#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Burning

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AB_Burning.AB_Burning_C.ExecuteUbergraph_AB_Burning
// 0x00C0 (0x00C0 - 0x0000)
struct AB_Burning_C_ExecuteUbergraph_AB_Burning final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0008(0x00B8)(ConstParm)
};
static_assert(alignof(AB_Burning_C_ExecuteUbergraph_AB_Burning) == 0x000008, "Wrong alignment on AB_Burning_C_ExecuteUbergraph_AB_Burning");
static_assert(sizeof(AB_Burning_C_ExecuteUbergraph_AB_Burning) == 0x0000C0, "Wrong size on AB_Burning_C_ExecuteUbergraph_AB_Burning");
static_assert(offsetof(AB_Burning_C_ExecuteUbergraph_AB_Burning, EntryPoint) == 0x000000, "Member 'AB_Burning_C_ExecuteUbergraph_AB_Burning::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Burning_C_ExecuteUbergraph_AB_Burning, K2Node_Event_EventData) == 0x000008, "Member 'AB_Burning_C_ExecuteUbergraph_AB_Burning::K2Node_Event_EventData' has a wrong offset!");

// Function AB_Burning.AB_Burning_C.K2_ActivateAbilityFromEvent
// 0x00B8 (0x00B8 - 0x0000)
struct AB_Burning_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_Burning_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on AB_Burning_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(AB_Burning_C_K2_ActivateAbilityFromEvent) == 0x0000B8, "Wrong size on AB_Burning_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(AB_Burning_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'AB_Burning_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

