#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_DirectionChange

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CAAudio_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function AB_DirectionChange.AB_DirectionChange_C.ExecuteUbergraph_AB_DirectionChange
// 0x03D0 (0x03D0 - 0x0000)
struct AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x0008(0x00B8)()
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00C0(0x00B8)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate;              // 0x0178(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0190(0x00B8)()
	struct FGameplayEventData                     Temp_struct_Variable_1;                            // 0x0248(0x00B8)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x030C(0x0014)(ZeroConstructor, NoDestructor)
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue;                  // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0328(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player_1;    // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36A[0x2];                                      // 0x036A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x036C(0x0014)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           CallFunc_get_end_ability_tag_ReturnValue;          // 0x0380(0x000C)(ConstParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_1;          // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39A[0x6];                                      // 0x039A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2; // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryApplyGameplayEffectToOwner_ReturnValue; // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x03B8(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange) == 0x000008, "Wrong alignment on AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange");
static_assert(sizeof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange) == 0x0003D0, "Wrong size on AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, EntryPoint) == 0x000000, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, K2Node_CustomEvent_Payload_1) == 0x000008, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, Temp_struct_Variable) == 0x0000C0, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, K2Node_CreateDelegate_OutputDelegate) == 0x000178, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, K2Node_CustomEvent_Payload) == 0x000190, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, Temp_struct_Variable_1) == 0x000248, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000300, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, CallFunc_IsValid_ReturnValue) == 0x000308, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, K2Node_CreateDelegate_OutputDelegate_1) == 0x00030C, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, CallFunc_WaitNetSync_ReturnValue) == 0x000320, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::CallFunc_WaitNetSync_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, Temp_delegate_Variable) == 0x000328, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, CallFunc_IsValid_ReturnValue_1) == 0x00033C, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000340, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x000348, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, K2Node_DynamicCast_bSuccess) == 0x000350, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000358, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, K2Node_DynamicCast_AsCACharacter_Main_Player_1) == 0x000360, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::K2Node_DynamicCast_AsCACharacter_Main_Player_1' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, K2Node_DynamicCast_bSuccess_1) == 0x000368, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, CallFunc_IsLocallyControlled_ReturnValue) == 0x000369, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, K2Node_CreateDelegate_OutputDelegate_2) == 0x00036C, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, CallFunc_get_end_ability_tag_ReturnValue) == 0x000380, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::CallFunc_get_end_ability_tag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, CallFunc_K2_CommitAbility_ReturnValue) == 0x00038C, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, CallFunc_WaitGameplayEvent_ReturnValue_1) == 0x000390, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::CallFunc_WaitGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, K2Node_Event_bWasCancelled) == 0x000398, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, CallFunc_IsValid_ReturnValue_2) == 0x000399, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2) == 0x0003A0, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, CallFunc_GetOwner_ReturnValue) == 0x0003A8, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, CallFunc_TryApplyGameplayEffectToOwner_ReturnValue) == 0x0003B0, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::CallFunc_TryApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, CallFunc_PlayEvent_playback_instance) == 0x0003B8, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange, CallFunc_PlayEvent_play_success) == 0x0003C8, "Member 'AB_DirectionChange_C_ExecuteUbergraph_AB_DirectionChange::CallFunc_PlayEvent_play_success' has a wrong offset!");

// Function AB_DirectionChange.AB_DirectionChange_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct AB_DirectionChange_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_DirectionChange_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on AB_DirectionChange_C_K2_OnEndAbility");
static_assert(sizeof(AB_DirectionChange_C_K2_OnEndAbility) == 0x000001, "Wrong size on AB_DirectionChange_C_K2_OnEndAbility");
static_assert(offsetof(AB_DirectionChange_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'AB_DirectionChange_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function AB_DirectionChange.AB_DirectionChange_C.EventReceived_B3697D5145CEAC8C809CD99447114C23
// 0x00B8 (0x00B8 - 0x0000)
struct AB_DirectionChange_C_EventReceived_B3697D5145CEAC8C809CD99447114C23 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AB_DirectionChange_C_EventReceived_B3697D5145CEAC8C809CD99447114C23) == 0x000008, "Wrong alignment on AB_DirectionChange_C_EventReceived_B3697D5145CEAC8C809CD99447114C23");
static_assert(sizeof(AB_DirectionChange_C_EventReceived_B3697D5145CEAC8C809CD99447114C23) == 0x0000B8, "Wrong size on AB_DirectionChange_C_EventReceived_B3697D5145CEAC8C809CD99447114C23");
static_assert(offsetof(AB_DirectionChange_C_EventReceived_B3697D5145CEAC8C809CD99447114C23, Payload) == 0x000000, "Member 'AB_DirectionChange_C_EventReceived_B3697D5145CEAC8C809CD99447114C23::Payload' has a wrong offset!");

// Function AB_DirectionChange.AB_DirectionChange_C.EventReceived_DA13C96B4ECDD12211B3BE95D8B17FAC
// 0x00B8 (0x00B8 - 0x0000)
struct AB_DirectionChange_C_EventReceived_DA13C96B4ECDD12211B3BE95D8B17FAC final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AB_DirectionChange_C_EventReceived_DA13C96B4ECDD12211B3BE95D8B17FAC) == 0x000008, "Wrong alignment on AB_DirectionChange_C_EventReceived_DA13C96B4ECDD12211B3BE95D8B17FAC");
static_assert(sizeof(AB_DirectionChange_C_EventReceived_DA13C96B4ECDD12211B3BE95D8B17FAC) == 0x0000B8, "Wrong size on AB_DirectionChange_C_EventReceived_DA13C96B4ECDD12211B3BE95D8B17FAC");
static_assert(offsetof(AB_DirectionChange_C_EventReceived_DA13C96B4ECDD12211B3BE95D8B17FAC, Payload) == 0x000000, "Member 'AB_DirectionChange_C_EventReceived_DA13C96B4ECDD12211B3BE95D8B17FAC::Payload' has a wrong offset!");

// Function AB_DirectionChange.AB_DirectionChange_C.K2_CanActivateAbility
// 0x0088 (0x0088 - 0x0000)
struct AB_DirectionChange_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0050(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0058(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0078(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDEBUGZeroGGravHookMode_ReturnValue;    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_DirectionChange_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on AB_DirectionChange_C_K2_CanActivateAbility");
static_assert(sizeof(AB_DirectionChange_C_K2_CanActivateAbility) == 0x000088, "Wrong size on AB_DirectionChange_C_K2_CanActivateAbility");
static_assert(offsetof(AB_DirectionChange_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'AB_DirectionChange_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_K2_CanActivateAbility, Handle) == 0x000050, "Member 'AB_DirectionChange_C_K2_CanActivateAbility::Handle' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_K2_CanActivateAbility, RelevantTags) == 0x000058, "Member 'AB_DirectionChange_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_K2_CanActivateAbility, ReturnValue) == 0x000078, "Member 'AB_DirectionChange_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_K2_CanActivateAbility, CallFunc_GetDEBUGZeroGGravHookMode_ReturnValue) == 0x00007C, "Member 'AB_DirectionChange_C_K2_CanActivateAbility::CallFunc_GetDEBUGZeroGGravHookMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_DirectionChange_C_K2_CanActivateAbility, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000080, "Member 'AB_DirectionChange_C_K2_CanActivateAbility::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

}

