#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_DirectionChange

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AB_Player_ManagedBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AB_DirectionChange.AB_DirectionChange_C
// 0x0040 (0x04E0 - 0x04A0)
class UAB_DirectionChange_C final : public UAB_Player_ManagedBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AB_DirectionChange_C;               // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	FMulticastInlineDelegateProperty_             Call_Ballerina_Jet_Boost_Audio_Event;              // 0x04A8(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FGameplayTagContainer                  Tag_Container;                                     // 0x04B8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Boost_Cost;                                        // 0x04D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BalanceVariablesSet;                               // 0x04DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void Call_Ballerina_Jet_Boost_Audio_Event__DelegateSignature();
	void ExecuteUbergraph_AB_DirectionChange(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnSync_CDD78124449EC411160AADA8559C478E();
	void EventReceived_B3697D5145CEAC8C809CD99447114C23(const struct FGameplayEventData& Payload);
	void EventReceived_DA13C96B4ECDD12211B3BE95D8B17FAC(const struct FGameplayEventData& Payload);

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_DirectionChange_C">();
	}
	static class UAB_DirectionChange_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_DirectionChange_C>();
	}
};
static_assert(alignof(UAB_DirectionChange_C) == 0x000008, "Wrong alignment on UAB_DirectionChange_C");
static_assert(sizeof(UAB_DirectionChange_C) == 0x0004E0, "Wrong size on UAB_DirectionChange_C");
static_assert(offsetof(UAB_DirectionChange_C, UberGraphFrame_AB_DirectionChange_C) == 0x0004A0, "Member 'UAB_DirectionChange_C::UberGraphFrame_AB_DirectionChange_C' has a wrong offset!");
static_assert(offsetof(UAB_DirectionChange_C, Call_Ballerina_Jet_Boost_Audio_Event) == 0x0004A8, "Member 'UAB_DirectionChange_C::Call_Ballerina_Jet_Boost_Audio_Event' has a wrong offset!");
static_assert(offsetof(UAB_DirectionChange_C, Tag_Container) == 0x0004B8, "Member 'UAB_DirectionChange_C::Tag_Container' has a wrong offset!");
static_assert(offsetof(UAB_DirectionChange_C, Boost_Cost) == 0x0004D8, "Member 'UAB_DirectionChange_C::Boost_Cost' has a wrong offset!");
static_assert(offsetof(UAB_DirectionChange_C, BalanceVariablesSet) == 0x0004DC, "Member 'UAB_DirectionChange_C::BalanceVariablesSet' has a wrong offset!");

}

