#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_DEBUG_Player_Give_All_Items_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AB_DEBUG_Player_Give_All_Items_Base.AB_DEBUG_Player_Give_All_Items_Base_C
// 0x0028 (0x04B8 - 0x0490)
class UAB_DEBUG_Player_Give_All_Items_Base_C : public UCAGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ACACharacter_MainPlayer*                Main_player;                                       // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Classes_to_load_counter;                           // 0x04A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A4[0x4];                                      // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UCAInventoryItem>> InventoryItems;                                    // 0x04A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_AB_DEBUG_Player_Give_All_Items_Base(int32 EntryPoint);
	void OnClassLoaded(class UCAInventoryItem* Item);
	void K2_ActivateAbility();
	void OnLoaded_721236D44C714F65D34A80BFFFFA5AAF(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_DEBUG_Player_Give_All_Items_Base_C">();
	}
	static class UAB_DEBUG_Player_Give_All_Items_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_DEBUG_Player_Give_All_Items_Base_C>();
	}
};
static_assert(alignof(UAB_DEBUG_Player_Give_All_Items_Base_C) == 0x000008, "Wrong alignment on UAB_DEBUG_Player_Give_All_Items_Base_C");
static_assert(sizeof(UAB_DEBUG_Player_Give_All_Items_Base_C) == 0x0004B8, "Wrong size on UAB_DEBUG_Player_Give_All_Items_Base_C");
static_assert(offsetof(UAB_DEBUG_Player_Give_All_Items_Base_C, UberGraphFrame) == 0x000490, "Member 'UAB_DEBUG_Player_Give_All_Items_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_DEBUG_Player_Give_All_Items_Base_C, Main_player) == 0x000498, "Member 'UAB_DEBUG_Player_Give_All_Items_Base_C::Main_player' has a wrong offset!");
static_assert(offsetof(UAB_DEBUG_Player_Give_All_Items_Base_C, Classes_to_load_counter) == 0x0004A0, "Member 'UAB_DEBUG_Player_Give_All_Items_Base_C::Classes_to_load_counter' has a wrong offset!");
static_assert(offsetof(UAB_DEBUG_Player_Give_All_Items_Base_C, InventoryItems) == 0x0004A8, "Member 'UAB_DEBUG_Player_Give_All_Items_Base_C::InventoryItems' has a wrong offset!");

}

