#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_DEBUG_DoExecute

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AB_DEBUG_DoExecute.AB_DEBUG_DoExecute_C.ExecuteUbergraph_AB_DEBUG_DoExecute
// 0x0008 (0x0008 - 0x0000)
struct AB_DEBUG_DoExecute_C_ExecuteUbergraph_AB_DEBUG_DoExecute final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_DEBUG_DoExecute_C_ExecuteUbergraph_AB_DEBUG_DoExecute) == 0x000004, "Wrong alignment on AB_DEBUG_DoExecute_C_ExecuteUbergraph_AB_DEBUG_DoExecute");
static_assert(sizeof(AB_DEBUG_DoExecute_C_ExecuteUbergraph_AB_DEBUG_DoExecute) == 0x000008, "Wrong size on AB_DEBUG_DoExecute_C_ExecuteUbergraph_AB_DEBUG_DoExecute");
static_assert(offsetof(AB_DEBUG_DoExecute_C_ExecuteUbergraph_AB_DEBUG_DoExecute, EntryPoint) == 0x000000, "Member 'AB_DEBUG_DoExecute_C_ExecuteUbergraph_AB_DEBUG_DoExecute::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_DEBUG_DoExecute_C_ExecuteUbergraph_AB_DEBUG_DoExecute, K2Node_Event_bWasCancelled) == 0x000004, "Member 'AB_DEBUG_DoExecute_C_ExecuteUbergraph_AB_DEBUG_DoExecute::K2Node_Event_bWasCancelled' has a wrong offset!");

// Function AB_DEBUG_DoExecute.AB_DEBUG_DoExecute_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct AB_DEBUG_DoExecute_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_DEBUG_DoExecute_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on AB_DEBUG_DoExecute_C_K2_OnEndAbility");
static_assert(sizeof(AB_DEBUG_DoExecute_C_K2_OnEndAbility) == 0x000001, "Wrong size on AB_DEBUG_DoExecute_C_K2_OnEndAbility");
static_assert(offsetof(AB_DEBUG_DoExecute_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'AB_DEBUG_DoExecute_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function AB_DEBUG_DoExecute.AB_DEBUG_DoExecute_C.ExtractSourceActor
// 0x0028 (0x0028 - 0x0000)
struct AB_DEBUG_DoExecute_C_ExtractSourceActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetCurrentSourceObject_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        K2Node_DynamicCast_AsActor_Component;              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_DEBUG_DoExecute_C_ExtractSourceActor) == 0x000008, "Wrong alignment on AB_DEBUG_DoExecute_C_ExtractSourceActor");
static_assert(sizeof(AB_DEBUG_DoExecute_C_ExtractSourceActor) == 0x000028, "Wrong size on AB_DEBUG_DoExecute_C_ExtractSourceActor");
static_assert(offsetof(AB_DEBUG_DoExecute_C_ExtractSourceActor, ReturnValue) == 0x000000, "Member 'AB_DEBUG_DoExecute_C_ExtractSourceActor::ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_DEBUG_DoExecute_C_ExtractSourceActor, CallFunc_GetCurrentSourceObject_ReturnValue) == 0x000008, "Member 'AB_DEBUG_DoExecute_C_ExtractSourceActor::CallFunc_GetCurrentSourceObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_DEBUG_DoExecute_C_ExtractSourceActor, K2Node_DynamicCast_AsActor_Component) == 0x000010, "Member 'AB_DEBUG_DoExecute_C_ExtractSourceActor::K2Node_DynamicCast_AsActor_Component' has a wrong offset!");
static_assert(offsetof(AB_DEBUG_DoExecute_C_ExtractSourceActor, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AB_DEBUG_DoExecute_C_ExtractSourceActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_DEBUG_DoExecute_C_ExtractSourceActor, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'AB_DEBUG_DoExecute_C_ExtractSourceActor::CallFunc_GetOwner_ReturnValue' has a wrong offset!");

// Function AB_DEBUG_DoExecute.AB_DEBUG_DoExecute_C.StartExecution
// 0x00C0 (0x00C0 - 0x0000)
struct AB_DEBUG_DoExecute_C_StartExecution final
{
public:
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0008(0x00B8)()
};
static_assert(alignof(AB_DEBUG_DoExecute_C_StartExecution) == 0x000008, "Wrong alignment on AB_DEBUG_DoExecute_C_StartExecution");
static_assert(sizeof(AB_DEBUG_DoExecute_C_StartExecution) == 0x0000C0, "Wrong size on AB_DEBUG_DoExecute_C_StartExecution");
static_assert(offsetof(AB_DEBUG_DoExecute_C_StartExecution, CallFunc_IsServer_ReturnValue) == 0x000000, "Member 'AB_DEBUG_DoExecute_C_StartExecution::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_DEBUG_DoExecute_C_StartExecution, K2Node_MakeStruct_GameplayEventData) == 0x000008, "Member 'AB_DEBUG_DoExecute_C_StartExecution::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");

// Function AB_DEBUG_DoExecute.AB_DEBUG_DoExecute_C.CalculateTransformForDocking
// 0x00A0 (0x00A0 - 0x0000)
struct AB_DEBUG_DoExecute_C_CalculateTransformForDocking final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorEyesViewPoint_OutLocation;        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetActorEyesViewPoint_OutRotation;        // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_DEBUG_DoExecute_C_CalculateTransformForDocking) == 0x000010, "Wrong alignment on AB_DEBUG_DoExecute_C_CalculateTransformForDocking");
static_assert(sizeof(AB_DEBUG_DoExecute_C_CalculateTransformForDocking) == 0x0000A0, "Wrong size on AB_DEBUG_DoExecute_C_CalculateTransformForDocking");
static_assert(offsetof(AB_DEBUG_DoExecute_C_CalculateTransformForDocking, ReturnValue) == 0x000000, "Member 'AB_DEBUG_DoExecute_C_CalculateTransformForDocking::ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_DEBUG_DoExecute_C_CalculateTransformForDocking, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'AB_DEBUG_DoExecute_C_CalculateTransformForDocking::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_DEBUG_DoExecute_C_CalculateTransformForDocking, CallFunc_GetActorEyesViewPoint_OutLocation) == 0x00003C, "Member 'AB_DEBUG_DoExecute_C_CalculateTransformForDocking::CallFunc_GetActorEyesViewPoint_OutLocation' has a wrong offset!");
static_assert(offsetof(AB_DEBUG_DoExecute_C_CalculateTransformForDocking, CallFunc_GetActorEyesViewPoint_OutRotation) == 0x000048, "Member 'AB_DEBUG_DoExecute_C_CalculateTransformForDocking::CallFunc_GetActorEyesViewPoint_OutRotation' has a wrong offset!");
static_assert(offsetof(AB_DEBUG_DoExecute_C_CalculateTransformForDocking, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000054, "Member 'AB_DEBUG_DoExecute_C_CalculateTransformForDocking::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_DEBUG_DoExecute_C_CalculateTransformForDocking, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000060, "Member 'AB_DEBUG_DoExecute_C_CalculateTransformForDocking::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_DEBUG_DoExecute_C_CalculateTransformForDocking, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'AB_DEBUG_DoExecute_C_CalculateTransformForDocking::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

// Function AB_DEBUG_DoExecute.AB_DEBUG_DoExecute_C.ApplyGameplayEffect
// 0x0018 (0x0018 - 0x0000)
struct AB_DEBUG_DoExecute_C_ApplyGameplayEffect final
{
public:
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_DEBUG_DoExecute_C_ApplyGameplayEffect) == 0x000008, "Wrong alignment on AB_DEBUG_DoExecute_C_ApplyGameplayEffect");
static_assert(sizeof(AB_DEBUG_DoExecute_C_ApplyGameplayEffect) == 0x000018, "Wrong size on AB_DEBUG_DoExecute_C_ApplyGameplayEffect");
static_assert(offsetof(AB_DEBUG_DoExecute_C_ApplyGameplayEffect, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000000, "Member 'AB_DEBUG_DoExecute_C_ApplyGameplayEffect::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_DEBUG_DoExecute_C_ApplyGameplayEffect, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000008, "Member 'AB_DEBUG_DoExecute_C_ApplyGameplayEffect::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_DEBUG_DoExecute_C_ApplyGameplayEffect, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000010, "Member 'AB_DEBUG_DoExecute_C_ApplyGameplayEffect::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");

// Function AB_DEBUG_DoExecute.AB_DEBUG_DoExecute_C.ResetExecutionerLocation
// 0x0010 (0x0010 - 0x0000)
struct AB_DEBUG_DoExecute_C_ResetExecutionerLocation final
{
public:
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_TeleportTo_ReturnValue;                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_DEBUG_DoExecute_C_ResetExecutionerLocation) == 0x000004, "Wrong alignment on AB_DEBUG_DoExecute_C_ResetExecutionerLocation");
static_assert(sizeof(AB_DEBUG_DoExecute_C_ResetExecutionerLocation) == 0x000010, "Wrong size on AB_DEBUG_DoExecute_C_ResetExecutionerLocation");
static_assert(offsetof(AB_DEBUG_DoExecute_C_ResetExecutionerLocation, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000000, "Member 'AB_DEBUG_DoExecute_C_ResetExecutionerLocation::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_DEBUG_DoExecute_C_ResetExecutionerLocation, CallFunc_K2_TeleportTo_ReturnValue) == 0x00000C, "Member 'AB_DEBUG_DoExecute_C_ResetExecutionerLocation::CallFunc_K2_TeleportTo_ReturnValue' has a wrong offset!");

}

