#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_DEBUG_DoExecute

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Keaton_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass AB_DEBUG_DoExecute.AB_DEBUG_DoExecute_C
// 0x0050 (0x04E8 - 0x0498)
class UAB_DEBUG_DoExecute_C final : public UCAGameplayAbility_Managed
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0498(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_Player_C*                           Victim;                                            // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            BeingExecutedGEHandle;                             // 0x04A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         AnimRate;                                          // 0x04B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                Executioner;                                       // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ExecutionerStartPosition;                          // 0x04C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Force;                                             // 0x04CC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ForceHandle;                                       // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           ExecutionMontage;                                  // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AB_DEBUG_DoExecute(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	class AActor* ExtractSourceActor();
	void CompleteExecution();
	void StartExecution();
	struct FTransform CalculateTransformForDocking();
	void ApplyGameplayEffect();
	void ResetExecutionerLocation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_DEBUG_DoExecute_C">();
	}
	static class UAB_DEBUG_DoExecute_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_DEBUG_DoExecute_C>();
	}
};
static_assert(alignof(UAB_DEBUG_DoExecute_C) == 0x000008, "Wrong alignment on UAB_DEBUG_DoExecute_C");
static_assert(sizeof(UAB_DEBUG_DoExecute_C) == 0x0004E8, "Wrong size on UAB_DEBUG_DoExecute_C");
static_assert(offsetof(UAB_DEBUG_DoExecute_C, UberGraphFrame) == 0x000498, "Member 'UAB_DEBUG_DoExecute_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_DEBUG_DoExecute_C, Victim) == 0x0004A0, "Member 'UAB_DEBUG_DoExecute_C::Victim' has a wrong offset!");
static_assert(offsetof(UAB_DEBUG_DoExecute_C, BeingExecutedGEHandle) == 0x0004A8, "Member 'UAB_DEBUG_DoExecute_C::BeingExecutedGEHandle' has a wrong offset!");
static_assert(offsetof(UAB_DEBUG_DoExecute_C, AnimRate) == 0x0004B0, "Member 'UAB_DEBUG_DoExecute_C::AnimRate' has a wrong offset!");
static_assert(offsetof(UAB_DEBUG_DoExecute_C, Executioner) == 0x0004B8, "Member 'UAB_DEBUG_DoExecute_C::Executioner' has a wrong offset!");
static_assert(offsetof(UAB_DEBUG_DoExecute_C, ExecutionerStartPosition) == 0x0004C0, "Member 'UAB_DEBUG_DoExecute_C::ExecutionerStartPosition' has a wrong offset!");
static_assert(offsetof(UAB_DEBUG_DoExecute_C, Force) == 0x0004CC, "Member 'UAB_DEBUG_DoExecute_C::Force' has a wrong offset!");
static_assert(offsetof(UAB_DEBUG_DoExecute_C, ForceHandle) == 0x0004D8, "Member 'UAB_DEBUG_DoExecute_C::ForceHandle' has a wrong offset!");
static_assert(offsetof(UAB_DEBUG_DoExecute_C, ExecutionMontage) == 0x0004E0, "Member 'UAB_DEBUG_DoExecute_C::ExecutionMontage' has a wrong offset!");

}

