#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Elite_IdleConversationTarget

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AB_Elite_IdleConversationTarget.AB_Elite_IdleConversationTarget_C.ExecuteUbergraph_AB_Elite_IdleConversationTarget
// 0x0160 (0x0160 - 0x0000)
struct AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0030(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0044(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0058(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_NPC*                       K2Node_DynamicCast_AsCACharacter_NPC;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMatchedAnimIndex_ReturnValue;          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0088(0x00B8)(ConstParm)
	class UAnimMontage*                           CallFunc_Array_Get_Item;                           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget) == 0x000008, "Wrong alignment on AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget");
static_assert(sizeof(AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget) == 0x000160, "Wrong size on AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget");
static_assert(offsetof(AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget, EntryPoint) == 0x000000, "Member 'AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget, CallFunc_K2_CommitAbility_ReturnValue) == 0x000004, "Member 'AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget, K2Node_CreateDelegate_OutputDelegate_2) == 0x000030, "Member 'AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget, K2Node_CreateDelegate_OutputDelegate_3) == 0x000044, "Member 'AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget, K2Node_CreateDelegate_OutputDelegate_4) == 0x000058, "Member 'AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000070, "Member 'AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget, K2Node_DynamicCast_AsCACharacter_NPC) == 0x000078, "Member 'AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget::K2Node_DynamicCast_AsCACharacter_NPC' has a wrong offset!");
static_assert(offsetof(AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget, CallFunc_GetMatchedAnimIndex_ReturnValue) == 0x000084, "Member 'AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget::CallFunc_GetMatchedAnimIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget, K2Node_Event_EventData) == 0x000088, "Member 'AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget, CallFunc_Array_Get_Item) == 0x000140, "Member 'AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000148, "Member 'AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000150, "Member 'AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget, CallFunc_IsValid_ReturnValue) == 0x000158, "Member 'AB_Elite_IdleConversationTarget_C_ExecuteUbergraph_AB_Elite_IdleConversationTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AB_Elite_IdleConversationTarget.AB_Elite_IdleConversationTarget_C.K2_ActivateAbilityFromEvent
// 0x00B8 (0x00B8 - 0x0000)
struct AB_Elite_IdleConversationTarget_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_Elite_IdleConversationTarget_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on AB_Elite_IdleConversationTarget_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(AB_Elite_IdleConversationTarget_C_K2_ActivateAbilityFromEvent) == 0x0000B8, "Wrong size on AB_Elite_IdleConversationTarget_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(AB_Elite_IdleConversationTarget_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'AB_Elite_IdleConversationTarget_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

