#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_EliteExoBurstDamageTaken

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AB_EliteExoBurstDamageTaken.AB_EliteExoBurstDamageTaken_C.ExecuteUbergraph_AB_EliteExoBurstDamageTaken
// 0x0040 (0x0040 - 0x0000)
struct AB_EliteExoBurstDamageTaken_C_ExecuteUbergraph_AB_EliteExoBurstDamageTaken final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAAIController*                        K2Node_DynamicCast_AsCAAIController;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_EliteExoBurstDamageTaken_C_ExecuteUbergraph_AB_EliteExoBurstDamageTaken) == 0x000008, "Wrong alignment on AB_EliteExoBurstDamageTaken_C_ExecuteUbergraph_AB_EliteExoBurstDamageTaken");
static_assert(sizeof(AB_EliteExoBurstDamageTaken_C_ExecuteUbergraph_AB_EliteExoBurstDamageTaken) == 0x000040, "Wrong size on AB_EliteExoBurstDamageTaken_C_ExecuteUbergraph_AB_EliteExoBurstDamageTaken");
static_assert(offsetof(AB_EliteExoBurstDamageTaken_C_ExecuteUbergraph_AB_EliteExoBurstDamageTaken, EntryPoint) == 0x000000, "Member 'AB_EliteExoBurstDamageTaken_C_ExecuteUbergraph_AB_EliteExoBurstDamageTaken::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_EliteExoBurstDamageTaken_C_ExecuteUbergraph_AB_EliteExoBurstDamageTaken, K2Node_Event_bWasCancelled) == 0x000004, "Member 'AB_EliteExoBurstDamageTaken_C_ExecuteUbergraph_AB_EliteExoBurstDamageTaken::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(AB_EliteExoBurstDamageTaken_C_ExecuteUbergraph_AB_EliteExoBurstDamageTaken, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000008, "Member 'AB_EliteExoBurstDamageTaken_C_ExecuteUbergraph_AB_EliteExoBurstDamageTaken::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EliteExoBurstDamageTaken_C_ExecuteUbergraph_AB_EliteExoBurstDamageTaken, K2Node_DynamicCast_AsPawn) == 0x000010, "Member 'AB_EliteExoBurstDamageTaken_C_ExecuteUbergraph_AB_EliteExoBurstDamageTaken::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(AB_EliteExoBurstDamageTaken_C_ExecuteUbergraph_AB_EliteExoBurstDamageTaken, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AB_EliteExoBurstDamageTaken_C_ExecuteUbergraph_AB_EliteExoBurstDamageTaken::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_EliteExoBurstDamageTaken_C_ExecuteUbergraph_AB_EliteExoBurstDamageTaken, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00001C, "Member 'AB_EliteExoBurstDamageTaken_C_ExecuteUbergraph_AB_EliteExoBurstDamageTaken::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EliteExoBurstDamageTaken_C_ExecuteUbergraph_AB_EliteExoBurstDamageTaken, CallFunc_GetController_ReturnValue) == 0x000028, "Member 'AB_EliteExoBurstDamageTaken_C_ExecuteUbergraph_AB_EliteExoBurstDamageTaken::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EliteExoBurstDamageTaken_C_ExecuteUbergraph_AB_EliteExoBurstDamageTaken, K2Node_DynamicCast_AsCAAIController) == 0x000030, "Member 'AB_EliteExoBurstDamageTaken_C_ExecuteUbergraph_AB_EliteExoBurstDamageTaken::K2Node_DynamicCast_AsCAAIController' has a wrong offset!");
static_assert(offsetof(AB_EliteExoBurstDamageTaken_C_ExecuteUbergraph_AB_EliteExoBurstDamageTaken, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'AB_EliteExoBurstDamageTaken_C_ExecuteUbergraph_AB_EliteExoBurstDamageTaken::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function AB_EliteExoBurstDamageTaken.AB_EliteExoBurstDamageTaken_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct AB_EliteExoBurstDamageTaken_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_EliteExoBurstDamageTaken_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on AB_EliteExoBurstDamageTaken_C_K2_OnEndAbility");
static_assert(sizeof(AB_EliteExoBurstDamageTaken_C_K2_OnEndAbility) == 0x000001, "Wrong size on AB_EliteExoBurstDamageTaken_C_K2_OnEndAbility");
static_assert(offsetof(AB_EliteExoBurstDamageTaken_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'AB_EliteExoBurstDamageTaken_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

