#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_EliteTank_Special

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CAGameDatabase_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AB_EliteTank_Special.AB_EliteTank_Special_C
// 0x0028 (0x04B8 - 0x0490)
class UAB_EliteTank_Special_C final : public UCAGameplayAbility_NPC
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAbilityTask_WaitDelay*                 Async_Task;                                        // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FCADataTableRowHandle                  SlamLength;                                        // 0x04A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_AB_EliteTank_Special(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void OnFinish_8502557844E9E71587EB35A58CEE4AD8();
	void OnCompleted_53499ECE4C1DE1623DEA25B777087483();
	void OnBlendOut_53499ECE4C1DE1623DEA25B777087483();
	void OnInterrupted_53499ECE4C1DE1623DEA25B777087483();
	void OnCancelled_53499ECE4C1DE1623DEA25B777087483();
	void OnSkipped_53499ECE4C1DE1623DEA25B777087483();
	void EventReceived_98BB74F84E0D3CA71EE48CB1B3A2109F(const struct FGameplayEventData& Payload);
	void EventReceived_B18504854E62B7381B4F5EB1C8714470(const struct FGameplayEventData& Payload);
	void GetMontageToPlay(class UAnimMontage** Montage_To_Play);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_EliteTank_Special_C">();
	}
	static class UAB_EliteTank_Special_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_EliteTank_Special_C>();
	}
};
static_assert(alignof(UAB_EliteTank_Special_C) == 0x000008, "Wrong alignment on UAB_EliteTank_Special_C");
static_assert(sizeof(UAB_EliteTank_Special_C) == 0x0004B8, "Wrong size on UAB_EliteTank_Special_C");
static_assert(offsetof(UAB_EliteTank_Special_C, UberGraphFrame) == 0x000490, "Member 'UAB_EliteTank_Special_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_EliteTank_Special_C, Async_Task) == 0x000498, "Member 'UAB_EliteTank_Special_C::Async_Task' has a wrong offset!");
static_assert(offsetof(UAB_EliteTank_Special_C, SlamLength) == 0x0004A0, "Member 'UAB_EliteTank_Special_C::SlamLength' has a wrong offset!");

}

