#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_EliteTank_Foamed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AB_EliteTank_Foamed.AB_EliteTank_Foamed_C
// 0x0040 (0x04D0 - 0x0490)
class UAB_EliteTank_Foamed_C : public UCAGameplayAbility_NPC
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ACACharacter_NPC*                       OwningNPC;                                         // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           FoamedIn_OnGround;                                 // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           FoamedIn_InAir;                                    // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           FoamedOut_OnGround;                                // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           FoamedOut_InAir;                                   // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   OnFoamed;                                          // 0x04C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AB_EliteTank_Foamed(int32 EntryPoint);
	void M_on_is_in_air_changed_Event();
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void OnCompleted_6C5E087148DBBC4032B728BF91D50E3E();
	void OnBlendOut_6C5E087148DBBC4032B728BF91D50E3E();
	void OnInterrupted_6C5E087148DBBC4032B728BF91D50E3E();
	void OnCancelled_6C5E087148DBBC4032B728BF91D50E3E();
	void OnSkipped_6C5E087148DBBC4032B728BF91D50E3E();
	void OnCompleted_59C47A9D4613A4EE6D6C98B6257D9A02();
	void OnBlendOut_59C47A9D4613A4EE6D6C98B6257D9A02();
	void OnInterrupted_59C47A9D4613A4EE6D6C98B6257D9A02();
	void OnCancelled_59C47A9D4613A4EE6D6C98B6257D9A02();
	void OnSkipped_59C47A9D4613A4EE6D6C98B6257D9A02();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_EliteTank_Foamed_C">();
	}
	static class UAB_EliteTank_Foamed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_EliteTank_Foamed_C>();
	}
};
static_assert(alignof(UAB_EliteTank_Foamed_C) == 0x000008, "Wrong alignment on UAB_EliteTank_Foamed_C");
static_assert(sizeof(UAB_EliteTank_Foamed_C) == 0x0004D0, "Wrong size on UAB_EliteTank_Foamed_C");
static_assert(offsetof(UAB_EliteTank_Foamed_C, UberGraphFrame) == 0x000490, "Member 'UAB_EliteTank_Foamed_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_EliteTank_Foamed_C, OwningNPC) == 0x000498, "Member 'UAB_EliteTank_Foamed_C::OwningNPC' has a wrong offset!");
static_assert(offsetof(UAB_EliteTank_Foamed_C, FoamedIn_OnGround) == 0x0004A0, "Member 'UAB_EliteTank_Foamed_C::FoamedIn_OnGround' has a wrong offset!");
static_assert(offsetof(UAB_EliteTank_Foamed_C, FoamedIn_InAir) == 0x0004A8, "Member 'UAB_EliteTank_Foamed_C::FoamedIn_InAir' has a wrong offset!");
static_assert(offsetof(UAB_EliteTank_Foamed_C, FoamedOut_OnGround) == 0x0004B0, "Member 'UAB_EliteTank_Foamed_C::FoamedOut_OnGround' has a wrong offset!");
static_assert(offsetof(UAB_EliteTank_Foamed_C, FoamedOut_InAir) == 0x0004B8, "Member 'UAB_EliteTank_Foamed_C::FoamedOut_InAir' has a wrong offset!");
static_assert(offsetof(UAB_EliteTank_Foamed_C, OnFoamed) == 0x0004C0, "Member 'UAB_EliteTank_Foamed_C::OnFoamed' has a wrong offset!");

}

