#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Equip_From_Payload_Base

#include "Basic.hpp"

#include "Keaton_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AB_Equip_From_Payload_Base.AB_Equip_From_Payload_Base_C.ExecuteUbergraph_AB_Equip_From_Payload_Base
// 0x05C0 (0x05C0 - 0x0000)
struct AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetCharacterEquipAnim_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x004C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0060(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x0078(0x00B8)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0130(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x0148(0x00B8)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x020C(0x0014)(ZeroConstructor, NoDestructor)
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue;                  // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22B[0x1];                                      // 0x022B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x022C(0x0014)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0240(0x00B8)()
	struct FGameplayEventData                     Temp_struct_Variable_1;                            // 0x02F8(0x00B8)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_1;          // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9[0x3];                                      // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x03BC(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x3];                                      // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x03D4(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAEquipmentBase*                       CallFunc_GetCurrentlyHeldDevice_ReturnValue;       // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetCharacterEquipAnim_ReturnValue_1;      // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_401[0x3];                                      // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetUnequipAnimRate_Rate;                  // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEquipAnimRate_Rate;                    // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1; // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x0422(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_423[0x5];                                      // 0x0423(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetCharacterUnequipAnim_ReturnValue;      // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431[0x3];                                      // 0x0431(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0434(0x0014)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0448(0x00B8)(ConstParm)
	class ACAEquipmentBase*                       K2Node_DynamicCast_AsCAEquipment_Base;             // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAWeapon*                              K2Node_DynamicCast_AsCAWeapon;                     // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_519[0x3];                                      // 0x0519(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x051C(0x0014)(ZeroConstructor, NoDestructor)
	struct FCAWeaponStatsInstanceInterface        CallFunc_GetStatsInstanceInterface_ReturnValue;    // 0x0530(0x0008)(ConstParm, NoDestructor)
	float                                         CallFunc_GetEquipOutTime_equip_out_time;           // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0540(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x0560(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCACharMoveComp_Player*                 K2Node_DynamicCast_AsCAChar_Move_Comp_Player;      // 0x0568(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECAPlayerMovementMode                         CallFunc_GetPlayerMovementMode_movement_mode;      // 0x0571(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0572(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Vector_IsNearlyZero_ReturnValue;          // 0x0573(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0574(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_575[0x3];                                      // 0x0575(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_581[0x7];                                      // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player_1;    // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0591(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_592[0x2];                                      // 0x0592(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x0594(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x05A8(0x0014)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base) == 0x000008, "Wrong alignment on AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base");
static_assert(sizeof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base) == 0x0005C0, "Wrong size on AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, EntryPoint) == 0x000000, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_GetCharacterEquipAnim_ReturnValue) == 0x000008, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_GetCharacterEquipAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_CreateDelegate_OutputDelegate_3) == 0x00004C, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_CreateDelegate_OutputDelegate_4) == 0x000060, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_CustomEvent_Payload_1) == 0x000078, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_CreateDelegate_OutputDelegate_5) == 0x000130, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, Temp_struct_Variable) == 0x000148, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000200, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_IsValid_ReturnValue) == 0x000208, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_CreateDelegate_OutputDelegate_6) == 0x00020C, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_WaitNetSync_ReturnValue) == 0x000220, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_WaitNetSync_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_IsValid_ReturnValue_1) == 0x000228, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_IsValid_ReturnValue_2) == 0x000229, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_IsValid_ReturnValue_3) == 0x00022A, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_CreateDelegate_OutputDelegate_7) == 0x00022C, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_CustomEvent_Payload) == 0x000240, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, Temp_struct_Variable_1) == 0x0002F8, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_WaitGameplayEvent_ReturnValue_1) == 0x0003B0, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_WaitGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_IsValid_ReturnValue_4) == 0x0003B8, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_CreateDelegate_OutputDelegate_8) == 0x0003BC, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, Temp_bool_Variable) == 0x0003D0, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_CreateDelegate_OutputDelegate_9) == 0x0003D4, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0003E8, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_GetCurrentlyHeldDevice_ReturnValue) == 0x0003F0, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_GetCurrentlyHeldDevice_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_GetCharacterEquipAnim_ReturnValue_1) == 0x0003F8, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_GetCharacterEquipAnim_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_IsValid_ReturnValue_5) == 0x000400, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_GetUnequipAnimRate_Rate) == 0x000404, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_GetUnequipAnimRate_Rate' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_GetEquipAnimRate_Rate) == 0x000408, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_GetEquipAnimRate_Rate' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000410, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1) == 0x000418, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_IsValid_ReturnValue_6) == 0x000420, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_IsValid_ReturnValue_7) == 0x000421, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_NotEqual_ObjectObject_ReturnValue_1) == 0x000422, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_NotEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_GetCharacterUnequipAnim_ReturnValue) == 0x000428, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_GetCharacterUnequipAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_Event_bWasCancelled) == 0x000430, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_CreateDelegate_OutputDelegate_10) == 0x000434, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_Event_EventData) == 0x000448, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_DynamicCast_AsCAEquipment_Base) == 0x000500, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_DynamicCast_AsCAEquipment_Base' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_DynamicCast_bSuccess) == 0x000508, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_DynamicCast_AsCAWeapon) == 0x000510, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_DynamicCast_AsCAWeapon' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_DynamicCast_bSuccess_1) == 0x000518, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_CreateDelegate_OutputDelegate_11) == 0x00051C, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_GetStatsInstanceInterface_ReturnValue) == 0x000530, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_GetStatsInstanceInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_GetEquipOutTime_equip_out_time) == 0x000538, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_GetEquipOutTime_equip_out_time' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000540, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000548, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x000550, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_DynamicCast_bSuccess_2) == 0x000558, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_GetMovementComponent_ReturnValue) == 0x000560, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_DynamicCast_AsCAChar_Move_Comp_Player) == 0x000568, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_DynamicCast_AsCAChar_Move_Comp_Player' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_DynamicCast_bSuccess_3) == 0x000570, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_GetPlayerMovementMode_movement_mode) == 0x000571, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_GetPlayerMovementMode_movement_mode' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000572, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_Vector_IsNearlyZero_ReturnValue) == 0x000573, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_Vector_IsNearlyZero_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_Not_PreBool_ReturnValue) == 0x000574, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000578, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_BooleanOR_ReturnValue) == 0x000580, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_DynamicCast_AsCACharacter_Main_Player_1) == 0x000588, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_DynamicCast_AsCACharacter_Main_Player_1' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_DynamicCast_bSuccess_4) == 0x000590, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, CallFunc_K2_HasAuthority_ReturnValue) == 0x000591, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_CreateDelegate_OutputDelegate_12) == 0x000594, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base, K2Node_CreateDelegate_OutputDelegate_13) == 0x0005A8, "Member 'AB_Equip_From_Payload_Base_C_ExecuteUbergraph_AB_Equip_From_Payload_Base::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");

// Function AB_Equip_From_Payload_Base.AB_Equip_From_Payload_Base_C.K2_ActivateAbilityFromEvent
// 0x00B8 (0x00B8 - 0x0000)
struct AB_Equip_From_Payload_Base_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_Equip_From_Payload_Base_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on AB_Equip_From_Payload_Base_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(AB_Equip_From_Payload_Base_C_K2_ActivateAbilityFromEvent) == 0x0000B8, "Wrong size on AB_Equip_From_Payload_Base_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'AB_Equip_From_Payload_Base_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function AB_Equip_From_Payload_Base.AB_Equip_From_Payload_Base_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct AB_Equip_From_Payload_Base_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Equip_From_Payload_Base_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on AB_Equip_From_Payload_Base_C_K2_OnEndAbility");
static_assert(sizeof(AB_Equip_From_Payload_Base_C_K2_OnEndAbility) == 0x000001, "Wrong size on AB_Equip_From_Payload_Base_C_K2_OnEndAbility");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'AB_Equip_From_Payload_Base_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function AB_Equip_From_Payload_Base.AB_Equip_From_Payload_Base_C.EventReceived_9484C2A645F67ABDD7A3858B6A6871CE
// 0x00B8 (0x00B8 - 0x0000)
struct AB_Equip_From_Payload_Base_C_EventReceived_9484C2A645F67ABDD7A3858B6A6871CE final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AB_Equip_From_Payload_Base_C_EventReceived_9484C2A645F67ABDD7A3858B6A6871CE) == 0x000008, "Wrong alignment on AB_Equip_From_Payload_Base_C_EventReceived_9484C2A645F67ABDD7A3858B6A6871CE");
static_assert(sizeof(AB_Equip_From_Payload_Base_C_EventReceived_9484C2A645F67ABDD7A3858B6A6871CE) == 0x0000B8, "Wrong size on AB_Equip_From_Payload_Base_C_EventReceived_9484C2A645F67ABDD7A3858B6A6871CE");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_EventReceived_9484C2A645F67ABDD7A3858B6A6871CE, Payload) == 0x000000, "Member 'AB_Equip_From_Payload_Base_C_EventReceived_9484C2A645F67ABDD7A3858B6A6871CE::Payload' has a wrong offset!");

// Function AB_Equip_From_Payload_Base.AB_Equip_From_Payload_Base_C.EventReceived_1FB14F9D4F2977CA255D2AB28856C15F
// 0x00B8 (0x00B8 - 0x0000)
struct AB_Equip_From_Payload_Base_C_EventReceived_1FB14F9D4F2977CA255D2AB28856C15F final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AB_Equip_From_Payload_Base_C_EventReceived_1FB14F9D4F2977CA255D2AB28856C15F) == 0x000008, "Wrong alignment on AB_Equip_From_Payload_Base_C_EventReceived_1FB14F9D4F2977CA255D2AB28856C15F");
static_assert(sizeof(AB_Equip_From_Payload_Base_C_EventReceived_1FB14F9D4F2977CA255D2AB28856C15F) == 0x0000B8, "Wrong size on AB_Equip_From_Payload_Base_C_EventReceived_1FB14F9D4F2977CA255D2AB28856C15F");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_EventReceived_1FB14F9D4F2977CA255D2AB28856C15F, Payload) == 0x000000, "Member 'AB_Equip_From_Payload_Base_C_EventReceived_1FB14F9D4F2977CA255D2AB28856C15F::Payload' has a wrong offset!");

// Function AB_Equip_From_Payload_Base.AB_Equip_From_Payload_Base_C.K2_ShouldAbilityRespondToEvent
// 0x0148 (0x0148 - 0x0000)
struct AB_Equip_From_Payload_Base_C_K2_ShouldAbilityRespondToEvent final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayEventData                     Payload;                                           // 0x0050(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          ReturnValue;                                       // 0x0108(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAEquipmentBase*                       K2Node_DynamicCast_AsCAEquipment_Base;             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAEquipmentBase*                       CallFunc_GetCurrentlyHeldDevice_ReturnValue;       // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Equip_From_Payload_Base_C_K2_ShouldAbilityRespondToEvent) == 0x000008, "Wrong alignment on AB_Equip_From_Payload_Base_C_K2_ShouldAbilityRespondToEvent");
static_assert(sizeof(AB_Equip_From_Payload_Base_C_K2_ShouldAbilityRespondToEvent) == 0x000148, "Wrong size on AB_Equip_From_Payload_Base_C_K2_ShouldAbilityRespondToEvent");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_K2_ShouldAbilityRespondToEvent, ActorInfo) == 0x000000, "Member 'AB_Equip_From_Payload_Base_C_K2_ShouldAbilityRespondToEvent::ActorInfo' has a wrong offset!");
static_assert(offsetof(AB_Equip_From_Payload_Base_C_K2_ShouldAbilityRespondToEvent, Payload) == 0x000050, "Member 'AB_Equip_From_Payload_Base_C_K2_ShouldAbilityRespondToEvent::Payload' has a wrong offset!");
