#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_EnterCombat_Surprised

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AB_EnterCombat_Surprised.AB_EnterCombat_Surprised_C.ExecuteUbergraph_AB_EnterCombat_Surprised
// 0x01A0 (0x01A0 - 0x0000)
struct AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_NPC*                       K2Node_DynamicCast_AsCACharacter_NPC;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0014)(ZeroConstructor, NoDestructor)
	struct FGameplayEffectRemovalInfo             K2Node_CustomEvent_GameplayEffectRemovalInfo_1;    // 0x0030(0x0020)(ConstParm)
	struct FGameplayEffectRemovalInfo             K2Node_CustomEvent_GameplayEffectRemovalInfo;      // 0x0050(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0070(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectRemovalInfo             Temp_struct_Variable;                              // 0x0088(0x0020)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A8(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x00D0(0x00B8)(ConstParm)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0188(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEffectRemoved* CallFunc_WaitForGameplayEffectRemoved_ReturnValue; // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised) == 0x000008, "Wrong alignment on AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised");
static_assert(sizeof(AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised) == 0x0001A0, "Wrong size on AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised");
static_assert(offsetof(AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised, EntryPoint) == 0x000000, "Member 'AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000008, "Member 'AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised, K2Node_DynamicCast_AsCACharacter_NPC) == 0x000010, "Member 'AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised::K2Node_DynamicCast_AsCACharacter_NPC' has a wrong offset!");
static_assert(offsetof(AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised, K2Node_CustomEvent_GameplayEffectRemovalInfo_1) == 0x000030, "Member 'AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised::K2Node_CustomEvent_GameplayEffectRemovalInfo_1' has a wrong offset!");
static_assert(offsetof(AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised, K2Node_CustomEvent_GameplayEffectRemovalInfo) == 0x000050, "Member 'AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised::K2Node_CustomEvent_GameplayEffectRemovalInfo' has a wrong offset!");
static_assert(offsetof(AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised, K2Node_CreateDelegate_OutputDelegate_1) == 0x000070, "Member 'AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised, Temp_struct_Variable) == 0x000088, "Member 'AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A8, "Member 'AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised, CallFunc_WaitDelay_ReturnValue) == 0x0000C0, "Member 'AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised, K2Node_Event_EventData) == 0x0000D0, "Member 'AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000188, "Member 'AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised, CallFunc_WaitForGameplayEffectRemoved_ReturnValue) == 0x000190, "Member 'AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised::CallFunc_WaitForGameplayEffectRemoved_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised, CallFunc_IsValid_ReturnValue_1) == 0x000198, "Member 'AB_EnterCombat_Surprised_C_ExecuteUbergraph_AB_EnterCombat_Surprised::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function AB_EnterCombat_Surprised.AB_EnterCombat_Surprised_C.K2_ActivateAbilityFromEvent
// 0x00B8 (0x00B8 - 0x0000)
struct AB_EnterCombat_Surprised_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_EnterCombat_Surprised_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on AB_EnterCombat_Surprised_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(AB_EnterCombat_Surprised_C_K2_ActivateAbilityFromEvent) == 0x0000B8, "Wrong size on AB_EnterCombat_Surprised_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(AB_EnterCombat_Surprised_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'AB_EnterCombat_Surprised_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function AB_EnterCombat_Surprised.AB_EnterCombat_Surprised_C.OnRemoved_131995E9449AAA0A8168C98763432EBD
// 0x0020 (0x0020 - 0x0000)
struct AB_EnterCombat_Surprised_C_OnRemoved_131995E9449AAA0A8168C98763432EBD final
{
public:
	struct FGameplayEffectRemovalInfo             GameplayEffectRemovalInfo;                         // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_EnterCombat_Surprised_C_OnRemoved_131995E9449AAA0A8168C98763432EBD) == 0x000008, "Wrong alignment on AB_EnterCombat_Surprised_C_OnRemoved_131995E9449AAA0A8168C98763432EBD");
static_assert(sizeof(AB_EnterCombat_Surprised_C_OnRemoved_131995E9449AAA0A8168C98763432EBD) == 0x000020, "Wrong size on AB_EnterCombat_Surprised_C_OnRemoved_131995E9449AAA0A8168C98763432EBD");
static_assert(offsetof(AB_EnterCombat_Surprised_C_OnRemoved_131995E9449AAA0A8168C98763432EBD, GameplayEffectRemovalInfo) == 0x000000, "Member 'AB_EnterCombat_Surprised_C_OnRemoved_131995E9449AAA0A8168C98763432EBD::GameplayEffectRemovalInfo' has a wrong offset!");

// Function AB_EnterCombat_Surprised.AB_EnterCombat_Surprised_C.InvalidHandle_131995E9449AAA0A8168C98763432EBD
// 0x0020 (0x0020 - 0x0000)
struct AB_EnterCombat_Surprised_C_InvalidHandle_131995E9449AAA0A8168C98763432EBD final
{
public:
	struct FGameplayEffectRemovalInfo             GameplayEffectRemovalInfo;                         // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_EnterCombat_Surprised_C_InvalidHandle_131995E9449AAA0A8168C98763432EBD) == 0x000008, "Wrong alignment on AB_EnterCombat_Surprised_C_InvalidHandle_131995E9449AAA0A8168C98763432EBD");
static_assert(sizeof(AB_EnterCombat_Surprised_C_InvalidHandle_131995E9449AAA0A8168C98763432EBD) == 0x000020, "Wrong size on AB_EnterCombat_Surprised_C_InvalidHandle_131995E9449AAA0A8168C98763432EBD");
static_assert(offsetof(AB_EnterCombat_Surprised_C_InvalidHandle_131995E9449AAA0A8168C98763432EBD, GameplayEffectRemovalInfo) == 0x000000, "Member 'AB_EnterCombat_Surprised_C_InvalidHandle_131995E9449AAA0A8168C98763432EBD::GameplayEffectRemovalInfo' has a wrong offset!");

}

