#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Equip_From_Payload_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AB_Equip_From_Payload_Base.AB_Equip_From_Payload_Base_C
// 0x0040 (0x04E0 - 0x04A0)
class UAB_Equip_From_Payload_Base_C : public UCAAbilityEquip
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCALoadoutComponent*                    Loadout_component;                                 // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAEquipmentBase*                       Target_equipment;                                  // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAEquipmentBase*                       Device_to_unequip;                                 // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Unequip_anim;                                      // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Equip_anim;                                        // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Restart;                                           // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Unblocked;                                         // 0x04D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D2[0x2];                                      // 0x04D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Execution;                                         // 0x04D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DoShortChange;                                     // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AB_Equip_From_Payload_Base(int32 EntryPoint);
	void EmergencyBackupTimer();
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void EventReceived_9484C2A645F67ABDD7A3858B6A6871CE(const struct FGameplayEventData& Payload);
	void OnSync_02008D834E53FA544F6470A7546A7289();
	void EventReceived_1FB14F9D4F2977CA255D2AB28856C15F(const struct FGameplayEventData& Payload);
	void OnCompleted_4FA010A84B1BD4D76EFEA5B9807C3872();
	void OnBlendOut_4FA010A84B1BD4D76EFEA5B9807C3872();
	void OnInterrupted_4FA010A84B1BD4D76EFEA5B9807C3872();
	void OnCancelled_4FA010A84B1BD4D76EFEA5B9807C3872();
	void OnSkipped_4FA010A84B1BD4D76EFEA5B9807C3872();
	void OnCompleted_C547D0964A6081C7615A14A081F27C8F();
	void OnBlendOut_C547D0964A6081C7615A14A081F27C8F();
	void OnInterrupted_C547D0964A6081C7615A14A081F27C8F();
	void OnCancelled_C547D0964A6081C7615A14A081F27C8F();
	void OnSkipped_C547D0964A6081C7615A14A081F27C8F();

	bool K2_ShouldAbilityRespondToEvent(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayEventData& Payload) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_Equip_From_Payload_Base_C">();
	}
	static class UAB_Equip_From_Payload_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_Equip_From_Payload_Base_C>();
	}
};
static_assert(alignof(UAB_Equip_From_Payload_Base_C) == 0x000008, "Wrong alignment on UAB_Equip_From_Payload_Base_C");
static_assert(sizeof(UAB_Equip_From_Payload_Base_C) == 0x0004E0, "Wrong size on UAB_Equip_From_Payload_Base_C");
static_assert(offsetof(UAB_Equip_From_Payload_Base_C, UberGraphFrame) == 0x0004A0, "Member 'UAB_Equip_From_Payload_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_Equip_From_Payload_Base_C, Loadout_component) == 0x0004A8, "Member 'UAB_Equip_From_Payload_Base_C::Loadout_component' has a wrong offset!");
static_assert(offsetof(UAB_Equip_From_Payload_Base_C, Target_equipment) == 0x0004B0, "Member 'UAB_Equip_From_Payload_Base_C::Target_equipment' has a wrong offset!");
static_assert(offsetof(UAB_Equip_From_Payload_Base_C, Device_to_unequip) == 0x0004B8, "Member 'UAB_Equip_From_Payload_Base_C::Device_to_unequip' has a wrong offset!");
static_assert(offsetof(UAB_Equip_From_Payload_Base_C, Unequip_anim) == 0x0004C0, "Member 'UAB_Equip_From_Payload_Base_C::Unequip_anim' has a wrong offset!");
static_assert(offsetof(UAB_Equip_From_Payload_Base_C, Equip_anim) == 0x0004C8, "Member 'UAB_Equip_From_Payload_Base_C::Equip_anim' has a wrong offset!");
static_assert(offsetof(UAB_Equip_From_Payload_Base_C, Restart) == 0x0004D0, "Member 'UAB_Equip_From_Payload_Base_C::Restart' has a wrong offset!");
static_assert(offsetof(UAB_Equip_From_Payload_Base_C, Unblocked) == 0x0004D1, "Member 'UAB_Equip_From_Payload_Base_C::Unblocked' has a wrong offset!");
static_assert(offsetof(UAB_Equip_From_Payload_Base_C, Execution) == 0x0004D4, "Member 'UAB_Equip_From_Payload_Base_C::Execution' has a wrong offset!");
static_assert(offsetof(UAB_Equip_From_Payload_Base_C, DoShortChange) == 0x0004D8, "Member 'UAB_Equip_From_Payload_Base_C::DoShortChange' has a wrong offset!");

}

