#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_EmoteDontShoot

#include "Basic.hpp"

#include "Keaton_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function AB_EmoteDontShoot.AB_EmoteDontShoot_C.ExecuteUbergraph_AB_EmoteDontShoot
// 0x03B0 (0x03B0 - 0x0000)
struct AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0040(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0058(0x00B8)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0110(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x0128(0x00B8)()
	struct FSpringArmData                         CallFunc_GetDataTableRowFromName_OutRow;           // 0x01E0(0x0028)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float Distance, bool Thrown_into_the_air)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x020C(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Player_C*                           K2Node_DynamicCast_AsBP_Player;                    // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23A[0x6];                                      // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Player_C*                           K2Node_DynamicCast_AsBP_Player_1;                  // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0254(0x0014)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           CallFunc_get_end_ability_tag_ReturnValue;          // 0x0268(0x000C)(ConstParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0278(0x00B8)(ConstParm)
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_Array_Random_OutItem;                     // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_355[0x3];                                      // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player_1;    // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanEmote_ReturnValue;                     // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A2[0x2];                                      // 0x03A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_distance;                       // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_thrown_into_the_air;            // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot) == 0x000008, "Wrong alignment on AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot");
static_assert(sizeof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot) == 0x0003B0, "Wrong size on AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, EntryPoint) == 0x000000, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, K2Node_CreateDelegate_OutputDelegate_3) == 0x000040, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, K2Node_CustomEvent_Payload) == 0x000058, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, K2Node_CreateDelegate_OutputDelegate_4) == 0x000110, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, Temp_struct_Variable) == 0x000128, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, CallFunc_GetDataTableRowFromName_OutRow) == 0x0001E0, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000208, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, K2Node_CreateDelegate_OutputDelegate_5) == 0x00020C, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, K2Node_Event_bWasCancelled) == 0x000220, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000228, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, K2Node_DynamicCast_AsBP_Player) == 0x000230, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::K2Node_DynamicCast_AsBP_Player' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, K2Node_DynamicCast_bSuccess) == 0x000238, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, CallFunc_K2_CommitAbility_ReturnValue) == 0x000239, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x000240, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, K2Node_DynamicCast_AsBP_Player_1) == 0x000248, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::K2Node_DynamicCast_AsBP_Player_1' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, K2Node_DynamicCast_bSuccess_1) == 0x000250, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, K2Node_CreateDelegate_OutputDelegate_6) == 0x000254, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, CallFunc_get_end_ability_tag_ReturnValue) == 0x000268, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::CallFunc_get_end_ability_tag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, K2Node_Event_EventData) == 0x000278, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000330, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, K2Node_DynamicCast_AsAnim_Montage) == 0x000338, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, K2Node_DynamicCast_bSuccess_2) == 0x000340, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, CallFunc_IsValid_ReturnValue) == 0x000341, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, CallFunc_Array_Random_OutItem) == 0x000348, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, CallFunc_Array_Random_OutIndex) == 0x000350, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, CallFunc_IsValid_ReturnValue_1) == 0x000354, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000358, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, CallFunc_IsValid_ReturnValue_2) == 0x000360, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, CallFunc_GetDisplayName_ReturnValue) == 0x000368, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000378, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x000380, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x000388, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, K2Node_DynamicCast_bSuccess_3) == 0x000390, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, K2Node_DynamicCast_AsCACharacter_Main_Player_1) == 0x000398, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::K2Node_DynamicCast_AsCACharacter_Main_Player_1' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, K2Node_DynamicCast_bSuccess_4) == 0x0003A0, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, CallFunc_CanEmote_ReturnValue) == 0x0003A1, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::CallFunc_CanEmote_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, K2Node_CustomEvent_distance) == 0x0003A4, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::K2Node_CustomEvent_distance' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot, K2Node_CustomEvent_thrown_into_the_air) == 0x0003A8, "Member 'AB_EmoteDontShoot_C_ExecuteUbergraph_AB_EmoteDontShoot::K2Node_CustomEvent_thrown_into_the_air' has a wrong offset!");

// Function AB_EmoteDontShoot.AB_EmoteDontShoot_C.m_on_knockback_Event_0
// 0x0008 (0x0008 - 0x0000)
struct AB_EmoteDontShoot_C_M_on_knockback_Event_0 final
{
public:
	float                                         Distance;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Thrown_into_the_air;                               // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_EmoteDontShoot_C_M_on_knockback_Event_0) == 0x000004, "Wrong alignment on AB_EmoteDontShoot_C_M_on_knockback_Event_0");
static_assert(sizeof(AB_EmoteDontShoot_C_M_on_knockback_Event_0) == 0x000008, "Wrong size on AB_EmoteDontShoot_C_M_on_knockback_Event_0");
static_assert(offsetof(AB_EmoteDontShoot_C_M_on_knockback_Event_0, Distance) == 0x000000, "Member 'AB_EmoteDontShoot_C_M_on_knockback_Event_0::Distance' has a wrong offset!");
static_assert(offsetof(AB_EmoteDontShoot_C_M_on_knockback_Event_0, Thrown_into_the_air) == 0x000004, "Member 'AB_EmoteDontShoot_C_M_on_knockback_Event_0::Thrown_into_the_air' has a wrong offset!");

// Function AB_EmoteDontShoot.AB_EmoteDontShoot_C.K2_ActivateAbilityFromEvent
// 0x00B8 (0x00B8 - 0x0000)
struct AB_EmoteDontShoot_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_EmoteDontShoot_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on AB_EmoteDontShoot_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(AB_EmoteDontShoot_C_K2_ActivateAbilityFromEvent) == 0x0000B8, "Wrong size on AB_EmoteDontShoot_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(AB_EmoteDontShoot_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'AB_EmoteDontShoot_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function AB_EmoteDontShoot.AB_EmoteDontShoot_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct AB_EmoteDontShoot_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_EmoteDontShoot_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on AB_EmoteDontShoot_C_K2_OnEndAbility");
static_assert(sizeof(AB_EmoteDontShoot_C_K2_OnEndAbility) == 0x000001, "Wrong size on AB_EmoteDontShoot_C_K2_OnEndAbility");
static_assert(offsetof(AB_EmoteDontShoot_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'AB_EmoteDontShoot_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function AB_EmoteDontShoot.AB_EmoteDontShoot_C.EventReceived_7C51CCFE4CFE5D80947630A1C787C13C
// 0x00B8 (0x00B8 - 0x0000)
struct AB_EmoteDontShoot_C_EventReceived_7C51CCFE4CFE5D80947630A1C787C13C final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AB_EmoteDontShoot_C_EventReceived_7C51CCFE4CFE5D80947630A1C787C13C) == 0x000008, "Wrong alignment on AB_EmoteDontShoot_C_EventReceived_7C51CCFE4CFE5D80947630A1C787C13C");
static_assert(sizeof(AB_EmoteDontShoot_C_EventReceived_7C51CCFE4CFE5D80947630A1C787C13C) == 0x0000B8, "Wrong size on AB_EmoteDontShoot_C_EventReceived_7C51CCFE4CFE5D80947630A1C787C13C");
static_assert(offsetof(AB_EmoteDontShoot_C_EventReceived_7C51CCFE4CFE5D80947630A1C787C13C, Payload) == 0x000000, "Member 'AB_EmoteDontShoot_C_EventReceived_7C51CCFE4CFE5D80947630A1C787C13C::Payload' has a wrong offset!");

}

