#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_EliteExo_Melee

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CAGameDatabase_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AB_EliteExo_Melee.AB_EliteExo_Melee_C
// 0x0038 (0x04C8 - 0x0490)
class UAB_EliteExo_Melee_C final : public UCAGameplayAbility_NPC
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UAnimMontage*>                   Anim_Montage_Array;                                // 0x0498(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimMontage*                           Montage_to_Play;                                   // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCADataTableRowHandle                  MeleeTime;                                         // 0x04B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_AB_EliteExo_Melee(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void EventReceived_5906A35A4BDAF177A84CA795197EB968(const struct FGameplayEventData& Payload);
	void OnCompleted_47B554844C54A3413DAAA9B20D836307();
	void OnBlendOut_47B554844C54A3413DAAA9B20D836307();
	void OnInterrupted_47B554844C54A3413DAAA9B20D836307();
	void OnCancelled_47B554844C54A3413DAAA9B20D836307();
	void OnSkipped_47B554844C54A3413DAAA9B20D836307();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_EliteExo_Melee_C">();
	}
	static class UAB_EliteExo_Melee_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_EliteExo_Melee_C>();
	}
};
static_assert(alignof(UAB_EliteExo_Melee_C) == 0x000008, "Wrong alignment on UAB_EliteExo_Melee_C");
static_assert(sizeof(UAB_EliteExo_Melee_C) == 0x0004C8, "Wrong size on UAB_EliteExo_Melee_C");
static_assert(offsetof(UAB_EliteExo_Melee_C, UberGraphFrame) == 0x000490, "Member 'UAB_EliteExo_Melee_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_EliteExo_Melee_C, Anim_Montage_Array) == 0x000498, "Member 'UAB_EliteExo_Melee_C::Anim_Montage_Array' has a wrong offset!");
static_assert(offsetof(UAB_EliteExo_Melee_C, Montage_to_Play) == 0x0004A8, "Member 'UAB_EliteExo_Melee_C::Montage_to_Play' has a wrong offset!");
static_assert(offsetof(UAB_EliteExo_Melee_C, MeleeTime) == 0x0004B0, "Member 'UAB_EliteExo_Melee_C::MeleeTime' has a wrong offset!");

}

