#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Elite_LegLost_Stun

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CAGameDatabase_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AB_Elite_LegLost_Stun.AB_Elite_LegLost_Stun_C
// 0x0060 (0x04F0 - 0x0490)
class UAB_Elite_LegLost_Stun_C : public UCAGameplayAbility_NPC
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   LeftComponentBoneName;                             // 0x0498(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RightComponentBoneName;                            // 0x04A4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           LeftStunComponentAnim;                             // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           RightStunComponentAnim;                            // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           LeftStunComponentAnim_InAir;                       // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           RightStunComponentAnim_InAir;                      // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           StunComponentAnim;                                 // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCADataTableRowHandle                  StunLeg;                                           // 0x04D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_AB_Elite_LegLost_Stun(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void OnCompleted_8712E8484A84B8F5B847F2B71ED503BC();
	void OnBlendOut_8712E8484A84B8F5B847F2B71ED503BC();
	void OnInterrupted_8712E8484A84B8F5B847F2B71ED503BC();
	void OnCancelled_8712E8484A84B8F5B847F2B71ED503BC();
	void OnSkipped_8712E8484A84B8F5B847F2B71ED503BC();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_Elite_LegLost_Stun_C">();
	}
	static class UAB_Elite_LegLost_Stun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_Elite_LegLost_Stun_C>();
	}
};
static_assert(alignof(UAB_Elite_LegLost_Stun_C) == 0x000008, "Wrong alignment on UAB_Elite_LegLost_Stun_C");
static_assert(sizeof(UAB_Elite_LegLost_Stun_C) == 0x0004F0, "Wrong size on UAB_Elite_LegLost_Stun_C");
static_assert(offsetof(UAB_Elite_LegLost_Stun_C, UberGraphFrame) == 0x000490, "Member 'UAB_Elite_LegLost_Stun_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_Elite_LegLost_Stun_C, LeftComponentBoneName) == 0x000498, "Member 'UAB_Elite_LegLost_Stun_C::LeftComponentBoneName' has a wrong offset!");
static_assert(offsetof(UAB_Elite_LegLost_Stun_C, RightComponentBoneName) == 0x0004A4, "Member 'UAB_Elite_LegLost_Stun_C::RightComponentBoneName' has a wrong offset!");
static_assert(offsetof(UAB_Elite_LegLost_Stun_C, LeftStunComponentAnim) == 0x0004B0, "Member 'UAB_Elite_LegLost_Stun_C::LeftStunComponentAnim' has a wrong offset!");
static_assert(offsetof(UAB_Elite_LegLost_Stun_C, RightStunComponentAnim) == 0x0004B8, "Member 'UAB_Elite_LegLost_Stun_C::RightStunComponentAnim' has a wrong offset!");
static_assert(offsetof(UAB_Elite_LegLost_Stun_C, LeftStunComponentAnim_InAir) == 0x0004C0, "Member 'UAB_Elite_LegLost_Stun_C::LeftStunComponentAnim_InAir' has a wrong offset!");
static_assert(offsetof(UAB_Elite_LegLost_Stun_C, RightStunComponentAnim_InAir) == 0x0004C8, "Member 'UAB_Elite_LegLost_Stun_C::RightStunComponentAnim_InAir' has a wrong offset!");
static_assert(offsetof(UAB_Elite_LegLost_Stun_C, StunComponentAnim) == 0x0004D0, "Member 'UAB_Elite_LegLost_Stun_C::StunComponentAnim' has a wrong offset!");
static_assert(offsetof(UAB_Elite_LegLost_Stun_C, StunLeg) == 0x0004D8, "Member 'UAB_Elite_LegLost_Stun_C::StunLeg' has a wrong offset!");

}

