#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Elite_Stun_Back

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CAGameDatabase_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AB_Elite_Stun_Back.AB_Elite_Stun_Back_C
// 0x0028 (0x04B8 - 0x0490)
class UAB_Elite_Stun_Back_C : public UCAGameplayAbility_NPC
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                           StunComponentAnim;                                 // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCADataTableRowHandle                  BackStun;                                          // 0x04A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_AB_Elite_Stun_Back(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void OnCompleted_8249074849698DB6A1BF5DA98D91882A();
	void OnBlendOut_8249074849698DB6A1BF5DA98D91882A();
	void OnInterrupted_8249074849698DB6A1BF5DA98D91882A();
	void OnCancelled_8249074849698DB6A1BF5DA98D91882A();
	void OnSkipped_8249074849698DB6A1BF5DA98D91882A();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_Elite_Stun_Back_C">();
	}
	static class UAB_Elite_Stun_Back_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_Elite_Stun_Back_C>();
	}
};
static_assert(alignof(UAB_Elite_Stun_Back_C) == 0x000008, "Wrong alignment on UAB_Elite_Stun_Back_C");
static_assert(sizeof(UAB_Elite_Stun_Back_C) == 0x0004B8, "Wrong size on UAB_Elite_Stun_Back_C");
static_assert(offsetof(UAB_Elite_Stun_Back_C, UberGraphFrame) == 0x000490, "Member 'UAB_Elite_Stun_Back_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_Elite_Stun_Back_C, StunComponentAnim) == 0x000498, "Member 'UAB_Elite_Stun_Back_C::StunComponentAnim' has a wrong offset!");
static_assert(offsetof(UAB_Elite_Stun_Back_C, BackStun) == 0x0004A0, "Member 'UAB_Elite_Stun_Back_C::BackStun' has a wrong offset!");

}

