#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_EliteExoFaceplate

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AB_EliteExoFaceplate.AB_EliteExoFaceplate_C.ExecuteUbergraph_AB_EliteExoFaceplate
// 0x00D8 (0x00D8 - 0x0000)
struct AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTweakParameterValue_ReturnValue;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0030(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0044(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0058(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasGameplayTag_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1; // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_2; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTweakParameterValue_ReturnValue_1;     // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue;  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate) == 0x000008, "Wrong alignment on AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate");
static_assert(sizeof(AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate) == 0x0000D8, "Wrong size on AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate");
static_assert(offsetof(AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate, EntryPoint) == 0x000000, "Member 'AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate, CallFunc_GetTweakParameterValue_ReturnValue) == 0x000004, "Member 'AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate::CallFunc_GetTweakParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate, K2Node_CreateDelegate_OutputDelegate_2) == 0x000030, "Member 'AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate, K2Node_CreateDelegate_OutputDelegate_3) == 0x000044, "Member 'AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate, K2Node_CreateDelegate_OutputDelegate_4) == 0x000058, "Member 'AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000070, "Member 'AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate, CallFunc_HasGameplayTag_ReturnValue) == 0x000078, "Member 'AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate::CallFunc_HasGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate, CallFunc_GetPlayLength_ReturnValue) == 0x00007C, "Member 'AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate::CallFunc_GetPlayLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate, K2Node_Event_bWasCancelled) == 0x000080, "Member 'AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000084, "Member 'AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000088, "Member 'AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x000090, "Member 'AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000098, "Member 'AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x0000A0, "Member 'AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1) == 0x0000A8, "Member 'AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate, CallFunc_GetOwningActorFromActorInfo_ReturnValue_2) == 0x0000B8, "Member 'AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate::CallFunc_GetOwningActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x0000C0, "Member 'AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x0000C8, "Member 'AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate, CallFunc_GetTweakParameterValue_ReturnValue_1) == 0x0000CC, "Member 'AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate::CallFunc_GetTweakParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate, CallFunc_RemoveActiveEffectsWithTags_ReturnValue) == 0x0000D0, "Member 'AB_EliteExoFaceplate_C_ExecuteUbergraph_AB_EliteExoFaceplate::CallFunc_RemoveActiveEffectsWithTags_ReturnValue' has a wrong offset!");

// Function AB_EliteExoFaceplate.AB_EliteExoFaceplate_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct AB_EliteExoFaceplate_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_EliteExoFaceplate_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on AB_EliteExoFaceplate_C_K2_OnEndAbility");
static_assert(sizeof(AB_EliteExoFaceplate_C_K2_OnEndAbility) == 0x000001, "Wrong size on AB_EliteExoFaceplate_C_K2_OnEndAbility");
static_assert(offsetof(AB_EliteExoFaceplate_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'AB_EliteExoFaceplate_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

