#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Elite_IdleConversationStarter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AB_Elite_IdleConversationStarter.AB_Elite_IdleConversationStarter_C
// 0x0048 (0x04D8 - 0x0490)
class UAB_Elite_IdleConversationStarter_C final : public UCAGameplayAbility_NPC
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UAnimMontage*>                   Anim_Montage_Array;                                // 0x0498(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AActor*                                 TargetAlly;                                        // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_NPC*                       OwnerNPC;                                          // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomIndex;                                       // 0x04B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_NPC*                       TargetAllyNPC;                                     // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           DialogueTriggerArray;                              // 0x04C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_AB_Elite_IdleConversationStarter(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void OnCompleted_05D8BCD941338953503926B091EF25A0();
	void OnBlendOut_05D8BCD941338953503926B091EF25A0();
	void OnInterrupted_05D8BCD941338953503926B091EF25A0();
	void OnCancelled_05D8BCD941338953503926B091EF25A0();
	void OnSkipped_05D8BCD941338953503926B091EF25A0();
	void SetRandomAnimIndex();
	void Get_Random_Dialogue_Trigger(class FName* Trigger);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_Elite_IdleConversationStarter_C">();
	}
	static class UAB_Elite_IdleConversationStarter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_Elite_IdleConversationStarter_C>();
	}
};
static_assert(alignof(UAB_Elite_IdleConversationStarter_C) == 0x000008, "Wrong alignment on UAB_Elite_IdleConversationStarter_C");
static_assert(sizeof(UAB_Elite_IdleConversationStarter_C) == 0x0004D8, "Wrong size on UAB_Elite_IdleConversationStarter_C");
static_assert(offsetof(UAB_Elite_IdleConversationStarter_C, UberGraphFrame) == 0x000490, "Member 'UAB_Elite_IdleConversationStarter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_Elite_IdleConversationStarter_C, Anim_Montage_Array) == 0x000498, "Member 'UAB_Elite_IdleConversationStarter_C::Anim_Montage_Array' has a wrong offset!");
static_assert(offsetof(UAB_Elite_IdleConversationStarter_C, TargetAlly) == 0x0004A8, "Member 'UAB_Elite_IdleConversationStarter_C::TargetAlly' has a wrong offset!");
static_assert(offsetof(UAB_Elite_IdleConversationStarter_C, OwnerNPC) == 0x0004B0, "Member 'UAB_Elite_IdleConversationStarter_C::OwnerNPC' has a wrong offset!");
static_assert(offsetof(UAB_Elite_IdleConversationStarter_C, RandomIndex) == 0x0004B8, "Member 'UAB_Elite_IdleConversationStarter_C::RandomIndex' has a wrong offset!");
static_assert(offsetof(UAB_Elite_IdleConversationStarter_C, TargetAllyNPC) == 0x0004C0, "Member 'UAB_Elite_IdleConversationStarter_C::TargetAllyNPC' has a wrong offset!");
static_assert(offsetof(UAB_Elite_IdleConversationStarter_C, DialogueTriggerArray) == 0x0004C8, "Member 'UAB_Elite_IdleConversationStarter_C::DialogueTriggerArray' has a wrong offset!");

}

