#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Grunt_EvadeDodge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AB_Grunt_EvadeDodge.AB_Grunt_EvadeDodge_C
// 0x0028 (0x04B8 - 0x0490)
class UAB_Grunt_EvadeDodge_C final : public UCAGameplayAbility_NPC
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UAnimMontage*>                   Anim_Montage_Array;                                // 0x0498(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   OnCombatEvasive;                                   // 0x04A8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AB_Grunt_EvadeDodge(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void OnCompleted_1F1802C74C458E9F7F4832A1004605D1();
	void OnBlendOut_1F1802C74C458E9F7F4832A1004605D1();
	void OnInterrupted_1F1802C74C458E9F7F4832A1004605D1();
	void OnCancelled_1F1802C74C458E9F7F4832A1004605D1();
	void OnSkipped_1F1802C74C458E9F7F4832A1004605D1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_Grunt_EvadeDodge_C">();
	}
	static class UAB_Grunt_EvadeDodge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_Grunt_EvadeDodge_C>();
	}
};
static_assert(alignof(UAB_Grunt_EvadeDodge_C) == 0x000008, "Wrong alignment on UAB_Grunt_EvadeDodge_C");
static_assert(sizeof(UAB_Grunt_EvadeDodge_C) == 0x0004B8, "Wrong size on UAB_Grunt_EvadeDodge_C");
static_assert(offsetof(UAB_Grunt_EvadeDodge_C, UberGraphFrame) == 0x000490, "Member 'UAB_Grunt_EvadeDodge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_EvadeDodge_C, Anim_Montage_Array) == 0x000498, "Member 'UAB_Grunt_EvadeDodge_C::Anim_Montage_Array' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_EvadeDodge_C, OnCombatEvasive) == 0x0004A8, "Member 'UAB_Grunt_EvadeDodge_C::OnCombatEvasive' has a wrong offset!");

}

