#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Grunt_JumpStart

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CAGameDatabase_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AB_Grunt_JumpStart.AB_Grunt_JumpStart_C
// 0x00A8 (0x0538 - 0x0490)
class UAB_Grunt_JumpStart_C final : public UCAGameplayAbility_NPC
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FVector>                        HeightArray;                                       // 0x0498(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimMontage*                           Takeoff_Small;                                     // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Takeoff_Medium;                                    // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Takeoff_Large;                                     // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Takeoff_XLarge;                                    // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   OnCombatEvasiveElite;                              // 0x04C8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCADataTableRowHandle                  JumpSmall;                                         // 0x04D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FCADataTableRowHandle                  JumpMid;                                           // 0x04F0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FCADataTableRowHandle                  JumpLarge;                                         // 0x0508(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FCADataTableRowHandle                  JumpXL;                                            // 0x0520(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_AB_Grunt_JumpStart(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void OnCompleted_5A5EE749426975A7ED1D448A11F6D5D1();
	void OnBlendOut_5A5EE749426975A7ED1D448A11F6D5D1();
	void OnInterrupted_5A5EE749426975A7ED1D448A11F6D5D1();
	void OnCancelled_5A5EE749426975A7ED1D448A11F6D5D1();
	void OnSkipped_5A5EE749426975A7ED1D448A11F6D5D1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_Grunt_JumpStart_C">();
	}
	static class UAB_Grunt_JumpStart_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_Grunt_JumpStart_C>();
	}
};
static_assert(alignof(UAB_Grunt_JumpStart_C) == 0x000008, "Wrong alignment on UAB_Grunt_JumpStart_C");
static_assert(sizeof(UAB_Grunt_JumpStart_C) == 0x000538, "Wrong size on UAB_Grunt_JumpStart_C");
static_assert(offsetof(UAB_Grunt_JumpStart_C, UberGraphFrame) == 0x000490, "Member 'UAB_Grunt_JumpStart_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_JumpStart_C, HeightArray) == 0x000498, "Member 'UAB_Grunt_JumpStart_C::HeightArray' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_JumpStart_C, Takeoff_Small) == 0x0004A8, "Member 'UAB_Grunt_JumpStart_C::Takeoff_Small' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_JumpStart_C, Takeoff_Medium) == 0x0004B0, "Member 'UAB_Grunt_JumpStart_C::Takeoff_Medium' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_JumpStart_C, Takeoff_Large) == 0x0004B8, "Member 'UAB_Grunt_JumpStart_C::Takeoff_Large' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_JumpStart_C, Takeoff_XLarge) == 0x0004C0, "Member 'UAB_Grunt_JumpStart_C::Takeoff_XLarge' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_JumpStart_C, OnCombatEvasiveElite) == 0x0004C8, "Member 'UAB_Grunt_JumpStart_C::OnCombatEvasiveElite' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_JumpStart_C, JumpSmall) == 0x0004D8, "Member 'UAB_Grunt_JumpStart_C::JumpSmall' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_JumpStart_C, JumpMid) == 0x0004F0, "Member 'UAB_Grunt_JumpStart_C::JumpMid' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_JumpStart_C, JumpLarge) == 0x000508, "Member 'UAB_Grunt_JumpStart_C::JumpLarge' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_JumpStart_C, JumpXL) == 0x000520, "Member 'UAB_Grunt_JumpStart_C::JumpXL' has a wrong offset!");

}

