#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Grunt_JumpLand

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AB_Grunt_JumpLand.AB_Grunt_JumpLand_C.ExecuteUbergraph_AB_Grunt_JumpLand
// 0x00B8 (0x00B8 - 0x0000)
struct AB_Grunt_JumpLand_C_ExecuteUbergraph_AB_Grunt_JumpLand final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectRemovalInfo             K2Node_CustomEvent_GameplayEffectRemovalInfo_1;    // 0x0008(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectRemovalInfo             K2Node_CustomEvent_GameplayEffectRemovalInfo;      // 0x0040(0x0020)(ConstParm)
	TDelegate<void(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectRemovalInfo             Temp_struct_Variable;                              // 0x0078(0x0020)()
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x009C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayEffectRemoved* CallFunc_WaitForGameplayEffectRemoved_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Grunt_JumpLand_C_ExecuteUbergraph_AB_Grunt_JumpLand) == 0x000008, "Wrong alignment on AB_Grunt_JumpLand_C_ExecuteUbergraph_AB_Grunt_JumpLand");
static_assert(sizeof(AB_Grunt_JumpLand_C_ExecuteUbergraph_AB_Grunt_JumpLand) == 0x0000B8, "Wrong size on AB_Grunt_JumpLand_C_ExecuteUbergraph_AB_Grunt_JumpLand");
static_assert(offsetof(AB_Grunt_JumpLand_C_ExecuteUbergraph_AB_Grunt_JumpLand, EntryPoint) == 0x000000, "Member 'AB_Grunt_JumpLand_C_ExecuteUbergraph_AB_Grunt_JumpLand::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Grunt_JumpLand_C_ExecuteUbergraph_AB_Grunt_JumpLand, K2Node_CustomEvent_GameplayEffectRemovalInfo_1) == 0x000008, "Member 'AB_Grunt_JumpLand_C_ExecuteUbergraph_AB_Grunt_JumpLand::K2Node_CustomEvent_GameplayEffectRemovalInfo_1' has a wrong offset!");
static_assert(offsetof(AB_Grunt_JumpLand_C_ExecuteUbergraph_AB_Grunt_JumpLand, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'AB_Grunt_JumpLand_C_ExecuteUbergraph_AB_Grunt_JumpLand::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_Grunt_JumpLand_C_ExecuteUbergraph_AB_Grunt_JumpLand, K2Node_CustomEvent_GameplayEffectRemovalInfo) == 0x000040, "Member 'AB_Grunt_JumpLand_C_ExecuteUbergraph_AB_Grunt_JumpLand::K2Node_CustomEvent_GameplayEffectRemovalInfo' has a wrong offset!");
static_assert(offsetof(AB_Grunt_JumpLand_C_ExecuteUbergraph_AB_Grunt_JumpLand, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'AB_Grunt_JumpLand_C_ExecuteUbergraph_AB_Grunt_JumpLand::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AB_Grunt_JumpLand_C_ExecuteUbergraph_AB_Grunt_JumpLand, Temp_struct_Variable) == 0x000078, "Member 'AB_Grunt_JumpLand_C_ExecuteUbergraph_AB_Grunt_JumpLand::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AB_Grunt_JumpLand_C_ExecuteUbergraph_AB_Grunt_JumpLand, K2Node_Event_bWasCancelled) == 0x000098, "Member 'AB_Grunt_JumpLand_C_ExecuteUbergraph_AB_Grunt_JumpLand::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(AB_Grunt_JumpLand_C_ExecuteUbergraph_AB_Grunt_JumpLand, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00009C, "Member 'AB_Grunt_JumpLand_C_ExecuteUbergraph_AB_Grunt_JumpLand::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_JumpLand_C_ExecuteUbergraph_AB_Grunt_JumpLand, CallFunc_WaitForGameplayEffectRemoved_ReturnValue) == 0x0000A8, "Member 'AB_Grunt_JumpLand_C_ExecuteUbergraph_AB_Grunt_JumpLand::CallFunc_WaitForGameplayEffectRemoved_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_JumpLand_C_ExecuteUbergraph_AB_Grunt_JumpLand, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'AB_Grunt_JumpLand_C_ExecuteUbergraph_AB_Grunt_JumpLand::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AB_Grunt_JumpLand.AB_Grunt_JumpLand_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct AB_Grunt_JumpLand_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Grunt_JumpLand_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on AB_Grunt_JumpLand_C_K2_OnEndAbility");
static_assert(sizeof(AB_Grunt_JumpLand_C_K2_OnEndAbility) == 0x000001, "Wrong size on AB_Grunt_JumpLand_C_K2_OnEndAbility");
static_assert(offsetof(AB_Grunt_JumpLand_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'AB_Grunt_JumpLand_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function AB_Grunt_JumpLand.AB_Grunt_JumpLand_C.OnRemoved_74BFAF2E41B63FC662875DB49ECBDC42
// 0x0020 (0x0020 - 0x0000)
struct AB_Grunt_JumpLand_C_OnRemoved_74BFAF2E41B63FC662875DB49ECBDC42 final
{
public:
	struct FGameplayEffectRemovalInfo             GameplayEffectRemovalInfo;                         // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_Grunt_JumpLand_C_OnRemoved_74BFAF2E41B63FC662875DB49ECBDC42) == 0x000008, "Wrong alignment on AB_Grunt_JumpLand_C_OnRemoved_74BFAF2E41B63FC662875DB49ECBDC42");
static_assert(sizeof(AB_Grunt_JumpLand_C_OnRemoved_74BFAF2E41B63FC662875DB49ECBDC42) == 0x000020, "Wrong size on AB_Grunt_JumpLand_C_OnRemoved_74BFAF2E41B63FC662875DB49ECBDC42");
static_assert(offsetof(AB_Grunt_JumpLand_C_OnRemoved_74BFAF2E41B63FC662875DB49ECBDC42, GameplayEffectRemovalInfo) == 0x000000, "Member 'AB_Grunt_JumpLand_C_OnRemoved_74BFAF2E41B63FC662875DB49ECBDC42::GameplayEffectRemovalInfo' has a wrong offset!");

// Function AB_Grunt_JumpLand.AB_Grunt_JumpLand_C.InvalidHandle_74BFAF2E41B63FC662875DB49ECBDC42
// 0x0020 (0x0020 - 0x0000)
struct AB_Grunt_JumpLand_C_InvalidHandle_74BFAF2E41B63FC662875DB49ECBDC42 final
{
public:
	struct FGameplayEffectRemovalInfo             GameplayEffectRemovalInfo;                         // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_Grunt_JumpLand_C_InvalidHandle_74BFAF2E41B63FC662875DB49ECBDC42) == 0x000008, "Wrong alignment on AB_Grunt_JumpLand_C_InvalidHandle_74BFAF2E41B63FC662875DB49ECBDC42");
static_assert(sizeof(AB_Grunt_JumpLand_C_InvalidHandle_74BFAF2E41B63FC662875DB49ECBDC42) == 0x000020, "Wrong size on AB_Grunt_JumpLand_C_InvalidHandle_74BFAF2E41B63FC662875DB49ECBDC42");
static_assert(offsetof(AB_Grunt_JumpLand_C_InvalidHandle_74BFAF2E41B63FC662875DB49ECBDC42, GameplayEffectRemovalInfo) == 0x000000, "Member 'AB_Grunt_JumpLand_C_InvalidHandle_74BFAF2E41B63FC662875DB49ECBDC42::GameplayEffectRemovalInfo' has a wrong offset!");

}

