#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Grunt_Helmet

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AB_Grunt_Helmet.AB_Grunt_Helmet_C.ExecuteUbergraph_AB_Grunt_Helmet
// 0x0210 (0x0210 - 0x0000)
struct AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTweakParameterValue_ReturnValue;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0050(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0064(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0088(0x00B8)(ConstParm)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue;  // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHitDataType*                           K2Node_DynamicCast_AsHit_Data_Type;                // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter*                           K2Node_DynamicCast_AsCACharacter;                  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  CallFunc_GetActorRotation__Quat__Return_Value;     // 0x0180(0x0010)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Quat_Rotator_ReturnValue;                 // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_LessLess_VectorRotator_ReturnValue;       // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_Array_Get_Item;                           // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Get4DirectionIndex_ReturnValue;           // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x01E0(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_2; // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0208(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet) == 0x000010, "Wrong alignment on AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet");
static_assert(sizeof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet) == 0x000210, "Wrong size on AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, EntryPoint) == 0x000000, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, CallFunc_GetTweakParameterValue_ReturnValue) == 0x000004, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::CallFunc_GetTweakParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, CallFunc_WaitDelay_ReturnValue) == 0x000008, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, K2Node_CreateDelegate_OutputDelegate_3) == 0x000050, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, K2Node_CreateDelegate_OutputDelegate_4) == 0x000064, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, K2Node_Event_bWasCancelled) == 0x000078, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000080, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, K2Node_Event_EventData) == 0x000088, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000140, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, CallFunc_RemoveActiveEffectsWithTags_ReturnValue) == 0x000148, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::CallFunc_RemoveActiveEffectsWithTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, K2Node_DynamicCast_AsHit_Data_Type) == 0x000150, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::K2Node_DynamicCast_AsHit_Data_Type' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x000160, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, K2Node_DynamicCast_AsCACharacter) == 0x000168, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::K2Node_DynamicCast_AsCACharacter' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, K2Node_DynamicCast_bSuccess_1) == 0x000170, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000174, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, CallFunc_GetActorRotation__Quat__Return_Value) == 0x000180, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::CallFunc_GetActorRotation__Quat__Return_Value' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000190, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, CallFunc_Quat_Rotator_ReturnValue) == 0x00019C, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::CallFunc_Quat_Rotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, CallFunc_Normal_ReturnValue) == 0x0001A8, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, CallFunc_LessLess_VectorRotator_ReturnValue) == 0x0001B4, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::CallFunc_LessLess_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, CallFunc_Array_Get_Item) == 0x0001C0, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, CallFunc_Get4DirectionIndex_ReturnValue) == 0x0001C8, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::CallFunc_Get4DirectionIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, CallFunc_GetPlayLength_ReturnValue) == 0x0001CC, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::CallFunc_GetPlayLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001D0, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x0001D8, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001E0, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, CallFunc_IsValid_ReturnValue_1) == 0x0001F4, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, CallFunc_GetOwningActorFromActorInfo_ReturnValue_2) == 0x0001F8, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::CallFunc_GetOwningActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000200, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000208, "Member 'AB_Grunt_Helmet_C_ExecuteUbergraph_AB_Grunt_Helmet::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");

// Function AB_Grunt_Helmet.AB_Grunt_Helmet_C.K2_ActivateAbilityFromEvent
// 0x00B8 (0x00B8 - 0x0000)
struct AB_Grunt_Helmet_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_Grunt_Helmet_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on AB_Grunt_Helmet_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(AB_Grunt_Helmet_C_K2_ActivateAbilityFromEvent) == 0x0000B8, "Wrong size on AB_Grunt_Helmet_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(AB_Grunt_Helmet_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'AB_Grunt_Helmet_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function AB_Grunt_Helmet.AB_Grunt_Helmet_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct AB_Grunt_Helmet_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Grunt_Helmet_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on AB_Grunt_Helmet_C_K2_OnEndAbility");
static_assert(sizeof(AB_Grunt_Helmet_C_K2_OnEndAbility) == 0x000001, "Wrong size on AB_Grunt_Helmet_C_K2_OnEndAbility");
static_assert(offsetof(AB_Grunt_Helmet_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'AB_Grunt_Helmet_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

