#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Grunt_Throw_Grenade

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CAGameDatabase_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AB_Grunt_Throw_Grenade.AB_Grunt_Throw_Grenade_C
// 0x0080 (0x0510 - 0x0490)
class UAB_Grunt_Throw_Grenade_C final : public UCAGameplayAbility_NPC
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          GrenadeLaunched;                                   // 0x0498(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAComponent_NPCTargetManager*          TargetManager;                                     // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Launch_Direction;                                  // 0x04A8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DropAtFeet;                                        // 0x04B4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage_to_Play;                                   // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Owner_Actor;                                       // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   OnUseConsumableLethal;                             // 0x04D0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DC[0x4];                                      // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_NPC*                       Owner_NPC;                                         // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FVector                                Launch_Location;                                   // 0x04E8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F4[0x4];                                      // 0x04F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCADataTableRowHandle                  GrenadeTime;                                       // 0x04F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_AB_Grunt_Throw_Grenade(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void LaunchIfNeeded();
	void LaunchGrenade();
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void EventReceived_B33119F04D6CC9CC6232A3B7D2FAFF58(const struct FGameplayEventData& Payload);
	void Success_55C0843545E2F0C410EACA9F12ECAA53(class AActor* SpawnedActor);
	void DidNotSpawn_55C0843545E2F0C410EACA9F12ECAA53(class AActor* SpawnedActor);
	void OnCompleted_318E738B44B69E07201D68B810BDAE7F();
	void OnBlendOut_318E738B44B69E07201D68B810BDAE7F();
	void OnInterrupted_318E738B44B69E07201D68B810BDAE7F();
	void OnCancelled_318E738B44B69E07201D68B810BDAE7F();
	void OnSkipped_318E738B44B69E07201D68B810BDAE7F();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_Grunt_Throw_Grenade_C">();
	}
	static class UAB_Grunt_Throw_Grenade_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_Grunt_Throw_Grenade_C>();
	}
};
static_assert(alignof(UAB_Grunt_Throw_Grenade_C) == 0x000008, "Wrong alignment on UAB_Grunt_Throw_Grenade_C");
static_assert(sizeof(UAB_Grunt_Throw_Grenade_C) == 0x000510, "Wrong size on UAB_Grunt_Throw_Grenade_C");
static_assert(offsetof(UAB_Grunt_Throw_Grenade_C, UberGraphFrame) == 0x000490, "Member 'UAB_Grunt_Throw_Grenade_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_Throw_Grenade_C, GrenadeLaunched) == 0x000498, "Member 'UAB_Grunt_Throw_Grenade_C::GrenadeLaunched' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_Throw_Grenade_C, TargetManager) == 0x0004A0, "Member 'UAB_Grunt_Throw_Grenade_C::TargetManager' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_Throw_Grenade_C, Launch_Direction) == 0x0004A8, "Member 'UAB_Grunt_Throw_Grenade_C::Launch_Direction' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_Throw_Grenade_C, DropAtFeet) == 0x0004B4, "Member 'UAB_Grunt_Throw_Grenade_C::DropAtFeet' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_Throw_Grenade_C, Montage_to_Play) == 0x0004C0, "Member 'UAB_Grunt_Throw_Grenade_C::Montage_to_Play' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_Throw_Grenade_C, Owner_Actor) == 0x0004C8, "Member 'UAB_Grunt_Throw_Grenade_C::Owner_Actor' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_Throw_Grenade_C, OnUseConsumableLethal) == 0x0004D0, "Member 'UAB_Grunt_Throw_Grenade_C::OnUseConsumableLethal' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_Throw_Grenade_C, Owner_NPC) == 0x0004E0, "Member 'UAB_Grunt_Throw_Grenade_C::Owner_NPC' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_Throw_Grenade_C, Launch_Location) == 0x0004E8, "Member 'UAB_Grunt_Throw_Grenade_C::Launch_Location' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_Throw_Grenade_C, GrenadeTime) == 0x0004F8, "Member 'UAB_Grunt_Throw_Grenade_C::GrenadeTime' has a wrong offset!");

}

