#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Grunt_Helmet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CAGameDatabase_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AB_Grunt_Helmet.AB_Grunt_Helmet_C
// 0x0040 (0x04D0 - 0x0490)
class UAB_Grunt_Helmet_C final : public UCAGameplayAbility_NPC
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UAnimMontage*>                   FaceComponentAnim;                                 // 0x0498(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   ComponentBoneName;                                 // 0x04A8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         M_direction;                                       // 0x04B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCADataTableRowHandle                  StaggerTime;                                       // 0x04B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_AB_Grunt_Helmet(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnFinish_BD4B18354258DF23D4E06989D2FDD387();
	void OnCompleted_E6D6D96744A9E5198BF9BCBB708E0518();
	void OnBlendOut_E6D6D96744A9E5198BF9BCBB708E0518();
	void OnInterrupted_E6D6D96744A9E5198BF9BCBB708E0518();
	void OnCancelled_E6D6D96744A9E5198BF9BCBB708E0518();
	void OnSkipped_E6D6D96744A9E5198BF9BCBB708E0518();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_Grunt_Helmet_C">();
	}
	static class UAB_Grunt_Helmet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_Grunt_Helmet_C>();
	}
};
static_assert(alignof(UAB_Grunt_Helmet_C) == 0x000008, "Wrong alignment on UAB_Grunt_Helmet_C");
static_assert(sizeof(UAB_Grunt_Helmet_C) == 0x0004D0, "Wrong size on UAB_Grunt_Helmet_C");
static_assert(offsetof(UAB_Grunt_Helmet_C, UberGraphFrame) == 0x000490, "Member 'UAB_Grunt_Helmet_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_Helmet_C, FaceComponentAnim) == 0x000498, "Member 'UAB_Grunt_Helmet_C::FaceComponentAnim' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_Helmet_C, ComponentBoneName) == 0x0004A8, "Member 'UAB_Grunt_Helmet_C::ComponentBoneName' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_Helmet_C, M_direction) == 0x0004B4, "Member 'UAB_Grunt_Helmet_C::M_direction' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_Helmet_C, StaggerTime) == 0x0004B8, "Member 'UAB_Grunt_Helmet_C::StaggerTime' has a wrong offset!");

}

