#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Grunt_IdleAtHint

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AB_Grunt_IdleAtHint.AB_Grunt_IdleAtHint_C.ExecuteUbergraph_AB_Grunt_IdleAtHint
// 0x0148 (0x0148 - 0x0000)
struct AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0040(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0054(0x0014)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0068(0x00B8)(ConstParm)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_Array_Random_OutItem;                     // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint) == 0x000008, "Wrong alignment on AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint");
static_assert(sizeof(AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint) == 0x000148, "Wrong size on AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint");
static_assert(offsetof(AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint, EntryPoint) == 0x000000, "Member 'AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint, K2Node_CreateDelegate_OutputDelegate_3) == 0x000040, "Member 'AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint, K2Node_CreateDelegate_OutputDelegate_4) == 0x000054, "Member 'AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint, K2Node_Event_EventData) == 0x000068, "Member 'AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint, CallFunc_K2_CommitAbility_ReturnValue) == 0x000120, "Member 'AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint, CallFunc_Array_Random_OutItem) == 0x000128, "Member 'AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint, CallFunc_Array_Random_OutIndex) == 0x000130, "Member 'AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000138, "Member 'AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint, CallFunc_IsValid_ReturnValue) == 0x000140, "Member 'AB_Grunt_IdleAtHint_C_ExecuteUbergraph_AB_Grunt_IdleAtHint::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AB_Grunt_IdleAtHint.AB_Grunt_IdleAtHint_C.K2_ActivateAbilityFromEvent
// 0x00B8 (0x00B8 - 0x0000)
struct AB_Grunt_IdleAtHint_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_Grunt_IdleAtHint_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on AB_Grunt_IdleAtHint_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(AB_Grunt_IdleAtHint_C_K2_ActivateAbilityFromEvent) == 0x0000B8, "Wrong size on AB_Grunt_IdleAtHint_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(AB_Grunt_IdleAtHint_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'AB_Grunt_IdleAtHint_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

