#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Grunt_Foamed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AB_Grunt_Foamed.AB_Grunt_Foamed_C
// 0x0030 (0x04C0 - 0x0490)
class UAB_Grunt_Foamed_C final : public UCAGameplayAbility_NPC
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ACACharacter_NPC*                       OwningNPC;                                         // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                   AnimMontageArray;                                  // 0x04A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   OnFoamed;                                          // 0x04B0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AB_Grunt_Foamed(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void OnCompleted_BCF9BFD44AC0B664080BC19C0EECC9C0();
	void OnBlendOut_BCF9BFD44AC0B664080BC19C0EECC9C0();
	void OnInterrupted_BCF9BFD44AC0B664080BC19C0EECC9C0();
	void OnCancelled_BCF9BFD44AC0B664080BC19C0EECC9C0();
	void OnSkipped_BCF9BFD44AC0B664080BC19C0EECC9C0();
	void OnCompleted_A31A752A4FE6E81EBB975196F4499F44();
	void OnBlendOut_A31A752A4FE6E81EBB975196F4499F44();
	void OnInterrupted_A31A752A4FE6E81EBB975196F4499F44();
	void OnCancelled_A31A752A4FE6E81EBB975196F4499F44();
	void OnSkipped_A31A752A4FE6E81EBB975196F4499F44();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_Grunt_Foamed_C">();
	}
	static class UAB_Grunt_Foamed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_Grunt_Foamed_C>();
	}
};
static_assert(alignof(UAB_Grunt_Foamed_C) == 0x000008, "Wrong alignment on UAB_Grunt_Foamed_C");
static_assert(sizeof(UAB_Grunt_Foamed_C) == 0x0004C0, "Wrong size on UAB_Grunt_Foamed_C");
static_assert(offsetof(UAB_Grunt_Foamed_C, UberGraphFrame) == 0x000490, "Member 'UAB_Grunt_Foamed_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_Foamed_C, OwningNPC) == 0x000498, "Member 'UAB_Grunt_Foamed_C::OwningNPC' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_Foamed_C, AnimMontageArray) == 0x0004A0, "Member 'UAB_Grunt_Foamed_C::AnimMontageArray' has a wrong offset!");
static_assert(offsetof(UAB_Grunt_Foamed_C, OnFoamed) == 0x0004B0, "Member 'UAB_Grunt_Foamed_C::OnFoamed' has a wrong offset!");

}

