#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Grunt_EvadeDodge

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AB_Grunt_EvadeDodge.AB_Grunt_EvadeDodge_C.ExecuteUbergraph_AB_Grunt_EvadeDodge
// 0x0180 (0x0180 - 0x0000)
struct AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACADialogueNPCManager*                  CallFunc_GetDialogueNPCManager_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x004C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0060(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0078(0x00B8)(ConstParm)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_Array_Random_OutItem;                     // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_NPC_Character_C*                    K2Node_DynamicCast_AsBP_NPC_Character;             // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACADialogueNPCManager*                  CallFunc_GetDialogueNPCManager_ReturnValue_1;      // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPlayCombatLine_ReturnValue;            // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge) == 0x000008, "Wrong alignment on AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge");
static_assert(sizeof(AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge) == 0x000180, "Wrong size on AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge");
static_assert(offsetof(AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge, EntryPoint) == 0x000000, "Member 'AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge, CallFunc_GetDialogueNPCManager_ReturnValue) == 0x000008, "Member 'AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge::CallFunc_GetDialogueNPCManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge, K2Node_CreateDelegate_OutputDelegate_3) == 0x00004C, "Member 'AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge, K2Node_CreateDelegate_OutputDelegate_4) == 0x000060, "Member 'AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge, K2Node_Event_EventData) == 0x000078, "Member 'AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge, CallFunc_K2_CommitAbility_ReturnValue) == 0x000130, "Member 'AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge, CallFunc_Array_Random_OutItem) == 0x000138, "Member 'AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge, CallFunc_Array_Random_OutIndex) == 0x000140, "Member 'AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000148, "Member 'AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge, CallFunc_IsValid_ReturnValue) == 0x000150, "Member 'AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000158, "Member 'AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge, K2Node_DynamicCast_AsBP_NPC_Character) == 0x000160, "Member 'AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge::K2Node_DynamicCast_AsBP_NPC_Character' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge, K2Node_DynamicCast_bSuccess) == 0x000168, "Member 'AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge, CallFunc_GetDialogueNPCManager_ReturnValue_1) == 0x000170, "Member 'AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge::CallFunc_GetDialogueNPCManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge, CallFunc_CanPlayCombatLine_ReturnValue) == 0x000178, "Member 'AB_Grunt_EvadeDodge_C_ExecuteUbergraph_AB_Grunt_EvadeDodge::CallFunc_CanPlayCombatLine_ReturnValue' has a wrong offset!");

// Function AB_Grunt_EvadeDodge.AB_Grunt_EvadeDodge_C.K2_ActivateAbilityFromEvent
// 0x00B8 (0x00B8 - 0x0000)
struct AB_Grunt_EvadeDodge_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_Grunt_EvadeDodge_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on AB_Grunt_EvadeDodge_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(AB_Grunt_EvadeDodge_C_K2_ActivateAbilityFromEvent) == 0x0000B8, "Wrong size on AB_Grunt_EvadeDodge_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(AB_Grunt_EvadeDodge_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'AB_Grunt_EvadeDodge_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

