#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Grunt_OnZeroGCollision

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AB_Grunt_OnZeroGCollision.AB_Grunt_OnZeroGCollision_C.ExecuteUbergraph_AB_Grunt_OnZeroGCollision
// 0x00E8 (0x00E8 - 0x0000)
struct AB_Grunt_OnZeroGCollision_C_ExecuteUbergraph_AB_Grunt_OnZeroGCollision final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0008(0x00B8)(ConstParm)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_NPC*                       CallFunc_ValidateAsServerNPC_valid_npc;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAAIController*                        CallFunc_ValidateAsServerNPC_valid_ai_controller;  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidateAsServerNPC_ReturnValue;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x00DC(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Grunt_OnZeroGCollision_C_ExecuteUbergraph_AB_Grunt_OnZeroGCollision) == 0x000008, "Wrong alignment on AB_Grunt_OnZeroGCollision_C_ExecuteUbergraph_AB_Grunt_OnZeroGCollision");
static_assert(sizeof(AB_Grunt_OnZeroGCollision_C_ExecuteUbergraph_AB_Grunt_OnZeroGCollision) == 0x0000E8, "Wrong size on AB_Grunt_OnZeroGCollision_C_ExecuteUbergraph_AB_Grunt_OnZeroGCollision");
static_assert(offsetof(AB_Grunt_OnZeroGCollision_C_ExecuteUbergraph_AB_Grunt_OnZeroGCollision, EntryPoint) == 0x000000, "Member 'AB_Grunt_OnZeroGCollision_C_ExecuteUbergraph_AB_Grunt_OnZeroGCollision::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Grunt_OnZeroGCollision_C_ExecuteUbergraph_AB_Grunt_OnZeroGCollision, K2Node_Event_EventData) == 0x000008, "Member 'AB_Grunt_OnZeroGCollision_C_ExecuteUbergraph_AB_Grunt_OnZeroGCollision::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(AB_Grunt_OnZeroGCollision_C_ExecuteUbergraph_AB_Grunt_OnZeroGCollision, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x0000C0, "Member 'AB_Grunt_OnZeroGCollision_C_ExecuteUbergraph_AB_Grunt_OnZeroGCollision::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_OnZeroGCollision_C_ExecuteUbergraph_AB_Grunt_OnZeroGCollision, CallFunc_ValidateAsServerNPC_valid_npc) == 0x0000C8, "Member 'AB_Grunt_OnZeroGCollision_C_ExecuteUbergraph_AB_Grunt_OnZeroGCollision::CallFunc_ValidateAsServerNPC_valid_npc' has a wrong offset!");
static_assert(offsetof(AB_Grunt_OnZeroGCollision_C_ExecuteUbergraph_AB_Grunt_OnZeroGCollision, CallFunc_ValidateAsServerNPC_valid_ai_controller) == 0x0000D0, "Member 'AB_Grunt_OnZeroGCollision_C_ExecuteUbergraph_AB_Grunt_OnZeroGCollision::CallFunc_ValidateAsServerNPC_valid_ai_controller' has a wrong offset!");
static_assert(offsetof(AB_Grunt_OnZeroGCollision_C_ExecuteUbergraph_AB_Grunt_OnZeroGCollision, CallFunc_ValidateAsServerNPC_ReturnValue) == 0x0000D8, "Member 'AB_Grunt_OnZeroGCollision_C_ExecuteUbergraph_AB_Grunt_OnZeroGCollision::CallFunc_ValidateAsServerNPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_OnZeroGCollision_C_ExecuteUbergraph_AB_Grunt_OnZeroGCollision, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0000DC, "Member 'AB_Grunt_OnZeroGCollision_C_ExecuteUbergraph_AB_Grunt_OnZeroGCollision::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

// Function AB_Grunt_OnZeroGCollision.AB_Grunt_OnZeroGCollision_C.K2_ActivateAbilityFromEvent
// 0x00B8 (0x00B8 - 0x0000)
struct AB_Grunt_OnZeroGCollision_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_Grunt_OnZeroGCollision_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on AB_Grunt_OnZeroGCollision_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(AB_Grunt_OnZeroGCollision_C_K2_ActivateAbilityFromEvent) == 0x0000B8, "Wrong size on AB_Grunt_OnZeroGCollision_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(AB_Grunt_OnZeroGCollision_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'AB_Grunt_OnZeroGCollision_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

