#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_GruntShotgun_Melee

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AB_GruntShotgun_Melee.AB_GruntShotgun_Melee_C.ExecuteUbergraph_AB_GruntShotgun_Melee
// 0x02F8 (0x02F8 - 0x0000)
struct AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTweakParameterValue_ReturnValue;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0030(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0044(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0058(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0070(0x00B8)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0128(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x0140(0x00B8)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_202[0x6];                                      // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0208(0x00B8)(ConstParm)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_Array_Random_OutItem;                     // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee) == 0x000008, "Wrong alignment on AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee");
static_assert(sizeof(AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee) == 0x0002F8, "Wrong size on AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee");
static_assert(offsetof(AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee, EntryPoint) == 0x000000, "Member 'AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee, CallFunc_GetTweakParameterValue_ReturnValue) == 0x000004, "Member 'AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee::CallFunc_GetTweakParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee, K2Node_CreateDelegate_OutputDelegate_2) == 0x000030, "Member 'AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee, K2Node_CreateDelegate_OutputDelegate_3) == 0x000044, "Member 'AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee, K2Node_CreateDelegate_OutputDelegate_4) == 0x000058, "Member 'AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee, K2Node_CustomEvent_Payload) == 0x000070, "Member 'AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee, K2Node_CreateDelegate_OutputDelegate_5) == 0x000128, "Member 'AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee, Temp_struct_Variable) == 0x000140, "Member 'AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee, CallFunc_WaitGameplayEvent_ReturnValue) == 0x0001F8, "Member 'AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee, CallFunc_IsValid_ReturnValue) == 0x000200, "Member 'AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee, K2Node_Event_bWasCancelled) == 0x000201, "Member 'AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee, K2Node_Event_EventData) == 0x000208, "Member 'AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x0002C0, "Member 'AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee, CallFunc_K2_CommitAbility_ReturnValue) == 0x0002C8, "Member 'AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee, CallFunc_Array_Random_OutItem) == 0x0002D0, "Member 'AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee, CallFunc_Array_Random_OutIndex) == 0x0002D8, "Member 'AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee, CallFunc_GetPlayLength_ReturnValue) == 0x0002DC, "Member 'AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee::CallFunc_GetPlayLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0002E0, "Member 'AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x0002E8, "Member 'AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee, CallFunc_IsValid_ReturnValue_1) == 0x0002F0, "Member 'AB_GruntShotgun_Melee_C_ExecuteUbergraph_AB_GruntShotgun_Melee::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function AB_GruntShotgun_Melee.AB_GruntShotgun_Melee_C.K2_ActivateAbilityFromEvent
// 0x00B8 (0x00B8 - 0x0000)
struct AB_GruntShotgun_Melee_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_GruntShotgun_Melee_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on AB_GruntShotgun_Melee_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(AB_GruntShotgun_Melee_C_K2_ActivateAbilityFromEvent) == 0x0000B8, "Wrong size on AB_GruntShotgun_Melee_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(AB_GruntShotgun_Melee_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'AB_GruntShotgun_Melee_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function AB_GruntShotgun_Melee.AB_GruntShotgun_Melee_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct AB_GruntShotgun_Melee_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_GruntShotgun_Melee_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on AB_GruntShotgun_Melee_C_K2_OnEndAbility");
static_assert(sizeof(AB_GruntShotgun_Melee_C_K2_OnEndAbility) == 0x000001, "Wrong size on AB_GruntShotgun_Melee_C_K2_OnEndAbility");
static_assert(offsetof(AB_GruntShotgun_Melee_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'AB_GruntShotgun_Melee_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function AB_GruntShotgun_Melee.AB_GruntShotgun_Melee_C.EventReceived_65CDBE89424BD46CFE5F92BDEF38CCDD
// 0x00B8 (0x00B8 - 0x0000)
struct AB_GruntShotgun_Melee_C_EventReceived_65CDBE89424BD46CFE5F92BDEF38CCDD final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AB_GruntShotgun_Melee_C_EventReceived_65CDBE89424BD46CFE5F92BDEF38CCDD) == 0x000008, "Wrong alignment on AB_GruntShotgun_Melee_C_EventReceived_65CDBE89424BD46CFE5F92BDEF38CCDD");
static_assert(sizeof(AB_GruntShotgun_Melee_C_EventReceived_65CDBE89424BD46CFE5F92BDEF38CCDD) == 0x0000B8, "Wrong size on AB_GruntShotgun_Melee_C_EventReceived_65CDBE89424BD46CFE5F92BDEF38CCDD");
static_assert(offsetof(AB_GruntShotgun_Melee_C_EventReceived_65CDBE89424BD46CFE5F92BDEF38CCDD, Payload) == 0x000000, "Member 'AB_GruntShotgun_Melee_C_EventReceived_65CDBE89424BD46CFE5F92BDEF38CCDD::Payload' has a wrong offset!");

}

