#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Grunt_EnterMagboots

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AB_Grunt_EnterMagboots.AB_Grunt_EnterMagboots_C.ExecuteUbergraph_AB_Grunt_EnterMagboots
// 0x0110 (0x0110 - 0x0000)
struct AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ActionNumber_1;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 ActionNumber)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0014)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_ActionNumber;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 ActionNumber)>           K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0014)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_Repeat*                    CallFunc_RepeatAction_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0050(0x00B8)(ConstParm)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x0108(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots) == 0x000008, "Wrong alignment on AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots");
static_assert(sizeof(AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots) == 0x000110, "Wrong size on AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots");
static_assert(offsetof(AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots, EntryPoint) == 0x000000, "Member 'AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000004, "Member 'AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots, K2Node_CustomEvent_ActionNumber_1) == 0x00000C, "Member 'AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots::K2Node_CustomEvent_ActionNumber_1' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots, K2Node_CustomEvent_ActionNumber) == 0x000024, "Member 'AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots::K2Node_CustomEvent_ActionNumber' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots, Temp_int_Variable) == 0x00003C, "Member 'AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots, CallFunc_RepeatAction_ReturnValue) == 0x000040, "Member 'AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots::CallFunc_RepeatAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots, K2Node_Event_EventData) == 0x000050, "Member 'AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x000108, "Member 'AB_Grunt_EnterMagboots_C_ExecuteUbergraph_AB_Grunt_EnterMagboots::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");

// Function AB_Grunt_EnterMagboots.AB_Grunt_EnterMagboots_C.K2_ActivateAbilityFromEvent
// 0x00B8 (0x00B8 - 0x0000)
struct AB_Grunt_EnterMagboots_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_Grunt_EnterMagboots_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on AB_Grunt_EnterMagboots_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(AB_Grunt_EnterMagboots_C_K2_ActivateAbilityFromEvent) == 0x0000B8, "Wrong size on AB_Grunt_EnterMagboots_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(AB_Grunt_EnterMagboots_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'AB_Grunt_EnterMagboots_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function AB_Grunt_EnterMagboots.AB_Grunt_EnterMagboots_C.OnPerformAction_6BCDFA76408D7D0A45647487370C1749
// 0x0004 (0x0004 - 0x0000)
struct AB_Grunt_EnterMagboots_C_OnPerformAction_6BCDFA76408D7D0A45647487370C1749 final
{
public:
	int32                                         ActionNumber;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Grunt_EnterMagboots_C_OnPerformAction_6BCDFA76408D7D0A45647487370C1749) == 0x000004, "Wrong alignment on AB_Grunt_EnterMagboots_C_OnPerformAction_6BCDFA76408D7D0A45647487370C1749");
static_assert(sizeof(AB_Grunt_EnterMagboots_C_OnPerformAction_6BCDFA76408D7D0A45647487370C1749) == 0x000004, "Wrong size on AB_Grunt_EnterMagboots_C_OnPerformAction_6BCDFA76408D7D0A45647487370C1749");
static_assert(offsetof(AB_Grunt_EnterMagboots_C_OnPerformAction_6BCDFA76408D7D0A45647487370C1749, ActionNumber) == 0x000000, "Member 'AB_Grunt_EnterMagboots_C_OnPerformAction_6BCDFA76408D7D0A45647487370C1749::ActionNumber' has a wrong offset!");

// Function AB_Grunt_EnterMagboots.AB_Grunt_EnterMagboots_C.OnFinished_6BCDFA76408D7D0A45647487370C1749
// 0x0004 (0x0004 - 0x0000)
struct AB_Grunt_EnterMagboots_C_OnFinished_6BCDFA76408D7D0A45647487370C1749 final
{
public:
	int32                                         ActionNumber;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Grunt_EnterMagboots_C_OnFinished_6BCDFA76408D7D0A45647487370C1749) == 0x000004, "Wrong alignment on AB_Grunt_EnterMagboots_C_OnFinished_6BCDFA76408D7D0A45647487370C1749");
static_assert(sizeof(AB_Grunt_EnterMagboots_C_OnFinished_6BCDFA76408D7D0A45647487370C1749) == 0x000004, "Wrong size on AB_Grunt_EnterMagboots_C_OnFinished_6BCDFA76408D7D0A45647487370C1749");
static_assert(offsetof(AB_Grunt_EnterMagboots_C_OnFinished_6BCDFA76408D7D0A45647487370C1749, ActionNumber) == 0x000000, "Member 'AB_Grunt_EnterMagboots_C_OnFinished_6BCDFA76408D7D0A45647487370C1749::ActionNumber' has a wrong offset!");

}

