#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Generic_ChangedTarget

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AB_Generic_ChangedTarget.AB_Generic_ChangedTarget_C.ExecuteUbergraph_AB_Generic_ChangedTarget
// 0x0168 (0x0168 - 0x0000)
struct AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0018(0x00B8)(ConstParm)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00D8(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_NPC*                       K2Node_DynamicCast_AsCACharacter_NPC;              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            CallFunc_GetTargetingEffect_ReturnValue;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ACAAIController*                        CallFunc_GetCAAIController_ReturnValue;            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetItemDefaultObjectFromItemClass_ReturnValue; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UCAComponent_NPCTargetManager*    CallFunc_GetNPCTargetManager_ReturnValue;          // 0x0120(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetCurrentTarget_ReturnValue;             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetPreviousTarget_ReturnValue;            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0148(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue;  // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget) == 0x000008, "Wrong alignment on AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget");
static_assert(sizeof(AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget) == 0x000168, "Wrong size on AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget");
static_assert(offsetof(AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget, EntryPoint) == 0x000000, "Member 'AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget, CallFunc_WaitDelay_ReturnValue) == 0x000008, "Member 'AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget, K2Node_Event_EventData) == 0x000018, "Member 'AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x0000D0, "Member 'AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget, K2Node_CreateDelegate_OutputDelegate) == 0x0000D8, "Member 'AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget, K2Node_DynamicCast_AsCACharacter_NPC) == 0x0000F0, "Member 'AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget::K2Node_DynamicCast_AsCACharacter_NPC' has a wrong offset!");
static_assert(offsetof(AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000100, "Member 'AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget, CallFunc_GetTargetingEffect_ReturnValue) == 0x000108, "Member 'AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget::CallFunc_GetTargetingEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget, CallFunc_GetCAAIController_ReturnValue) == 0x000110, "Member 'AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget::CallFunc_GetCAAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget, CallFunc_GetItemDefaultObjectFromItemClass_ReturnValue) == 0x000118, "Member 'AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget::CallFunc_GetItemDefaultObjectFromItemClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget, CallFunc_GetNPCTargetManager_ReturnValue) == 0x000120, "Member 'AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget::CallFunc_GetNPCTargetManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget, CallFunc_IsValid_ReturnValue_1) == 0x000128, "Member 'AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget, CallFunc_GetCurrentTarget_ReturnValue) == 0x000130, "Member 'AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget::CallFunc_GetCurrentTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000138, "Member 'AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget, CallFunc_GetPreviousTarget_ReturnValue) == 0x000140, "Member 'AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget::CallFunc_GetPreviousTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000148, "Member 'AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget, CallFunc_IsValid_ReturnValue_2) == 0x000150, "Member 'AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget, CallFunc_GetAbilitySystemComponent_ReturnValue_2) == 0x000158, "Member 'AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget::CallFunc_GetAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget, CallFunc_RemoveActiveEffectsWithTags_ReturnValue) == 0x000160, "Member 'AB_Generic_ChangedTarget_C_ExecuteUbergraph_AB_Generic_ChangedTarget::CallFunc_RemoveActiveEffectsWithTags_ReturnValue' has a wrong offset!");

// Function AB_Generic_ChangedTarget.AB_Generic_ChangedTarget_C.K2_ActivateAbilityFromEvent
// 0x00B8 (0x00B8 - 0x0000)
struct AB_Generic_ChangedTarget_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_Generic_ChangedTarget_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on AB_Generic_ChangedTarget_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(AB_Generic_ChangedTarget_C_K2_ActivateAbilityFromEvent) == 0x0000B8, "Wrong size on AB_Generic_ChangedTarget_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(AB_Generic_ChangedTarget_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'AB_Generic_ChangedTarget_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

