#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_HeavyHitReaction_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CAGameDatabase_structs.hpp"
#include "Keaton_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AB_HeavyHitReaction_Base.AB_HeavyHitReaction_Base_C
// 0x00F0 (0x0580 - 0x0490)
class UAB_HeavyHitReaction_Base_C : public UCAGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FCADataTableRowHandle                  TweakEntry_TimeFront;                              // 0x0498(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FCADataTableRowHandle                  TweakEntry_TimeBack;                               // 0x04B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FCADataTableRowHandle                  TweakEntry_TimeLeft;                               // 0x04C8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FCADataTableRowHandle                  TweakEntry_TimeRight;                              // 0x04E0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TArray<class UAnimMontage*>                   HeadHitAnims;                                      // 0x04F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   ChestHitAnims;                                     // 0x0508(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   GutHitAnims;                                       // 0x0518(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   LegHitAnims;                                       // 0x0528(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimMontage*                           Current_Montage;                                   // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                   HeadHitAnims_ZG;                                   // 0x0540(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   ChestHitAnims_ZG;                                  // 0x0550(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   GutHitAnims_ZG;                                    // 0x0560(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   LegHitAnims_ZG;                                    // 0x0570(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_AB_HeavyHitReaction_Base(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void OnFinish_AB3320B2422D350554E578913247DAA5();
	void OnCompleted_A621B6EA4D1C80B85EAC1EA584A56916();
	void OnBlendOut_A621B6EA4D1C80B85EAC1EA584A56916();
	void OnInterrupted_A621B6EA4D1C80B85EAC1EA584A56916();
	void OnCancelled_A621B6EA4D1C80B85EAC1EA584A56916();
	void OnSkipped_A621B6EA4D1C80B85EAC1EA584A56916();
	int32 GetDirectionIndex(const struct FGameplayEventData& GameplayEventData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_HeavyHitReaction_Base_C">();
	}
	static class UAB_HeavyHitReaction_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_HeavyHitReaction_Base_C>();
	}
};
static_assert(alignof(UAB_HeavyHitReaction_Base_C) == 0x000008, "Wrong alignment on UAB_HeavyHitReaction_Base_C");
static_assert(sizeof(UAB_HeavyHitReaction_Base_C) == 0x000580, "Wrong size on UAB_HeavyHitReaction_Base_C");
static_assert(offsetof(UAB_HeavyHitReaction_Base_C, UberGraphFrame) == 0x000490, "Member 'UAB_HeavyHitReaction_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_HeavyHitReaction_Base_C, TweakEntry_TimeFront) == 0x000498, "Member 'UAB_HeavyHitReaction_Base_C::TweakEntry_TimeFront' has a wrong offset!");
static_assert(offsetof(UAB_HeavyHitReaction_Base_C, TweakEntry_TimeBack) == 0x0004B0, "Member 'UAB_HeavyHitReaction_Base_C::TweakEntry_TimeBack' has a wrong offset!");
static_assert(offsetof(UAB_HeavyHitReaction_Base_C, TweakEntry_TimeLeft) == 0x0004C8, "Member 'UAB_HeavyHitReaction_Base_C::TweakEntry_TimeLeft' has a wrong offset!");
static_assert(offsetof(UAB_HeavyHitReaction_Base_C, TweakEntry_TimeRight) == 0x0004E0, "Member 'UAB_HeavyHitReaction_Base_C::TweakEntry_TimeRight' has a wrong offset!");
static_assert(offsetof(UAB_HeavyHitReaction_Base_C, HeadHitAnims) == 0x0004F8, "Member 'UAB_HeavyHitReaction_Base_C::HeadHitAnims' has a wrong offset!");
static_assert(offsetof(UAB_HeavyHitReaction_Base_C, ChestHitAnims) == 0x000508, "Member 'UAB_HeavyHitReaction_Base_C::ChestHitAnims' has a wrong offset!");
static_assert(offsetof(UAB_HeavyHitReaction_Base_C, GutHitAnims) == 0x000518, "Member 'UAB_HeavyHitReaction_Base_C::GutHitAnims' has a wrong offset!");
static_assert(offsetof(UAB_HeavyHitReaction_Base_C, LegHitAnims) == 0x000528, "Member 'UAB_HeavyHitReaction_Base_C::LegHitAnims' has a wrong offset!");
static_assert(offsetof(UAB_HeavyHitReaction_Base_C, Current_Montage) == 0x000538, "Member 'UAB_HeavyHitReaction_Base_C::Current_Montage' has a wrong offset!");
static_assert(offsetof(UAB_HeavyHitReaction_Base_C, HeadHitAnims_ZG) == 0x000540, "Member 'UAB_HeavyHitReaction_Base_C::HeadHitAnims_ZG' has a wrong offset!");
static_assert(offsetof(UAB_HeavyHitReaction_Base_C, ChestHitAnims_ZG) == 0x000550, "Member 'UAB_HeavyHitReaction_Base_C::ChestHitAnims_ZG' has a wrong offset!");
static_assert(offsetof(UAB_HeavyHitReaction_Base_C, GutHitAnims_ZG) == 0x000560, "Member 'UAB_HeavyHitReaction_Base_C::GutHitAnims_ZG' has a wrong offset!");
static_assert(offsetof(UAB_HeavyHitReaction_Base_C, LegHitAnims_ZG) == 0x000570, "Member 'UAB_HeavyHitReaction_Base_C::LegHitAnims_ZG' has a wrong offset!");

}

