#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_HeavyHitReaction_Base

#include "Basic.hpp"

#include "CAGameDatabase_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Keaton_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AB_HeavyHitReaction_Base.AB_HeavyHitReaction_Base_C.ExecuteUbergraph_AB_HeavyHitReaction_Base
// 0x0290 (0x0290 - 0x0000)
struct AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0030(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0044(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0058(0x0014)(ZeroConstructor, NoDestructor)
	EBodyPart                                     Temp_byte_Variable;                                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimMontage*>                   Temp_object_Variable;                              // 0x0070(0x0010)(ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBodyPart                                     Temp_byte_Variable_1;                              // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimMontage*>                   Temp_object_Variable_1;                            // 0x0088(0x0010)(ReferenceParm)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0098(0x00B8)(ConstParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0150(0x0014)(ZeroConstructor, NoDestructor)
	struct FHitResult                             CallFunc_EffectContextGetHitResult_ReturnValue;    // 0x0164(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_GetDirectionIndex_ReturnValue;            // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_NPC*                       K2Node_DynamicCast_AsCACharacter_NPC;              // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInAir_ReturnValue;                      // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBodyPart                                     CallFunc_GetHitBodyPart_ReturnValue;               // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_213[0x5];                                      // 0x0213(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCADataTableRowHandle                  K2Node_Select_Default;                             // 0x0218(0x0018)(NoDestructor)
	float                                         CallFunc_GetTweakParameterValue_ReturnValue;       // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                   K2Node_Select_Default_1;                           // 0x0240(0x0010)(ReferenceParm)
	class UAnimMontage*                           CallFunc_Array_Get_Item;                           // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                   K2Node_Select_Default_2;                           // 0x0270(0x0010)(ReferenceParm)
	class UAnimMontage*                           CallFunc_Array_Get_Item_1;                         // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base) == 0x000008, "Wrong alignment on AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base");
static_assert(sizeof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base) == 0x000290, "Wrong size on AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, EntryPoint) == 0x000000, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, K2Node_CreateDelegate_OutputDelegate_2) == 0x000030, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, K2Node_CreateDelegate_OutputDelegate_3) == 0x000044, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, K2Node_CreateDelegate_OutputDelegate_4) == 0x000058, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, Temp_byte_Variable) == 0x00006C, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, Temp_object_Variable) == 0x000070, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, Temp_int_Variable) == 0x000080, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, Temp_byte_Variable_1) == 0x000084, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, Temp_object_Variable_1) == 0x000088, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, K2Node_Event_EventData) == 0x000098, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, K2Node_CreateDelegate_OutputDelegate_5) == 0x000150, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, CallFunc_EffectContextGetHitResult_ReturnValue) == 0x000164, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::CallFunc_EffectContextGetHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, CallFunc_GetDirectionIndex_ReturnValue) == 0x0001F4, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::CallFunc_GetDirectionIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, K2Node_Event_bWasCancelled) == 0x0001F8, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000200, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, K2Node_DynamicCast_AsCACharacter_NPC) == 0x000208, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::K2Node_DynamicCast_AsCACharacter_NPC' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, K2Node_DynamicCast_bSuccess) == 0x000210, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, CallFunc_IsInAir_ReturnValue) == 0x000211, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::CallFunc_IsInAir_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, CallFunc_GetHitBodyPart_ReturnValue) == 0x000212, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::CallFunc_GetHitBodyPart_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, K2Node_Select_Default) == 0x000218, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, CallFunc_GetTweakParameterValue_ReturnValue) == 0x000230, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::CallFunc_GetTweakParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, CallFunc_WaitDelay_ReturnValue) == 0x000238, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, K2Node_Select_Default_1) == 0x000240, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, CallFunc_Array_Get_Item) == 0x000250, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, CallFunc_IsValid_ReturnValue_1) == 0x000258, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, CallFunc_GetPlayLength_ReturnValue) == 0x00025C, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::CallFunc_GetPlayLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000260, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000268, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, K2Node_Select_Default_2) == 0x000270, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, CallFunc_Array_Get_Item_1) == 0x000280, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base, CallFunc_IsValid_ReturnValue_2) == 0x000288, "Member 'AB_HeavyHitReaction_Base_C_ExecuteUbergraph_AB_HeavyHitReaction_Base::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function AB_HeavyHitReaction_Base.AB_HeavyHitReaction_Base_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct AB_HeavyHitReaction_Base_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_HeavyHitReaction_Base_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on AB_HeavyHitReaction_Base_C_K2_OnEndAbility");
static_assert(sizeof(AB_HeavyHitReaction_Base_C_K2_OnEndAbility) == 0x000001, "Wrong size on AB_HeavyHitReaction_Base_C_K2_OnEndAbility");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'AB_HeavyHitReaction_Base_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function AB_HeavyHitReaction_Base.AB_HeavyHitReaction_Base_C.K2_ActivateAbilityFromEvent
// 0x00B8 (0x00B8 - 0x0000)
struct AB_HeavyHitReaction_Base_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_HeavyHitReaction_Base_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on AB_HeavyHitReaction_Base_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(AB_HeavyHitReaction_Base_C_K2_ActivateAbilityFromEvent) == 0x0000B8, "Wrong size on AB_HeavyHitReaction_Base_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'AB_HeavyHitReaction_Base_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function AB_HeavyHitReaction_Base.AB_HeavyHitReaction_Base_C.GetDirectionIndex
// 0x0208 (0x0208 - 0x0000)
struct AB_HeavyHitReaction_Base_C_GetDirectionIndex final
{
public:
	struct FGameplayEventData                     GameplayEventData;                                 // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         ReturnValue;                                       // 0x00B8(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_EffectContextGetHitResult_ReturnValue;    // 0x00D4(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_166[0x2];                                      // 0x0166(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_LessLess_VectorRotator_ReturnValue;       // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Get4DirectionIndex_ReturnValue;           // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_HeavyHitReaction_Base_C_GetDirectionIndex) == 0x000008, "Wrong alignment on AB_HeavyHitReaction_Base_C_GetDirectionIndex");
static_assert(sizeof(AB_HeavyHitReaction_Base_C_GetDirectionIndex) == 0x000208, "Wrong size on AB_HeavyHitReaction_Base_C_GetDirectionIndex");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_GetDirectionIndex, GameplayEventData) == 0x000000, "Member 'AB_HeavyHitReaction_Base_C_GetDirectionIndex::GameplayEventData' has a wrong offset!");
static_assert(offsetof(AB_HeavyHitReaction_Base_C_GetDirectionIndex, ReturnValue) == 0x0000B8, "Member 'AB_HeavyHitReaction_Base_C_GetDirectionIndex::ReturnValue' has a wrong offset!");
