#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Interrupt_Specialist_Ability

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function AB_Interrupt_Specialist_Ability.AB_Interrupt_Specialist_Ability_C.ExecuteUbergraph_AB_Interrupt_Specialist_Ability
// 0x0004 (0x0004 - 0x0000)
struct AB_Interrupt_Specialist_Ability_C_ExecuteUbergraph_AB_Interrupt_Specialist_Ability final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Interrupt_Specialist_Ability_C_ExecuteUbergraph_AB_Interrupt_Specialist_Ability) == 0x000004, "Wrong alignment on AB_Interrupt_Specialist_Ability_C_ExecuteUbergraph_AB_Interrupt_Specialist_Ability");
static_assert(sizeof(AB_Interrupt_Specialist_Ability_C_ExecuteUbergraph_AB_Interrupt_Specialist_Ability) == 0x000004, "Wrong size on AB_Interrupt_Specialist_Ability_C_ExecuteUbergraph_AB_Interrupt_Specialist_Ability");
static_assert(offsetof(AB_Interrupt_Specialist_Ability_C_ExecuteUbergraph_AB_Interrupt_Specialist_Ability, EntryPoint) == 0x000000, "Member 'AB_Interrupt_Specialist_Ability_C_ExecuteUbergraph_AB_Interrupt_Specialist_Ability::EntryPoint' has a wrong offset!");

// Function AB_Interrupt_Specialist_Ability.AB_Interrupt_Specialist_Ability_C.Unequip Specialist Weapon
// 0x0048 (0x0048 - 0x0000)
struct AB_Interrupt_Specialist_Ability_C_Unequip_Specialist_Weapon final
{
public:
	struct FGameplayTagContainer                  Weapon_Unequip_Tags;                               // 0x0000(0x0020)(Edit, BlueprintVisible)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryActivateAbilitiesByTag_ReturnValue;    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAEquipmentBase*                       CallFunc_GetCurrentlyHeldDevice_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasGameplayTag_ReturnValue;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Interrupt_Specialist_Ability_C_Unequip_Specialist_Weapon) == 0x000008, "Wrong alignment on AB_Interrupt_Specialist_Ability_C_Unequip_Specialist_Weapon");
static_assert(sizeof(AB_Interrupt_Specialist_Ability_C_Unequip_Specialist_Weapon) == 0x000048, "Wrong size on AB_Interrupt_Specialist_Ability_C_Unequip_Specialist_Weapon");
static_assert(offsetof(AB_Interrupt_Specialist_Ability_C_Unequip_Specialist_Weapon, Weapon_Unequip_Tags) == 0x000000, "Member 'AB_Interrupt_Specialist_Ability_C_Unequip_Specialist_Weapon::Weapon_Unequip_Tags' has a wrong offset!");
static_assert(offsetof(AB_Interrupt_Specialist_Ability_C_Unequip_Specialist_Weapon, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000020, "Member 'AB_Interrupt_Specialist_Ability_C_Unequip_Specialist_Weapon::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Interrupt_Specialist_Ability_C_Unequip_Specialist_Weapon, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x000028, "Member 'AB_Interrupt_Specialist_Ability_C_Unequip_Specialist_Weapon::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(AB_Interrupt_Specialist_Ability_C_Unequip_Specialist_Weapon, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AB_Interrupt_Specialist_Ability_C_Unequip_Specialist_Weapon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_Interrupt_Specialist_Ability_C_Unequip_Specialist_Weapon, CallFunc_TryActivateAbilitiesByTag_ReturnValue) == 0x000031, "Member 'AB_Interrupt_Specialist_Ability_C_Unequip_Specialist_Weapon::CallFunc_TryActivateAbilitiesByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Interrupt_Specialist_Ability_C_Unequip_Specialist_Weapon, CallFunc_GetCurrentlyHeldDevice_ReturnValue) == 0x000038, "Member 'AB_Interrupt_Specialist_Ability_C_Unequip_Specialist_Weapon::CallFunc_GetCurrentlyHeldDevice_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Interrupt_Specialist_Ability_C_Unequip_Specialist_Weapon, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'AB_Interrupt_Specialist_Ability_C_Unequip_Specialist_Weapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Interrupt_Specialist_Ability_C_Unequip_Specialist_Weapon, CallFunc_HasGameplayTag_ReturnValue) == 0x000041, "Member 'AB_Interrupt_Specialist_Ability_C_Unequip_Specialist_Weapon::CallFunc_HasGameplayTag_ReturnValue' has a wrong offset!");

}

