#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_MatchStart_ShortIntroSequence

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AB_MatchStart_ShortIntroSequence.AB_MatchStart_ShortIntroSequence_C.ExecuteUbergraph_AB_MatchStart_ShortIntroSequence
// 0x0308 (0x0308 - 0x0000)
struct AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0008(0x00B8)()
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00C0(0x00B8)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0184(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0198(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x01AC(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x01C0(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x01D4(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsFeatureActive_ReturnValue;              // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFeatureActive_ReturnValue_1;            // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA[0x2];                                      // 0x01EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             Temp_delegate_Variable;                            // 0x01EC(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	class UAnimMontage*                           CallFunc_GetMontageForCharacter_ReturnValue;       // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0208(0x00B8)(ConstParm)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x02CC(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x02D8(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence) == 0x000008, "Wrong alignment on AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence");
static_assert(sizeof(AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence) == 0x000308, "Wrong size on AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence");
static_assert(offsetof(AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence, EntryPoint) == 0x000000, "Member 'AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence, K2Node_CustomEvent_Payload) == 0x000008, "Member 'AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence, Temp_struct_Variable) == 0x0000C0, "Member 'AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000178, "Member 'AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence, CallFunc_IsValid_ReturnValue) == 0x000180, "Member 'AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence, K2Node_CreateDelegate_OutputDelegate) == 0x000184, "Member 'AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence, K2Node_CreateDelegate_OutputDelegate_1) == 0x000198, "Member 'AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001AC, "Member 'AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001C0, "Member 'AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001D4, "Member 'AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence, CallFunc_IsFeatureActive_ReturnValue) == 0x0001E8, "Member 'AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence::CallFunc_IsFeatureActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence, CallFunc_IsFeatureActive_ReturnValue_1) == 0x0001E9, "Member 'AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence::CallFunc_IsFeatureActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence, Temp_delegate_Variable) == 0x0001EC, "Member 'AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence, CallFunc_GetMontageForCharacter_ReturnValue) == 0x000200, "Member 'AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence::CallFunc_GetMontageForCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence, K2Node_Event_EventData) == 0x000208, "Member 'AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x0002C0, "Member 'AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence, CallFunc_IsValid_ReturnValue_1) == 0x0002C8, "Member 'AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0002CC, "Member 'AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence, K2Node_Event_bWasCancelled) == 0x0002D4, "Member 'AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence, K2Node_CreateDelegate_OutputDelegate_5) == 0x0002D8, "Member 'AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0002F0, "Member 'AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x0002F8, "Member 'AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence, K2Node_DynamicCast_bSuccess) == 0x000300, "Member 'AB_MatchStart_ShortIntroSequence_C_ExecuteUbergraph_AB_MatchStart_ShortIntroSequence::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AB_MatchStart_ShortIntroSequence.AB_MatchStart_ShortIntroSequence_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct AB_MatchStart_ShortIntroSequence_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_MatchStart_ShortIntroSequence_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on AB_MatchStart_ShortIntroSequence_C_K2_OnEndAbility");
static_assert(sizeof(AB_MatchStart_ShortIntroSequence_C_K2_OnEndAbility) == 0x000001, "Wrong size on AB_MatchStart_ShortIntroSequence_C_K2_OnEndAbility");
static_assert(offsetof(AB_MatchStart_ShortIntroSequence_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'AB_MatchStart_ShortIntroSequence_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function AB_MatchStart_ShortIntroSequence.AB_MatchStart_ShortIntroSequence_C.K2_ActivateAbilityFromEvent
// 0x00B8 (0x00B8 - 0x0000)
struct AB_MatchStart_ShortIntroSequence_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_MatchStart_ShortIntroSequence_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on AB_MatchStart_ShortIntroSequence_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(AB_MatchStart_ShortIntroSequence_C_K2_ActivateAbilityFromEvent) == 0x0000B8, "Wrong size on AB_MatchStart_ShortIntroSequence_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(AB_MatchStart_ShortIntroSequence_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'AB_MatchStart_ShortIntroSequence_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function AB_MatchStart_ShortIntroSequence.AB_MatchStart_ShortIntroSequence_C.EventReceived_11CB93564A03027A49DE4DB9D6E8194B
// 0x00B8 (0x00B8 - 0x0000)
struct AB_MatchStart_ShortIntroSequence_C_EventReceived_11CB93564A03027A49DE4DB9D6E8194B final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AB_MatchStart_ShortIntroSequence_C_EventReceived_11CB93564A03027A49DE4DB9D6E8194B) == 0x000008, "Wrong alignment on AB_MatchStart_ShortIntroSequence_C_EventReceived_11CB93564A03027A49DE4DB9D6E8194B");
static_assert(sizeof(AB_MatchStart_ShortIntroSequence_C_EventReceived_11CB93564A03027A49DE4DB9D6E8194B) == 0x0000B8, "Wrong size on AB_MatchStart_ShortIntroSequence_C_EventReceived_11CB93564A03027A49DE4DB9D6E8194B");
static_assert(offsetof(AB_MatchStart_ShortIntroSequence_C_EventReceived_11CB93564A03027A49DE4DB9D6E8194B, Payload) == 0x000000, "Member 'AB_MatchStart_ShortIntroSequence_C_EventReceived_11CB93564A03027A49DE4DB9D6E8194B::Payload' has a wrong offset!");

}

