#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_NPC_Drone_Foamed_Nodestruction

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AB_NPC_Drone_Foamed_Nodestruction.AB_NPC_Drone_Foamed_Nodestruction_C.ExecuteUbergraph_AB_NPC_Drone_Foamed_Nodestruction
// 0x00F8 (0x00F8 - 0x0000)
struct AB_NPC_Drone_Foamed_Nodestruction_C_ExecuteUbergraph_AB_NPC_Drone_Foamed_Nodestruction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0018(0x00B8)(ConstParm)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x00D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_NPC*                       K2Node_DynamicCast_AsCACharacter_NPC;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_NPC_Drone_Foamed_Nodestruction_C_ExecuteUbergraph_AB_NPC_Drone_Foamed_Nodestruction) == 0x000008, "Wrong alignment on AB_NPC_Drone_Foamed_Nodestruction_C_ExecuteUbergraph_AB_NPC_Drone_Foamed_Nodestruction");
static_assert(sizeof(AB_NPC_Drone_Foamed_Nodestruction_C_ExecuteUbergraph_AB_NPC_Drone_Foamed_Nodestruction) == 0x0000F8, "Wrong size on AB_NPC_Drone_Foamed_Nodestruction_C_ExecuteUbergraph_AB_NPC_Drone_Foamed_Nodestruction");
static_assert(offsetof(AB_NPC_Drone_Foamed_Nodestruction_C_ExecuteUbergraph_AB_NPC_Drone_Foamed_Nodestruction, EntryPoint) == 0x000000, "Member 'AB_NPC_Drone_Foamed_Nodestruction_C_ExecuteUbergraph_AB_NPC_Drone_Foamed_Nodestruction::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_NPC_Drone_Foamed_Nodestruction_C_ExecuteUbergraph_AB_NPC_Drone_Foamed_Nodestruction, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000008, "Member 'AB_NPC_Drone_Foamed_Nodestruction_C_ExecuteUbergraph_AB_NPC_Drone_Foamed_Nodestruction::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Drone_Foamed_Nodestruction_C_ExecuteUbergraph_AB_NPC_Drone_Foamed_Nodestruction, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000010, "Member 'AB_NPC_Drone_Foamed_Nodestruction_C_ExecuteUbergraph_AB_NPC_Drone_Foamed_Nodestruction::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Drone_Foamed_Nodestruction_C_ExecuteUbergraph_AB_NPC_Drone_Foamed_Nodestruction, K2Node_Event_EventData) == 0x000018, "Member 'AB_NPC_Drone_Foamed_Nodestruction_C_ExecuteUbergraph_AB_NPC_Drone_Foamed_Nodestruction::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(AB_NPC_Drone_Foamed_Nodestruction_C_ExecuteUbergraph_AB_NPC_Drone_Foamed_Nodestruction, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x0000D0, "Member 'AB_NPC_Drone_Foamed_Nodestruction_C_ExecuteUbergraph_AB_NPC_Drone_Foamed_Nodestruction::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Drone_Foamed_Nodestruction_C_ExecuteUbergraph_AB_NPC_Drone_Foamed_Nodestruction, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x0000D8, "Member 'AB_NPC_Drone_Foamed_Nodestruction_C_ExecuteUbergraph_AB_NPC_Drone_Foamed_Nodestruction::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_NPC_Drone_Foamed_Nodestruction_C_ExecuteUbergraph_AB_NPC_Drone_Foamed_Nodestruction, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x0000E0, "Member 'AB_NPC_Drone_Foamed_Nodestruction_C_ExecuteUbergraph_AB_NPC_Drone_Foamed_Nodestruction::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Drone_Foamed_Nodestruction_C_ExecuteUbergraph_AB_NPC_Drone_Foamed_Nodestruction, K2Node_DynamicCast_AsCACharacter_NPC) == 0x0000E8, "Member 'AB_NPC_Drone_Foamed_Nodestruction_C_ExecuteUbergraph_AB_NPC_Drone_Foamed_Nodestruction::K2Node_DynamicCast_AsCACharacter_NPC' has a wrong offset!");
static_assert(offsetof(AB_NPC_Drone_Foamed_Nodestruction_C_ExecuteUbergraph_AB_NPC_Drone_Foamed_Nodestruction, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'AB_NPC_Drone_Foamed_Nodestruction_C_ExecuteUbergraph_AB_NPC_Drone_Foamed_Nodestruction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_NPC_Drone_Foamed_Nodestruction_C_ExecuteUbergraph_AB_NPC_Drone_Foamed_Nodestruction, K2Node_Event_bWasCancelled) == 0x0000F1, "Member 'AB_NPC_Drone_Foamed_Nodestruction_C_ExecuteUbergraph_AB_NPC_Drone_Foamed_Nodestruction::K2Node_Event_bWasCancelled' has a wrong offset!");

// Function AB_NPC_Drone_Foamed_Nodestruction.AB_NPC_Drone_Foamed_Nodestruction_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct AB_NPC_Drone_Foamed_Nodestruction_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_NPC_Drone_Foamed_Nodestruction_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on AB_NPC_Drone_Foamed_Nodestruction_C_K2_OnEndAbility");
static_assert(sizeof(AB_NPC_Drone_Foamed_Nodestruction_C_K2_OnEndAbility) == 0x000001, "Wrong size on AB_NPC_Drone_Foamed_Nodestruction_C_K2_OnEndAbility");
static_assert(offsetof(AB_NPC_Drone_Foamed_Nodestruction_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'AB_NPC_Drone_Foamed_Nodestruction_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function AB_NPC_Drone_Foamed_Nodestruction.AB_NPC_Drone_Foamed_Nodestruction_C.K2_ActivateAbilityFromEvent
// 0x00B8 (0x00B8 - 0x0000)
struct AB_NPC_Drone_Foamed_Nodestruction_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_NPC_Drone_Foamed_Nodestruction_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on AB_NPC_Drone_Foamed_Nodestruction_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(AB_NPC_Drone_Foamed_Nodestruction_C_K2_ActivateAbilityFromEvent) == 0x0000B8, "Wrong size on AB_NPC_Drone_Foamed_Nodestruction_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(AB_NPC_Drone_Foamed_Nodestruction_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'AB_NPC_Drone_Foamed_Nodestruction_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

