#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_NPC_Pushed

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AB_NPC_Pushed.AB_NPC_Pushed_C.ExecuteUbergraph_AB_NPC_Pushed
// 0x0100 (0x0100 - 0x0000)
struct AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZeroGravity_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0020(0x00B8)(ConstParm)
	class ACACharacter*                           K2Node_DynamicCast_AsCACharacter;                  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Calculate_Force_Vector_PushVector;        // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Calculate_Force_Vector_Valid;             // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesTag_ReturnValue_1;                 // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesTag_ReturnValue_2;                 // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFlying_ReturnValue;                     // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x00F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00F7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_CAApplyTimedImpulse_ReturnValue;          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed) == 0x000008, "Wrong alignment on AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed");
static_assert(sizeof(AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed) == 0x000100, "Wrong size on AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed");
static_assert(offsetof(AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed, EntryPoint) == 0x000000, "Member 'AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed, CallFunc_K2_CommitAbility_ReturnValue) == 0x000004, "Member 'AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed, CallFunc_IsInZeroGravity_ReturnValue) == 0x000014, "Member 'AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed::CallFunc_IsInZeroGravity_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000018, "Member 'AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed, K2Node_Event_EventData) == 0x000020, "Member 'AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed, K2Node_DynamicCast_AsCACharacter) == 0x0000D8, "Member 'AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed::K2Node_DynamicCast_AsCACharacter' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed, CallFunc_Calculate_Force_Vector_PushVector) == 0x0000E4, "Member 'AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed::CallFunc_Calculate_Force_Vector_PushVector' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed, CallFunc_Calculate_Force_Vector_Valid) == 0x0000F0, "Member 'AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed::CallFunc_Calculate_Force_Vector_Valid' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed, CallFunc_MatchesTag_ReturnValue) == 0x0000F1, "Member 'AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed, CallFunc_MatchesTag_ReturnValue_1) == 0x0000F2, "Member 'AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed::CallFunc_MatchesTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed, CallFunc_MatchesTag_ReturnValue_2) == 0x0000F3, "Member 'AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed::CallFunc_MatchesTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed, CallFunc_BooleanOR_ReturnValue) == 0x0000F4, "Member 'AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed, CallFunc_IsFlying_ReturnValue) == 0x0000F5, "Member 'AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed::CallFunc_IsFlying_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed, K2Node_Event_bWasCancelled) == 0x0000F6, "Member 'AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed, CallFunc_BooleanOR_ReturnValue_1) == 0x0000F7, "Member 'AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed, CallFunc_CAApplyTimedImpulse_ReturnValue) == 0x0000F8, "Member 'AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed::CallFunc_CAApplyTimedImpulse_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed, Temp_bool_Variable) == 0x0000F9, "Member 'AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed, K2Node_Select_Default) == 0x0000FC, "Member 'AB_NPC_Pushed_C_ExecuteUbergraph_AB_NPC_Pushed::K2Node_Select_Default' has a wrong offset!");

// Function AB_NPC_Pushed.AB_NPC_Pushed_C.K2_ActivateAbilityFromEvent
// 0x00B8 (0x00B8 - 0x0000)
struct AB_NPC_Pushed_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_NPC_Pushed_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on AB_NPC_Pushed_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(AB_NPC_Pushed_C_K2_ActivateAbilityFromEvent) == 0x0000B8, "Wrong size on AB_NPC_Pushed_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(AB_NPC_Pushed_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'AB_NPC_Pushed_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function AB_NPC_Pushed.AB_NPC_Pushed_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct AB_NPC_Pushed_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_NPC_Pushed_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on AB_NPC_Pushed_C_K2_OnEndAbility");
static_assert(sizeof(AB_NPC_Pushed_C_K2_OnEndAbility) == 0x000001, "Wrong size on AB_NPC_Pushed_C_K2_OnEndAbility");
static_assert(offsetof(AB_NPC_Pushed_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'AB_NPC_Pushed_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function AB_NPC_Pushed.AB_NPC_Pushed_C.Calculate Force Vector
// 0x0100 (0x0100 - 0x0000)
struct AB_NPC_Pushed_C_Calculate_Force_Vector final
{
public:
	class UObject*                                Grenade_Object;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Magnitude;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PushVector;                                        // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Valid;                                             // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InverseTransformLocation_ReturnValue;     // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_NPC_Pushed_C_Calculate_Force_Vector) == 0x000010, "Wrong alignment on AB_NPC_Pushed_C_Calculate_Force_Vector");
static_assert(sizeof(AB_NPC_Pushed_C_Calculate_Force_Vector) == 0x000100, "Wrong size on AB_NPC_Pushed_C_Calculate_Force_Vector");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, Grenade_Object) == 0x000000, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::Grenade_Object' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, Magnitude) == 0x000008, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::Magnitude' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, PushVector) == 0x00000C, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::PushVector' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, Valid) == 0x000018, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::Valid' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, Temp_bool_Variable) == 0x000019, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, K2Node_DynamicCast_AsActor) == 0x000020, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, Temp_bool_Variable_1) == 0x00006C, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000070, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00007C, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000088, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, CallFunc_Normal_ReturnValue) == 0x000094, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, CallFunc_InverseTransformLocation_ReturnValue) == 0x0000A0, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::CallFunc_InverseTransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, CallFunc_BreakVector_X) == 0x0000AC, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, CallFunc_BreakVector_Y) == 0x0000B0, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, CallFunc_BreakVector_Z) == 0x0000B4, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0000B8, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, CallFunc_BreakRotator_Roll) == 0x0000C4, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, CallFunc_BreakRotator_Pitch) == 0x0000C8, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, CallFunc_BreakRotator_Yaw) == 0x0000CC, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, CallFunc_FClamp_ReturnValue) == 0x0000D0, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000D4, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, K2Node_Select_Default) == 0x0000D8, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000DC, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, K2Node_Select_Default_1) == 0x0000E0, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, CallFunc_MakeVector_ReturnValue) == 0x0000E4, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_Calculate_Force_Vector, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000F0, "Member 'AB_NPC_Pushed_C_Calculate_Force_Vector::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

// Function AB_NPC_Pushed.AB_NPC_Pushed_C.SetValues
// 0x0090 (0x0090 - 0x0000)
struct AB_NPC_Pushed_C_SetValues final
{
public:
	struct FCAGameplayEffectTableValueRow         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0000(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAGameplayEffectTableValueRow         CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0018(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAGameplayEffectTableValueRow         CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0030(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAGameplayEffectTableValueRow         CallFunc_GetDataTableRowFromName_OutRow_3;         // 0x0048(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_3;    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAGameplayEffectTableValueRow         CallFunc_GetDataTableRowFromName_OutRow_4;         // 0x0060(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_4;    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAGameplayEffectTableValueRow         CallFunc_GetDataTableRowFromName_OutRow_5;         // 0x0078(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_5;    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_NPC_Pushed_C_SetValues) == 0x000008, "Wrong alignment on AB_NPC_Pushed_C_SetValues");
static_assert(sizeof(AB_NPC_Pushed_C_SetValues) == 0x000090, "Wrong size on AB_NPC_Pushed_C_SetValues");
static_assert(offsetof(AB_NPC_Pushed_C_SetValues, CallFunc_GetDataTableRowFromName_OutRow) == 0x000000, "Member 'AB_NPC_Pushed_C_SetValues::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_SetValues, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000010, "Member 'AB_NPC_Pushed_C_SetValues::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_SetValues, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000018, "Member 'AB_NPC_Pushed_C_SetValues::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_SetValues, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000028, "Member 'AB_NPC_Pushed_C_SetValues::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_SetValues, CallFunc_GetDataTableRowFromName_OutRow_2) == 0x000030, "Member 'AB_NPC_Pushed_C_SetValues::CallFunc_GetDataTableRowFromName_OutRow_2' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_SetValues, CallFunc_GetDataTableRowFromName_ReturnValue_2) == 0x000040, "Member 'AB_NPC_Pushed_C_SetValues::CallFunc_GetDataTableRowFromName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_SetValues, CallFunc_GetDataTableRowFromName_OutRow_3) == 0x000048, "Member 'AB_NPC_Pushed_C_SetValues::CallFunc_GetDataTableRowFromName_OutRow_3' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_SetValues, CallFunc_GetDataTableRowFromName_ReturnValue_3) == 0x000058, "Member 'AB_NPC_Pushed_C_SetValues::CallFunc_GetDataTableRowFromName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_SetValues, CallFunc_GetDataTableRowFromName_OutRow_4) == 0x000060, "Member 'AB_NPC_Pushed_C_SetValues::CallFunc_GetDataTableRowFromName_OutRow_4' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_SetValues, CallFunc_GetDataTableRowFromName_ReturnValue_4) == 0x000070, "Member 'AB_NPC_Pushed_C_SetValues::CallFunc_GetDataTableRowFromName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_SetValues, CallFunc_GetDataTableRowFromName_OutRow_5) == 0x000078, "Member 'AB_NPC_Pushed_C_SetValues::CallFunc_GetDataTableRowFromName_OutRow_5' has a wrong offset!");
static_assert(offsetof(AB_NPC_Pushed_C_SetValues, CallFunc_GetDataTableRowFromName_ReturnValue_5) == 0x000088, "Member 'AB_NPC_Pushed_C_SetValues::CallFunc_GetDataTableRowFromName_ReturnValue_5' has a wrong offset!");

}

