#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Next_Equipment

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AB_Next_Equipment.AB_Next_Equipment_C
// 0x0010 (0x04A8 - 0x0498)
class UAB_Next_Equipment_C : public UCAGameplayAbility_Managed
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0498(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          UseNextEquipment;                                  // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ForConsumables;                                    // 0x04A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AB_Next_Equipment(int32 EntryPoint);
	void K2_ActivateAbility();
	void Removed_6B156DEA4E5B3D5EFD1579ABEC764A96();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_Next_Equipment_C">();
	}
	static class UAB_Next_Equipment_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_Next_Equipment_C>();
	}
};
static_assert(alignof(UAB_Next_Equipment_C) == 0x000008, "Wrong alignment on UAB_Next_Equipment_C");
static_assert(sizeof(UAB_Next_Equipment_C) == 0x0004A8, "Wrong size on UAB_Next_Equipment_C");
static_assert(offsetof(UAB_Next_Equipment_C, UberGraphFrame) == 0x000498, "Member 'UAB_Next_Equipment_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_Next_Equipment_C, UseNextEquipment) == 0x0004A0, "Member 'UAB_Next_Equipment_C::UseNextEquipment' has a wrong offset!");
static_assert(offsetof(UAB_Next_Equipment_C, ForConsumables) == 0x0004A1, "Member 'UAB_Next_Equipment_C::ForConsumables' has a wrong offset!");

}

