#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_NPC_Flashed_Tactical

#include "Basic.hpp"

#include "Keaton_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Struct_NPCFlashbangDuration_structs.hpp"


namespace SDK::Params
{

// Function AB_NPC_Flashed_Tactical.AB_NPC_Flashed_Tactical_C.ExecuteUbergraph_AB_NPC_Flashed_Tactical
// 0x02B8 (0x02B8 - 0x0000)
struct AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	struct FCATeamID                              CallFunc_GetTeamID_ReturnValue;                    // 0x0018(0x0004)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Is_in_pool)>              K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_NPC*                       K2Node_DynamicCast_AsCACharacter_NPC;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAGameState*                           CallFunc_GetGameState_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0080(0x00B8)(ConstParm)
	struct FCATeamID                              CallFunc_GetTeamID_ReturnValue_1;                  // 0x0138(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TeamIDTeamID_ReturnValue;      // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAProjectile_Flashbang*                K2Node_DynamicCast_AsCAProjectile_Flashbang;       // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFlashbangMultiplier0G_ReturnValue;     // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZeroGravity_ReturnValue;              // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Projectile_Tactical_CosplayerFlash_C* K2Node_DynamicCast_AsBP_Projectile_Tactical_Cosplayer_Flash; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_is_in_pool;                     // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16B[0x5];                                      // 0x016B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeFlashbangGameplayCueParameters_ReturnValue; // 0x0170(0x00F0)(ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0260(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorEyesViewPoint_OutLocation;        // 0x026C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetActorEyesViewPoint_OutRotation;        // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0284(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPointOnScaledCurve_ReturnValue;        // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x029C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_NPCFlashbangDuration           CallFunc_GetDataTableRowFromName_OutRow;           // 0x02A8(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical) == 0x000008, "Wrong alignment on AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical");
static_assert(sizeof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical) == 0x0002B8, "Wrong size on AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, EntryPoint) == 0x000000, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_GetTeamID_ReturnValue) == 0x000018, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, Temp_int_Variable) == 0x00001C, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_K2_CommitAbility_ReturnValue) == 0x000034, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000038, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000040, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, K2Node_DynamicCast_AsCACharacter_NPC) == 0x000048, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::K2Node_DynamicCast_AsCACharacter_NPC' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_GetGameState_ReturnValue) == 0x000058, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000060, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000064, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000068, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_WaitDelay_ReturnValue) == 0x000070, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00007C, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, K2Node_Event_EventData) == 0x000080, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_GetTeamID_ReturnValue_1) == 0x000138, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_GetTeamID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_EqualEqual_TeamIDTeamID_ReturnValue) == 0x00013C, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_EqualEqual_TeamIDTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, K2Node_DynamicCast_AsCAProjectile_Flashbang) == 0x000140, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::K2Node_DynamicCast_AsCAProjectile_Flashbang' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, K2Node_DynamicCast_bSuccess_1) == 0x000148, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_GetFlashbangMultiplier0G_ReturnValue) == 0x00014C, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_GetFlashbangMultiplier0G_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000150, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_IsInZeroGravity_ReturnValue) == 0x00015C, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_IsInZeroGravity_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, K2Node_DynamicCast_AsBP_Projectile_Tactical_Cosplayer_Flash) == 0x000160, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::K2Node_DynamicCast_AsBP_Projectile_Tactical_Cosplayer_Flash' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, K2Node_DynamicCast_bSuccess_2) == 0x000168, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, K2Node_CustomEvent_is_in_pool) == 0x000169, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::K2Node_CustomEvent_is_in_pool' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00016A, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_MakeFlashbangGameplayCueParameters_ReturnValue) == 0x000170, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_MakeFlashbangGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000260, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_GetActorEyesViewPoint_OutLocation) == 0x00026C, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_GetActorEyesViewPoint_OutLocation' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_GetActorEyesViewPoint_OutRotation) == 0x000278, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_GetActorEyesViewPoint_OutRotation' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000284, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_VSize_ReturnValue) == 0x000290, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_GetPointOnScaledCurve_ReturnValue) == 0x000294, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_GetPointOnScaledCurve_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_FMax_ReturnValue) == 0x000298, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, K2Node_Select_Default) == 0x00029C, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_GetDataTableRowFromName_OutRow) == 0x0002A8, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0002B0, "Member 'AB_NPC_Flashed_Tactical_C_ExecuteUbergraph_AB_NPC_Flashed_Tactical::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function AB_NPC_Flashed_Tactical.AB_NPC_Flashed_Tactical_C.ResetAbility
// 0x0001 (0x0001 - 0x0000)
struct AB_NPC_Flashed_Tactical_C_ResetAbility final
{
public:
	bool                                          Is_in_pool;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_NPC_Flashed_Tactical_C_ResetAbility) == 0x000001, "Wrong alignment on AB_NPC_Flashed_Tactical_C_ResetAbility");
static_assert(sizeof(AB_NPC_Flashed_Tactical_C_ResetAbility) == 0x000001, "Wrong size on AB_NPC_Flashed_Tactical_C_ResetAbility");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_ResetAbility, Is_in_pool) == 0x000000, "Member 'AB_NPC_Flashed_Tactical_C_ResetAbility::Is_in_pool' has a wrong offset!");

// Function AB_NPC_Flashed_Tactical.AB_NPC_Flashed_Tactical_C.K2_ActivateAbilityFromEvent
// 0x00B8 (0x00B8 - 0x0000)
struct AB_NPC_Flashed_Tactical_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_NPC_Flashed_Tactical_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on AB_NPC_Flashed_Tactical_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(AB_NPC_Flashed_Tactical_C_K2_ActivateAbilityFromEvent) == 0x0000B8, "Wrong size on AB_NPC_Flashed_Tactical_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(AB_NPC_Flashed_Tactical_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'AB_NPC_Flashed_Tactical_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

