#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_PlayerDownedAR

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Keaton_structs.hpp"


namespace SDK::Params
{

// Function AB_PlayerDownedAR.AB_PlayerDownedAR_C.ExecuteUbergraph_AB_PlayerDownedAR
// 0x0448 (0x0448 - 0x0000)
struct AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0040(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0054(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0068(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0088(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue_1;                  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x00A8(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x00C0(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x00D4(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x00E8(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x00FC(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x0110(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Check_Client_Downing_Hit_Valid_Hit_Valid; // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x0128(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetSkillfulKillsDeathAndRecoveryAnim_DownedMontage; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetSkillfulKillsDeathAndRecoveryAnim_RecoveryMontage; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_DetermineSkillfulTag_Skillful_Tag;        // 0x0150(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0160(0x0020)()
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_14;           // 0x0184(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_15;           // 0x0198(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAAbilityTask_PlayMontageWithManualBlendOut* CallFunc_CreatePlayMontageManualBlendOut_ReturnValue; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSliding_ReturnValue;                    // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCACombatFXComponent*                   CallFunc_GetCombatFXComponent_ReturnValue;         // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_PlayerCombatFXComponent_C*          K2Node_DynamicCast_AsBP_Player_Combat_FXComponent; // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCACharacterMovementComponent*          K2Node_DynamicCast_AsCACharacter_Movement_Component; // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkedHit                          CallFunc_Get_Downed_Hit_Information_Recent_Downed_Hit; // 0x0210(0x0068)(NoDestructor)
	class UAnimMontage*                           K2Node_CustomEvent_DownedTransitionMontage;        // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_CustomEvent_RecoveryTransitionMontage;      // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMetaDataOfType_ReturnValue;            // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28A[0x6];                                      // 0x028A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkedHit                          K2Node_MakeStruct_NetworkedHit;                    // 0x0290(0x0068)(NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue;                  // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x030C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0320(0x00F0)(ContainsInstancedReference)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_419[0x3];                                      // 0x0419(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_16;           // 0x041C(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsFeatureActive_ReturnValue;              // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431[0x3];                                      // 0x0431(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_17;           // 0x0434(0x0014)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR) == 0x000008, "Wrong alignment on AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR");
static_assert(sizeof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR) == 0x000448, "Wrong size on AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, EntryPoint) == 0x000000, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_CreateDelegate_OutputDelegate_3) == 0x000040, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_CreateDelegate_OutputDelegate_4) == 0x000054, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_CreateDelegate_OutputDelegate_5) == 0x000068, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_WaitDelay_ReturnValue) == 0x000080, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_CreateDelegate_OutputDelegate_6) == 0x000088, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_IsValid_ReturnValue) == 0x00009C, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_WaitDelay_ReturnValue_1) == 0x0000A0, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_WaitDelay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000A8, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_IsValid_ReturnValue_1) == 0x0000BC, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000C0, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_CreateDelegate_OutputDelegate_9) == 0x0000D4, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_CreateDelegate_OutputDelegate_10) == 0x0000E8, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_CreateDelegate_OutputDelegate_11) == 0x0000FC, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_CreateDelegate_OutputDelegate_12) == 0x000110, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_Check_Client_Downing_Hit_Valid_Hit_Valid) == 0x000124, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_Check_Client_Downing_Hit_Valid_Hit_Valid' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_CreateDelegate_OutputDelegate_13) == 0x000128, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_GetSkillfulKillsDeathAndRecoveryAnim_DownedMontage) == 0x000140, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_GetSkillfulKillsDeathAndRecoveryAnim_DownedMontage' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_GetSkillfulKillsDeathAndRecoveryAnim_RecoveryMontage) == 0x000148, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_GetSkillfulKillsDeathAndRecoveryAnim_RecoveryMontage' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_DetermineSkillfulTag_Skillful_Tag) == 0x000150, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_DetermineSkillfulTag_Skillful_Tag' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x000160, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_HasAuthority_ReturnValue) == 0x000180, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_CreateDelegate_OutputDelegate_14) == 0x000184, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_CreateDelegate_OutputDelegate_15) == 0x000198, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_CreatePlayMontageManualBlendOut_ReturnValue) == 0x0001B0, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_CreatePlayMontageManualBlendOut_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_IsValid_ReturnValue_2) == 0x0001B8, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_IsSliding_ReturnValue) == 0x0001B9, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_IsSliding_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0001C0, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_IsFalling_ReturnValue) == 0x0001C8, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x0001D0, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_DynamicCast_bSuccess) == 0x0001D8, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_GetCombatFXComponent_ReturnValue) == 0x0001E0, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_GetCombatFXComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_DynamicCast_AsBP_Player_Combat_FXComponent) == 0x0001E8, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_DynamicCast_AsBP_Player_Combat_FXComponent' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_DynamicCast_bSuccess_1) == 0x0001F0, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_GetMovementComponent_ReturnValue) == 0x0001F8, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_DynamicCast_AsCACharacter_Movement_Component) == 0x000200, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_DynamicCast_AsCACharacter_Movement_Component' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_DynamicCast_bSuccess_2) == 0x000208, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_Get_Downed_Hit_Information_Recent_Downed_Hit) == 0x000210, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_Get_Downed_Hit_Information_Recent_Downed_Hit' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_CustomEvent_DownedTransitionMontage) == 0x000278, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_CustomEvent_DownedTransitionMontage' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_CustomEvent_RecoveryTransitionMontage) == 0x000280, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_CustomEvent_RecoveryTransitionMontage' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_HasMetaDataOfType_ReturnValue) == 0x000288, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_HasMetaDataOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_Not_PreBool_ReturnValue) == 0x000289, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_MakeStruct_NetworkedHit) == 0x000290, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_MakeStruct_NetworkedHit' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_Event_bWasCancelled) == 0x0002F8, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_WaitNetSync_ReturnValue) == 0x000300, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_WaitNetSync_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_IsValid_ReturnValue_3) == 0x000308, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_GetForwardVector_ReturnValue) == 0x00030C, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_Add_IntInt_ReturnValue) == 0x000318, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000320, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000410, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_IsValid_ReturnValue_4) == 0x000418, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_CreateDelegate_OutputDelegate_16) == 0x00041C, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, CallFunc_IsFeatureActive_ReturnValue) == 0x000430, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::CallFunc_IsFeatureActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR, K2Node_CreateDelegate_OutputDelegate_17) == 0x000434, "Member 'AB_PlayerDownedAR_C_ExecuteUbergraph_AB_PlayerDownedAR::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");

// Function AB_PlayerDownedAR.AB_PlayerDownedAR_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct AB_PlayerDownedAR_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_PlayerDownedAR_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on AB_PlayerDownedAR_C_K2_OnEndAbility");
static_assert(sizeof(AB_PlayerDownedAR_C_K2_OnEndAbility) == 0x000001, "Wrong size on AB_PlayerDownedAR_C_K2_OnEndAbility");
static_assert(offsetof(AB_PlayerDownedAR_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'AB_PlayerDownedAR_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function AB_PlayerDownedAR.AB_PlayerDownedAR_C.ProcessRecoveryTransition
// 0x0010 (0x0010 - 0x0000)
struct AB_PlayerDownedAR_C_ProcessRecoveryTransition final
{
public:
	class UAnimMontage*                           DownedTransitionMontage;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           RecoveryTransitionMontage;                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_PlayerDownedAR_C_ProcessRecoveryTransition) == 0x000008, "Wrong alignment on AB_PlayerDownedAR_C_ProcessRecoveryTransition");
static_assert(sizeof(AB_PlayerDownedAR_C_ProcessRecoveryTransition) == 0x000010, "Wrong size on AB_PlayerDownedAR_C_ProcessRecoveryTransition");
static_assert(offsetof(AB_PlayerDownedAR_C_ProcessRecoveryTransition, DownedTransitionMontage) == 0x000000, "Member 'AB_PlayerDownedAR_C_ProcessRecoveryTransition::DownedTransitionMontage' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_ProcessRecoveryTransition, RecoveryTransitionMontage) == 0x000008, "Member 'AB_PlayerDownedAR_C_ProcessRecoveryTransition::RecoveryTransitionMontage' has a wrong offset!");

// Function AB_PlayerDownedAR.AB_PlayerDownedAR_C.GetSkillfulKillsDeathAndRecoveryAnim
// 0x0160 (0x0160 - 0x0000)
struct AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim final
{
public:
	class UAnimMontage*                           DownedMontage;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           RecoveryMontage;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Velocity;                                          // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DirectionIndex;                                    // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Heading;                                           // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAWeaponClass                                WeaponClass;                                       // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBodyPart                                     BodyPart;                                          // 0x0025(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           SelectedDownedMontage;                             // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBodyPart                                     Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Temp_object_Variable_1;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Temp_object_Variable_2;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Temp_object_Variable_3;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMetaDataOfType_ReturnValue;            // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Temp_object_Variable_4;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_Select_Default;                             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMetaDataOfType_ReturnValue_1;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMetaDataOfType_ReturnValue_2;          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMetaDataOfType_ReturnValue_3;          // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMetaDataOfType_ReturnValue_4;          // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Select_Default_1;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSkillfulKillsDownedData>       Temp_struct_Variable;                              // 0x0090(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable_2;                              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBodyPart                                     Temp_byte_Variable_1;                              // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSkillfulKillsDownedData>       K2Node_Select_Default_2;                           // 0x00A8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Temp_object_Variable_5;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_2;             // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_Array_Get_Item_2;                         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Temp_object_Variable_6;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSkillfulKillsDownedData>       K2Node_Select_Default_3;                           // 0x00F0(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable_3;                              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_Select_Default_4;                           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_3;             // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Select_Default_5;                           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_Array_Get_Item_3;                         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_Select_Default_6;                           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_4;             // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_Array_Get_Item_4;                         // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim) == 0x000008, "Wrong alignment on AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim");
static_assert(sizeof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim) == 0x000160, "Wrong size on AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, DownedMontage) == 0x000000, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::DownedMontage' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, RecoveryMontage) == 0x000008, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::RecoveryMontage' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, Velocity) == 0x000010, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::Velocity' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, DirectionIndex) == 0x00001C, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::DirectionIndex' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, Heading) == 0x000020, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::Heading' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, WeaponClass) == 0x000024, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::WeaponClass' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, BodyPart) == 0x000025, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::BodyPart' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, SelectedDownedMontage) == 0x000028, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::SelectedDownedMontage' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, Temp_byte_Variable) == 0x000030, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, Temp_bool_Variable) == 0x000031, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, Temp_object_Variable) == 0x000038, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, Temp_object_Variable_1) == 0x000040, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, Temp_object_Variable_2) == 0x000048, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, K2Node_SwitchEnum_CmpSuccess) == 0x000054, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, Temp_object_Variable_3) == 0x000058, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000060, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, CallFunc_HasMetaDataOfType_ReturnValue) == 0x000064, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::CallFunc_HasMetaDataOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, Temp_object_Variable_4) == 0x000068, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, K2Node_Select_Default) == 0x000070, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, CallFunc_HasMetaDataOfType_ReturnValue_1) == 0x000078, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::CallFunc_HasMetaDataOfType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, CallFunc_HasMetaDataOfType_ReturnValue_2) == 0x000079, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::CallFunc_HasMetaDataOfType_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, CallFunc_HasMetaDataOfType_ReturnValue_3) == 0x00007A, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::CallFunc_HasMetaDataOfType_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, CallFunc_HasMetaDataOfType_ReturnValue_4) == 0x00007B, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::CallFunc_HasMetaDataOfType_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, CallFunc_IsValid_ReturnValue) == 0x00007C, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, Temp_bool_Variable_1) == 0x00007D, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, K2Node_Select_Default_1) == 0x000080, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, CallFunc_Array_Length_ReturnValue_1) == 0x000088, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, CallFunc_BooleanOR_ReturnValue) == 0x00008C, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, Temp_struct_Variable) == 0x000090, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, Temp_bool_Variable_2) == 0x0000A0, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, Temp_byte_Variable_1) == 0x0000A1, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, K2Node_Select_Default_2) == 0x0000A8, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, CallFunc_Percent_IntInt_ReturnValue) == 0x0000B8, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, CallFunc_Array_Length_ReturnValue_2) == 0x0000BC, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, Temp_object_Variable_5) == 0x0000C8, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, CallFunc_Percent_IntInt_ReturnValue_1) == 0x0000D0, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, CallFunc_Percent_IntInt_ReturnValue_2) == 0x0000D4, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::CallFunc_Percent_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, CallFunc_Array_Get_Item_2) == 0x0000E0, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, Temp_object_Variable_6) == 0x0000E8, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, K2Node_Select_Default_3) == 0x0000F0, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, Temp_bool_Variable_3) == 0x000100, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, CallFunc_Array_Length_ReturnValue_3) == 0x000104, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, K2Node_Select_Default_4) == 0x000108, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, CallFunc_Percent_IntInt_ReturnValue_3) == 0x000110, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::CallFunc_Percent_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, K2Node_Select_Default_5) == 0x000118, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, CallFunc_Array_Get_Item_3) == 0x000120, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, Temp_bool_Variable_4) == 0x000128, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, CallFunc_GetDisplayName_ReturnValue) == 0x000130, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, K2Node_Select_Default_6) == 0x000140, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, CallFunc_GetMovementComponent_ReturnValue) == 0x000148, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, CallFunc_Array_Length_ReturnValue_4) == 0x000150, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, CallFunc_Percent_IntInt_ReturnValue_4) == 0x000154, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::CallFunc_Percent_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim, CallFunc_Array_Get_Item_4) == 0x000158, "Member 'AB_PlayerDownedAR_C_GetSkillfulKillsDeathAndRecoveryAnim::CallFunc_Array_Get_Item_4' has a wrong offset!");

// Function AB_PlayerDownedAR.AB_PlayerDownedAR_C.Check Client Downing Hit Valid
// 0x0040 (0x0040 - 0x0000)
struct AB_PlayerDownedAR_C_Check_Client_Downing_Hit_Valid final
{
public:
	bool                                          Hit_Valid;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_GetNetMode_ReturnValue;                   // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0014)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AB_PlayerDownedAR_C_Check_Client_Downing_Hit_Valid) == 0x000008, "Wrong alignment on AB_PlayerDownedAR_C_Check_Client_Downing_Hit_Valid");
static_assert(sizeof(AB_PlayerDownedAR_C_Check_Client_Downing_Hit_Valid) == 0x000040, "Wrong size on AB_PlayerDownedAR_C_Check_Client_Downing_Hit_Valid");
static_assert(offsetof(AB_PlayerDownedAR_C_Check_Client_Downing_Hit_Valid, Hit_Valid) == 0x000000, "Member 'AB_PlayerDownedAR_C_Check_Client_Downing_Hit_Valid::Hit_Valid' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_Check_Client_Downing_Hit_Valid, CallFunc_IsServer_ReturnValue) == 0x000001, "Member 'AB_PlayerDownedAR_C_Check_Client_Downing_Hit_Valid::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_Check_Client_Downing_Hit_Valid, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AB_PlayerDownedAR_C_Check_Client_Downing_Hit_Valid::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_Check_Client_Downing_Hit_Valid, CallFunc_GetNetMode_ReturnValue) == 0x000018, "Member 'AB_PlayerDownedAR_C_Check_Client_Downing_Hit_Valid::CallFunc_GetNetMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_Check_Client_Downing_Hit_Valid, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'AB_PlayerDownedAR_C_Check_Client_Downing_Hit_Valid::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function AB_PlayerDownedAR.AB_PlayerDownedAR_C.DetermineSkillfulTag
// 0x0010 (0x0010 - 0x0000)
struct AB_PlayerDownedAR_C_DetermineSkillfulTag final
{
public:
	struct FGameplayTag                           Skillful_Tag;                                      // 0x0000(0x000C)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_PlayerDownedAR_C_DetermineSkillfulTag) == 0x000004, "Wrong alignment on AB_PlayerDownedAR_C_DetermineSkillfulTag");
static_assert(sizeof(AB_PlayerDownedAR_C_DetermineSkillfulTag) == 0x000010, "Wrong size on AB_PlayerDownedAR_C_DetermineSkillfulTag");
static_assert(offsetof(AB_PlayerDownedAR_C_DetermineSkillfulTag, Skillful_Tag) == 0x000000, "Member 'AB_PlayerDownedAR_C_DetermineSkillfulTag::Skillful_Tag' has a wrong offset!");
static_assert(offsetof(AB_PlayerDownedAR_C_DetermineSkillfulTag, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000C, "Member 'AB_PlayerDownedAR_C_DetermineSkillfulTag::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

}

