#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Player_Foamed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AB_Player_ManagedBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AB_Player_Foamed.AB_Player_Foamed_C
// 0x0020 (0x04C0 - 0x04A0)
class UAB_Player_Foamed_C final : public UAB_Player_ManagedBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AB_Player_Foamed_C;                 // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 FoamedPlayer;                                      // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   OnCurseFrustrated;                                 // 0x04B0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AB_Player_Foamed(int32 EntryPoint);
	void M_on_death_delegate_Event_0(class ACACharacter* Character, const struct FGameplayEffectSpec& Death_gameplay_effect_spec, float Damage_magnitude, const struct FNetworkedHit& Networked_hit, const class AActor* Killer);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void Removed_A27A5E134E04127E6D6008ADA3F2EE0B();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_Player_Foamed_C">();
	}
	static class UAB_Player_Foamed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_Player_Foamed_C>();
	}
};
static_assert(alignof(UAB_Player_Foamed_C) == 0x000008, "Wrong alignment on UAB_Player_Foamed_C");
static_assert(sizeof(UAB_Player_Foamed_C) == 0x0004C0, "Wrong size on UAB_Player_Foamed_C");
static_assert(offsetof(UAB_Player_Foamed_C, UberGraphFrame_AB_Player_Foamed_C) == 0x0004A0, "Member 'UAB_Player_Foamed_C::UberGraphFrame_AB_Player_Foamed_C' has a wrong offset!");
static_assert(offsetof(UAB_Player_Foamed_C, FoamedPlayer) == 0x0004A8, "Member 'UAB_Player_Foamed_C::FoamedPlayer' has a wrong offset!");
static_assert(offsetof(UAB_Player_Foamed_C, OnCurseFrustrated) == 0x0004B0, "Member 'UAB_Player_Foamed_C::OnCurseFrustrated' has a wrong offset!");

}

