#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Player_Foamed

#include "Basic.hpp"

#include "Keaton_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CAAudio_structs.hpp"


namespace SDK::Params
{

// Function AB_Player_Foamed.AB_Player_Foamed_C.ExecuteUbergraph_AB_Player_Foamed
// 0x0420 (0x0420 - 0x0000)
struct AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0004(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ACACharacter* Character, struct FGameplayEffectSpec& Death_gameplay_effect_spec, float Damage_magnitude, struct FNetworkedHit& Networked_hit, class AActor* Killer)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x0058(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0070(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x0088(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_GetOwnedGameplayTags_self_CastInput;      // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTagContainer                  CallFunc_GetOwnedGameplayTags_TagContainer;        // 0x00C8(0x0020)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter*                           K2Node_CustomEvent_character;                      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpec                    K2Node_CustomEvent_death_gameplay_effect_spec;     // 0x00F8(0x0298)(ConstParm)
	float                                         K2Node_CustomEvent_damage_magnitude;               // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkedHit                          K2Node_CustomEvent_networked_hit;                  // 0x0398(0x0068)(ConstParm, NoDestructor)
	const class AActor*                           K2Node_CustomEvent_killer;                         // 0x0400(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player_1;    // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x3];                                      // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0414(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed) == 0x000008, "Wrong alignment on AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed");
static_assert(sizeof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed) == 0x000420, "Wrong size on AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, EntryPoint) == 0x000000, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, Temp_delegate_Variable) == 0x000004, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x000030, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, CallFunc_IsValid_ReturnValue) == 0x00004C, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000050, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, Temp_delegate_Variable_1) == 0x000058, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, CallFunc_PlayEvent_playback_instance) == 0x000070, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, CallFunc_PlayEvent_play_success) == 0x000080, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, CallFunc_PlayEvent_playback_instance_1) == 0x000088, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, CallFunc_PlayEvent_play_success_1) == 0x000098, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::CallFunc_PlayEvent_play_success_1' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, K2Node_Event_bWasCancelled) == 0x000099, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x0000A0, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0000B0, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, CallFunc_GetOwnedGameplayTags_self_CastInput) == 0x0000B8, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::CallFunc_GetOwnedGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, CallFunc_GetOwnedGameplayTags_TagContainer) == 0x0000C8, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::CallFunc_GetOwnedGameplayTags_TagContainer' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, CallFunc_HasTag_ReturnValue) == 0x0000E8, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, K2Node_CustomEvent_character) == 0x0000F0, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::K2Node_CustomEvent_character' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, K2Node_CustomEvent_death_gameplay_effect_spec) == 0x0000F8, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::K2Node_CustomEvent_death_gameplay_effect_spec' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, K2Node_CustomEvent_damage_magnitude) == 0x000390, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::K2Node_CustomEvent_damage_magnitude' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, K2Node_CustomEvent_networked_hit) == 0x000398, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::K2Node_CustomEvent_networked_hit' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, K2Node_CustomEvent_killer) == 0x000400, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::K2Node_CustomEvent_killer' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, K2Node_DynamicCast_AsCACharacter_Main_Player_1) == 0x000408, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::K2Node_DynamicCast_AsCACharacter_Main_Player_1' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, K2Node_DynamicCast_bSuccess_1) == 0x000410, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000414, "Member 'AB_Player_Foamed_C_ExecuteUbergraph_AB_Player_Foamed::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");

// Function AB_Player_Foamed.AB_Player_Foamed_C.m_on_death_delegate_Event_0
// 0x0318 (0x0318 - 0x0000)
struct AB_Player_Foamed_C_M_on_death_delegate_Event_0 final
{
public:
	class ACACharacter*                           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpec                    Death_gameplay_effect_spec;                        // 0x0008(0x0298)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         Damage_magnitude;                                  // 0x02A0(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkedHit                          Networked_hit;                                     // 0x02A8(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	const class AActor*                           Killer;                                            // 0x0310(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Player_Foamed_C_M_on_death_delegate_Event_0) == 0x000008, "Wrong alignment on AB_Player_Foamed_C_M_on_death_delegate_Event_0");
static_assert(sizeof(AB_Player_Foamed_C_M_on_death_delegate_Event_0) == 0x000318, "Wrong size on AB_Player_Foamed_C_M_on_death_delegate_Event_0");
static_assert(offsetof(AB_Player_Foamed_C_M_on_death_delegate_Event_0, Character) == 0x000000, "Member 'AB_Player_Foamed_C_M_on_death_delegate_Event_0::Character' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_M_on_death_delegate_Event_0, Death_gameplay_effect_spec) == 0x000008, "Member 'AB_Player_Foamed_C_M_on_death_delegate_Event_0::Death_gameplay_effect_spec' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_M_on_death_delegate_Event_0, Damage_magnitude) == 0x0002A0, "Member 'AB_Player_Foamed_C_M_on_death_delegate_Event_0::Damage_magnitude' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_M_on_death_delegate_Event_0, Networked_hit) == 0x0002A8, "Member 'AB_Player_Foamed_C_M_on_death_delegate_Event_0::Networked_hit' has a wrong offset!");
static_assert(offsetof(AB_Player_Foamed_C_M_on_death_delegate_Event_0, Killer) == 0x000310, "Member 'AB_Player_Foamed_C_M_on_death_delegate_Event_0::Killer' has a wrong offset!");

// Function AB_Player_Foamed.AB_Player_Foamed_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct AB_Player_Foamed_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Player_Foamed_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on AB_Player_Foamed_C_K2_OnEndAbility");
static_assert(sizeof(AB_Player_Foamed_C_K2_OnEndAbility) == 0x000001, "Wrong size on AB_Player_Foamed_C_K2_OnEndAbility");
static_assert(offsetof(AB_Player_Foamed_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'AB_Player_Foamed_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

