#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Player_Collect

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AB_Player_Collect.AB_Player_Collect_C.ExecuteUbergraph_AB_Player_Collect
// 0x0170 (0x0170 - 0x0000)
struct AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter*                           K2Node_DynamicCast_AsCACharacter;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0014)(ZeroConstructor, NoDestructor)
	TScriptInterface<class ICALoadoutInterface>   K2Node_DynamicCast_AsCALoadout_Interface;          // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCALoadoutComponent*                    CallFunc_GetLoadoutComponent_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0050(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsPrimaryWeaponHeld_ReturnValue;          // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0068(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x007C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0090(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x00B0(0x00B8)(ConstParm)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect) == 0x000008, "Wrong alignment on AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect");
static_assert(sizeof(AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect) == 0x000170, "Wrong size on AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect");
static_assert(offsetof(AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect, EntryPoint) == 0x000000, "Member 'AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000008, "Member 'AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect, K2Node_DynamicCast_AsCACharacter) == 0x000010, "Member 'AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect::K2Node_DynamicCast_AsCACharacter' has a wrong offset!");
static_assert(offsetof(AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect, K2Node_DynamicCast_AsCALoadout_Interface) == 0x000030, "Member 'AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect::K2Node_DynamicCast_AsCALoadout_Interface' has a wrong offset!");
static_assert(offsetof(AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect, CallFunc_GetLoadoutComponent_ReturnValue) == 0x000048, "Member 'AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect::CallFunc_GetLoadoutComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect, K2Node_CreateDelegate_OutputDelegate_1) == 0x000050, "Member 'AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect, CallFunc_IsPrimaryWeaponHeld_ReturnValue) == 0x000064, "Member 'AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect::CallFunc_IsPrimaryWeaponHeld_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect, K2Node_CreateDelegate_OutputDelegate_2) == 0x000068, "Member 'AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect, K2Node_CreateDelegate_OutputDelegate_3) == 0x00007C, "Member 'AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect, K2Node_CreateDelegate_OutputDelegate_4) == 0x000090, "Member 'AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x0000A8, "Member 'AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect, K2Node_Event_EventData) == 0x0000B0, "Member 'AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect, CallFunc_MatchesTag_ReturnValue) == 0x000168, "Member 'AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect, CallFunc_BooleanAND_ReturnValue) == 0x000169, "Member 'AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect, CallFunc_IsValid_ReturnValue) == 0x00016A, "Member 'AB_Player_Collect_C_ExecuteUbergraph_AB_Player_Collect::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AB_Player_Collect.AB_Player_Collect_C.K2_ActivateAbilityFromEvent
// 0x00B8 (0x00B8 - 0x0000)
struct AB_Player_Collect_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_Player_Collect_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on AB_Player_Collect_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(AB_Player_Collect_C_K2_ActivateAbilityFromEvent) == 0x0000B8, "Wrong size on AB_Player_Collect_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(AB_Player_Collect_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'AB_Player_Collect_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

