#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Player_BankRobber_Recall_Turret

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AB_Player_BankRobber_Recall_Turret.AB_Player_BankRobber_Recall_Turret_C.ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret
// 0x0408 (0x0408 - 0x0000)
struct AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_1;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0058(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_2;         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPUI_HUD_GenericProgress_C*            CallFunc_ShowGenericProgressWidget_WidgetReference; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayEffectSpec& Killing_effect_spec, float Delta_value)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0090(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Character_BankRobber_C*             K2Node_DynamicCast_AsBP_Character_Bank_Robber;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float TimeHeld)>               K2Node_CreateDelegate_OutputDelegate_5;            // 0x00BC(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BankRobber_Turret_C> K2Node_DynamicCast_AsBPI_Bank_Robber_Turret;       // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAAbilitySystemComponent*              K2Node_DynamicCast_AsCAAbility_System_Component;   // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BankRobber_Turret_C> K2Node_DynamicCast_AsBPI_Bank_Robber_Turret_1;     // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_NPC_BankRobber_Turret_C*            K2Node_DynamicCast_AsBP_NPC_Bank_Robber_Turret;    // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitInputRelease*          CallFunc_WaitInputRelease_ReturnValue;             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13E[0x2];                                      // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpec                    K2Node_CustomEvent_killing_effect_spec;            // 0x0140(0x0298)(ConstParm)
	float                                         K2Node_CustomEvent_delta_value;                    // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAAIController*                        CallFunc_GetCAAIController_ReturnValue;            // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeHeld;                       // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CAAIController_BankRobber_Turret_C* K2Node_DynamicCast_AsBP_CAAIController_Bank_Robber_Turret; // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAComponent_NPCAttackManager*          CallFunc_GetNPCAttackManager_ReturnValue;          // 0x0400(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret) == 0x000008, "Wrong alignment on AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret");
static_assert(sizeof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret) == 0x000408, "Wrong size on AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, EntryPoint) == 0x000000, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000030, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, CallFunc_IsValid_ReturnValue) == 0x00004C, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, CallFunc_WaitGameplayTagAdd_ReturnValue_1) == 0x000050, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::CallFunc_WaitGameplayTagAdd_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, K2Node_CreateDelegate_OutputDelegate_3) == 0x000058, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, CallFunc_IsValid_ReturnValue_1) == 0x00006C, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, CallFunc_WaitGameplayTagAdd_ReturnValue_2) == 0x000070, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::CallFunc_WaitGameplayTagAdd_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, CallFunc_WaitDelay_ReturnValue) == 0x000078, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, CallFunc_IsValid_ReturnValue_2) == 0x000080, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, CallFunc_IsValid_ReturnValue_3) == 0x000081, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, CallFunc_IsValid_ReturnValue_4) == 0x000082, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, K2Node_Event_bWasCancelled) == 0x000083, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, CallFunc_ShowGenericProgressWidget_WidgetReference) == 0x000088, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::CallFunc_ShowGenericProgressWidget_WidgetReference' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, K2Node_CreateDelegate_OutputDelegate_4) == 0x000090, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x0000A8, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, K2Node_DynamicCast_AsBP_Character_Bank_Robber) == 0x0000B0, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::K2Node_DynamicCast_AsBP_Character_Bank_Robber' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000BC, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, CallFunc_IsValid_ReturnValue_5) == 0x0000D0, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0000D8, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, K2Node_DynamicCast_AsBPI_Bank_Robber_Turret) == 0x0000E0, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::K2Node_DynamicCast_AsBPI_Bank_Robber_Turret' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, K2Node_DynamicCast_AsCAAbility_System_Component) == 0x0000F8, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::K2Node_DynamicCast_AsCAAbility_System_Component' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, K2Node_DynamicCast_bSuccess_2) == 0x000100, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, K2Node_DynamicCast_AsBPI_Bank_Robber_Turret_1) == 0x000108, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::K2Node_DynamicCast_AsBPI_Bank_Robber_Turret_1' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, K2Node_DynamicCast_bSuccess_3) == 0x000118, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, CallFunc_IsValid_ReturnValue_6) == 0x000119, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, CallFunc_IsValid_ReturnValue_7) == 0x00011A, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, CallFunc_IsServer_ReturnValue) == 0x00011B, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, CallFunc_IsValid_ReturnValue_8) == 0x00011C, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, K2Node_DynamicCast_AsBP_NPC_Bank_Robber_Turret) == 0x000120, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::K2Node_DynamicCast_AsBP_NPC_Bank_Robber_Turret' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, K2Node_DynamicCast_bSuccess_4) == 0x000128, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, CallFunc_WaitInputRelease_ReturnValue) == 0x000130, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::CallFunc_WaitInputRelease_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, Temp_float_Variable) == 0x000138, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, CallFunc_IsValid_ReturnValue_9) == 0x00013C, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, CallFunc_IsValid_ReturnValue_10) == 0x00013D, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, K2Node_CustomEvent_killing_effect_spec) == 0x000140, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::K2Node_CustomEvent_killing_effect_spec' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, K2Node_CustomEvent_delta_value) == 0x0003D8, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::K2Node_CustomEvent_delta_value' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, CallFunc_GetCAAIController_ReturnValue) == 0x0003E0, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::CallFunc_GetCAAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, K2Node_CustomEvent_TimeHeld) == 0x0003E8, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::K2Node_CustomEvent_TimeHeld' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, K2Node_DynamicCast_AsBP_CAAIController_Bank_Robber_Turret) == 0x0003F0, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::K2Node_DynamicCast_AsBP_CAAIController_Bank_Robber_Turret' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, K2Node_DynamicCast_bSuccess_5) == 0x0003F8, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret, CallFunc_GetNPCAttackManager_ReturnValue) == 0x000400, "Member 'AB_Player_BankRobber_Recall_Turret_C_ExecuteUbergraph_AB_Player_BankRobber_Recall_Turret::CallFunc_GetNPCAttackManager_ReturnValue' has a wrong offset!");

// Function AB_Player_BankRobber_Recall_Turret.AB_Player_BankRobber_Recall_Turret_C.OnTurretZeroHealthEvent
// 0x02A0 (0x02A0 - 0x0000)
struct AB_Player_BankRobber_Recall_Turret_C_OnTurretZeroHealthEvent final
{
public:
	struct FGameplayEffectSpec                    Killing_effect_spec;                               // 0x0000(0x0298)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         Delta_value;                                       // 0x0298(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Player_BankRobber_Recall_Turret_C_OnTurretZeroHealthEvent) == 0x000008, "Wrong alignment on AB_Player_BankRobber_Recall_Turret_C_OnTurretZeroHealthEvent");
static_assert(sizeof(AB_Player_BankRobber_Recall_Turret_C_OnTurretZeroHealthEvent) == 0x0002A0, "Wrong size on AB_Player_BankRobber_Recall_Turret_C_OnTurretZeroHealthEvent");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_OnTurretZeroHealthEvent, Killing_effect_spec) == 0x000000, "Member 'AB_Player_BankRobber_Recall_Turret_C_OnTurretZeroHealthEvent::Killing_effect_spec' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_OnTurretZeroHealthEvent, Delta_value) == 0x000298, "Member 'AB_Player_BankRobber_Recall_Turret_C_OnTurretZeroHealthEvent::Delta_value' has a wrong offset!");

// Function AB_Player_BankRobber_Recall_Turret.AB_Player_BankRobber_Recall_Turret_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct AB_Player_BankRobber_Recall_Turret_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Player_BankRobber_Recall_Turret_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on AB_Player_BankRobber_Recall_Turret_C_K2_OnEndAbility");
static_assert(sizeof(AB_Player_BankRobber_Recall_Turret_C_K2_OnEndAbility) == 0x000001, "Wrong size on AB_Player_BankRobber_Recall_Turret_C_K2_OnEndAbility");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'AB_Player_BankRobber_Recall_Turret_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function AB_Player_BankRobber_Recall_Turret.AB_Player_BankRobber_Recall_Turret_C.OnRelease_B8CDA632458DF778070F2699E66FEA92
// 0x0004 (0x0004 - 0x0000)
struct AB_Player_BankRobber_Recall_Turret_C_OnRelease_B8CDA632458DF778070F2699E66FEA92 final
{
public:
	float                                         TimeHeld;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Player_BankRobber_Recall_Turret_C_OnRelease_B8CDA632458DF778070F2699E66FEA92) == 0x000004, "Wrong alignment on AB_Player_BankRobber_Recall_Turret_C_OnRelease_B8CDA632458DF778070F2699E66FEA92");
static_assert(sizeof(AB_Player_BankRobber_Recall_Turret_C_OnRelease_B8CDA632458DF778070F2699E66FEA92) == 0x000004, "Wrong size on AB_Player_BankRobber_Recall_Turret_C_OnRelease_B8CDA632458DF778070F2699E66FEA92");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_OnRelease_B8CDA632458DF778070F2699E66FEA92, TimeHeld) == 0x000000, "Member 'AB_Player_BankRobber_Recall_Turret_C_OnRelease_B8CDA632458DF778070F2699E66FEA92::TimeHeld' has a wrong offset!");

// Function AB_Player_BankRobber_Recall_Turret.AB_Player_BankRobber_Recall_Turret_C.SetBalancingVariables
// 0x0018 (0x0018 - 0x0000)
struct AB_Player_BankRobber_Recall_Turret_C_SetBalancingVariables final
{
public:
	struct FCAGameplayEffectTableValueRow         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0000(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Player_BankRobber_Recall_Turret_C_SetBalancingVariables) == 0x000008, "Wrong alignment on AB_Player_BankRobber_Recall_Turret_C_SetBalancingVariables");
static_assert(sizeof(AB_Player_BankRobber_Recall_Turret_C_SetBalancingVariables) == 0x000018, "Wrong size on AB_Player_BankRobber_Recall_Turret_C_SetBalancingVariables");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_SetBalancingVariables, CallFunc_GetDataTableRowFromName_OutRow) == 0x000000, "Member 'AB_Player_BankRobber_Recall_Turret_C_SetBalancingVariables::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_SetBalancingVariables, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000010, "Member 'AB_Player_BankRobber_Recall_Turret_C_SetBalancingVariables::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function AB_Player_BankRobber_Recall_Turret.AB_Player_BankRobber_Recall_Turret_C.StartUndeployingTurret
// 0x00C0 (0x00C0 - 0x0000)
struct AB_Player_BankRobber_Recall_Turret_C_StartUndeployingTurret final
{
public:
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0000(0x00B8)()
	int32                                         CallFunc_SendGameplayEventToActor_ReturnValue;     // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Player_BankRobber_Recall_Turret_C_StartUndeployingTurret) == 0x000008, "Wrong alignment on AB_Player_BankRobber_Recall_Turret_C_StartUndeployingTurret");
static_assert(sizeof(AB_Player_BankRobber_Recall_Turret_C_StartUndeployingTurret) == 0x0000C0, "Wrong size on AB_Player_BankRobber_Recall_Turret_C_StartUndeployingTurret");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_StartUndeployingTurret, K2Node_MakeStruct_GameplayEventData) == 0x000000, "Member 'AB_Player_BankRobber_Recall_Turret_C_StartUndeployingTurret::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_StartUndeployingTurret, CallFunc_SendGameplayEventToActor_ReturnValue) == 0x0000B8, "Member 'AB_Player_BankRobber_Recall_Turret_C_StartUndeployingTurret::CallFunc_SendGameplayEventToActor_ReturnValue' has a wrong offset!");

// Function AB_Player_BankRobber_Recall_Turret.AB_Player_BankRobber_Recall_Turret_C.FinishUndeploying
// 0x0034 (0x0034 - 0x0000)
struct AB_Player_BankRobber_Recall_Turret_C_FinishUndeploying final
{
public:
	bool                                          WasCanceled;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0004(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0010(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x0020(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SendGameplayEventToActor_ReturnValue;     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Player_BankRobber_Recall_Turret_C_FinishUndeploying) == 0x000004, "Wrong alignment on AB_Player_BankRobber_Recall_Turret_C_FinishUndeploying");
static_assert(sizeof(AB_Player_BankRobber_Recall_Turret_C_FinishUndeploying) == 0x000034, "Wrong size on AB_Player_BankRobber_Recall_Turret_C_FinishUndeploying");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_FinishUndeploying, WasCanceled) == 0x000000, "Member 'AB_Player_BankRobber_Recall_Turret_C_FinishUndeploying::WasCanceled' has a wrong offset!");
static_assert(offsetof(AB_Player_BankRobber_Recall_Turret_C_FinishUndeploying, Temp_struct_Variable) == 0x000004, "Member 'AB_Player_BankRobber_Recall_Turret_C_FinishUndeploying::Temp_struct_Variable' has a wrong offset!");
