#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Prototype_Generic_Knockback

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AB_Prototype_Generic_Knockback.AB_Prototype_Generic_Knockback_C.ExecuteUbergraph_AB_Prototype_Generic_Knockback
// 0x00C0 (0x00C0 - 0x0000)
struct AB_Prototype_Generic_Knockback_C_ExecuteUbergraph_AB_Prototype_Generic_Knockback final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0008(0x00B8)(ConstParm)
};
static_assert(alignof(AB_Prototype_Generic_Knockback_C_ExecuteUbergraph_AB_Prototype_Generic_Knockback) == 0x000008, "Wrong alignment on AB_Prototype_Generic_Knockback_C_ExecuteUbergraph_AB_Prototype_Generic_Knockback");
static_assert(sizeof(AB_Prototype_Generic_Knockback_C_ExecuteUbergraph_AB_Prototype_Generic_Knockback) == 0x0000C0, "Wrong size on AB_Prototype_Generic_Knockback_C_ExecuteUbergraph_AB_Prototype_Generic_Knockback");
static_assert(offsetof(AB_Prototype_Generic_Knockback_C_ExecuteUbergraph_AB_Prototype_Generic_Knockback, EntryPoint) == 0x000000, "Member 'AB_Prototype_Generic_Knockback_C_ExecuteUbergraph_AB_Prototype_Generic_Knockback::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Prototype_Generic_Knockback_C_ExecuteUbergraph_AB_Prototype_Generic_Knockback, CallFunc_K2_CommitAbility_ReturnValue) == 0x000004, "Member 'AB_Prototype_Generic_Knockback_C_ExecuteUbergraph_AB_Prototype_Generic_Knockback::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Prototype_Generic_Knockback_C_ExecuteUbergraph_AB_Prototype_Generic_Knockback, K2Node_Event_EventData) == 0x000008, "Member 'AB_Prototype_Generic_Knockback_C_ExecuteUbergraph_AB_Prototype_Generic_Knockback::K2Node_Event_EventData' has a wrong offset!");

// Function AB_Prototype_Generic_Knockback.AB_Prototype_Generic_Knockback_C.K2_ActivateAbilityFromEvent
// 0x00B8 (0x00B8 - 0x0000)
struct AB_Prototype_Generic_Knockback_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_Prototype_Generic_Knockback_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on AB_Prototype_Generic_Knockback_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(AB_Prototype_Generic_Knockback_C_K2_ActivateAbilityFromEvent) == 0x0000B8, "Wrong size on AB_Prototype_Generic_Knockback_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(AB_Prototype_Generic_Knockback_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'AB_Prototype_Generic_Knockback_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function AB_Prototype_Generic_Knockback.AB_Prototype_Generic_Knockback_C.PerformKnockback
// 0x00D8 (0x00D8 - 0x0000)
struct AB_Prototype_Generic_Knockback_C_PerformKnockback final
{
public:
	struct FGameplayEventData                     GameplayEventData;                                 // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter*                           K2Node_DynamicCast_AsCACharacter;                  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Prototype_Generic_Knockback_C_PerformKnockback) == 0x000008, "Wrong alignment on AB_Prototype_Generic_Knockback_C_PerformKnockback");
static_assert(sizeof(AB_Prototype_Generic_Knockback_C_PerformKnockback) == 0x0000D8, "Wrong size on AB_Prototype_Generic_Knockback_C_PerformKnockback");
static_assert(offsetof(AB_Prototype_Generic_Knockback_C_PerformKnockback, GameplayEventData) == 0x000000, "Member 'AB_Prototype_Generic_Knockback_C_PerformKnockback::GameplayEventData' has a wrong offset!");
static_assert(offsetof(AB_Prototype_Generic_Knockback_C_PerformKnockback, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000B8, "Member 'AB_Prototype_Generic_Knockback_C_PerformKnockback::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Prototype_Generic_Knockback_C_PerformKnockback, K2Node_DynamicCast_AsCACharacter) == 0x0000C0, "Member 'AB_Prototype_Generic_Knockback_C_PerformKnockback::K2Node_DynamicCast_AsCACharacter' has a wrong offset!");
static_assert(offsetof(AB_Prototype_Generic_Knockback_C_PerformKnockback, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'AB_Prototype_Generic_Knockback_C_PerformKnockback::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_Prototype_Generic_Knockback_C_PerformKnockback, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000CC, "Member 'AB_Prototype_Generic_Knockback_C_PerformKnockback::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

}

