#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Player_Flashed_Tactical

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AB_Player_Flashed_Tactical.AB_Player_Flashed_Tactical_C
// 0x0048 (0x05F0 - 0x05A8)
class UAB_Player_Flashed_Tactical_C final : public UCAAbilityPlayerFlashed
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<TSoftClassPtr<class UClass>>           ClassesToCheckTheInstigator;                       // 0x05B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         FlashStartTime;                                    // 0x05C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentDelay;                                      // 0x05C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                MainPlayer;                                        // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ACAProjectile_Flashbang*                FlashGrenade;                                      // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AActor*                                 Instigator;                                        // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NoCrewEffectLevel;                                 // 0x05E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E4[0x4];                                      // 0x05E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACADownedSpectatorPawn*                 Downed_Spectator_Pawn;                             // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AB_Player_Flashed_Tactical(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_Player_Flashed_Tactical_C">();
	}
	static class UAB_Player_Flashed_Tactical_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_Player_Flashed_Tactical_C>();
	}
};
static_assert(alignof(UAB_Player_Flashed_Tactical_C) == 0x000008, "Wrong alignment on UAB_Player_Flashed_Tactical_C");
static_assert(sizeof(UAB_Player_Flashed_Tactical_C) == 0x0005F0, "Wrong size on UAB_Player_Flashed_Tactical_C");
static_assert(offsetof(UAB_Player_Flashed_Tactical_C, UberGraphFrame) == 0x0005A8, "Member 'UAB_Player_Flashed_Tactical_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_Player_Flashed_Tactical_C, ClassesToCheckTheInstigator) == 0x0005B0, "Member 'UAB_Player_Flashed_Tactical_C::ClassesToCheckTheInstigator' has a wrong offset!");
static_assert(offsetof(UAB_Player_Flashed_Tactical_C, FlashStartTime) == 0x0005C0, "Member 'UAB_Player_Flashed_Tactical_C::FlashStartTime' has a wrong offset!");
static_assert(offsetof(UAB_Player_Flashed_Tactical_C, CurrentDelay) == 0x0005C4, "Member 'UAB_Player_Flashed_Tactical_C::CurrentDelay' has a wrong offset!");
static_assert(offsetof(UAB_Player_Flashed_Tactical_C, MainPlayer) == 0x0005C8, "Member 'UAB_Player_Flashed_Tactical_C::MainPlayer' has a wrong offset!");
static_assert(offsetof(UAB_Player_Flashed_Tactical_C, FlashGrenade) == 0x0005D0, "Member 'UAB_Player_Flashed_Tactical_C::FlashGrenade' has a wrong offset!");
static_assert(offsetof(UAB_Player_Flashed_Tactical_C, Instigator) == 0x0005D8, "Member 'UAB_Player_Flashed_Tactical_C::Instigator' has a wrong offset!");
static_assert(offsetof(UAB_Player_Flashed_Tactical_C, NoCrewEffectLevel) == 0x0005E0, "Member 'UAB_Player_Flashed_Tactical_C::NoCrewEffectLevel' has a wrong offset!");
static_assert(offsetof(UAB_Player_Flashed_Tactical_C, Downed_Spectator_Pawn) == 0x0005E8, "Member 'UAB_Player_Flashed_Tactical_C::Downed_Spectator_Pawn' has a wrong offset!");

}

