#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Player_Aim_Down_Sights_Actual

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function AB_Player_Aim_Down_Sights_Actual.AB_Player_Aim_Down_Sights_Actual_C.ExecuteUbergraph_AB_Player_Aim_Down_Sights_Actual
// 0x00F8 (0x00F8 - 0x0000)
struct AB_Player_Aim_Down_Sights_Actual_C_ExecuteUbergraph_AB_Player_Aim_Down_Sights_Actual final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0010(0x00B8)(ConstParm)
	class ACACharacter*                           K2Node_DynamicCast_AsCACharacter;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter*                           K2Node_DynamicCast_AsCACharacter_1;                // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Player_Aim_Down_Sights_Actual_C_ExecuteUbergraph_AB_Player_Aim_Down_Sights_Actual) == 0x000008, "Wrong alignment on AB_Player_Aim_Down_Sights_Actual_C_ExecuteUbergraph_AB_Player_Aim_Down_Sights_Actual");
static_assert(sizeof(AB_Player_Aim_Down_Sights_Actual_C_ExecuteUbergraph_AB_Player_Aim_Down_Sights_Actual) == 0x0000F8, "Wrong size on AB_Player_Aim_Down_Sights_Actual_C_ExecuteUbergraph_AB_Player_Aim_Down_Sights_Actual");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_ExecuteUbergraph_AB_Player_Aim_Down_Sights_Actual, EntryPoint) == 0x000000, "Member 'AB_Player_Aim_Down_Sights_Actual_C_ExecuteUbergraph_AB_Player_Aim_Down_Sights_Actual::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_ExecuteUbergraph_AB_Player_Aim_Down_Sights_Actual, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'AB_Player_Aim_Down_Sights_Actual_C_ExecuteUbergraph_AB_Player_Aim_Down_Sights_Actual::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_ExecuteUbergraph_AB_Player_Aim_Down_Sights_Actual, K2Node_Event_EventData) == 0x000010, "Member 'AB_Player_Aim_Down_Sights_Actual_C_ExecuteUbergraph_AB_Player_Aim_Down_Sights_Actual::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_ExecuteUbergraph_AB_Player_Aim_Down_Sights_Actual, K2Node_DynamicCast_AsCACharacter) == 0x0000C8, "Member 'AB_Player_Aim_Down_Sights_Actual_C_ExecuteUbergraph_AB_Player_Aim_Down_Sights_Actual::K2Node_DynamicCast_AsCACharacter' has a wrong offset!");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_ExecuteUbergraph_AB_Player_Aim_Down_Sights_Actual, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'AB_Player_Aim_Down_Sights_Actual_C_ExecuteUbergraph_AB_Player_Aim_Down_Sights_Actual::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_ExecuteUbergraph_AB_Player_Aim_Down_Sights_Actual, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x0000D8, "Member 'AB_Player_Aim_Down_Sights_Actual_C_ExecuteUbergraph_AB_Player_Aim_Down_Sights_Actual::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_ExecuteUbergraph_AB_Player_Aim_Down_Sights_Actual, K2Node_Event_bWasCancelled) == 0x0000E0, "Member 'AB_Player_Aim_Down_Sights_Actual_C_ExecuteUbergraph_AB_Player_Aim_Down_Sights_Actual::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_ExecuteUbergraph_AB_Player_Aim_Down_Sights_Actual, K2Node_DynamicCast_AsCACharacter_1) == 0x0000E8, "Member 'AB_Player_Aim_Down_Sights_Actual_C_ExecuteUbergraph_AB_Player_Aim_Down_Sights_Actual::K2Node_DynamicCast_AsCACharacter_1' has a wrong offset!");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_ExecuteUbergraph_AB_Player_Aim_Down_Sights_Actual, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'AB_Player_Aim_Down_Sights_Actual_C_ExecuteUbergraph_AB_Player_Aim_Down_Sights_Actual::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function AB_Player_Aim_Down_Sights_Actual.AB_Player_Aim_Down_Sights_Actual_C.K2_ActivateAbilityFromEvent
// 0x00B8 (0x00B8 - 0x0000)
struct AB_Player_Aim_Down_Sights_Actual_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_Player_Aim_Down_Sights_Actual_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on AB_Player_Aim_Down_Sights_Actual_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(AB_Player_Aim_Down_Sights_Actual_C_K2_ActivateAbilityFromEvent) == 0x0000B8, "Wrong size on AB_Player_Aim_Down_Sights_Actual_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'AB_Player_Aim_Down_Sights_Actual_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function AB_Player_Aim_Down_Sights_Actual.AB_Player_Aim_Down_Sights_Actual_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct AB_Player_Aim_Down_Sights_Actual_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Player_Aim_Down_Sights_Actual_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on AB_Player_Aim_Down_Sights_Actual_C_K2_OnEndAbility");
static_assert(sizeof(AB_Player_Aim_Down_Sights_Actual_C_K2_OnEndAbility) == 0x000001, "Wrong size on AB_Player_Aim_Down_Sights_Actual_C_K2_OnEndAbility");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'AB_Player_Aim_Down_Sights_Actual_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function AB_Player_Aim_Down_Sights_Actual.AB_Player_Aim_Down_Sights_Actual_C.K2_CanActivateAbility
// 0x00E0 (0x00E0 - 0x0000)
struct AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0050(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0058(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0078(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter*                           K2Node_DynamicCast_AsCACharacter;                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAEquipmentBase*                       CallFunc_GetCurrentlyHeldDevice_ReturnValue;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAWeapon*                              K2Node_DynamicCast_AsCAWeapon;                     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICAWeaponInterface>    CallFunc_CanReload_self_CastInput;                 // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanReload_ReturnValue;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICAWeaponInterface>    CallFunc_PassesAmmoCheck_self_CastInput;           // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PassesAmmoCheck_ReturnValue;              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility");
static_assert(sizeof(AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility) == 0x0000E0, "Wrong size on AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility, Handle) == 0x000050, "Member 'AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility::Handle' has a wrong offset!");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility, RelevantTags) == 0x000058, "Member 'AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility, ReturnValue) == 0x000078, "Member 'AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility, K2Node_DynamicCast_AsCACharacter) == 0x000080, "Member 'AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility::K2Node_DynamicCast_AsCACharacter' has a wrong offset!");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility, CallFunc_GetCurrentlyHeldDevice_ReturnValue) == 0x000090, "Member 'AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility::CallFunc_GetCurrentlyHeldDevice_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility, K2Node_DynamicCast_AsCAWeapon) == 0x0000A0, "Member 'AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility::K2Node_DynamicCast_AsCAWeapon' has a wrong offset!");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility, CallFunc_CanReload_self_CastInput) == 0x0000B0, "Member 'AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility::CallFunc_CanReload_self_CastInput' has a wrong offset!");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility, CallFunc_CanReload_ReturnValue) == 0x0000C0, "Member 'AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility::CallFunc_CanReload_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility, CallFunc_PassesAmmoCheck_self_CastInput) == 0x0000C8, "Member 'AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility::CallFunc_PassesAmmoCheck_self_CastInput' has a wrong offset!");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility, CallFunc_PassesAmmoCheck_ReturnValue) == 0x0000D8, "Member 'AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility::CallFunc_PassesAmmoCheck_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility, CallFunc_Not_PreBool_ReturnValue) == 0x0000D9, "Member 'AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility, CallFunc_BooleanOR_ReturnValue) == 0x0000DA, "Member 'AB_Player_Aim_Down_Sights_Actual_C_K2_CanActivateAbility::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

