#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Player_Next_Weapon_Mode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AB_Player_Next_Weapon_Mode.AB_Player_Next_Weapon_Mode_C
// 0x0010 (0x04A8 - 0x0498)
class UAB_Player_Next_Weapon_Mode_C final : public UCAGameplayAbility_Managed
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0498(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Anim_Ended;                                        // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Weapon_Mode_Swapped;                               // 0x04A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AB_Player_Next_Weapon_Mode(int32 EntryPoint);
	void K2_ActivateAbility();
	void EventReceived_0E50F83148F839B0BA925DAD480A1FC4(const struct FGameplayEventData& Payload);
	void OnCompleted_7D04950D4D207A4AB801E7A9811A91FA();
	void OnBlendOut_7D04950D4D207A4AB801E7A9811A91FA();
	void OnInterrupted_7D04950D4D207A4AB801E7A9811A91FA();
	void OnCancelled_7D04950D4D207A4AB801E7A9811A91FA();
	void OnSkipped_7D04950D4D207A4AB801E7A9811A91FA();
	void SetNextWeaponMode();
	void End_if_Complete();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_Player_Next_Weapon_Mode_C">();
	}
	static class UAB_Player_Next_Weapon_Mode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_Player_Next_Weapon_Mode_C>();
	}
};
static_assert(alignof(UAB_Player_Next_Weapon_Mode_C) == 0x000008, "Wrong alignment on UAB_Player_Next_Weapon_Mode_C");
static_assert(sizeof(UAB_Player_Next_Weapon_Mode_C) == 0x0004A8, "Wrong size on UAB_Player_Next_Weapon_Mode_C");
static_assert(offsetof(UAB_Player_Next_Weapon_Mode_C, UberGraphFrame) == 0x000498, "Member 'UAB_Player_Next_Weapon_Mode_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_Player_Next_Weapon_Mode_C, Anim_Ended) == 0x0004A0, "Member 'UAB_Player_Next_Weapon_Mode_C::Anim_Ended' has a wrong offset!");
static_assert(offsetof(UAB_Player_Next_Weapon_Mode_C, Weapon_Mode_Swapped) == 0x0004A1, "Member 'UAB_Player_Next_Weapon_Mode_C::Weapon_Mode_Swapped' has a wrong offset!");

}

