#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Projectile_Weapon_NPC

#include "Basic.hpp"


namespace SDK::Params
{

// Function AB_Projectile_Weapon_NPC.AB_Projectile_Weapon_NPC_C.ExecuteUbergraph_AB_Projectile_Weapon_NPC
// 0x0008 (0x0008 - 0x0000)
struct AB_Projectile_Weapon_NPC_C_ExecuteUbergraph_AB_Projectile_Weapon_NPC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Projectile_Weapon_NPC_C_ExecuteUbergraph_AB_Projectile_Weapon_NPC) == 0x000004, "Wrong alignment on AB_Projectile_Weapon_NPC_C_ExecuteUbergraph_AB_Projectile_Weapon_NPC");
static_assert(sizeof(AB_Projectile_Weapon_NPC_C_ExecuteUbergraph_AB_Projectile_Weapon_NPC) == 0x000008, "Wrong size on AB_Projectile_Weapon_NPC_C_ExecuteUbergraph_AB_Projectile_Weapon_NPC");
static_assert(offsetof(AB_Projectile_Weapon_NPC_C_ExecuteUbergraph_AB_Projectile_Weapon_NPC, EntryPoint) == 0x000000, "Member 'AB_Projectile_Weapon_NPC_C_ExecuteUbergraph_AB_Projectile_Weapon_NPC::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Projectile_Weapon_NPC_C_ExecuteUbergraph_AB_Projectile_Weapon_NPC, K2Node_Event_bWasCancelled) == 0x000004, "Member 'AB_Projectile_Weapon_NPC_C_ExecuteUbergraph_AB_Projectile_Weapon_NPC::K2Node_Event_bWasCancelled' has a wrong offset!");

// Function AB_Projectile_Weapon_NPC.AB_Projectile_Weapon_NPC_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct AB_Projectile_Weapon_NPC_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Projectile_Weapon_NPC_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on AB_Projectile_Weapon_NPC_C_K2_OnEndAbility");
static_assert(sizeof(AB_Projectile_Weapon_NPC_C_K2_OnEndAbility) == 0x000001, "Wrong size on AB_Projectile_Weapon_NPC_C_K2_OnEndAbility");
static_assert(offsetof(AB_Projectile_Weapon_NPC_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'AB_Projectile_Weapon_NPC_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

