#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Player_Use

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function AB_Player_Use.AB_Player_Use_C.ExecuteUbergraph_AB_Player_Use
// 0x0200 (0x0200 - 0x0000)
struct AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeHeld;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float TimeHeld)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0014)(ZeroConstructor, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitInputRelease*          CallFunc_WaitInputRelease_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0014)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0040(0x00B8)()
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00F8(0x00B8)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BB[0x5];                                      // 0x01BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAInteractorComponent*                 CallFunc_GetInteractorComponent_interactor_component; // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player_1;    // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAInteractorComponent*                 CallFunc_GetInteractorComponent_interactor_component_1; // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use) == 0x000008, "Wrong alignment on AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use");
static_assert(sizeof(AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use) == 0x000200, "Wrong size on AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use");
static_assert(offsetof(AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use, EntryPoint) == 0x000000, "Member 'AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use, K2Node_CustomEvent_TimeHeld) == 0x000004, "Member 'AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use::K2Node_CustomEvent_TimeHeld' has a wrong offset!");
static_assert(offsetof(AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use, Temp_float_Variable) == 0x00001C, "Member 'AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use, CallFunc_WaitInputRelease_ReturnValue) == 0x000020, "Member 'AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use::CallFunc_WaitInputRelease_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use, K2Node_CustomEvent_Payload) == 0x000040, "Member 'AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use, Temp_struct_Variable) == 0x0000F8, "Member 'AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use, CallFunc_WaitGameplayEvent_ReturnValue) == 0x0001B0, "Member 'AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use, CallFunc_IsValid_ReturnValue_1) == 0x0001B8, "Member 'AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use, K2Node_Event_bWasCancelled) == 0x0001B9, "Member 'AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use, CallFunc_K2_CommitAbility_ReturnValue) == 0x0001BA, "Member 'AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0001C0, "Member 'AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x0001C8, "Member 'AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use, K2Node_DynamicCast_bSuccess) == 0x0001D0, "Member 'AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use, CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1) == 0x0001D8, "Member 'AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use::CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use, CallFunc_GetInteractorComponent_interactor_component) == 0x0001E0, "Member 'AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use::CallFunc_GetInteractorComponent_interactor_component' has a wrong offset!");
static_assert(offsetof(AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use, K2Node_DynamicCast_AsCACharacter_Main_Player_1) == 0x0001E8, "Member 'AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use::K2Node_DynamicCast_AsCACharacter_Main_Player_1' has a wrong offset!");
static_assert(offsetof(AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use, K2Node_DynamicCast_bSuccess_1) == 0x0001F0, "Member 'AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use, CallFunc_GetInteractorComponent_interactor_component_1) == 0x0001F8, "Member 'AB_Player_Use_C_ExecuteUbergraph_AB_Player_Use::CallFunc_GetInteractorComponent_interactor_component_1' has a wrong offset!");

// Function AB_Player_Use.AB_Player_Use_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct AB_Player_Use_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Player_Use_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on AB_Player_Use_C_K2_OnEndAbility");
static_assert(sizeof(AB_Player_Use_C_K2_OnEndAbility) == 0x000001, "Wrong size on AB_Player_Use_C_K2_OnEndAbility");
static_assert(offsetof(AB_Player_Use_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'AB_Player_Use_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function AB_Player_Use.AB_Player_Use_C.EventReceived_2557C69041D7886A8E2C3695BB76FE6C
// 0x00B8 (0x00B8 - 0x0000)
struct AB_Player_Use_C_EventReceived_2557C69041D7886A8E2C3695BB76FE6C final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AB_Player_Use_C_EventReceived_2557C69041D7886A8E2C3695BB76FE6C) == 0x000008, "Wrong alignment on AB_Player_Use_C_EventReceived_2557C69041D7886A8E2C3695BB76FE6C");
static_assert(sizeof(AB_Player_Use_C_EventReceived_2557C69041D7886A8E2C3695BB76FE6C) == 0x0000B8, "Wrong size on AB_Player_Use_C_EventReceived_2557C69041D7886A8E2C3695BB76FE6C");
static_assert(offsetof(AB_Player_Use_C_EventReceived_2557C69041D7886A8E2C3695BB76FE6C, Payload) == 0x000000, "Member 'AB_Player_Use_C_EventReceived_2557C69041D7886A8E2C3695BB76FE6C::Payload' has a wrong offset!");

// Function AB_Player_Use.AB_Player_Use_C.OnRelease_2AEA513E4ED544855D54CA8283576166
// 0x0004 (0x0004 - 0x0000)
struct AB_Player_Use_C_OnRelease_2AEA513E4ED544855D54CA8283576166 final
{
public:
	float                                         TimeHeld;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Player_Use_C_OnRelease_2AEA513E4ED544855D54CA8283576166) == 0x000004, "Wrong alignment on AB_Player_Use_C_OnRelease_2AEA513E4ED544855D54CA8283576166");
static_assert(sizeof(AB_Player_Use_C_OnRelease_2AEA513E4ED544855D54CA8283576166) == 0x000004, "Wrong size on AB_Player_Use_C_OnRelease_2AEA513E4ED544855D54CA8283576166");
static_assert(offsetof(AB_Player_Use_C_OnRelease_2AEA513E4ED544855D54CA8283576166, TimeHeld) == 0x000000, "Member 'AB_Player_Use_C_OnRelease_2AEA513E4ED544855D54CA8283576166::TimeHeld' has a wrong offset!");

// Function AB_Player_Use.AB_Player_Use_C.K2_CanActivateAbility
// 0x0080 (0x0080 - 0x0000)
struct AB_Player_Use_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0050(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0058(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0078(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Player_Use_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on AB_Player_Use_C_K2_CanActivateAbility");
static_assert(sizeof(AB_Player_Use_C_K2_CanActivateAbility) == 0x000080, "Wrong size on AB_Player_Use_C_K2_CanActivateAbility");
static_assert(offsetof(AB_Player_Use_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'AB_Player_Use_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(AB_Player_Use_C_K2_CanActivateAbility, Handle) == 0x000050, "Member 'AB_Player_Use_C_K2_CanActivateAbility::Handle' has a wrong offset!");
static_assert(offsetof(AB_Player_Use_C_K2_CanActivateAbility, RelevantTags) == 0x000058, "Member 'AB_Player_Use_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(AB_Player_Use_C_K2_CanActivateAbility, ReturnValue) == 0x000078, "Member 'AB_Player_Use_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");

}

