#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Player_Downed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AB_Player_ManagedBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AB_Player_Downed.AB_Player_Downed_C
// 0x0028 (0x04C8 - 0x04A0)
class UAB_Player_Downed_C final : public UAB_Player_ManagedBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AB_Player_Downed_C;                 // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ACACharacter_MainPlayer*                As_CACharacter_Main_Player;                        // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FTimerHandle                           Timer;                                             // 0x04B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   OnNPCIdleDownedPlayerTaunt;                        // 0x04B8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AB_Player_Downed(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void NPCDialogueTaunt();
	void K2_ActivateAbility();
	void EventReceived_F86395594E31F39D0CEC4DAFE5E52D5B(const struct FGameplayEventData& Payload);
	void EventReceived_61FD251841C407851B607BA32C3F5389(const struct FGameplayEventData& Payload);
	void Removed_3C6CA96A43CEFE5D1B1461AEAEDFCF1D();
	void OnSync_43485C614A39287369CF9CB256A7F7BA();
	void Removed_858D8120456354904731ED85D4C09D0E();
	void EventReceived_FC9E62204E144ED2C51ECA88F63CD671(const struct FGameplayEventData& Payload);
	void IsMovementDowned(bool* IsDowned, bool* IsWrongType);
	void ReviveCharacter();
	void ExecuteCharacter(const struct FGameplayEventData& Payload);
	void SelfRevive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_Player_Downed_C">();
	}
	static class UAB_Player_Downed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_Player_Downed_C>();
	}
};
static_assert(alignof(UAB_Player_Downed_C) == 0x000008, "Wrong alignment on UAB_Player_Downed_C");
static_assert(sizeof(UAB_Player_Downed_C) == 0x0004C8, "Wrong size on UAB_Player_Downed_C");
static_assert(offsetof(UAB_Player_Downed_C, UberGraphFrame_AB_Player_Downed_C) == 0x0004A0, "Member 'UAB_Player_Downed_C::UberGraphFrame_AB_Player_Downed_C' has a wrong offset!");
static_assert(offsetof(UAB_Player_Downed_C, As_CACharacter_Main_Player) == 0x0004A8, "Member 'UAB_Player_Downed_C::As_CACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(UAB_Player_Downed_C, Timer) == 0x0004B0, "Member 'UAB_Player_Downed_C::Timer' has a wrong offset!");
static_assert(offsetof(UAB_Player_Downed_C, OnNPCIdleDownedPlayerTaunt) == 0x0004B8, "Member 'UAB_Player_Downed_C::OnNPCIdleDownedPlayerTaunt' has a wrong offset!");

}

