#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Player_BeingRevived

#include "Basic.hpp"

#include "Keaton_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AB_Player_BeingRevived.AB_Player_BeingRevived_C.ExecuteUbergraph_AB_Player_BeingRevived
// 0x0A70 (0x0A70 - 0x0000)
struct AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_2;                      // 0x0048(0x00B8)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0100(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x0118(0x00B8)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x01DC(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x01F0(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0204(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0218(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x022C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0240(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0254(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x0268(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x027C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x0290(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_14;           // 0x02A4(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_15;           // 0x02B8(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_16;           // 0x02CC(0x0014)(ZeroConstructor, NoDestructor)
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue;                  // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_17;           // 0x02E8(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EHealthState Health_state)>    K2Node_CreateDelegate_OutputDelegate_18;           // 0x0300(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_19;           // 0x0314(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_20;           // 0x0328(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_21;           // 0x033C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_22;           // 0x0350(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_23;           // 0x0364(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_24;           // 0x0378(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue_1;                // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_25;           // 0x0398(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AD[0x3];                                      // 0x03AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x03B0(0x00B8)()
	struct FGameplayEventData                     Temp_struct_Variable_1;                            // 0x0468(0x00B8)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_1;          // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_529[0x3];                                      // 0x0529(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_26;           // 0x052C(0x0014)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0540(0x00B8)()
	struct FGameplayEventData                     Temp_struct_Variable_2;                            // 0x05F8(0x00B8)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_2;          // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B9[0x7];                                      // 0x06B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x06C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Player_C*                           K2Node_DynamicCast_AsBP_Player;                    // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x06D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D2[0x2];                                      // 0x06D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_27;           // 0x06D4(0x0014)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x06E8(0x00B8)(ConstParm)
	struct FTransform                             CallFunc_CalculateTransformForDocking_ReturnValue; // 0x07A0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D1[0x7];                                      // 0x07D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x07D8(0x0050)(ContainsInstancedReference)
	class ACACharacter*                           K2Node_DynamicCast_AsCACharacter;                  // 0x0828(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0830(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0831(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_832[0x6];                                      // 0x0832(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAEquipmentBase*                       CallFunc_GetCurrentlyHeldDevice_ReturnValue;       // 0x0838(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAWeapon*                              K2Node_DynamicCast_AsCAWeapon;                     // 0x0840(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0848(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_849[0x7];                                      // 0x0849(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetCharacterEquipAnim_ReturnValue;        // 0x0850(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0858(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0860(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_861[0x7];                                      // 0x0861(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_3;          // 0x0868(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1; // 0x0870(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0878(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0879(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x087A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87B[0x1];                                      // 0x087B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_28;           // 0x087C(0x0014)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     Temp_struct_Variable_3;                            // 0x0890(0x00B8)()
	class UCAAbilityTask_MontageSectionEvent*     CallFunc_SectionListener_ReturnValue;              // 0x0948(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_3;                      // 0x0950(0x00B8)()
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0A08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A09[0x7];                                      // 0x0A09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAAbilityTask_MontageSectionEvent*     CallFunc_SectionListener_ReturnValue_1;            // 0x0A10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0A18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsReviverCrouching_ReturnValue;           // 0x0A19(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1A[0x6];                                      // 0x0A1A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x0A20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0A28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A29[0x7];                                      // 0x0A29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Select_Default;                             // 0x0A30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculatePlaybackRateBySectionName_ReturnValue; // 0x0A38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3C[0x4];                                      // 0x0A3C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAAbilityTask_PlayDockedWithManualBlendOut* CallFunc_CreatePlayDockedMontageAndStopAndWaitProxy_ReturnValue; // 0x0A40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHealthState                                  CallFunc_GetHealthState_ReturnValue;               // 0x0A48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0A49(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0A4A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHealthState                                  K2Node_CustomEvent_health_state;                   // 0x0A4B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHealthState                                  CallFunc_GetHealthState_ReturnValue_1;             // 0x0A4C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0A4D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A4E[0x2];                                      // 0x0A4E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_2; // 0x0A50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_29;           // 0x0A58(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0A6C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived) == 0x000010, "Wrong alignment on AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived");
static_assert(sizeof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived) == 0x000A70, "Wrong size on AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, EntryPoint) == 0x000000, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, Temp_bool_Variable) == 0x000040, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CustomEvent_Payload_2) == 0x000048, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CustomEvent_Payload_2' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_3) == 0x000100, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, Temp_struct_Variable) == 0x000118, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_WaitGameplayEvent_ReturnValue) == 0x0001D0, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_IsValid_ReturnValue) == 0x0001D8, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001DC, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001F0, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_6) == 0x000204, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_7) == 0x000218, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_8) == 0x00022C, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_9) == 0x000240, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_10) == 0x000254, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_11) == 0x000268, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_12) == 0x00027C, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_13) == 0x000290, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_14) == 0x0002A4, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_15) == 0x0002B8, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_16) == 0x0002CC, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_WaitNetSync_ReturnValue) == 0x0002E0, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_WaitNetSync_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_17) == 0x0002E8, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_IsValid_ReturnValue_1) == 0x0002FC, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_18) == 0x000300, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_18' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_19) == 0x000314, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_19' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_20) == 0x000328, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_20' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_21) == 0x00033C, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_21' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_22) == 0x000350, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_22' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_23) == 0x000364, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_23' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_24) == 0x000378, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_24' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_WaitNetSync_ReturnValue_1) == 0x000390, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_WaitNetSync_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_25) == 0x000398, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_25' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_IsValid_ReturnValue_2) == 0x0003AC, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CustomEvent_Payload_1) == 0x0003B0, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, Temp_struct_Variable_1) == 0x000468, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_WaitGameplayEvent_ReturnValue_1) == 0x000520, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_WaitGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_IsValid_ReturnValue_3) == 0x000528, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_26) == 0x00052C, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_26' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CustomEvent_Payload) == 0x000540, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, Temp_struct_Variable_2) == 0x0005F8, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_WaitGameplayEvent_ReturnValue_2) == 0x0006B0, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_WaitGameplayEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_IsValid_ReturnValue_4) == 0x0006B8, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0006C0, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_DynamicCast_AsBP_Player) == 0x0006C8, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_DynamicCast_AsBP_Player' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_DynamicCast_bSuccess) == 0x0006D0, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_Event_bWasCancelled) == 0x0006D1, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_27) == 0x0006D4, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_27' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_Event_EventData) == 0x0006E8, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_CalculateTransformForDocking_ReturnValue) == 0x0007A0, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_CalculateTransformForDocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_K2_CommitAbility_ReturnValue) == 0x0007D0, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_GetActorInfo_ReturnValue) == 0x0007D8, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_DynamicCast_AsCACharacter) == 0x000828, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_DynamicCast_AsCACharacter' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_DynamicCast_bSuccess_1) == 0x000830, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_IsValid_ReturnValue_5) == 0x000831, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_GetCurrentlyHeldDevice_ReturnValue) == 0x000838, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_GetCurrentlyHeldDevice_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_DynamicCast_AsCAWeapon) == 0x000840, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_DynamicCast_AsCAWeapon' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_DynamicCast_bSuccess_2) == 0x000848, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_GetCharacterEquipAnim_ReturnValue) == 0x000850, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_GetCharacterEquipAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000858, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_IsValid_ReturnValue_6) == 0x000860, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_WaitGameplayEvent_ReturnValue_3) == 0x000868, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_WaitGameplayEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1) == 0x000870, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_IsValid_ReturnValue_7) == 0x000878, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_IsValid_ReturnValue_8) == 0x000879, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_IsServer_ReturnValue) == 0x00087A, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_28) == 0x00087C, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_28' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, Temp_struct_Variable_3) == 0x000890, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_SectionListener_ReturnValue) == 0x000948, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_SectionListener_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CustomEvent_Payload_3) == 0x000950, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CustomEvent_Payload_3' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_IsValid_ReturnValue_9) == 0x000A08, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_SectionListener_ReturnValue_1) == 0x000A10, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_SectionListener_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_IsValid_ReturnValue_10) == 0x000A18, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_IsReviverCrouching_ReturnValue) == 0x000A19, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_IsReviverCrouching_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x000A20, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_DynamicCast_bSuccess_3) == 0x000A28, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_Select_Default) == 0x000A30, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_CalculatePlaybackRateBySectionName_ReturnValue) == 0x000A38, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_CalculatePlaybackRateBySectionName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_CreatePlayDockedMontageAndStopAndWaitProxy_ReturnValue) == 0x000A40, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_CreatePlayDockedMontageAndStopAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_GetHealthState_ReturnValue) == 0x000A48, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_GetHealthState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000A49, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_IsValid_ReturnValue_11) == 0x000A4A, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CustomEvent_health_state) == 0x000A4B, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CustomEvent_health_state' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_GetHealthState_ReturnValue_1) == 0x000A4C, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_GetHealthState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000A4D, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_2) == 0x000A50, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, K2Node_CreateDelegate_OutputDelegate_29) == 0x000A58, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::K2Node_CreateDelegate_OutputDelegate_29' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived, CallFunc_IsValid_ReturnValue_12) == 0x000A6C, "Member 'AB_Player_BeingRevived_C_ExecuteUbergraph_AB_Player_BeingRevived::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");

// Function AB_Player_BeingRevived.AB_Player_BeingRevived_C.HealthStateChanged
// 0x0001 (0x0001 - 0x0000)
struct AB_Player_BeingRevived_C_HealthStateChanged final
{
public:
	EHealthState                                  Health_state;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Player_BeingRevived_C_HealthStateChanged) == 0x000001, "Wrong alignment on AB_Player_BeingRevived_C_HealthStateChanged");
static_assert(sizeof(AB_Player_BeingRevived_C_HealthStateChanged) == 0x000001, "Wrong size on AB_Player_BeingRevived_C_HealthStateChanged");
static_assert(offsetof(AB_Player_BeingRevived_C_HealthStateChanged, Health_state) == 0x000000, "Member 'AB_Player_BeingRevived_C_HealthStateChanged::Health_state' has a wrong offset!");

// Function AB_Player_BeingRevived.AB_Player_BeingRevived_C.K2_ActivateAbilityFromEvent
// 0x00B8 (0x00B8 - 0x0000)
struct AB_Player_BeingRevived_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_Player_BeingRevived_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on AB_Player_BeingRevived_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(AB_Player_BeingRevived_C_K2_ActivateAbilityFromEvent) == 0x0000B8, "Wrong size on AB_Player_BeingRevived_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(AB_Player_BeingRevived_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'AB_Player_BeingRevived_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function AB_Player_BeingRevived.AB_Player_BeingRevived_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct AB_Player_BeingRevived_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Player_BeingRevived_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on AB_Player_BeingRevived_C_K2_OnEndAbility");
static_assert(sizeof(AB_Player_BeingRevived_C_K2_OnEndAbility) == 0x000001, "Wrong size on AB_Player_BeingRevived_C_K2_OnEndAbility");
static_assert(offsetof(AB_Player_BeingRevived_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'AB_Player_BeingRevived_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function AB_Player_BeingRevived.AB_Player_BeingRevived_C.EventReceived_8A5D76D84C481FE8D1E929B9059871D4
// 0x00B8 (0x00B8 - 0x0000)
struct AB_Player_BeingRevived_C_EventReceived_8A5D76D84C481FE8D1E929B9059871D4 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AB_Player_BeingRevived_C_EventReceived_8A5D76D84C481FE8D1E929B9059871D4) == 0x000008, "Wrong alignment on AB_Player_BeingRevived_C_EventReceived_8A5D76D84C481FE8D1E929B9059871D4");
static_assert(sizeof(AB_Player_BeingRevived_C_EventReceived_8A5D76D84C481FE8D1E929B9059871D4) == 0x0000B8, "Wrong size on AB_Player_BeingRevived_C_EventReceived_8A5D76D84C481FE8D1E929B9059871D4");
static_assert(offsetof(AB_Player_BeingRevived_C_EventReceived_8A5D76D84C481FE8D1E929B9059871D4, Payload) == 0x000000, "Member 'AB_Player_BeingRevived_C_EventReceived_8A5D76D84C481FE8D1E929B9059871D4::Payload' has a wrong offset!");

// Function AB_Player_BeingRevived.AB_Player_BeingRevived_C.EventReceived_E1B0DE7C4928126AAC61D78B0B7489C6
// 0x00B8 (0x00B8 - 0x0000)
struct AB_Player_BeingRevived_C_EventReceived_E1B0DE7C4928126AAC61D78B0B7489C6 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AB_Player_BeingRevived_C_EventReceived_E1B0DE7C4928126AAC61D78B0B7489C6) == 0x000008, "Wrong alignment on AB_Player_BeingRevived_C_EventReceived_E1B0DE7C4928126AAC61D78B0B7489C6");
static_assert(sizeof(AB_Player_BeingRevived_C_EventReceived_E1B0DE7C4928126AAC61D78B0B7489C6) == 0x0000B8, "Wrong size on AB_Player_BeingRevived_C_EventReceived_E1B0DE7C4928126AAC61D78B0B7489C6");
static_assert(offsetof(AB_Player_BeingRevived_C_EventReceived_E1B0DE7C4928126AAC61D78B0B7489C6, Payload) == 0x000000, "Member 'AB_Player_BeingRevived_C_EventReceived_E1B0DE7C4928126AAC61D78B0B7489C6::Payload' has a wrong offset!");

// Function AB_Player_BeingRevived.AB_Player_BeingRevived_C.EventReceived_A871E9C74ED1AF3A6A043B9D5E6CCB7B
// 0x00B8 (0x00B8 - 0x0000)
struct AB_Player_BeingRevived_C_EventReceived_A871E9C74ED1AF3A6A043B9D5E6CCB7B final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AB_Player_BeingRevived_C_EventReceived_A871E9C74ED1AF3A6A043B9D5E6CCB7B) == 0x000008, "Wrong alignment on AB_Player_BeingRevived_C_EventReceived_A871E9C74ED1AF3A6A043B9D5E6CCB7B");
static_assert(sizeof(AB_Player_BeingRevived_C_EventReceived_A871E9C74ED1AF3A6A043B9D5E6CCB7B) == 0x0000B8, "Wrong size on AB_Player_BeingRevived_C_EventReceived_A871E9C74ED1AF3A6A043B9D5E6CCB7B");
static_assert(offsetof(AB_Player_BeingRevived_C_EventReceived_A871E9C74ED1AF3A6A043B9D5E6CCB7B, Payload) == 0x000000, "Member 'AB_Player_BeingRevived_C_EventReceived_A871E9C74ED1AF3A6A043B9D5E6CCB7B::Payload' has a wrong offset!");

// Function AB_Player_BeingRevived.AB_Player_BeingRevived_C.EventReceived_16E222144A8D23C3C881F690CABBF90B
// 0x00B8 (0x00B8 - 0x0000)
struct AB_Player_BeingRevived_C_EventReceived_16E222144A8D23C3C881F690CABBF90B final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AB_Player_BeingRevived_C_EventReceived_16E222144A8D23C3C881F690CABBF90B) == 0x000008, "Wrong alignment on AB_Player_BeingRevived_C_EventReceived_16E222144A8D23C3C881F690CABBF90B");
static_assert(sizeof(AB_Player_BeingRevived_C_EventReceived_16E222144A8D23C3C881F690CABBF90B) == 0x0000B8, "Wrong size on AB_Player_BeingRevived_C_EventReceived_16E222144A8D23C3C881F690CABBF90B");
static_assert(offsetof(AB_Player_BeingRevived_C_EventReceived_16E222144A8D23C3C881F690CABBF90B, Payload) == 0x000000, "Member 'AB_Player_BeingRevived_C_EventReceived_16E222144A8D23C3C881F690CABBF90B::Payload' has a wrong offset!");

// Function AB_Player_BeingRevived.AB_Player_BeingRevived_C.CalculateTransformForDocking
// 0x00F0 (0x00F0 - 0x0000)
struct AB_Player_BeingRevived_C_CalculateTransformForDocking final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCapsuleBottom_ReturnValue;             // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_NegateVector_ReturnValue;                 // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetCapsuleBottom_ReturnValue_1;           // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_1;       // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Vector_IsNearlyZero_ReturnValue;          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Player_BeingRevived_C_CalculateTransformForDocking) == 0x000010, "Wrong alignment on AB_Player_BeingRevived_C_CalculateTransformForDocking");
static_assert(sizeof(AB_Player_BeingRevived_C_CalculateTransformForDocking) == 0x0000F0, "Wrong size on AB_Player_BeingRevived_C_CalculateTransformForDocking");
static_assert(offsetof(AB_Player_BeingRevived_C_CalculateTransformForDocking, ReturnValue) == 0x000000, "Member 'AB_Player_BeingRevived_C_CalculateTransformForDocking::ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_CalculateTransformForDocking, CallFunc_GetActorForwardVector_ReturnValue) == 0x000030, "Member 'AB_Player_BeingRevived_C_CalculateTransformForDocking::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_CalculateTransformForDocking, CallFunc_GetCapsuleBottom_ReturnValue) == 0x00003C, "Member 'AB_Player_BeingRevived_C_CalculateTransformForDocking::CallFunc_GetCapsuleBottom_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_CalculateTransformForDocking, CallFunc_NegateVector_ReturnValue) == 0x000048, "Member 'AB_Player_BeingRevived_C_CalculateTransformForDocking::CallFunc_NegateVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_CalculateTransformForDocking, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000054, "Member 'AB_Player_BeingRevived_C_CalculateTransformForDocking::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_CalculateTransformForDocking, CallFunc_GetCapsuleBottom_ReturnValue_1) == 0x000060, "Member 'AB_Player_BeingRevived_C_CalculateTransformForDocking::CallFunc_GetCapsuleBottom_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_CalculateTransformForDocking, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'AB_Player_BeingRevived_C_CalculateTransformForDocking::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_CalculateTransformForDocking, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000A0, "Member 'AB_Player_BeingRevived_C_CalculateTransformForDocking::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_CalculateTransformForDocking, CallFunc_Conv_VectorToRotator_ReturnValue_1) == 0x0000AC, "Member 'AB_Player_BeingRevived_C_CalculateTransformForDocking::CallFunc_Conv_VectorToRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_CalculateTransformForDocking, CallFunc_Vector_IsNearlyZero_ReturnValue) == 0x0000B8, "Member 'AB_Player_BeingRevived_C_CalculateTransformForDocking::CallFunc_Vector_IsNearlyZero_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_CalculateTransformForDocking, CallFunc_MakeTransform_ReturnValue_1) == 0x0000C0, "Member 'AB_Player_BeingRevived_C_CalculateTransformForDocking::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");

// Function AB_Player_BeingRevived.AB_Player_BeingRevived_C.IsReviverCrouching
// 0x00C0 (0x00C0 - 0x0000)
struct AB_Player_BeingRevived_C_IsReviverCrouching final
{
public:
	struct FGameplayEventData                     GameplayEventData;                                 // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x00B8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Player_BeingRevived_C_IsReviverCrouching) == 0x000008, "Wrong alignment on AB_Player_BeingRevived_C_IsReviverCrouching");
static_assert(sizeof(AB_Player_BeingRevived_C_IsReviverCrouching) == 0x0000C0, "Wrong size on AB_Player_BeingRevived_C_IsReviverCrouching");
static_assert(offsetof(AB_Player_BeingRevived_C_IsReviverCrouching, GameplayEventData) == 0x000000, "Member 'AB_Player_BeingRevived_C_IsReviverCrouching::GameplayEventData' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_IsReviverCrouching, ReturnValue) == 0x0000B8, "Member 'AB_Player_BeingRevived_C_IsReviverCrouching::ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Player_BeingRevived_C_IsReviverCrouching, CallFunc_HasTag_ReturnValue) == 0x0000B9, "Member 'AB_Player_BeingRevived_C_IsReviverCrouching::CallFunc_HasTag_ReturnValue' has a wrong offset!");

}

