#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_RespawnInPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AB_RespawnInPlayer.AB_RespawnInPlayer_C
// 0x0040 (0x04D8 - 0x0498)
class UAB_RespawnInPlayer_C final : public UCAGameplayAbility_Managed
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0498(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ACACharacter_MainPlayer*                User;                                              // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TeleportInDuration;                                // 0x04A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   OnBeingRespawnedStatement;                         // 0x04AC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACAPlayerState*>                 Delayed_Trigger_Relationships;                     // 0x04B8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class ACAPlayerController*                    PlayerUsingRespawnerController;                    // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                MainPlayerUsingRespawner;                          // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AB_RespawnInPlayer(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnFinish_EC42330A4FC39821CF28CE8C30457547();

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_RespawnInPlayer_C">();
	}
	static class UAB_RespawnInPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_RespawnInPlayer_C>();
	}
};
static_assert(alignof(UAB_RespawnInPlayer_C) == 0x000008, "Wrong alignment on UAB_RespawnInPlayer_C");
static_assert(sizeof(UAB_RespawnInPlayer_C) == 0x0004D8, "Wrong size on UAB_RespawnInPlayer_C");
static_assert(offsetof(UAB_RespawnInPlayer_C, UberGraphFrame) == 0x000498, "Member 'UAB_RespawnInPlayer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_RespawnInPlayer_C, User) == 0x0004A0, "Member 'UAB_RespawnInPlayer_C::User' has a wrong offset!");
static_assert(offsetof(UAB_RespawnInPlayer_C, TeleportInDuration) == 0x0004A8, "Member 'UAB_RespawnInPlayer_C::TeleportInDuration' has a wrong offset!");
static_assert(offsetof(UAB_RespawnInPlayer_C, OnBeingRespawnedStatement) == 0x0004AC, "Member 'UAB_RespawnInPlayer_C::OnBeingRespawnedStatement' has a wrong offset!");
static_assert(offsetof(UAB_RespawnInPlayer_C, Delayed_Trigger_Relationships) == 0x0004B8, "Member 'UAB_RespawnInPlayer_C::Delayed_Trigger_Relationships' has a wrong offset!");
static_assert(offsetof(UAB_RespawnInPlayer_C, PlayerUsingRespawnerController) == 0x0004C8, "Member 'UAB_RespawnInPlayer_C::PlayerUsingRespawnerController' has a wrong offset!");
static_assert(offsetof(UAB_RespawnInPlayer_C, MainPlayerUsingRespawner) == 0x0004D0, "Member 'UAB_RespawnInPlayer_C::MainPlayerUsingRespawner' has a wrong offset!");

}

