#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_RespawnInPlayer

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function AB_RespawnInPlayer.AB_RespawnInPlayer_C.ExecuteUbergraph_AB_RespawnInPlayer
// 0x0108 (0x0108 - 0x0000)
struct AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAPlayerController*                    CallFunc_GetAssociatedPlayerController_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAPlayerController*                    CallFunc_GetAssociatedPlayerController_ReturnValue_1; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAPlayerState*                         K2Node_DynamicCast_AsCAPlayer_State;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0014)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACACharacter_MainPlayer*>        CallFunc_GetPlayersOnTeam_ReturnValue;             // 0x0080(0x0010)(ReferenceParm)
	class ACACharacter_MainPlayer*                CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasGameplayTag_ReturnValue;               // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAPlayerState*                         K2Node_DynamicCast_AsCAPlayer_State_1;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACAPlayerState*>                 K2Node_MakeArray_Array_1;                          // 0x00B0(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContext_ReturnValue;            // 0x00C8(0x0018)()
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x00E0(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x00F0(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue; // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer) == 0x000008, "Wrong alignment on AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer");
static_assert(sizeof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer) == 0x000108, "Wrong size on AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, EntryPoint) == 0x000000, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, CallFunc_GetAssociatedPlayerController_ReturnValue) == 0x000008, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::CallFunc_GetAssociatedPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, CallFunc_GetAssociatedPlayerController_ReturnValue_1) == 0x000010, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::CallFunc_GetAssociatedPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, K2Node_DynamicCast_AsCAPlayer_State) == 0x000018, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::K2Node_DynamicCast_AsCAPlayer_State' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, Temp_int_Array_Index_Variable) == 0x000040, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000048, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x000050, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, CallFunc_K2_CommitAbility_ReturnValue) == 0x00005A, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, CallFunc_WaitDelay_ReturnValue) == 0x000060, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, K2Node_MakeArray_Array) == 0x000068, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, CallFunc_IsValid_ReturnValue_2) == 0x000079, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, CallFunc_GetPlayersOnTeam_ReturnValue) == 0x000080, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::CallFunc_GetPlayersOnTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, CallFunc_Array_Get_Item) == 0x000090, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, CallFunc_Less_IntInt_ReturnValue) == 0x00009C, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, CallFunc_HasGameplayTag_ReturnValue) == 0x00009D, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::CallFunc_HasGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, K2Node_DynamicCast_AsCAPlayer_State_1) == 0x0000A0, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::K2Node_DynamicCast_AsCAPlayer_State_1' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, K2Node_DynamicCast_bSuccess_2) == 0x0000A8, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, K2Node_MakeArray_Array_1) == 0x0000B0, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, CallFunc_IsValid_ReturnValue_3) == 0x0000C0, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, CallFunc_MakeEffectContext_ReturnValue) == 0x0000C8, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::CallFunc_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x0000E0, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x0000F0, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue) == 0x000100, "Member 'AB_RespawnInPlayer_C_ExecuteUbergraph_AB_RespawnInPlayer::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue' has a wrong offset!");

// Function AB_RespawnInPlayer.AB_RespawnInPlayer_C.K2_CanActivateAbility
// 0x0080 (0x0080 - 0x0000)
struct AB_RespawnInPlayer_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0050(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0058(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0078(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_RespawnInPlayer_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on AB_RespawnInPlayer_C_K2_CanActivateAbility");
static_assert(sizeof(AB_RespawnInPlayer_C_K2_CanActivateAbility) == 0x000080, "Wrong size on AB_RespawnInPlayer_C_K2_CanActivateAbility");
static_assert(offsetof(AB_RespawnInPlayer_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'AB_RespawnInPlayer_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_K2_CanActivateAbility, Handle) == 0x000050, "Member 'AB_RespawnInPlayer_C_K2_CanActivateAbility::Handle' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_K2_CanActivateAbility, RelevantTags) == 0x000058, "Member 'AB_RespawnInPlayer_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(AB_RespawnInPlayer_C_K2_CanActivateAbility, ReturnValue) == 0x000078, "Member 'AB_RespawnInPlayer_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");

}

