#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_S_NPC_DroneRusher_Suicide

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CAGameDatabase_structs.hpp"


namespace SDK::Params
{

// Function AB_S_NPC_DroneRusher_Suicide.AB_S_NPC_DroneRusher_Suicide_C.ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide
// 0x0268 (0x0268 - 0x0000)
struct AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0014)(ZeroConstructor, NoDestructor)
	struct FCADataTableRowHandle                  K2Node_MakeStruct_CADataTableRowHandle;            // 0x0040(0x0018)(NoDestructor)
	float                                         CallFunc_GetTweakParameterValue_ReturnValue;       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0060(0x00B8)(ConstParm)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0118(0x00F0)(ContainsInstancedReference)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x021C(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x023C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0250(0x0014)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide) == 0x000008, "Wrong alignment on AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide");
static_assert(sizeof(AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide) == 0x000268, "Wrong size on AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide");
static_assert(offsetof(AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide, EntryPoint) == 0x000000, "Member 'AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide, K2Node_MakeStruct_CADataTableRowHandle) == 0x000040, "Member 'AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide::K2Node_MakeStruct_CADataTableRowHandle' has a wrong offset!");
static_assert(offsetof(AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide, CallFunc_GetTweakParameterValue_ReturnValue) == 0x000058, "Member 'AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide::CallFunc_GetTweakParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide, K2Node_Event_EventData) == 0x000060, "Member 'AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000118, "Member 'AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000208, "Member 'AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000210, "Member 'AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide, CallFunc_GetPlayLength_ReturnValue) == 0x000218, "Member 'AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide::CallFunc_GetPlayLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x00021C, "Member 'AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000224, "Member 'AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide, CallFunc_IsValid_ReturnValue) == 0x000228, "Member 'AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000230, "Member 'AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide, CallFunc_IsValid_ReturnValue_1) == 0x000238, "Member 'AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide, K2Node_CreateDelegate_OutputDelegate_3) == 0x00023C, "Member 'AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide, K2Node_CreateDelegate_OutputDelegate_4) == 0x000250, "Member 'AB_S_NPC_DroneRusher_Suicide_C_ExecuteUbergraph_AB_S_NPC_DroneRusher_Suicide::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

// Function AB_S_NPC_DroneRusher_Suicide.AB_S_NPC_DroneRusher_Suicide_C.K2_ActivateAbilityFromEvent
// 0x00B8 (0x00B8 - 0x0000)
struct AB_S_NPC_DroneRusher_Suicide_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_S_NPC_DroneRusher_Suicide_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on AB_S_NPC_DroneRusher_Suicide_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(AB_S_NPC_DroneRusher_Suicide_C_K2_ActivateAbilityFromEvent) == 0x0000B8, "Wrong size on AB_S_NPC_DroneRusher_Suicide_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(AB_S_NPC_DroneRusher_Suicide_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'AB_S_NPC_DroneRusher_Suicide_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

