#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_SwitchRadialMenuRight

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AB_SwitchRadialMenuRight.AB_SwitchRadialMenuRight_C.ExecuteUbergraph_AB_SwitchRadialMenuRight
// 0x01A0 (0x01A0 - 0x0000)
struct AB_SwitchRadialMenuRight_C_ExecuteUbergraph_AB_SwitchRadialMenuRight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0008(0x00B8)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate;              // 0x00C0(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00D8(0x00B8)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_SwitchRadialMenuRight_C_ExecuteUbergraph_AB_SwitchRadialMenuRight) == 0x000008, "Wrong alignment on AB_SwitchRadialMenuRight_C_ExecuteUbergraph_AB_SwitchRadialMenuRight");
static_assert(sizeof(AB_SwitchRadialMenuRight_C_ExecuteUbergraph_AB_SwitchRadialMenuRight) == 0x0001A0, "Wrong size on AB_SwitchRadialMenuRight_C_ExecuteUbergraph_AB_SwitchRadialMenuRight");
static_assert(offsetof(AB_SwitchRadialMenuRight_C_ExecuteUbergraph_AB_SwitchRadialMenuRight, EntryPoint) == 0x000000, "Member 'AB_SwitchRadialMenuRight_C_ExecuteUbergraph_AB_SwitchRadialMenuRight::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_SwitchRadialMenuRight_C_ExecuteUbergraph_AB_SwitchRadialMenuRight, K2Node_CustomEvent_Payload) == 0x000008, "Member 'AB_SwitchRadialMenuRight_C_ExecuteUbergraph_AB_SwitchRadialMenuRight::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(AB_SwitchRadialMenuRight_C_ExecuteUbergraph_AB_SwitchRadialMenuRight, K2Node_CreateDelegate_OutputDelegate) == 0x0000C0, "Member 'AB_SwitchRadialMenuRight_C_ExecuteUbergraph_AB_SwitchRadialMenuRight::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_SwitchRadialMenuRight_C_ExecuteUbergraph_AB_SwitchRadialMenuRight, Temp_struct_Variable) == 0x0000D8, "Member 'AB_SwitchRadialMenuRight_C_ExecuteUbergraph_AB_SwitchRadialMenuRight::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AB_SwitchRadialMenuRight_C_ExecuteUbergraph_AB_SwitchRadialMenuRight, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000190, "Member 'AB_SwitchRadialMenuRight_C_ExecuteUbergraph_AB_SwitchRadialMenuRight::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_SwitchRadialMenuRight_C_ExecuteUbergraph_AB_SwitchRadialMenuRight, CallFunc_IsValid_ReturnValue) == 0x000198, "Member 'AB_SwitchRadialMenuRight_C_ExecuteUbergraph_AB_SwitchRadialMenuRight::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AB_SwitchRadialMenuRight.AB_SwitchRadialMenuRight_C.EventReceived_78CB384B49816E01169D208B47232A34
// 0x00B8 (0x00B8 - 0x0000)
struct AB_SwitchRadialMenuRight_C_EventReceived_78CB384B49816E01169D208B47232A34 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AB_SwitchRadialMenuRight_C_EventReceived_78CB384B49816E01169D208B47232A34) == 0x000008, "Wrong alignment on AB_SwitchRadialMenuRight_C_EventReceived_78CB384B49816E01169D208B47232A34");
static_assert(sizeof(AB_SwitchRadialMenuRight_C_EventReceived_78CB384B49816E01169D208B47232A34) == 0x0000B8, "Wrong size on AB_SwitchRadialMenuRight_C_EventReceived_78CB384B49816E01169D208B47232A34");
static_assert(offsetof(AB_SwitchRadialMenuRight_C_EventReceived_78CB384B49816E01169D208B47232A34, Payload) == 0x000000, "Member 'AB_SwitchRadialMenuRight_C_EventReceived_78CB384B49816E01169D208B47232A34::Payload' has a wrong offset!");

}

