#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_TeleportPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AB_TeleportPlayer.AB_TeleportPlayer_C
// 0x0038 (0x04D0 - 0x0498)
class UAB_TeleportPlayer_C final : public UCAGameplayAbility_Managed
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0498(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   Dialogue_Trigger_Activate_Teleport;                // 0x04A0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AC[0x4];                                      // 0x04AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                User;                                              // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TeleportInDuration;                                // 0x04B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TeleportOutDuration;                               // 0x04BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TeleportOut;                                       // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TeleportIn;                                        // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AB_TeleportPlayer(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void TeleportBackIn(class ACACharacter_MainPlayer* User_0);
	void TriggerTeleport(class ACACharacter_MainPlayer* User_0);
	void OnSync_FB49C8FB483F9DD7C908069A31383CE1();
	void OnSync_2450BA5E478F40918B12FCABE071CD3A();
	void OnSync_BF3545064272A8898F4E37A7BC01BF06();
	void OnFinish_8B6785D94262B3F42EE7678D9E74084F();
	void OnSync_0B75D0F34A09A5DE9C4AB1B383E3FEE9();
	void OnFinish_35BBC5474A17084A724147A7C56E0D60();

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_TeleportPlayer_C">();
	}
	static class UAB_TeleportPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_TeleportPlayer_C>();
	}
};
static_assert(alignof(UAB_TeleportPlayer_C) == 0x000008, "Wrong alignment on UAB_TeleportPlayer_C");
static_assert(sizeof(UAB_TeleportPlayer_C) == 0x0004D0, "Wrong size on UAB_TeleportPlayer_C");
static_assert(offsetof(UAB_TeleportPlayer_C, UberGraphFrame) == 0x000498, "Member 'UAB_TeleportPlayer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_TeleportPlayer_C, Dialogue_Trigger_Activate_Teleport) == 0x0004A0, "Member 'UAB_TeleportPlayer_C::Dialogue_Trigger_Activate_Teleport' has a wrong offset!");
static_assert(offsetof(UAB_TeleportPlayer_C, User) == 0x0004B0, "Member 'UAB_TeleportPlayer_C::User' has a wrong offset!");
static_assert(offsetof(UAB_TeleportPlayer_C, TeleportInDuration) == 0x0004B8, "Member 'UAB_TeleportPlayer_C::TeleportInDuration' has a wrong offset!");
static_assert(offsetof(UAB_TeleportPlayer_C, TeleportOutDuration) == 0x0004BC, "Member 'UAB_TeleportPlayer_C::TeleportOutDuration' has a wrong offset!");
static_assert(offsetof(UAB_TeleportPlayer_C, TeleportOut) == 0x0004C0, "Member 'UAB_TeleportPlayer_C::TeleportOut' has a wrong offset!");
static_assert(offsetof(UAB_TeleportPlayer_C, TeleportIn) == 0x0004C8, "Member 'UAB_TeleportPlayer_C::TeleportIn' has a wrong offset!");

}

