#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Turret_Foamed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AB_Turret_Foamed.AB_Turret_Foamed_C
// 0x0020 (0x04B0 - 0x0490)
class UAB_Turret_Foamed_C final : public UCAGameplayAbility_NPC
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ACACharacter_NPC*                       OwningNPC;                                         // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                   AnimMontageArray;                                  // 0x04A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_AB_Turret_Foamed(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void OnCompleted_A321AF0A4000FAA6FF34E8BB0053B1E9();
	void OnBlendOut_A321AF0A4000FAA6FF34E8BB0053B1E9();
	void OnInterrupted_A321AF0A4000FAA6FF34E8BB0053B1E9();
	void OnCancelled_A321AF0A4000FAA6FF34E8BB0053B1E9();
	void OnSkipped_A321AF0A4000FAA6FF34E8BB0053B1E9();
	void OnCompleted_66ED9ABE4DC4DDEE6EDE828B2FB1BD15();
	void OnBlendOut_66ED9ABE4DC4DDEE6EDE828B2FB1BD15();
	void OnInterrupted_66ED9ABE4DC4DDEE6EDE828B2FB1BD15();
	void OnCancelled_66ED9ABE4DC4DDEE6EDE828B2FB1BD15();
	void OnSkipped_66ED9ABE4DC4DDEE6EDE828B2FB1BD15();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AB_Turret_Foamed_C">();
	}
	static class UAB_Turret_Foamed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAB_Turret_Foamed_C>();
	}
};
static_assert(alignof(UAB_Turret_Foamed_C) == 0x000008, "Wrong alignment on UAB_Turret_Foamed_C");
static_assert(sizeof(UAB_Turret_Foamed_C) == 0x0004B0, "Wrong size on UAB_Turret_Foamed_C");
static_assert(offsetof(UAB_Turret_Foamed_C, UberGraphFrame) == 0x000490, "Member 'UAB_Turret_Foamed_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAB_Turret_Foamed_C, OwningNPC) == 0x000498, "Member 'UAB_Turret_Foamed_C::OwningNPC' has a wrong offset!");
static_assert(offsetof(UAB_Turret_Foamed_C, AnimMontageArray) == 0x0004A0, "Member 'UAB_Turret_Foamed_C::AnimMontageArray' has a wrong offset!");

}

