#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Turret_Undeploy

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AB_Turret_Undeploy.AB_Turret_Undeploy_C.ExecuteUbergraph_AB_Turret_Undeploy
// 0x0460 (0x0460 - 0x0000)
struct AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x0008(0x00B8)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate;              // 0x00C0(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00D8(0x00B8)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x019C(0x0014)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x01B0(0x00B8)()
	struct FGameplayEventData                     Temp_struct_Variable_1;                            // 0x0268(0x00B8)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_1;          // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x032C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0340(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0354(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0368(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x037C(0x0014)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0390(0x00B8)(ConstParm)
	float                                         CallFunc_GetPlayRate_Play_Rate;                    // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0459(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy) == 0x000008, "Wrong alignment on AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy");
static_assert(sizeof(AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy) == 0x000460, "Wrong size on AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy");
static_assert(offsetof(AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy, EntryPoint) == 0x000000, "Member 'AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy, K2Node_CustomEvent_Payload_1) == 0x000008, "Member 'AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy, K2Node_CreateDelegate_OutputDelegate) == 0x0000C0, "Member 'AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy, Temp_struct_Variable) == 0x0000D8, "Member 'AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000190, "Member 'AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy, CallFunc_IsValid_ReturnValue) == 0x000198, "Member 'AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy, K2Node_CreateDelegate_OutputDelegate_1) == 0x00019C, "Member 'AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy, K2Node_CustomEvent_Payload) == 0x0001B0, "Member 'AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy, Temp_struct_Variable_1) == 0x000268, "Member 'AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy, CallFunc_WaitGameplayEvent_ReturnValue_1) == 0x000320, "Member 'AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy::CallFunc_WaitGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy, CallFunc_IsValid_ReturnValue_1) == 0x000328, "Member 'AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy, K2Node_CreateDelegate_OutputDelegate_2) == 0x00032C, "Member 'AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy, K2Node_CreateDelegate_OutputDelegate_3) == 0x000340, "Member 'AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy, K2Node_CreateDelegate_OutputDelegate_4) == 0x000354, "Member 'AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy, K2Node_CreateDelegate_OutputDelegate_5) == 0x000368, "Member 'AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy, K2Node_CreateDelegate_OutputDelegate_6) == 0x00037C, "Member 'AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy, K2Node_Event_EventData) == 0x000390, "Member 'AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy, CallFunc_GetPlayRate_Play_Rate) == 0x000448, "Member 'AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy::CallFunc_GetPlayRate_Play_Rate' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000450, "Member 'AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy, K2Node_Event_bWasCancelled) == 0x000458, "Member 'AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy, CallFunc_IsValid_ReturnValue_2) == 0x000459, "Member 'AB_Turret_Undeploy_C_ExecuteUbergraph_AB_Turret_Undeploy::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function AB_Turret_Undeploy.AB_Turret_Undeploy_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct AB_Turret_Undeploy_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Turret_Undeploy_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on AB_Turret_Undeploy_C_K2_OnEndAbility");
static_assert(sizeof(AB_Turret_Undeploy_C_K2_OnEndAbility) == 0x000001, "Wrong size on AB_Turret_Undeploy_C_K2_OnEndAbility");
static_assert(offsetof(AB_Turret_Undeploy_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'AB_Turret_Undeploy_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function AB_Turret_Undeploy.AB_Turret_Undeploy_C.K2_ActivateAbilityFromEvent
// 0x00B8 (0x00B8 - 0x0000)
struct AB_Turret_Undeploy_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_Turret_Undeploy_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on AB_Turret_Undeploy_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(AB_Turret_Undeploy_C_K2_ActivateAbilityFromEvent) == 0x0000B8, "Wrong size on AB_Turret_Undeploy_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(AB_Turret_Undeploy_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'AB_Turret_Undeploy_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function AB_Turret_Undeploy.AB_Turret_Undeploy_C.EventReceived_3CC2DDA94AEF76D3EA39C3879239EEAE
// 0x00B8 (0x00B8 - 0x0000)
struct AB_Turret_Undeploy_C_EventReceived_3CC2DDA94AEF76D3EA39C3879239EEAE final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AB_Turret_Undeploy_C_EventReceived_3CC2DDA94AEF76D3EA39C3879239EEAE) == 0x000008, "Wrong alignment on AB_Turret_Undeploy_C_EventReceived_3CC2DDA94AEF76D3EA39C3879239EEAE");
static_assert(sizeof(AB_Turret_Undeploy_C_EventReceived_3CC2DDA94AEF76D3EA39C3879239EEAE) == 0x0000B8, "Wrong size on AB_Turret_Undeploy_C_EventReceived_3CC2DDA94AEF76D3EA39C3879239EEAE");
static_assert(offsetof(AB_Turret_Undeploy_C_EventReceived_3CC2DDA94AEF76D3EA39C3879239EEAE, Payload) == 0x000000, "Member 'AB_Turret_Undeploy_C_EventReceived_3CC2DDA94AEF76D3EA39C3879239EEAE::Payload' has a wrong offset!");

// Function AB_Turret_Undeploy.AB_Turret_Undeploy_C.EventReceived_4AA13AF141C63626A29C5F9B11584ED8
// 0x00B8 (0x00B8 - 0x0000)
struct AB_Turret_Undeploy_C_EventReceived_4AA13AF141C63626A29C5F9B11584ED8 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AB_Turret_Undeploy_C_EventReceived_4AA13AF141C63626A29C5F9B11584ED8) == 0x000008, "Wrong alignment on AB_Turret_Undeploy_C_EventReceived_4AA13AF141C63626A29C5F9B11584ED8");
static_assert(sizeof(AB_Turret_Undeploy_C_EventReceived_4AA13AF141C63626A29C5F9B11584ED8) == 0x0000B8, "Wrong size on AB_Turret_Undeploy_C_EventReceived_4AA13AF141C63626A29C5F9B11584ED8");
static_assert(offsetof(AB_Turret_Undeploy_C_EventReceived_4AA13AF141C63626A29C5F9B11584ED8, Payload) == 0x000000, "Member 'AB_Turret_Undeploy_C_EventReceived_4AA13AF141C63626A29C5F9B11584ED8::Payload' has a wrong offset!");

// Function AB_Turret_Undeploy.AB_Turret_Undeploy_C.GetPlayRate
// 0x000C (0x000C - 0x0000)
struct AB_Turret_Undeploy_C_GetPlayRate final
{
public:
	float                                         Play_Rate;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Turret_Undeploy_C_GetPlayRate) == 0x000004, "Wrong alignment on AB_Turret_Undeploy_C_GetPlayRate");
static_assert(sizeof(AB_Turret_Undeploy_C_GetPlayRate) == 0x00000C, "Wrong size on AB_Turret_Undeploy_C_GetPlayRate");
static_assert(offsetof(AB_Turret_Undeploy_C_GetPlayRate, Play_Rate) == 0x000000, "Member 'AB_Turret_Undeploy_C_GetPlayRate::Play_Rate' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_GetPlayRate, CallFunc_GetPlayLength_ReturnValue) == 0x000004, "Member 'AB_Turret_Undeploy_C_GetPlayRate::CallFunc_GetPlayLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_GetPlayRate, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'AB_Turret_Undeploy_C_GetPlayRate::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function AB_Turret_Undeploy.AB_Turret_Undeploy_C.GetReverseLocation
// 0x0014 (0x0014 - 0x0000)
struct AB_Turret_Undeploy_C_GetReverseLocation final
{
public:
	float                                         Reverse_Location;                                  // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_Turret_Undeploy_C_GetReverseLocation) == 0x000004, "Wrong alignment on AB_Turret_Undeploy_C_GetReverseLocation");
static_assert(sizeof(AB_Turret_Undeploy_C_GetReverseLocation) == 0x000014, "Wrong size on AB_Turret_Undeploy_C_GetReverseLocation");
static_assert(offsetof(AB_Turret_Undeploy_C_GetReverseLocation, Reverse_Location) == 0x000000, "Member 'AB_Turret_Undeploy_C_GetReverseLocation::Reverse_Location' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_GetReverseLocation, CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue) == 0x000004, "Member 'AB_Turret_Undeploy_C_GetReverseLocation::CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_GetReverseLocation, CallFunc_GetPlayLength_ReturnValue) == 0x000008, "Member 'AB_Turret_Undeploy_C_GetReverseLocation::CallFunc_GetPlayLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_GetReverseLocation, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'AB_Turret_Undeploy_C_GetReverseLocation::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_GetReverseLocation, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'AB_Turret_Undeploy_C_GetReverseLocation::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function AB_Turret_Undeploy.AB_Turret_Undeploy_C.SetBalancingVariables
// 0x0018 (0x0018 - 0x0000)
struct AB_Turret_Undeploy_C_SetBalancingVariables final
{
public:
	struct FCAGameplayEffectTableValueRow         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0000(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Turret_Undeploy_C_SetBalancingVariables) == 0x000008, "Wrong alignment on AB_Turret_Undeploy_C_SetBalancingVariables");
static_assert(sizeof(AB_Turret_Undeploy_C_SetBalancingVariables) == 0x000018, "Wrong size on AB_Turret_Undeploy_C_SetBalancingVariables");
static_assert(offsetof(AB_Turret_Undeploy_C_SetBalancingVariables, CallFunc_GetDataTableRowFromName_OutRow) == 0x000000, "Member 'AB_Turret_Undeploy_C_SetBalancingVariables::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(AB_Turret_Undeploy_C_SetBalancingVariables, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000010, "Member 'AB_Turret_Undeploy_C_SetBalancingVariables::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

}

