#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_TimedFloat

#include "Basic.hpp"

#include "Keaton_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AB_TimedFloat.AB_TimedFloat_C.ExecuteUbergraph_AB_TimedFloat
// 0x0138 (0x0138 - 0x0000)
struct AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0020(0x00B8)(ConstParm)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_NPC*                       K2Node_DynamicCast_AsCACharacter_NPC;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetZeroGFloatTimeRandom_ReturnValue;      // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECAZeroGLocoState Zero_g_loco_state)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00F0(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCACharMoveComp_NPC*                    K2Node_DynamicCast_AsCAChar_Move_Comp_NPC;         // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECAZeroGLocoState                             K2Node_CustomEvent_zero_g_loco_state;              // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12B[0x1];                                      // 0x012B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x012C(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat) == 0x000008, "Wrong alignment on AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat");
static_assert(sizeof(AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat) == 0x000138, "Wrong size on AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat");
static_assert(offsetof(AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat, EntryPoint) == 0x000000, "Member 'AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat, K2Node_Event_bWasCancelled) == 0x000018, "Member 'AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat, K2Node_Event_EventData) == 0x000020, "Member 'AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x0000D8, "Member 'AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat, K2Node_DynamicCast_AsCACharacter_NPC) == 0x0000E0, "Member 'AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat::K2Node_DynamicCast_AsCACharacter_NPC' has a wrong offset!");
static_assert(offsetof(AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat, CallFunc_GetZeroGFloatTimeRandom_ReturnValue) == 0x0000EC, "Member 'AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat::CallFunc_GetZeroGFloatTimeRandom_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000F0, "Member 'AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat, CallFunc_WaitDelay_ReturnValue) == 0x000108, "Member 'AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat, CallFunc_IsValid_ReturnValue) == 0x000110, "Member 'AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat, CallFunc_GetMovementComponent_ReturnValue) == 0x000118, "Member 'AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat, K2Node_DynamicCast_AsCAChar_Move_Comp_NPC) == 0x000120, "Member 'AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat::K2Node_DynamicCast_AsCAChar_Move_Comp_NPC' has a wrong offset!");
static_assert(offsetof(AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat, K2Node_DynamicCast_bSuccess_1) == 0x000128, "Member 'AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat, K2Node_CustomEvent_zero_g_loco_state) == 0x000129, "Member 'AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat::K2Node_CustomEvent_zero_g_loco_state' has a wrong offset!");
static_assert(offsetof(AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00012A, "Member 'AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00012C, "Member 'AB_TimedFloat_C_ExecuteUbergraph_AB_TimedFloat::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

// Function AB_TimedFloat.AB_TimedFloat_C.m_on_zero_g_loco_state_changed_Event_0
// 0x0001 (0x0001 - 0x0000)
struct AB_TimedFloat_C_M_on_zero_g_loco_state_changed_Event_0 final
{
public:
	ECAZeroGLocoState                             Zero_g_loco_state;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AB_TimedFloat_C_M_on_zero_g_loco_state_changed_Event_0) == 0x000001, "Wrong alignment on AB_TimedFloat_C_M_on_zero_g_loco_state_changed_Event_0");
static_assert(sizeof(AB_TimedFloat_C_M_on_zero_g_loco_state_changed_Event_0) == 0x000001, "Wrong size on AB_TimedFloat_C_M_on_zero_g_loco_state_changed_Event_0");
static_assert(offsetof(AB_TimedFloat_C_M_on_zero_g_loco_state_changed_Event_0, Zero_g_loco_state) == 0x000000, "Member 'AB_TimedFloat_C_M_on_zero_g_loco_state_changed_Event_0::Zero_g_loco_state' has a wrong offset!");

// Function AB_TimedFloat.AB_TimedFloat_C.K2_ActivateAbilityFromEvent
// 0x00B8 (0x00B8 - 0x0000)
struct AB_TimedFloat_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AB_TimedFloat_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on AB_TimedFloat_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(AB_TimedFloat_C_K2_ActivateAbilityFromEvent) == 0x0000B8, "Wrong size on AB_TimedFloat_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(AB_TimedFloat_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'AB_TimedFloat_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function AB_TimedFloat.AB_TimedFloat_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct AB_TimedFloat_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_TimedFloat_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on AB_TimedFloat_C_K2_OnEndAbility");
static_assert(sizeof(AB_TimedFloat_C_K2_OnEndAbility) == 0x000001, "Wrong size on AB_TimedFloat_C_K2_OnEndAbility");
static_assert(offsetof(AB_TimedFloat_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'AB_TimedFloat_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

