#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AB_Weapon_Laser_Primary

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AB_Weapon_Laser_Primary.AB_Weapon_Laser_Primary_C.ExecuteUbergraph_AB_Weapon_Laser_Primary
// 0x0138 (0x0138 - 0x0000)
struct AB_Weapon_Laser_Primary_C_ExecuteUbergraph_AB_Weapon_Laser_Primary final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACADialogueNPCManager*                  CallFunc_GetDialogueNPCManager_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetCurrentSourceObject_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0020(0x00F0)(ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_NPC_EliteExosuit_Laser_C*           K2Node_DynamicCast_AsBP_NPC_Elite_Exosuit_Laser;   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACADialogueNPCManager*                  CallFunc_GetDialogueNPCManager_ReturnValue_1;      // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPlayCombatLine_ReturnValue;            // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Weapon_Laser_Primary_C_ExecuteUbergraph_AB_Weapon_Laser_Primary) == 0x000008, "Wrong alignment on AB_Weapon_Laser_Primary_C_ExecuteUbergraph_AB_Weapon_Laser_Primary");
static_assert(sizeof(AB_Weapon_Laser_Primary_C_ExecuteUbergraph_AB_Weapon_Laser_Primary) == 0x000138, "Wrong size on AB_Weapon_Laser_Primary_C_ExecuteUbergraph_AB_Weapon_Laser_Primary");
static_assert(offsetof(AB_Weapon_Laser_Primary_C_ExecuteUbergraph_AB_Weapon_Laser_Primary, EntryPoint) == 0x000000, "Member 'AB_Weapon_Laser_Primary_C_ExecuteUbergraph_AB_Weapon_Laser_Primary::EntryPoint' has a wrong offset!");
static_assert(offsetof(AB_Weapon_Laser_Primary_C_ExecuteUbergraph_AB_Weapon_Laser_Primary, CallFunc_GetDialogueNPCManager_ReturnValue) == 0x000008, "Member 'AB_Weapon_Laser_Primary_C_ExecuteUbergraph_AB_Weapon_Laser_Primary::CallFunc_GetDialogueNPCManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Weapon_Laser_Primary_C_ExecuteUbergraph_AB_Weapon_Laser_Primary, K2Node_Event_bWasCancelled) == 0x000010, "Member 'AB_Weapon_Laser_Primary_C_ExecuteUbergraph_AB_Weapon_Laser_Primary::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(AB_Weapon_Laser_Primary_C_ExecuteUbergraph_AB_Weapon_Laser_Primary, CallFunc_GetCurrentSourceObject_ReturnValue) == 0x000018, "Member 'AB_Weapon_Laser_Primary_C_ExecuteUbergraph_AB_Weapon_Laser_Primary::CallFunc_GetCurrentSourceObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Weapon_Laser_Primary_C_ExecuteUbergraph_AB_Weapon_Laser_Primary, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000020, "Member 'AB_Weapon_Laser_Primary_C_ExecuteUbergraph_AB_Weapon_Laser_Primary::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Weapon_Laser_Primary_C_ExecuteUbergraph_AB_Weapon_Laser_Primary, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000110, "Member 'AB_Weapon_Laser_Primary_C_ExecuteUbergraph_AB_Weapon_Laser_Primary::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AB_Weapon_Laser_Primary_C_ExecuteUbergraph_AB_Weapon_Laser_Primary, K2Node_DynamicCast_AsBP_NPC_Elite_Exosuit_Laser) == 0x000118, "Member 'AB_Weapon_Laser_Primary_C_ExecuteUbergraph_AB_Weapon_Laser_Primary::K2Node_DynamicCast_AsBP_NPC_Elite_Exosuit_Laser' has a wrong offset!");
static_assert(offsetof(AB_Weapon_Laser_Primary_C_ExecuteUbergraph_AB_Weapon_Laser_Primary, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'AB_Weapon_Laser_Primary_C_ExecuteUbergraph_AB_Weapon_Laser_Primary::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AB_Weapon_Laser_Primary_C_ExecuteUbergraph_AB_Weapon_Laser_Primary, CallFunc_GetDialogueNPCManager_ReturnValue_1) == 0x000128, "Member 'AB_Weapon_Laser_Primary_C_ExecuteUbergraph_AB_Weapon_Laser_Primary::CallFunc_GetDialogueNPCManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AB_Weapon_Laser_Primary_C_ExecuteUbergraph_AB_Weapon_Laser_Primary, CallFunc_CanPlayCombatLine_ReturnValue) == 0x000130, "Member 'AB_Weapon_Laser_Primary_C_ExecuteUbergraph_AB_Weapon_Laser_Primary::CallFunc_CanPlayCombatLine_ReturnValue' has a wrong offset!");

// Function AB_Weapon_Laser_Primary.AB_Weapon_Laser_Primary_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct AB_Weapon_Laser_Primary_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AB_Weapon_Laser_Primary_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on AB_Weapon_Laser_Primary_C_K2_OnEndAbility");
static_assert(sizeof(AB_Weapon_Laser_Primary_C_K2_OnEndAbility) == 0x000001, "Wrong size on AB_Weapon_Laser_Primary_C_K2_OnEndAbility");
static_assert(offsetof(AB_Weapon_Laser_Primary_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'AB_Weapon_Laser_Primary_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

