#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_NPC_DroneRusher

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_NPC_DroneRusher.ABP_NPC_DroneRusher_C.ExecuteUbergraph_ABP_NPC_DroneRusher
// 0x0024 (0x0024 - 0x0000)
struct ABP_NPC_DroneRusher_C_ExecuteUbergraph_ABP_NPC_DroneRusher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetDroneRotation_ReturnValue;             // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RInterpTo_Constant_ReturnValue;           // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_NPC_DroneRusher_C_ExecuteUbergraph_ABP_NPC_DroneRusher) == 0x000004, "Wrong alignment on ABP_NPC_DroneRusher_C_ExecuteUbergraph_ABP_NPC_DroneRusher");
static_assert(sizeof(ABP_NPC_DroneRusher_C_ExecuteUbergraph_ABP_NPC_DroneRusher) == 0x000024, "Wrong size on ABP_NPC_DroneRusher_C_ExecuteUbergraph_ABP_NPC_DroneRusher");
static_assert(offsetof(ABP_NPC_DroneRusher_C_ExecuteUbergraph_ABP_NPC_DroneRusher, EntryPoint) == 0x000000, "Member 'ABP_NPC_DroneRusher_C_ExecuteUbergraph_ABP_NPC_DroneRusher::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_NPC_DroneRusher_C_ExecuteUbergraph_ABP_NPC_DroneRusher, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'ABP_NPC_DroneRusher_C_ExecuteUbergraph_ABP_NPC_DroneRusher::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_NPC_DroneRusher_C_ExecuteUbergraph_ABP_NPC_DroneRusher, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'ABP_NPC_DroneRusher_C_ExecuteUbergraph_ABP_NPC_DroneRusher::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_DroneRusher_C_ExecuteUbergraph_ABP_NPC_DroneRusher, CallFunc_GetDroneRotation_ReturnValue) == 0x00000C, "Member 'ABP_NPC_DroneRusher_C_ExecuteUbergraph_ABP_NPC_DroneRusher::CallFunc_GetDroneRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_DroneRusher_C_ExecuteUbergraph_ABP_NPC_DroneRusher, CallFunc_RInterpTo_Constant_ReturnValue) == 0x000018, "Member 'ABP_NPC_DroneRusher_C_ExecuteUbergraph_ABP_NPC_DroneRusher::CallFunc_RInterpTo_Constant_ReturnValue' has a wrong offset!");

// Function ABP_NPC_DroneRusher.ABP_NPC_DroneRusher_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_NPC_DroneRusher_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_NPC_DroneRusher_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_NPC_DroneRusher_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_NPC_DroneRusher_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_NPC_DroneRusher_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_NPC_DroneRusher_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_NPC_DroneRusher_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_NPC_DroneRusher.ABP_NPC_DroneRusher_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_NPC_DroneRusher_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_NPC_DroneRusher_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_NPC_DroneRusher_C_AnimGraph");
static_assert(sizeof(ABP_NPC_DroneRusher_C_AnimGraph) == 0x000010, "Wrong size on ABP_NPC_DroneRusher_C_AnimGraph");
static_assert(offsetof(ABP_NPC_DroneRusher_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_NPC_DroneRusher_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

