#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Prp_NPC_RailgunTurret

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Prp_NPC_RailgunTurret.ABP_Prp_NPC_RailgunTurret_C
// 0x0710 (0x09D0 - 0x02C0)
class UABP_Prp_NPC_RailgunTurret_C final : public UCAAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0038)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0300(0x00E8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x03E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0410(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0438(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0460(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x04E0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0518(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0598(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x05D0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0650(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0688(0x00B0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0738(0x0110)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0848(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0868(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0888(0x0110)()
	class ACACharacter*                           TurretBase;                                        // 0x0998(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOffline;                                         // 0x09A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A1[0x7];                                      // 0x09A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAAnimInstance_NPC*                    BaseAnimInstance;                                  // 0x09A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Pitch;                                             // 0x09B0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               ActorRotation;                                     // 0x09BC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_Prp_NPC_RailgunTurret(int32 EntryPoint);
	void BlueprintBeginPlay();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Prp_NPC_RailgunTurret_C">();
	}
	static class UABP_Prp_NPC_RailgunTurret_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Prp_NPC_RailgunTurret_C>();
	}
};
static_assert(alignof(UABP_Prp_NPC_RailgunTurret_C) == 0x000010, "Wrong alignment on UABP_Prp_NPC_RailgunTurret_C");
static_assert(sizeof(UABP_Prp_NPC_RailgunTurret_C) == 0x0009D0, "Wrong size on UABP_Prp_NPC_RailgunTurret_C");
static_assert(offsetof(UABP_Prp_NPC_RailgunTurret_C, UberGraphFrame) == 0x0002C0, "Member 'UABP_Prp_NPC_RailgunTurret_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Prp_NPC_RailgunTurret_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UABP_Prp_NPC_RailgunTurret_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Prp_NPC_RailgunTurret_C, AnimGraphNode_Slot) == 0x000300, "Member 'UABP_Prp_NPC_RailgunTurret_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Prp_NPC_RailgunTurret_C, AnimGraphNode_TransitionResult_2) == 0x0003E8, "Member 'UABP_Prp_NPC_RailgunTurret_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Prp_NPC_RailgunTurret_C, AnimGraphNode_TransitionResult_1) == 0x000410, "Member 'UABP_Prp_NPC_RailgunTurret_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Prp_NPC_RailgunTurret_C, AnimGraphNode_TransitionResult) == 0x000438, "Member 'UABP_Prp_NPC_RailgunTurret_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_Prp_NPC_RailgunTurret_C, AnimGraphNode_SequencePlayer_2) == 0x000460, "Member 'UABP_Prp_NPC_RailgunTurret_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_Prp_NPC_RailgunTurret_C, AnimGraphNode_StateResult_2) == 0x0004E0, "Member 'UABP_Prp_NPC_RailgunTurret_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Prp_NPC_RailgunTurret_C, AnimGraphNode_SequencePlayer_1) == 0x000518, "Member 'UABP_Prp_NPC_RailgunTurret_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Prp_NPC_RailgunTurret_C, AnimGraphNode_StateResult_1) == 0x000598, "Member 'UABP_Prp_NPC_RailgunTurret_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Prp_NPC_RailgunTurret_C, AnimGraphNode_SequencePlayer) == 0x0005D0, "Member 'UABP_Prp_NPC_RailgunTurret_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Prp_NPC_RailgunTurret_C, AnimGraphNode_StateResult) == 0x000650, "Member 'UABP_Prp_NPC_RailgunTurret_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Prp_NPC_RailgunTurret_C, AnimGraphNode_StateMachine) == 0x000688, "Member 'UABP_Prp_NPC_RailgunTurret_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Prp_NPC_RailgunTurret_C, AnimGraphNode_ModifyBone_1) == 0x000738, "Member 'UABP_Prp_NPC_RailgunTurret_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UABP_Prp_NPC_RailgunTurret_C, AnimGraphNode_LocalToComponentSpace) == 0x000848, "Member 'UABP_Prp_NPC_RailgunTurret_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Prp_NPC_RailgunTurret_C, AnimGraphNode_ComponentToLocalSpace) == 0x000868, "Member 'UABP_Prp_NPC_RailgunTurret_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Prp_NPC_RailgunTurret_C, AnimGraphNode_ModifyBone) == 0x000888, "Member 'UABP_Prp_NPC_RailgunTurret_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_Prp_NPC_RailgunTurret_C, TurretBase) == 0x000998, "Member 'UABP_Prp_NPC_RailgunTurret_C::TurretBase' has a wrong offset!");
static_assert(offsetof(UABP_Prp_NPC_RailgunTurret_C, IsOffline) == 0x0009A0, "Member 'UABP_Prp_NPC_RailgunTurret_C::IsOffline' has a wrong offset!");
static_assert(offsetof(UABP_Prp_NPC_RailgunTurret_C, BaseAnimInstance) == 0x0009A8, "Member 'UABP_Prp_NPC_RailgunTurret_C::BaseAnimInstance' has a wrong offset!");
static_assert(offsetof(UABP_Prp_NPC_RailgunTurret_C, Pitch) == 0x0009B0, "Member 'UABP_Prp_NPC_RailgunTurret_C::Pitch' has a wrong offset!");
static_assert(offsetof(UABP_Prp_NPC_RailgunTurret_C, ActorRotation) == 0x0009BC, "Member 'UABP_Prp_NPC_RailgunTurret_C::ActorRotation' has a wrong offset!");

}

