#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Charm_Chain

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Charm_Chain.ABP_Charm_Chain_C
// 0x1480 (0x1740 - 0x02C0)
class UABP_Charm_Chain_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0038)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x0300(0x0450)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0750(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x0770(0x0450)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x0BC0(0x0450)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1010(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1030(0x0110)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x1140(0x0450)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x1590(0x0050)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x15E0(0x0110)()
	struct FVector                                Gravity_Force;                                     // 0x16F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ParentScale;                                       // 0x16FC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ImFirstPerson;                                     // 0x1708(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1709[0x7];                                     // 0x1709(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             HandTransform;                                     // 0x1710(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_Charm_Chain(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Charm_Chain_AnimGraphNode_ModifyBone_E7D5D11544C580634CB37092D26F20EA();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void GetCACharacter(class ACACharacter_MainPlayer** CACharacter);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Charm_Chain_C">();
	}
	static class UABP_Charm_Chain_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Charm_Chain_C>();
	}
};
static_assert(alignof(UABP_Charm_Chain_C) == 0x000010, "Wrong alignment on UABP_Charm_Chain_C");
static_assert(sizeof(UABP_Charm_Chain_C) == 0x001740, "Wrong size on UABP_Charm_Chain_C");
static_assert(offsetof(UABP_Charm_Chain_C, UberGraphFrame) == 0x0002C0, "Member 'UABP_Charm_Chain_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Charm_Chain_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UABP_Charm_Chain_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Charm_Chain_C, AnimGraphNode_AnimDynamics_3) == 0x000300, "Member 'UABP_Charm_Chain_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UABP_Charm_Chain_C, AnimGraphNode_ComponentToLocalSpace) == 0x000750, "Member 'UABP_Charm_Chain_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Charm_Chain_C, AnimGraphNode_AnimDynamics_2) == 0x000770, "Member 'UABP_Charm_Chain_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UABP_Charm_Chain_C, AnimGraphNode_AnimDynamics_1) == 0x000BC0, "Member 'UABP_Charm_Chain_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UABP_Charm_Chain_C, AnimGraphNode_LocalToComponentSpace) == 0x001010, "Member 'UABP_Charm_Chain_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Charm_Chain_C, AnimGraphNode_ModifyBone_1) == 0x001030, "Member 'UABP_Charm_Chain_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UABP_Charm_Chain_C, AnimGraphNode_AnimDynamics) == 0x001140, "Member 'UABP_Charm_Chain_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UABP_Charm_Chain_C, AnimGraphNode_SequenceEvaluator) == 0x001590, "Member 'UABP_Charm_Chain_C::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(UABP_Charm_Chain_C, AnimGraphNode_ModifyBone) == 0x0015E0, "Member 'UABP_Charm_Chain_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_Charm_Chain_C, Gravity_Force) == 0x0016F0, "Member 'UABP_Charm_Chain_C::Gravity_Force' has a wrong offset!");
static_assert(offsetof(UABP_Charm_Chain_C, ParentScale) == 0x0016FC, "Member 'UABP_Charm_Chain_C::ParentScale' has a wrong offset!");
static_assert(offsetof(UABP_Charm_Chain_C, ImFirstPerson) == 0x001708, "Member 'UABP_Charm_Chain_C::ImFirstPerson' has a wrong offset!");
static_assert(offsetof(UABP_Charm_Chain_C, HandTransform) == 0x001710, "Member 'UABP_Charm_Chain_C::HandTransform' has a wrong offset!");

}

