#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_EliteTank_TP_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Keaton_structs.hpp"


namespace SDK::Params
{

// Function ABP_EliteTank_TP_01.ABP_EliteTank_TP_01_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_EliteTank_TP_01_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_EliteTank_TP_01_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_EliteTank_TP_01_C_AnimGraph");
static_assert(sizeof(ABP_EliteTank_TP_01_C_AnimGraph) == 0x000010, "Wrong size on ABP_EliteTank_TP_01_C_AnimGraph");
static_assert(offsetof(ABP_EliteTank_TP_01_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_EliteTank_TP_01_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_EliteTank_TP_01.ABP_EliteTank_TP_01_C.Get Death Anim Yaw Offset
// 0x0190 (0x0190 - 0x0000)
struct ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset final
{
public:
	float                                         Yaw;                                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_InverseTransformRotation_ReturnValue;     // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_1;            // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue_1;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0080(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_InverseTransformRotation_ReturnValue_1;   // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_2;            // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue_2;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue_2;               // 0x00E0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_InverseTransformRotation_ReturnValue_2;   // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_3;            // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue_3;             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue_3;               // 0x0140(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_InverseTransformRotation_ReturnValue_3;   // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll_3;                      // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_3;                     // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_3;                       // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset) == 0x000010, "Wrong alignment on ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset");
static_assert(sizeof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset) == 0x000190, "Wrong size on ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, Yaw) == 0x000000, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::Yaw' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_ComposeRotators_ReturnValue) == 0x000010, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_InverseTransformRotation_ReturnValue) == 0x000050, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_InverseTransformRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_ComposeRotators_ReturnValue_1) == 0x00005C, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_ComposeRotators_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_BreakRotator_Roll) == 0x000068, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_BreakRotator_Pitch) == 0x00006C, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_BreakRotator_Yaw) == 0x000070, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_GetOwningActor_ReturnValue_1) == 0x000078, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_GetOwningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_GetTransform_ReturnValue_1) == 0x000080, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_InverseTransformRotation_ReturnValue_1) == 0x0000B0, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_InverseTransformRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_ComposeRotators_ReturnValue_2) == 0x0000BC, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_ComposeRotators_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_BreakRotator_Roll_1) == 0x0000C8, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_BreakRotator_Pitch_1) == 0x0000CC, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_BreakRotator_Yaw_1) == 0x0000D0, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_GetOwningActor_ReturnValue_2) == 0x0000D8, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_GetOwningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_GetTransform_ReturnValue_2) == 0x0000E0, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_GetTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_InverseTransformRotation_ReturnValue_2) == 0x000110, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_InverseTransformRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_ComposeRotators_ReturnValue_3) == 0x00011C, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_ComposeRotators_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_BreakRotator_Roll_2) == 0x000128, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_BreakRotator_Pitch_2) == 0x00012C, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_BreakRotator_Yaw_2) == 0x000130, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_GetOwningActor_ReturnValue_3) == 0x000138, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_GetOwningActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_GetTransform_ReturnValue_3) == 0x000140, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_GetTransform_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_InverseTransformRotation_ReturnValue_3) == 0x000170, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_InverseTransformRotation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, K2Node_SwitchInteger_CmpSuccess) == 0x00017C, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_BreakRotator_Roll_3) == 0x000180, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_BreakRotator_Roll_3' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_BreakRotator_Pitch_3) == 0x000184, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_BreakRotator_Pitch_3' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset, CallFunc_BreakRotator_Yaw_3) == 0x000188, "Member 'ABP_EliteTank_TP_01_C_Get_Death_Anim_Yaw_Offset::CallFunc_BreakRotator_Yaw_3' has a wrong offset!");

// Function ABP_EliteTank_TP_01.ABP_EliteTank_TP_01_C.OnHitReaction
// 0x01A0 (0x01A0 - 0x0000)
struct ABP_EliteTank_TP_01_C_OnHitReaction final
{
public:
	struct FNetworkedHit                          Hit;                                               // 0x0000(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UAnimSequenceBase*                      HitReactionAnim;                                   // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBodyPart                                     Temp_byte_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimSequenceBase*>              Temp_object_Variable;                              // 0x0078(0x0010)(ReferenceParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBodyPart                                     Temp_byte_Variable_1;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimSequenceBase*>              Temp_object_Variable_1;                            // 0x00A0(0x0010)(ReferenceParm)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimSequenceBase*>              K2Node_Select_Default;                             // 0x00C0(0x0010)(ReferenceParm)
	TArray<class UAnimSequenceBase*>              K2Node_Select_Default_1;                           // 0x00D0(0x0010)(ReferenceParm)
	TArray<class UAnimSequenceBase*>              Temp_object_Variable_2;                            // 0x00E0(0x0010)(ReferenceParm)
	EBodyPart                                     Temp_byte_Variable_2;                              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimSequenceBase*>              Temp_object_Variable_3;                            // 0x00F8(0x0010)(ReferenceParm)
	EBodyPart                                     Temp_byte_Variable_3;                              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimSequenceBase*>              K2Node_Select_Default_2;                           // 0x0110(0x0010)(ReferenceParm)
	TArray<class UAnimSequenceBase*>              Temp_object_Variable_4;                            // 0x0120(0x0010)(ReferenceParm)
	TArray<class UAnimSequenceBase*>              K2Node_Select_Default_3;                           // 0x0130(0x0010)(ReferenceParm)
	EBodyPart                                     Temp_byte_Variable_4;                              // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class UAnimSequenceBase*>              K2Node_Select_Default_4;                           // 0x0150(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_LessLess_VectorRotator_ReturnValue;       // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Get4DirectionIndex_ReturnValue;           // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      CallFunc_Array_Get_Item;                           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      CallFunc_Array_Get_Item_1;                         // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      CallFunc_Array_Get_Item_2;                         // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      CallFunc_Array_Get_Item_3;                         // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      CallFunc_Array_Get_Item_4;                         // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_EliteTank_TP_01_C_OnHitReaction) == 0x000008, "Wrong alignment on ABP_EliteTank_TP_01_C_OnHitReaction");
static_assert(sizeof(ABP_EliteTank_TP_01_C_OnHitReaction) == 0x0001A0, "Wrong size on ABP_EliteTank_TP_01_C_OnHitReaction");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, Hit) == 0x000000, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::Hit' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, HitReactionAnim) == 0x000068, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::HitReactionAnim' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, Temp_byte_Variable) == 0x000070, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, Temp_object_Variable) == 0x000078, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, K2Node_SwitchEnum_CmpSuccess) == 0x000088, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x00008C, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, Temp_byte_Variable_1) == 0x000098, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, Temp_object_Variable_1) == 0x0000A0, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, K2Node_DynamicCast_AsAnim_Montage) == 0x0000B0, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, CallFunc_Montage_Play_ReturnValue) == 0x0000BC, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, K2Node_Select_Default) == 0x0000C0, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, K2Node_Select_Default_1) == 0x0000D0, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, Temp_object_Variable_2) == 0x0000E0, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, Temp_byte_Variable_2) == 0x0000F0, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, Temp_object_Variable_3) == 0x0000F8, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, Temp_byte_Variable_3) == 0x000108, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, K2Node_Select_Default_2) == 0x000110, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, Temp_object_Variable_4) == 0x000120, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, K2Node_Select_Default_3) == 0x000130, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, Temp_byte_Variable_4) == 0x000140, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, CallFunc_MakeRotator_ReturnValue) == 0x000144, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, K2Node_Select_Default_4) == 0x000150, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, CallFunc_LessLess_VectorRotator_ReturnValue) == 0x000160, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::CallFunc_LessLess_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, CallFunc_Get4DirectionIndex_ReturnValue) == 0x00016C, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::CallFunc_Get4DirectionIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, CallFunc_Array_Get_Item) == 0x000170, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, CallFunc_Array_Get_Item_1) == 0x000178, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, CallFunc_Array_Get_Item_2) == 0x000180, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, CallFunc_Array_Get_Item_3) == 0x000188, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, CallFunc_Array_Get_Item_4) == 0x000190, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_OnHitReaction, CallFunc_IsValid_ReturnValue) == 0x000198, "Member 'ABP_EliteTank_TP_01_C_OnHitReaction::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ABP_EliteTank_TP_01.ABP_EliteTank_TP_01_C.SelectDeathAnimSequence
// 0x0620 (0x0620 - 0x0000)
struct ABP_EliteTank_TP_01_C_SelectDeathAnimSequence final
{
public:
	class ACACharacter*                           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpec                    DeathGameplayEffectSpec;                           // 0x0008(0x0298)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         DamageMagnitude;                                   // 0x02A0(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkedHit                          NetworkedHit;                                      // 0x02A8(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	TArray<class FString>                         DirNames;                                          // 0x0310(0x0010)(Edit, BlueprintVisible)
	class FString                                 DeathAnimType;                                     // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	EBodyPart                                     Temp_byte_Variable;                                // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimSequenceBase*>              Temp_object_Variable;                              // 0x0338(0x0010)(ReferenceParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x034C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x035C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBodyPart                                     Temp_byte_Variable_1;                              // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimSequenceBase*>              Temp_object_Variable_1;                            // 0x0370(0x0010)(ReferenceParm)
	EBodyPart                                     Temp_byte_Variable_2;                              // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimSequenceBase*>              Temp_object_Variable_2;                            // 0x0388(0x0010)(ReferenceParm)
	EBodyPart                                     Temp_byte_Variable_3;                              // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimSequenceBase*>              Temp_object_Variable_3;                            // 0x03A0(0x0010)(ReferenceParm)
	EBodyPart                                     Temp_byte_Variable_4;                              // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimSequenceBase*>              Temp_object_Variable_4;                            // 0x03B8(0x0010)(ReferenceParm)
	EBodyPart                                     Temp_byte_Variable_5;                              // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimSequenceBase*>              Temp_object_Variable_5;                            // 0x03D0(0x0010)(ReferenceParm)
	EBodyPart                                     Temp_byte_Variable_6;                              // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimSequenceBase*>              Temp_object_Variable_6;                            // 0x03E8(0x0010)(ReferenceParm)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x03F8(0x0010)(ReferenceParm)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x0408(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0410(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0440(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x044C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0458(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0464(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0470(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0488(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0494(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x04A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x04AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4AD[0x3];                                      // 0x04AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_Select_Default;                             // 0x04B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x04BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BD[0x3];                                      // 0x04BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimSequenceBase*>              K2Node_Select_Default_1;                           // 0x04C0(0x0010)(ReferenceParm)
	struct FVector                                K2Node_Select_Default_2;                           // 0x04D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DC[0x4];                                      // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      CallFunc_Array_Get_Item;                           // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_LessLess_VectorRotator_ReturnValue;       // 0x04E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Get4DirectionIndex_ReturnValue;           // 0x04F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimSequenceBase*>              K2Node_Select_Default_3;                           // 0x04F8(0x0010)(ReferenceParm)
	TArray<class UAnimSequenceBase*>              Temp_object_Variable_7;                            // 0x0508(0x0010)(ReferenceParm)
	class UAnimSequenceBase*                      CallFunc_Array_Get_Item_1;                         // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBodyPart                                     Temp_byte_Variable_7;                              // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_521[0x7];                                      // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimSequenceBase*>              Temp_object_Variable_8;                            // 0x0528(0x0010)(ReferenceParm)
	EBodyPart                                     Temp_byte_Variable_8;                              // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimSequenceBase*>              K2Node_Select_Default_4;                           // 0x0540(0x0010)(ReferenceParm)
	class UAnimSequenceBase*                      CallFunc_Array_Get_Item_2;                         // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimSequenceBase*>              K2Node_Select_Default_5;                           // 0x0558(0x0010)(ReferenceParm)
	class UAnimSequenceBase*                      CallFunc_Array_Get_Item_3;                         // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimSequenceBase*>              K2Node_Select_Default_6;                           // 0x0570(0x0010)(ReferenceParm)
	class UAnimSequenceBase*                      CallFunc_Array_Get_Item_4;                         // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimSequenceBase*>              Temp_object_Variable_9;                            // 0x0588(0x0010)(ReferenceParm)
	TArray<class UAnimSequenceBase*>              K2Node_Select_Default_7;                           // 0x0598(0x0010)(ReferenceParm)
	class UAnimSequenceBase*                      CallFunc_Array_Get_Item_5;                         // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimSequenceBase*>              K2Node_Select_Default_8;                           // 0x05B0(0x0010)(ReferenceParm)
	class UAnimSequenceBase*                      CallFunc_Array_Get_Item_6;                         // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBodyPart                                     Temp_byte_Variable_9;                              // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C9[0x7];                                      // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimSequenceBase*>              K2Node_Select_Default_9;                           // 0x05D0(0x0010)(ReferenceParm)
	class UAnimSequenceBase*                      CallFunc_Array_Get_Item_7;                         // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimSequenceBase*>              K2Node_Select_Default_10;                          // 0x05E8(0x0010)(ReferenceParm)
	class UAnimSequenceBase*                      CallFunc_Array_Get_Item_8;                         // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_601[0x7];                                      // 0x0601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimSequenceBase*>              K2Node_Select_Default_11;                          // 0x0608(0x0010)(ReferenceParm)
	class UAnimSequenceBase*                      CallFunc_Array_Get_Item_9;                         // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence) == 0x000010, "Wrong alignment on ABP_EliteTank_TP_01_C_SelectDeathAnimSequence");
static_assert(sizeof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence) == 0x000620, "Wrong size on ABP_EliteTank_TP_01_C_SelectDeathAnimSequence");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, Character) == 0x000000, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::Character' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, DeathGameplayEffectSpec) == 0x000008, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::DeathGameplayEffectSpec' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, DamageMagnitude) == 0x0002A0, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::DamageMagnitude' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, NetworkedHit) == 0x0002A8, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::NetworkedHit' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, DirNames) == 0x000310, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::DirNames' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, DeathAnimType) == 0x000320, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::DeathAnimType' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, Temp_byte_Variable) == 0x000330, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, Temp_object_Variable) == 0x000338, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, K2Node_SwitchEnum_CmpSuccess) == 0x000348, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00034C, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_IsValid_ReturnValue) == 0x000358, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x00035C, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, Temp_byte_Variable_1) == 0x000368, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, Temp_object_Variable_1) == 0x000370, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, Temp_byte_Variable_2) == 0x000380, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, Temp_object_Variable_2) == 0x000388, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, Temp_byte_Variable_3) == 0x000398, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, Temp_object_Variable_3) == 0x0003A0, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, Temp_byte_Variable_4) == 0x0003B0, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, Temp_object_Variable_4) == 0x0003B8, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, Temp_byte_Variable_5) == 0x0003C8, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, Temp_object_Variable_5) == 0x0003D0, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, Temp_byte_Variable_6) == 0x0003E0, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, Temp_object_Variable_6) == 0x0003E8, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, K2Node_MakeArray_Array) == 0x0003F8, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_GetOwningComponent_ReturnValue) == 0x000408, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_GetSocketTransform_ReturnValue) == 0x000410, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_BreakTransform_Location) == 0x000440, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_BreakTransform_Rotation) == 0x00044C, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_BreakTransform_Scale) == 0x000458, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_ComposeRotators_ReturnValue) == 0x000464, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000470, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_BreakRotator_Roll) == 0x00047C, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_BreakRotator_Pitch) == 0x000480, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_BreakRotator_Yaw) == 0x000484, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_Normal_ReturnValue) == 0x000488, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_MakeRotator_ReturnValue) == 0x000494, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_MakeRotFromX_ReturnValue) == 0x0004A0, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, Temp_bool_Variable) == 0x0004AC, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, K2Node_Select_Default) == 0x0004B0, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, Temp_bool_Variable_1) == 0x0004BC, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, K2Node_Select_Default_1) == 0x0004C0, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, K2Node_Select_Default_2) == 0x0004D0, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_Array_Get_Item) == 0x0004E0, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_LessLess_VectorRotator_ReturnValue) == 0x0004E8, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_LessLess_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_Get4DirectionIndex_ReturnValue) == 0x0004F4, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_Get4DirectionIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, K2Node_Select_Default_3) == 0x0004F8, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, Temp_object_Variable_7) == 0x000508, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_Array_Get_Item_1) == 0x000518, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, Temp_byte_Variable_7) == 0x000520, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, Temp_object_Variable_8) == 0x000528, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, Temp_byte_Variable_8) == 0x000538, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, K2Node_Select_Default_4) == 0x000540, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_Array_Get_Item_2) == 0x000550, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, K2Node_Select_Default_5) == 0x000558, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_Array_Get_Item_3) == 0x000568, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, K2Node_Select_Default_6) == 0x000570, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_Array_Get_Item_4) == 0x000580, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, Temp_object_Variable_9) == 0x000588, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, K2Node_Select_Default_7) == 0x000598, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_Array_Get_Item_5) == 0x0005A8, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, K2Node_Select_Default_8) == 0x0005B0, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_Array_Get_Item_6) == 0x0005C0, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, Temp_byte_Variable_9) == 0x0005C8, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, K2Node_Select_Default_9) == 0x0005D0, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::K2Node_Select_Default_9' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_Array_Get_Item_7) == 0x0005E0, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, K2Node_Select_Default_10) == 0x0005E8, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::K2Node_Select_Default_10' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_Array_Get_Item_8) == 0x0005F8, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_Array_Get_Item_8' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_IsValid_ReturnValue_1) == 0x000600, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, K2Node_Select_Default_11) == 0x000608, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::K2Node_Select_Default_11' has a wrong offset!");
static_assert(offsetof(ABP_EliteTank_TP_01_C_SelectDeathAnimSequence, CallFunc_Array_Get_Item_9) == 0x000618, "Member 'ABP_EliteTank_TP_01_C_SelectDeathAnimSequence::CallFunc_Array_Get_Item_9' has a wrong offset!");

// Function ABP_EliteTank_TP_01.ABP_EliteTank_TP_01_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_EliteTank_TP_01_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_EliteTank_TP_01_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_EliteTank_TP_01_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_EliteTank_TP_01_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_EliteTank_TP_01_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_EliteTank_TP_01_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_EliteTank_TP_01_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_EliteTank_TP_01.ABP_EliteTank_TP_01_C.OnDeath
// 0x0318 (0x0318 - 0x0000)
struct ABP_EliteTank_TP_01_C_OnDeath final
{
public:
	class ACACharacter*                           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpec                    Death_gameplay_effect_spec;                        // 0x0008(0x0298)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         Damage_magnitude;                                  // 0x02A0(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkedHit                          Networked_hit;                                     // 0x02A8(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
