#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Human_PostProcess

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_Human_PostProcess.ABP_Human_PostProcess_C.ExecuteUbergraph_ABP_Human_PostProcess
// 0x0078 (0x0078 - 0x0000)
struct ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInZeroG_ReturnValue;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_1;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player_1;    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSpecificPawnMesh_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetSpecificPawnMesh_ReturnValue_1;        // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess) == 0x000008, "Wrong alignment on ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess");
static_assert(sizeof(ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess) == 0x000078, "Wrong size on ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess");
static_assert(offsetof(ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess, EntryPoint) == 0x000000, "Member 'ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess, CallFunc_SelectFloat_ReturnValue) == 0x000004, "Member 'ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess, CallFunc_SelectFloat_ReturnValue_1) == 0x000008, "Member 'ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess, K2Node_Event_DeltaTimeX) == 0x00000C, "Member 'ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000010, "Member 'ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x000020, "Member 'ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess, CallFunc_IsInZeroG_ReturnValue) == 0x000029, "Member 'ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess::CallFunc_IsInZeroG_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess, CallFunc_SelectVector_ReturnValue) == 0x00002C, "Member 'ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess, CallFunc_TryGetPawnOwner_ReturnValue_1) == 0x000038, "Member 'ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess::CallFunc_TryGetPawnOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess, K2Node_DynamicCast_AsCACharacter_Main_Player_1) == 0x000048, "Member 'ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess::K2Node_DynamicCast_AsCACharacter_Main_Player_1' has a wrong offset!");
static_assert(offsetof(ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess, CallFunc_GetSpecificPawnMesh_ReturnValue) == 0x000058, "Member 'ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess::CallFunc_GetSpecificPawnMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess, CallFunc_GetSpecificPawnMesh_ReturnValue_1) == 0x000060, "Member 'ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess::CallFunc_GetSpecificPawnMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess, CallFunc_GetOwningComponent_ReturnValue) == 0x000068, "Member 'ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000070, "Member 'ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000071, "Member 'ABP_Human_PostProcess_C_ExecuteUbergraph_ABP_Human_PostProcess::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");

// Function ABP_Human_PostProcess.ABP_Human_PostProcess_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Human_PostProcess_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Human_PostProcess_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Human_PostProcess_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Human_PostProcess_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Human_PostProcess_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Human_PostProcess_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Human_PostProcess_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Human_PostProcess.ABP_Human_PostProcess_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct ABP_Human_PostProcess_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Human_PostProcess_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Human_PostProcess_C_AnimGraph");
static_assert(sizeof(ABP_Human_PostProcess_C_AnimGraph) == 0x000020, "Wrong size on ABP_Human_PostProcess_C_AnimGraph");
static_assert(offsetof(ABP_Human_PostProcess_C_AnimGraph, InPose) == 0x000000, "Member 'ABP_Human_PostProcess_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(ABP_Human_PostProcess_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'ABP_Human_PostProcess_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

