#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AN_NPCSpawnProjectileDownward

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AN_NPCSpawnProjectileDownward.AN_NPCSpawnProjectileDownward_C.Received_Notify
// 0x0110 (0x0110 - 0x0000)
struct AN_NPCSpawnProjectileDownward_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Downward_Velocity;                                 // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Target_Location;                                   // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAProjectileBase*                      Spawned_Projectile;                                // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Launch_Location;                                   // 0x0038(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_NPC*                       NPC;                                               // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_NPC*                       K2Node_DynamicCast_AsCACharacter_NPC;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAAIController*                        K2Node_DynamicCast_AsCAAIController;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UCAComponent_NPCTargetManager*    CallFunc_GetNPCTargetManager_ReturnValue;          // 0x0088(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAProjectileMovementComponent*         CallFunc_GetProjectileMovementComponent_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetGrenadeLaunchLocation_ReturnValue;     // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAProjectileMovementComponent*         CallFunc_GetProjectileMovementComponent_ReturnValue_1; // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAProjectileBase*                      CallFunc_FinishSpawningActor_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AN_NPCSpawnProjectileDownward_C_Received_Notify) == 0x000010, "Wrong alignment on AN_NPCSpawnProjectileDownward_C_Received_Notify");
static_assert(sizeof(AN_NPCSpawnProjectileDownward_C_Received_Notify) == 0x000110, "Wrong size on AN_NPCSpawnProjectileDownward_C_Received_Notify");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, MeshComp) == 0x000000, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, Animation) == 0x000008, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, ReturnValue) == 0x000010, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, Downward_Velocity) == 0x000014, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::Downward_Velocity' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, Target_Location) == 0x000020, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::Target_Location' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, Spawned_Projectile) == 0x000030, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::Spawned_Projectile' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, Launch_Location) == 0x000038, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::Launch_Location' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, NPC) == 0x000048, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::NPC' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000050, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, CallFunc_IsValidClass_ReturnValue) == 0x000059, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, CallFunc_HasAuthority_ReturnValue) == 0x00005A, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, K2Node_DynamicCast_AsCACharacter_NPC) == 0x000060, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::K2Node_DynamicCast_AsCACharacter_NPC' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, CallFunc_GetAIController_ReturnValue) == 0x000070, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::CallFunc_GetAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, K2Node_DynamicCast_AsCAAIController) == 0x000078, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::K2Node_DynamicCast_AsCAAIController' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, CallFunc_GetNPCTargetManager_ReturnValue) == 0x000088, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::CallFunc_GetNPCTargetManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, CallFunc_GetProjectileMovementComponent_ReturnValue) == 0x000090, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::CallFunc_GetProjectileMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, CallFunc_GetGrenadeLaunchLocation_ReturnValue) == 0x000098, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::CallFunc_GetGrenadeLaunchLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, CallFunc_Add_VectorVector_ReturnValue) == 0x0000A4, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, CallFunc_GetProjectileMovementComponent_ReturnValue_1) == 0x0000B0, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::CallFunc_GetProjectileMovementComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, CallFunc_IsValid_ReturnValue_1) == 0x0000B8, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x0000C0, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000F0, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000F8, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_Received_Notify, CallFunc_IsValid_ReturnValue_2) == 0x000100, "Member 'AN_NPCSpawnProjectileDownward_C_Received_Notify::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function AN_NPCSpawnProjectileDownward.AN_NPCSpawnProjectileDownward_C.MakeItIgnoreTankShield
// 0x0030 (0x0030 - 0x0000)
struct AN_NPCSpawnProjectileDownward_C_MakeItIgnoreTankShield final
{
public:
	class ACAProjectileBase*                      Spawned_Projectile;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_NPC*                       NPC;                                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_NPC_EliteTank_C*                    K2Node_DynamicCast_AsBP_NPC_Elite_Tank;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAProjectileAoeComponent*              CallFunc_GetProjectileAOEComponent_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AN_NPCSpawnProjectileDownward_C_MakeItIgnoreTankShield) == 0x000008, "Wrong alignment on AN_NPCSpawnProjectileDownward_C_MakeItIgnoreTankShield");
static_assert(sizeof(AN_NPCSpawnProjectileDownward_C_MakeItIgnoreTankShield) == 0x000030, "Wrong size on AN_NPCSpawnProjectileDownward_C_MakeItIgnoreTankShield");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_MakeItIgnoreTankShield, Spawned_Projectile) == 0x000000, "Member 'AN_NPCSpawnProjectileDownward_C_MakeItIgnoreTankShield::Spawned_Projectile' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_MakeItIgnoreTankShield, NPC) == 0x000008, "Member 'AN_NPCSpawnProjectileDownward_C_MakeItIgnoreTankShield::NPC' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_MakeItIgnoreTankShield, K2Node_DynamicCast_AsBP_NPC_Elite_Tank) == 0x000010, "Member 'AN_NPCSpawnProjectileDownward_C_MakeItIgnoreTankShield::K2Node_DynamicCast_AsBP_NPC_Elite_Tank' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_MakeItIgnoreTankShield, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AN_NPCSpawnProjectileDownward_C_MakeItIgnoreTankShield::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_MakeItIgnoreTankShield, CallFunc_GetProjectileAOEComponent_ReturnValue) == 0x000020, "Member 'AN_NPCSpawnProjectileDownward_C_MakeItIgnoreTankShield::CallFunc_GetProjectileAOEComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_NPCSpawnProjectileDownward_C_MakeItIgnoreTankShield, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'AN_NPCSpawnProjectileDownward_C_MakeItIgnoreTankShield::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

