#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ANS_PlayReviveeAudio

#include "Basic.hpp"

#include "CAAudio_structs.hpp"


namespace SDK::Params
{

// Function ANS_PlayReviveeAudio.ANS_PlayReviveeAudio_C.Received_NotifyBegin
// 0x0050 (0x0050 - 0x0000)
struct ANS_PlayReviveeAudio_C_Received_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0018(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0038(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMeshDealingWithAnimNotifies_ReturnValue; // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ANS_PlayReviveeAudio_C_Received_NotifyBegin) == 0x000008, "Wrong alignment on ANS_PlayReviveeAudio_C_Received_NotifyBegin");
static_assert(sizeof(ANS_PlayReviveeAudio_C_Received_NotifyBegin) == 0x000050, "Wrong size on ANS_PlayReviveeAudio_C_Received_NotifyBegin");
static_assert(offsetof(ANS_PlayReviveeAudio_C_Received_NotifyBegin, MeshComp) == 0x000000, "Member 'ANS_PlayReviveeAudio_C_Received_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(ANS_PlayReviveeAudio_C_Received_NotifyBegin, Animation) == 0x000008, "Member 'ANS_PlayReviveeAudio_C_Received_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(ANS_PlayReviveeAudio_C_Received_NotifyBegin, TotalDuration) == 0x000010, "Member 'ANS_PlayReviveeAudio_C_Received_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(ANS_PlayReviveeAudio_C_Received_NotifyBegin, ReturnValue) == 0x000014, "Member 'ANS_PlayReviveeAudio_C_Received_NotifyBegin::ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_PlayReviveeAudio_C_Received_NotifyBegin, Temp_delegate_Variable) == 0x000018, "Member 'ANS_PlayReviveeAudio_C_Received_NotifyBegin::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(ANS_PlayReviveeAudio_C_Received_NotifyBegin, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'ANS_PlayReviveeAudio_C_Received_NotifyBegin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_PlayReviveeAudio_C_Received_NotifyBegin, CallFunc_GetOwner_ReturnValue) == 0x000030, "Member 'ANS_PlayReviveeAudio_C_Received_NotifyBegin::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_PlayReviveeAudio_C_Received_NotifyBegin, CallFunc_PlayEvent_playback_instance) == 0x000038, "Member 'ANS_PlayReviveeAudio_C_Received_NotifyBegin::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(ANS_PlayReviveeAudio_C_Received_NotifyBegin, CallFunc_PlayEvent_play_success) == 0x000048, "Member 'ANS_PlayReviveeAudio_C_Received_NotifyBegin::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(ANS_PlayReviveeAudio_C_Received_NotifyBegin, CallFunc_IsMeshDealingWithAnimNotifies_ReturnValue) == 0x000049, "Member 'ANS_PlayReviveeAudio_C_Received_NotifyBegin::CallFunc_IsMeshDealingWithAnimNotifies_ReturnValue' has a wrong offset!");

// Function ANS_PlayReviveeAudio.ANS_PlayReviveeAudio_C.Received_NotifyEnd
// 0x0050 (0x0050 - 0x0000)
struct ANS_PlayReviveeAudio_C_Received_NotifyEnd final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0014(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0038(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMeshDealingWithAnimNotifies_ReturnValue; // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ANS_PlayReviveeAudio_C_Received_NotifyEnd) == 0x000008, "Wrong alignment on ANS_PlayReviveeAudio_C_Received_NotifyEnd");
static_assert(sizeof(ANS_PlayReviveeAudio_C_Received_NotifyEnd) == 0x000050, "Wrong size on ANS_PlayReviveeAudio_C_Received_NotifyEnd");
static_assert(offsetof(ANS_PlayReviveeAudio_C_Received_NotifyEnd, MeshComp) == 0x000000, "Member 'ANS_PlayReviveeAudio_C_Received_NotifyEnd::MeshComp' has a wrong offset!");
static_assert(offsetof(ANS_PlayReviveeAudio_C_Received_NotifyEnd, Animation) == 0x000008, "Member 'ANS_PlayReviveeAudio_C_Received_NotifyEnd::Animation' has a wrong offset!");
static_assert(offsetof(ANS_PlayReviveeAudio_C_Received_NotifyEnd, ReturnValue) == 0x000010, "Member 'ANS_PlayReviveeAudio_C_Received_NotifyEnd::ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_PlayReviveeAudio_C_Received_NotifyEnd, Temp_delegate_Variable) == 0x000014, "Member 'ANS_PlayReviveeAudio_C_Received_NotifyEnd::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(ANS_PlayReviveeAudio_C_Received_NotifyEnd, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'ANS_PlayReviveeAudio_C_Received_NotifyEnd::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_PlayReviveeAudio_C_Received_NotifyEnd, CallFunc_GetOwner_ReturnValue) == 0x000030, "Member 'ANS_PlayReviveeAudio_C_Received_NotifyEnd::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_PlayReviveeAudio_C_Received_NotifyEnd, CallFunc_PlayEvent_playback_instance) == 0x000038, "Member 'ANS_PlayReviveeAudio_C_Received_NotifyEnd::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(ANS_PlayReviveeAudio_C_Received_NotifyEnd, CallFunc_PlayEvent_play_success) == 0x000048, "Member 'ANS_PlayReviveeAudio_C_Received_NotifyEnd::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(ANS_PlayReviveeAudio_C_Received_NotifyEnd, CallFunc_IsMeshDealingWithAnimNotifies_ReturnValue) == 0x000049, "Member 'ANS_PlayReviveeAudio_C_Received_NotifyEnd::CallFunc_IsMeshDealingWithAnimNotifies_ReturnValue' has a wrong offset!");

}

