#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ability_Untouchable_Shield_1P

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Ability_Untouchable_Shield_3P_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Ability_Untouchable_Shield_1P.BP_Ability_Untouchable_Shield_1P_C
// 0x0020 (0x02A8 - 0x0288)
class ABP_Ability_Untouchable_Shield_1P_C final : public ABP_Ability_Untouchable_Shield_3P_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Ability_Untouchable_Shield_1P_C; // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      OneP_ShieldVFX;                                    // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 OnePMesh;                                          // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCANiagaraComponentFOV*                 WristAR;                                           // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Ability_Untouchable_Shield_1P(int32 EntryPoint);
	void ActivateShieldVFX();
	void FinishVFX_1();
	void OnShieldHit(const struct FVector& Hit_location, float Absorbed_damage_percentage);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Ability_Untouchable_Shield_1P_C">();
	}
	static class ABP_Ability_Untouchable_Shield_1P_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Ability_Untouchable_Shield_1P_C>();
	}
};
static_assert(alignof(ABP_Ability_Untouchable_Shield_1P_C) == 0x000008, "Wrong alignment on ABP_Ability_Untouchable_Shield_1P_C");
static_assert(sizeof(ABP_Ability_Untouchable_Shield_1P_C) == 0x0002A8, "Wrong size on ABP_Ability_Untouchable_Shield_1P_C");
static_assert(offsetof(ABP_Ability_Untouchable_Shield_1P_C, UberGraphFrame_BP_Ability_Untouchable_Shield_1P_C) == 0x000288, "Member 'ABP_Ability_Untouchable_Shield_1P_C::UberGraphFrame_BP_Ability_Untouchable_Shield_1P_C' has a wrong offset!");
static_assert(offsetof(ABP_Ability_Untouchable_Shield_1P_C, OneP_ShieldVFX) == 0x000290, "Member 'ABP_Ability_Untouchable_Shield_1P_C::OneP_ShieldVFX' has a wrong offset!");
static_assert(offsetof(ABP_Ability_Untouchable_Shield_1P_C, OnePMesh) == 0x000298, "Member 'ABP_Ability_Untouchable_Shield_1P_C::OnePMesh' has a wrong offset!");
static_assert(offsetof(ABP_Ability_Untouchable_Shield_1P_C, WristAR) == 0x0002A0, "Member 'ABP_Ability_Untouchable_Shield_1P_C::WristAR' has a wrong offset!");

}

