#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ArmourBreak

#include "Basic.hpp"

#include "CAAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_ArmourBreak.BP_ArmourBreak_C.ExecuteUbergraph_BP_ArmourBreak
// 0x00B8 (0x00B8 - 0x0000)
struct BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0004(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsFirstPerson;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PostProcess_Armour_Break_C*         CallFunc_SpawnCAAttachedEffect_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x0040(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0068(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x0080(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player_1;    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSpecificPawnMesh_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCANiagaraComponentFOV*                 CallFunc_SpawnCANiagaraFOVSystemAttached_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak) == 0x000008, "Wrong alignment on BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak");
static_assert(sizeof(BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak) == 0x0000B8, "Wrong size on BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak");
static_assert(offsetof(BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak, EntryPoint) == 0x000000, "Member 'BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak, Temp_delegate_Variable) == 0x000004, "Member 'BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak, CallFunc_IsDedicatedServer_ReturnValue) == 0x000019, "Member 'BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak, K2Node_CustomEvent_IsFirstPerson) == 0x00001A, "Member 'BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak::K2Node_CustomEvent_IsFirstPerson' has a wrong offset!");
static_assert(offsetof(BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x000020, "Member 'BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000030, "Member 'BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak, CallFunc_SpawnCAAttachedEffect_ReturnValue) == 0x000038, "Member 'BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak::CallFunc_SpawnCAAttachedEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak, Temp_delegate_Variable_1) == 0x000040, "Member 'BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000058, "Member 'BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue) == 0x000060, "Member 'BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak, CallFunc_PlayEvent_playback_instance) == 0x000068, "Member 'BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak, CallFunc_PlayEvent_play_success) == 0x000078, "Member 'BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak, CallFunc_PlayEvent_playback_instance_1) == 0x000080, "Member 'BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak, CallFunc_PlayEvent_play_success_1) == 0x000090, "Member 'BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak::CallFunc_PlayEvent_play_success_1' has a wrong offset!");
static_assert(offsetof(BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak, K2Node_DynamicCast_AsCACharacter_Main_Player_1) == 0x000098, "Member 'BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak::K2Node_DynamicCast_AsCACharacter_Main_Player_1' has a wrong offset!");
static_assert(offsetof(BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak, CallFunc_GetSpecificPawnMesh_ReturnValue) == 0x0000A8, "Member 'BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak::CallFunc_GetSpecificPawnMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak, CallFunc_SpawnCANiagaraFOVSystemAttached_ReturnValue) == 0x0000B0, "Member 'BP_ArmourBreak_C_ExecuteUbergraph_BP_ArmourBreak::CallFunc_SpawnCANiagaraFOVSystemAttached_ReturnValue' has a wrong offset!");

// Function BP_ArmourBreak.BP_ArmourBreak_C.OnArmourBreak
// 0x0001 (0x0001 - 0x0000)
struct BP_ArmourBreak_C_OnArmourBreak final
{
public:
	bool                                          IsFirstPerson;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ArmourBreak_C_OnArmourBreak) == 0x000001, "Wrong alignment on BP_ArmourBreak_C_OnArmourBreak");
static_assert(sizeof(BP_ArmourBreak_C_OnArmourBreak) == 0x000001, "Wrong size on BP_ArmourBreak_C_OnArmourBreak");
static_assert(offsetof(BP_ArmourBreak_C_OnArmourBreak, IsFirstPerson) == 0x000000, "Member 'BP_ArmourBreak_C_OnArmourBreak::IsFirstPerson' has a wrong offset!");

}

