#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ability_Untouchable_Shield_3P

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Keaton_structs.hpp"


namespace SDK::Params
{

// Function BP_Ability_Untouchable_Shield_3P.BP_Ability_Untouchable_Shield_3P_C.ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P
// 0x0050 (0x0050 - 0x0000)
struct BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_hit_location;                         // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_absorbed_damage_percentage;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCATeamID                              CallFunc_GetTeamID_ReturnValue;                    // 0x0028(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayer_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCATeamID                              CallFunc_GetTeamID_ReturnValue_1;                  // 0x0038(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TeamIDTeamID_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P) == 0x000008, "Wrong alignment on BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P");
static_assert(sizeof(BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P) == 0x000050, "Wrong size on BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P");
static_assert(offsetof(BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P, EntryPoint) == 0x000000, "Member 'BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P, CallFunc_IsValid_ReturnValue_2) == 0x000006, "Member 'BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P, K2Node_Event_hit_location) == 0x000008, "Member 'BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P::K2Node_Event_hit_location' has a wrong offset!");
static_assert(offsetof(BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P, K2Node_Event_absorbed_damage_percentage) == 0x000014, "Member 'BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P::K2Node_Event_absorbed_damage_percentage' has a wrong offset!");
static_assert(offsetof(BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P, CallFunc_FClamp_ReturnValue) == 0x000018, "Member 'BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P, CallFunc_GetAttachParentActor_ReturnValue) == 0x000020, "Member 'BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P, CallFunc_GetTeamID_ReturnValue) == 0x000028, "Member 'BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P, CallFunc_GetLocalPlayer_ReturnValue) == 0x000030, "Member 'BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P::CallFunc_GetLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P, CallFunc_GetTeamID_ReturnValue_1) == 0x000038, "Member 'BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P::CallFunc_GetTeamID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue) == 0x000040, "Member 'BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P, CallFunc_EqualEqual_TeamIDTeamID_ReturnValue) == 0x000048, "Member 'BP_Ability_Untouchable_Shield_3P_C_ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P::CallFunc_EqualEqual_TeamIDTeamID_ReturnValue' has a wrong offset!");

// Function BP_Ability_Untouchable_Shield_3P.BP_Ability_Untouchable_Shield_3P_C.OnShieldHit
// 0x0010 (0x0010 - 0x0000)
struct BP_Ability_Untouchable_Shield_3P_C_OnShieldHit final
{
public:
	struct FVector                                Hit_location;                                      // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Absorbed_damage_percentage;                        // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Ability_Untouchable_Shield_3P_C_OnShieldHit) == 0x000004, "Wrong alignment on BP_Ability_Untouchable_Shield_3P_C_OnShieldHit");
static_assert(sizeof(BP_Ability_Untouchable_Shield_3P_C_OnShieldHit) == 0x000010, "Wrong size on BP_Ability_Untouchable_Shield_3P_C_OnShieldHit");
static_assert(offsetof(BP_Ability_Untouchable_Shield_3P_C_OnShieldHit, Hit_location) == 0x000000, "Member 'BP_Ability_Untouchable_Shield_3P_C_OnShieldHit::Hit_location' has a wrong offset!");
static_assert(offsetof(BP_Ability_Untouchable_Shield_3P_C_OnShieldHit, Absorbed_damage_percentage) == 0x00000C, "Member 'BP_Ability_Untouchable_Shield_3P_C_OnShieldHit::Absorbed_damage_percentage' has a wrong offset!");

}

