#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AmputationEffect_Base

#include "Basic.hpp"

#include "Keaton_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CAAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AmputationEffect_Base.BP_AmputationEffect_Base_C.ExecuteUbergraph_BP_AmputationEffect_Base
// 0x0358 (0x0358 - 0x0000)
struct BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeQualityInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              K2Node_CustomEvent_SurfaceType;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_HitResult;                      // 0x001C(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FCATraceAuxiliaryResult                K2Node_CustomEvent_AuxiliaryResult;                // 0x00AC(0x000C)(NoDestructor)
	int32                                         CallFunc_MakeQualityInt_ReturnValue_1;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetImpactReflectionRoll_rotation_degrees; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetImpactReflectionNormal_reflection_normal; // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsImpactGlancing_is_glancing;             // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPhysicalSurface SurfaceType, const struct FHitResult& HitResult, const struct FCATraceAuxiliaryResult& AuxiliaryResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x0154(0x0014)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_Event_skeletal_mesh_component;              // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAAmputationLimb                             K2Node_Event_limb;                                 // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkedHit                          K2Node_Event_last_hit;                             // 0x0180(0x0068)(NoDestructor)
	class UCAAmputationSet*                       K2Node_Event_amputation_set;                       // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAEffectProp*                          CallFunc_AmputateLimb_ReturnValue;                 // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_202[0x2];                                      // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRelativePositionForLimb_ReturnValue;   // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetAttachmentBoneNameForLimb_ReturnValue; // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetRelativeRotationForLimb_ReturnValue;   // 0x022C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue_1;       // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0274(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEventInWorld_playback_instance;       // 0x02C0(0x0010)()
	bool                                          CallFunc_PlayEventInWorld_play_success;            // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        CallFunc_ZeroGCascadeSwitch_ReturnValue;           // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnCACascadeSystemAttached_ReturnValue; // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x02F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_SpawnCADecalAtImpact_out_material_instance; // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0318(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0330(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0340(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TraceAuxiliaryConeAsync_ReturnValue;      // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34D[0x3];                                      // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_SpawnCADecalAtImpact_out_material_instance_1; // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base) == 0x000008, "Wrong alignment on BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base");
static_assert(sizeof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base) == 0x000358, "Wrong size on BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, EntryPoint) == 0x000000, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_MakeLiteralInt_ReturnValue) == 0x000008, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00000C, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_MakeQualityInt_ReturnValue) == 0x000010, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_MakeQualityInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, K2Node_CustomEvent_SurfaceType) == 0x000018, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::K2Node_CustomEvent_SurfaceType' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, K2Node_CustomEvent_HitResult) == 0x00001C, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::K2Node_CustomEvent_HitResult' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, K2Node_CustomEvent_AuxiliaryResult) == 0x0000AC, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::K2Node_CustomEvent_AuxiliaryResult' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_MakeQualityInt_ReturnValue_1) == 0x0000B8, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_MakeQualityInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_GetImpactReflectionRoll_rotation_degrees) == 0x0000BC, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_GetImpactReflectionRoll_rotation_degrees' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_GetImpactReflectionNormal_reflection_normal) == 0x0000C0, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_GetImpactReflectionNormal_reflection_normal' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_BreakHitResult_bBlockingHit) == 0x0000CC, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000CD, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_BreakHitResult_Time) == 0x0000D0, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_BreakHitResult_Distance) == 0x0000D4, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_BreakHitResult_Location) == 0x0000D8, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_BreakHitResult_ImpactPoint) == 0x0000E4, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_BreakHitResult_Normal) == 0x0000F0, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_BreakHitResult_ImpactNormal) == 0x0000FC, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_BreakHitResult_PhysMat) == 0x000108, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_BreakHitResult_HitActor) == 0x000110, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_BreakHitResult_HitComponent) == 0x000118, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_BreakHitResult_HitBoneName) == 0x000120, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_BreakHitResult_HitItem) == 0x00012C, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_BreakHitResult_ElementIndex) == 0x000130, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_BreakHitResult_FaceIndex) == 0x000134, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_BreakHitResult_TraceStart) == 0x000138, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_BreakHitResult_TraceEnd) == 0x000144, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_IsImpactGlancing_is_glancing) == 0x000150, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_IsImpactGlancing_is_glancing' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000154, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000168, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, K2Node_Event_skeletal_mesh_component) == 0x000170, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::K2Node_Event_skeletal_mesh_component' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, K2Node_Event_limb) == 0x000178, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::K2Node_Event_limb' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, K2Node_Event_last_hit) == 0x000180, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::K2Node_Event_last_hit' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, K2Node_Event_amputation_set) == 0x0001E8, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::K2Node_Event_amputation_set' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, Temp_int_Variable) == 0x0001F0, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_AmputateLimb_ReturnValue) == 0x0001F8, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_AmputateLimb_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_IsValid_ReturnValue) == 0x000200, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000201, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_Add_IntInt_ReturnValue) == 0x000204, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_GetRelativePositionForLimb_ReturnValue) == 0x000208, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_GetRelativePositionForLimb_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000214, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_GetAttachmentBoneNameForLimb_ReturnValue) == 0x000220, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_GetAttachmentBoneNameForLimb_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_GetRelativeRotationForLimb_ReturnValue) == 0x00022C, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_GetRelativeRotationForLimb_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_GetSocketRotation_ReturnValue) == 0x000238, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_GetSocketRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_Conv_RotatorToVector_ReturnValue_1) == 0x000244, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_Conv_RotatorToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_ComposeRotators_ReturnValue) == 0x000250, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_Add_VectorVector_ReturnValue) == 0x00025C, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_GetForwardVector_ReturnValue) == 0x000268, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000274, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000280, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_Normal_ReturnValue) == 0x00028C, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_Normal_ReturnValue_1) == 0x000298, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_GetSocketLocation_ReturnValue) == 0x0002A4, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_GetSocketLocation_ReturnValue_1) == 0x0002B0, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_IsValid_ReturnValue_1) == 0x0002BC, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_PlayEventInWorld_playback_instance) == 0x0002C0, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_PlayEventInWorld_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_PlayEventInWorld_play_success) == 0x0002D0, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_PlayEventInWorld_play_success' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_ZeroGCascadeSwitch_ReturnValue) == 0x0002D8, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_ZeroGCascadeSwitch_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x0002E0, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_SpawnCACascadeSystemAttached_ReturnValue) == 0x0002E8, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_SpawnCACascadeSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_MakeVector_ReturnValue) == 0x0002F0, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_MakeLiteralFloat_ReturnValue) == 0x0002FC, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_SpawnCADecalAtImpact_out_material_instance) == 0x000300, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_SpawnCADecalAtImpact_out_material_instance' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000308, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000314, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000318, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000324, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x000328, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, Temp_object_Variable) == 0x000330, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_MakeVector_ReturnValue_1) == 0x000340, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_TraceAuxiliaryConeAsync_ReturnValue) == 0x00034C, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_TraceAuxiliaryConeAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base, CallFunc_SpawnCADecalAtImpact_out_material_instance_1) == 0x000350, "Member 'BP_AmputationEffect_Base_C_ExecuteUbergraph_BP_AmputationEffect_Base::CallFunc_SpawnCADecalAtImpact_out_material_instance_1' has a wrong offset!");

// Function BP_AmputationEffect_Base.BP_AmputationEffect_Base_C.AmputationDecalGen
// 0x00A0 (0x00A0 - 0x0000)
struct BP_AmputationEffect_Base_C_AmputationDecalGen final
{
public:
	EPhysicalSurface                              SurfaceType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             HitResult;                                         // 0x0004(0x0090)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FCATraceAuxiliaryResult                AuxiliaryResult;                                   // 0x0094(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_AmputationEffect_Base_C_AmputationDecalGen) == 0x000004, "Wrong alignment on BP_AmputationEffect_Base_C_AmputationDecalGen");
static_assert(sizeof(BP_AmputationEffect_Base_C_AmputationDecalGen) == 0x0000A0, "Wrong size on BP_AmputationEffect_Base_C_AmputationDecalGen");
static_assert(offsetof(BP_AmputationEffect_Base_C_AmputationDecalGen, SurfaceType) == 0x000000, "Member 'BP_AmputationEffect_Base_C_AmputationDecalGen::SurfaceType' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_AmputationDecalGen, HitResult) == 0x000004, "Member 'BP_AmputationEffect_Base_C_AmputationDecalGen::HitResult' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_AmputationDecalGen, AuxiliaryResult) == 0x000094, "Member 'BP_AmputationEffect_Base_C_AmputationDecalGen::AuxiliaryResult' has a wrong offset!");

// Function BP_AmputationEffect_Base.BP_AmputationEffect_Base_C.OnAmputate
// 0x0080 (0x0080 - 0x0000)
struct BP_AmputationEffect_Base_C_OnAmputate final
{
public:
	class USkeletalMeshComponent*                 Skeletal_mesh_component;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAAmputationLimb                             Limb;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkedHit                          Last_hit;                                          // 0x0010(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UCAAmputationSet*                       Amputation_set;                                    // 0x0078(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AmputationEffect_Base_C_OnAmputate) == 0x000008, "Wrong alignment on BP_AmputationEffect_Base_C_OnAmputate");
static_assert(sizeof(BP_AmputationEffect_Base_C_OnAmputate) == 0x000080, "Wrong size on BP_AmputationEffect_Base_C_OnAmputate");
static_assert(offsetof(BP_AmputationEffect_Base_C_OnAmputate, Skeletal_mesh_component) == 0x000000, "Member 'BP_AmputationEffect_Base_C_OnAmputate::Skeletal_mesh_component' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_OnAmputate, Limb) == 0x000008, "Member 'BP_AmputationEffect_Base_C_OnAmputate::Limb' has a wrong offset!");
static_assert(offsetof(BP_AmputationEffect_Base_C_OnAmputate, Last_hit) == 0x000010, "Member 'BP_AmputationEffect_Base_C_OnAmputate::Last_hit' has a wrong offset!");
