#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ability_Untouchable_Shield_3P

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Ability_Untouchable_Shield_3P.BP_Ability_Untouchable_Shield_3P_C
// 0x0030 (0x0288 - 0x0258)
class ABP_Ability_Untouchable_Shield_3P_C : public ACAShieldEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FadeOut_NewTrack_0_AF8E61C445FAC466F96D8C993ECF331E; // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeOut__Direction_AF8E61C445FAC466F96D8C993ECF331E; // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadeOut;                                           // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraShieldVFX;                                  // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         ShieldVFX_NiagaraSystem;                           // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Ability_Untouchable_Shield_3P(int32 EntryPoint);
	void ActivateShieldVFX();
	void FinishShieldVFX();
	void OnShieldHit(const struct FVector& Hit_location, float Absorbed_damage_percentage);
	void FadeOut__UpdateFunc();
	void FadeOut__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Ability_Untouchable_Shield_3P_C">();
	}
	static class ABP_Ability_Untouchable_Shield_3P_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Ability_Untouchable_Shield_3P_C>();
	}
};
static_assert(alignof(ABP_Ability_Untouchable_Shield_3P_C) == 0x000008, "Wrong alignment on ABP_Ability_Untouchable_Shield_3P_C");
static_assert(sizeof(ABP_Ability_Untouchable_Shield_3P_C) == 0x000288, "Wrong size on ABP_Ability_Untouchable_Shield_3P_C");
static_assert(offsetof(ABP_Ability_Untouchable_Shield_3P_C, UberGraphFrame) == 0x000258, "Member 'ABP_Ability_Untouchable_Shield_3P_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Ability_Untouchable_Shield_3P_C, DefaultSceneRoot) == 0x000260, "Member 'ABP_Ability_Untouchable_Shield_3P_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Ability_Untouchable_Shield_3P_C, FadeOut_NewTrack_0_AF8E61C445FAC466F96D8C993ECF331E) == 0x000268, "Member 'ABP_Ability_Untouchable_Shield_3P_C::FadeOut_NewTrack_0_AF8E61C445FAC466F96D8C993ECF331E' has a wrong offset!");
static_assert(offsetof(ABP_Ability_Untouchable_Shield_3P_C, FadeOut__Direction_AF8E61C445FAC466F96D8C993ECF331E) == 0x00026C, "Member 'ABP_Ability_Untouchable_Shield_3P_C::FadeOut__Direction_AF8E61C445FAC466F96D8C993ECF331E' has a wrong offset!");
static_assert(offsetof(ABP_Ability_Untouchable_Shield_3P_C, FadeOut) == 0x000270, "Member 'ABP_Ability_Untouchable_Shield_3P_C::FadeOut' has a wrong offset!");
static_assert(offsetof(ABP_Ability_Untouchable_Shield_3P_C, NiagaraShieldVFX) == 0x000278, "Member 'ABP_Ability_Untouchable_Shield_3P_C::NiagaraShieldVFX' has a wrong offset!");
static_assert(offsetof(ABP_Ability_Untouchable_Shield_3P_C, ShieldVFX_NiagaraSystem) == 0x000280, "Member 'ABP_Ability_Untouchable_Shield_3P_C::ShieldVFX_NiagaraSystem' has a wrong offset!");

}

