#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AmbientLightAreaComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AmbientLightAreaComponent.BP_AmbientLightAreaComponent_C.CanEnterArea
// 0x0020 (0x0020 - 0x0000)
struct BP_AmbientLightAreaComponent_C_CanEnterArea final
{
public:
	class AActor*                                 User;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AmbientLightAreaComponent_C_CanEnterArea) == 0x000008, "Wrong alignment on BP_AmbientLightAreaComponent_C_CanEnterArea");
static_assert(sizeof(BP_AmbientLightAreaComponent_C_CanEnterArea) == 0x000020, "Wrong size on BP_AmbientLightAreaComponent_C_CanEnterArea");
static_assert(offsetof(BP_AmbientLightAreaComponent_C_CanEnterArea, User) == 0x000000, "Member 'BP_AmbientLightAreaComponent_C_CanEnterArea::User' has a wrong offset!");
static_assert(offsetof(BP_AmbientLightAreaComponent_C_CanEnterArea, ReturnValue) == 0x000008, "Member 'BP_AmbientLightAreaComponent_C_CanEnterArea::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientLightAreaComponent_C_CanEnterArea, CallFunc_GetObjectClass_ReturnValue) == 0x000010, "Member 'BP_AmbientLightAreaComponent_C_CanEnterArea::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AmbientLightAreaComponent_C_CanEnterArea, CallFunc_ClassIsChildOf_ReturnValue) == 0x000018, "Member 'BP_AmbientLightAreaComponent_C_CanEnterArea::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");

}

