#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BTT_FinishPolitenessBehaviour

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BTT_FinishPolitenessBehaviour.BP_BTT_FinishPolitenessBehaviour_C
// 0x0020 (0x00D8 - 0x00B8)
class UBP_BTT_FinishPolitenessBehaviour_C final : public UBTTask_CABlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCANPCPolitenessBehaviourComponent*     PolitenessBehaviourComponent;                      // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Channel;                                           // 0x00C8(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BTT_FinishPolitenessBehaviour(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BTT_FinishPolitenessBehaviour_C">();
	}
	static class UBP_BTT_FinishPolitenessBehaviour_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BTT_FinishPolitenessBehaviour_C>();
	}
};
static_assert(alignof(UBP_BTT_FinishPolitenessBehaviour_C) == 0x000008, "Wrong alignment on UBP_BTT_FinishPolitenessBehaviour_C");
static_assert(sizeof(UBP_BTT_FinishPolitenessBehaviour_C) == 0x0000D8, "Wrong size on UBP_BTT_FinishPolitenessBehaviour_C");
static_assert(offsetof(UBP_BTT_FinishPolitenessBehaviour_C, UberGraphFrame) == 0x0000B8, "Member 'UBP_BTT_FinishPolitenessBehaviour_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_BTT_FinishPolitenessBehaviour_C, PolitenessBehaviourComponent) == 0x0000C0, "Member 'UBP_BTT_FinishPolitenessBehaviour_C::PolitenessBehaviourComponent' has a wrong offset!");
static_assert(offsetof(UBP_BTT_FinishPolitenessBehaviour_C, Channel) == 0x0000C8, "Member 'UBP_BTT_FinishPolitenessBehaviour_C::Channel' has a wrong offset!");

}

