#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BarrelBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CAAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BarrelBase.BP_BarrelBase_C
// 0x00A0 (0x0418 - 0x0378)
class ABP_BarrelBase_C final : public ACAObjectiveLoopActorWithAbilities
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCACollisionComponent*                  CACollision1;                                      // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_DestructibleActorStateMachine_C*    BP_DestructibleStateMachine;                       // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCAFoamAlignmentComponent*              CAFoamAlignment;                                   // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCACollisionComponent*                  TargetObjectCACollision;                           // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        HitPointLocation;                                  // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCACollisionComponent*                  CACollision;                                       // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SceneRoot;                                         // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCAHitPointComponent*                   CAHitPoint;                                        // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BarrelMesh;                                        // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    BarrelVariantDataTableRowHandle;                   // 0x03C8(0x0018)(Edit, BlueprintVisible, NoDestructor)
	class UCAGameplayStateComponent*              ActiveComponent;                                   // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            FoamImmuneGameplayEffect;                          // 0x03E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioEventType                      Barrel_Destroyed_Audio;                            // 0x03F0(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Barrel_Destroyed_VFX;                              // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    DestructibleActorVariantDTRowHandle;               // 0x0400(0x0018)(Edit, BlueprintVisible, NoDestructor)

public:
	void ExecuteUbergraph_BP_BarrelBase(int32 EntryPoint);
	void BndEvt__BP_BarrelBase_BP_DestructibleStateMachine_K2Node_ComponentBoundEvent_0_EventDestroyed__DelegateSignature();
	void BndEvt__BP_RedBarrel_CAFoamAlignment_K2Node_ComponentBoundEvent_2_FoamDestroyed__DelegateSignature();
	void BndEvt__BP_RedBarrel_CAFoamAlignment_K2Node_ComponentBoundEvent_1_FoamActivated__DelegateSignature();
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void RemoveActor();
	void UpdateVariant(const struct FDataTableRowHandle& BarrelDataRowHandle);
	void SetUpDestructibleActorComponent();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BarrelBase_C">();
	}
	static class ABP_BarrelBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BarrelBase_C>();
	}
};
static_assert(alignof(ABP_BarrelBase_C) == 0x000008, "Wrong alignment on ABP_BarrelBase_C");
static_assert(sizeof(ABP_BarrelBase_C) == 0x000418, "Wrong size on ABP_BarrelBase_C");
static_assert(offsetof(ABP_BarrelBase_C, UberGraphFrame) == 0x000378, "Member 'ABP_BarrelBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BarrelBase_C, CACollision1) == 0x000380, "Member 'ABP_BarrelBase_C::CACollision1' has a wrong offset!");
static_assert(offsetof(ABP_BarrelBase_C, BP_DestructibleStateMachine) == 0x000388, "Member 'ABP_BarrelBase_C::BP_DestructibleStateMachine' has a wrong offset!");
static_assert(offsetof(ABP_BarrelBase_C, CAFoamAlignment) == 0x000390, "Member 'ABP_BarrelBase_C::CAFoamAlignment' has a wrong offset!");
static_assert(offsetof(ABP_BarrelBase_C, TargetObjectCACollision) == 0x000398, "Member 'ABP_BarrelBase_C::TargetObjectCACollision' has a wrong offset!");
static_assert(offsetof(ABP_BarrelBase_C, HitPointLocation) == 0x0003A0, "Member 'ABP_BarrelBase_C::HitPointLocation' has a wrong offset!");
static_assert(offsetof(ABP_BarrelBase_C, CACollision) == 0x0003A8, "Member 'ABP_BarrelBase_C::CACollision' has a wrong offset!");
static_assert(offsetof(ABP_BarrelBase_C, SceneRoot) == 0x0003B0, "Member 'ABP_BarrelBase_C::SceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_BarrelBase_C, CAHitPoint) == 0x0003B8, "Member 'ABP_BarrelBase_C::CAHitPoint' has a wrong offset!");
static_assert(offsetof(ABP_BarrelBase_C, BarrelMesh) == 0x0003C0, "Member 'ABP_BarrelBase_C::BarrelMesh' has a wrong offset!");
static_assert(offsetof(ABP_BarrelBase_C, BarrelVariantDataTableRowHandle) == 0x0003C8, "Member 'ABP_BarrelBase_C::BarrelVariantDataTableRowHandle' has a wrong offset!");
static_assert(offsetof(ABP_BarrelBase_C, ActiveComponent) == 0x0003E0, "Member 'ABP_BarrelBase_C::ActiveComponent' has a wrong offset!");
static_assert(offsetof(ABP_BarrelBase_C, FoamImmuneGameplayEffect) == 0x0003E8, "Member 'ABP_BarrelBase_C::FoamImmuneGameplayEffect' has a wrong offset!");
static_assert(offsetof(ABP_BarrelBase_C, Barrel_Destroyed_Audio) == 0x0003F0, "Member 'ABP_BarrelBase_C::Barrel_Destroyed_Audio' has a wrong offset!");
static_assert(offsetof(ABP_BarrelBase_C, Barrel_Destroyed_VFX) == 0x0003F8, "Member 'ABP_BarrelBase_C::Barrel_Destroyed_VFX' has a wrong offset!");
static_assert(offsetof(ABP_BarrelBase_C, DestructibleActorVariantDTRowHandle) == 0x000400, "Member 'ABP_BarrelBase_C::DestructibleActorVariantDTRowHandle' has a wrong offset!");

}

