#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BTS_PolitenessBehaviourInProgress

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BTS_PolitenessBehaviourInProgress.BP_BTS_PolitenessBehaviourInProgress_C.ExecuteUbergraph_BP_BTS_PolitenessBehaviourInProgress
// 0x0040 (0x0040 - 0x0000)
struct BP_BTS_PolitenessBehaviourInProgress_C_ExecuteUbergraph_BP_BTS_PolitenessBehaviourInProgress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCANPCPolitenessBehaviourComponent*     CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCANPCPolitenessBehaviourComponent*     CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BTS_PolitenessBehaviourInProgress_C_ExecuteUbergraph_BP_BTS_PolitenessBehaviourInProgress) == 0x000008, "Wrong alignment on BP_BTS_PolitenessBehaviourInProgress_C_ExecuteUbergraph_BP_BTS_PolitenessBehaviourInProgress");
static_assert(sizeof(BP_BTS_PolitenessBehaviourInProgress_C_ExecuteUbergraph_BP_BTS_PolitenessBehaviourInProgress) == 0x000040, "Wrong size on BP_BTS_PolitenessBehaviourInProgress_C_ExecuteUbergraph_BP_BTS_PolitenessBehaviourInProgress");
static_assert(offsetof(BP_BTS_PolitenessBehaviourInProgress_C_ExecuteUbergraph_BP_BTS_PolitenessBehaviourInProgress, EntryPoint) == 0x000000, "Member 'BP_BTS_PolitenessBehaviourInProgress_C_ExecuteUbergraph_BP_BTS_PolitenessBehaviourInProgress::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BTS_PolitenessBehaviourInProgress_C_ExecuteUbergraph_BP_BTS_PolitenessBehaviourInProgress, K2Node_Event_OwnerController_1) == 0x000008, "Member 'BP_BTS_PolitenessBehaviourInProgress_C_ExecuteUbergraph_BP_BTS_PolitenessBehaviourInProgress::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(BP_BTS_PolitenessBehaviourInProgress_C_ExecuteUbergraph_BP_BTS_PolitenessBehaviourInProgress, K2Node_Event_ControlledPawn_1) == 0x000010, "Member 'BP_BTS_PolitenessBehaviourInProgress_C_ExecuteUbergraph_BP_BTS_PolitenessBehaviourInProgress::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(BP_BTS_PolitenessBehaviourInProgress_C_ExecuteUbergraph_BP_BTS_PolitenessBehaviourInProgress, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'BP_BTS_PolitenessBehaviourInProgress_C_ExecuteUbergraph_BP_BTS_PolitenessBehaviourInProgress::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BTS_PolitenessBehaviourInProgress_C_ExecuteUbergraph_BP_BTS_PolitenessBehaviourInProgress, K2Node_Event_OwnerController) == 0x000020, "Member 'BP_BTS_PolitenessBehaviourInProgress_C_ExecuteUbergraph_BP_BTS_PolitenessBehaviourInProgress::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BP_BTS_PolitenessBehaviourInProgress_C_ExecuteUbergraph_BP_BTS_PolitenessBehaviourInProgress, K2Node_Event_ControlledPawn) == 0x000028, "Member 'BP_BTS_PolitenessBehaviourInProgress_C_ExecuteUbergraph_BP_BTS_PolitenessBehaviourInProgress::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BP_BTS_PolitenessBehaviourInProgress_C_ExecuteUbergraph_BP_BTS_PolitenessBehaviourInProgress, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000030, "Member 'BP_BTS_PolitenessBehaviourInProgress_C_ExecuteUbergraph_BP_BTS_PolitenessBehaviourInProgress::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BTS_PolitenessBehaviourInProgress_C_ExecuteUbergraph_BP_BTS_PolitenessBehaviourInProgress, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_BTS_PolitenessBehaviourInProgress_C_ExecuteUbergraph_BP_BTS_PolitenessBehaviourInProgress::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BTS_PolitenessBehaviourInProgress_C_ExecuteUbergraph_BP_BTS_PolitenessBehaviourInProgress, CallFunc_IsValid_ReturnValue_1) == 0x000039, "Member 'BP_BTS_PolitenessBehaviourInProgress_C_ExecuteUbergraph_BP_BTS_PolitenessBehaviourInProgress::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_BTS_PolitenessBehaviourInProgress.BP_BTS_PolitenessBehaviourInProgress_C.ReceiveDeactivationAI
// 0x0010 (0x0010 - 0x0000)
struct BP_BTS_PolitenessBehaviourInProgress_C_ReceiveDeactivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BTS_PolitenessBehaviourInProgress_C_ReceiveDeactivationAI) == 0x000008, "Wrong alignment on BP_BTS_PolitenessBehaviourInProgress_C_ReceiveDeactivationAI");
static_assert(sizeof(BP_BTS_PolitenessBehaviourInProgress_C_ReceiveDeactivationAI) == 0x000010, "Wrong size on BP_BTS_PolitenessBehaviourInProgress_C_ReceiveDeactivationAI");
static_assert(offsetof(BP_BTS_PolitenessBehaviourInProgress_C_ReceiveDeactivationAI, OwnerController) == 0x000000, "Member 'BP_BTS_PolitenessBehaviourInProgress_C_ReceiveDeactivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BP_BTS_PolitenessBehaviourInProgress_C_ReceiveDeactivationAI, ControlledPawn) == 0x000008, "Member 'BP_BTS_PolitenessBehaviourInProgress_C_ReceiveDeactivationAI::ControlledPawn' has a wrong offset!");

// Function BP_BTS_PolitenessBehaviourInProgress.BP_BTS_PolitenessBehaviourInProgress_C.ReceiveActivationAI
// 0x0010 (0x0010 - 0x0000)
struct BP_BTS_PolitenessBehaviourInProgress_C_ReceiveActivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BTS_PolitenessBehaviourInProgress_C_ReceiveActivationAI) == 0x000008, "Wrong alignment on BP_BTS_PolitenessBehaviourInProgress_C_ReceiveActivationAI");
static_assert(sizeof(BP_BTS_PolitenessBehaviourInProgress_C_ReceiveActivationAI) == 0x000010, "Wrong size on BP_BTS_PolitenessBehaviourInProgress_C_ReceiveActivationAI");
static_assert(offsetof(BP_BTS_PolitenessBehaviourInProgress_C_ReceiveActivationAI, OwnerController) == 0x000000, "Member 'BP_BTS_PolitenessBehaviourInProgress_C_ReceiveActivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BP_BTS_PolitenessBehaviourInProgress_C_ReceiveActivationAI, ControlledPawn) == 0x000008, "Member 'BP_BTS_PolitenessBehaviourInProgress_C_ReceiveActivationAI::ControlledPawn' has a wrong offset!");

}

