#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BarrelBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_BarrelVariant_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_BarrelBase.BP_BarrelBase_C.ExecuteUbergraph_BP_BarrelBase
// 0x0010 (0x0010 - 0x0000)
struct BP_BarrelBase_C_ExecuteUbergraph_BP_BarrelBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BarrelBase_C_ExecuteUbergraph_BP_BarrelBase) == 0x000004, "Wrong alignment on BP_BarrelBase_C_ExecuteUbergraph_BP_BarrelBase");
static_assert(sizeof(BP_BarrelBase_C_ExecuteUbergraph_BP_BarrelBase) == 0x000010, "Wrong size on BP_BarrelBase_C_ExecuteUbergraph_BP_BarrelBase");
static_assert(offsetof(BP_BarrelBase_C_ExecuteUbergraph_BP_BarrelBase, EntryPoint) == 0x000000, "Member 'BP_BarrelBase_C_ExecuteUbergraph_BP_BarrelBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BarrelBase_C_ExecuteUbergraph_BP_BarrelBase, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000004, "Member 'BP_BarrelBase_C_ExecuteUbergraph_BP_BarrelBase::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BarrelBase_C_ExecuteUbergraph_BP_BarrelBase, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x00000C, "Member 'BP_BarrelBase_C_ExecuteUbergraph_BP_BarrelBase::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");

// Function BP_BarrelBase.BP_BarrelBase_C.UpdateVariant
// 0x0038 (0x0038 - 0x0000)
struct BP_BarrelBase_C_UpdateVariant final
{
public:
	struct FDataTableRowHandle                    BarrelDataRowHandle;                               // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FS_BarrelVariant                       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0018(0x0018)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BarrelBase_C_UpdateVariant) == 0x000008, "Wrong alignment on BP_BarrelBase_C_UpdateVariant");
static_assert(sizeof(BP_BarrelBase_C_UpdateVariant) == 0x000038, "Wrong size on BP_BarrelBase_C_UpdateVariant");
static_assert(offsetof(BP_BarrelBase_C_UpdateVariant, BarrelDataRowHandle) == 0x000000, "Member 'BP_BarrelBase_C_UpdateVariant::BarrelDataRowHandle' has a wrong offset!");
static_assert(offsetof(BP_BarrelBase_C_UpdateVariant, CallFunc_GetDataTableRowFromName_OutRow) == 0x000018, "Member 'BP_BarrelBase_C_UpdateVariant::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_BarrelBase_C_UpdateVariant, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000030, "Member 'BP_BarrelBase_C_UpdateVariant::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BarrelBase_C_UpdateVariant, CallFunc_SetStaticMesh_ReturnValue) == 0x000031, "Member 'BP_BarrelBase_C_UpdateVariant::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

}

