#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BTT_FinishPolitenessBehaviour

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BTT_FinishPolitenessBehaviour.BP_BTT_FinishPolitenessBehaviour_C.ExecuteUbergraph_BP_BTT_FinishPolitenessBehaviour
// 0x0028 (0x0028 - 0x0000)
struct BP_BTT_FinishPolitenessBehaviour_C_ExecuteUbergraph_BP_BTT_FinishPolitenessBehaviour final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCANPCPolitenessBehaviourComponent*     CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BTT_FinishPolitenessBehaviour_C_ExecuteUbergraph_BP_BTT_FinishPolitenessBehaviour) == 0x000008, "Wrong alignment on BP_BTT_FinishPolitenessBehaviour_C_ExecuteUbergraph_BP_BTT_FinishPolitenessBehaviour");
static_assert(sizeof(BP_BTT_FinishPolitenessBehaviour_C_ExecuteUbergraph_BP_BTT_FinishPolitenessBehaviour) == 0x000028, "Wrong size on BP_BTT_FinishPolitenessBehaviour_C_ExecuteUbergraph_BP_BTT_FinishPolitenessBehaviour");
static_assert(offsetof(BP_BTT_FinishPolitenessBehaviour_C_ExecuteUbergraph_BP_BTT_FinishPolitenessBehaviour, EntryPoint) == 0x000000, "Member 'BP_BTT_FinishPolitenessBehaviour_C_ExecuteUbergraph_BP_BTT_FinishPolitenessBehaviour::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BTT_FinishPolitenessBehaviour_C_ExecuteUbergraph_BP_BTT_FinishPolitenessBehaviour, K2Node_Event_OwnerController) == 0x000008, "Member 'BP_BTT_FinishPolitenessBehaviour_C_ExecuteUbergraph_BP_BTT_FinishPolitenessBehaviour::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BP_BTT_FinishPolitenessBehaviour_C_ExecuteUbergraph_BP_BTT_FinishPolitenessBehaviour, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BP_BTT_FinishPolitenessBehaviour_C_ExecuteUbergraph_BP_BTT_FinishPolitenessBehaviour::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BP_BTT_FinishPolitenessBehaviour_C_ExecuteUbergraph_BP_BTT_FinishPolitenessBehaviour, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_BTT_FinishPolitenessBehaviour_C_ExecuteUbergraph_BP_BTT_FinishPolitenessBehaviour::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BTT_FinishPolitenessBehaviour_C_ExecuteUbergraph_BP_BTT_FinishPolitenessBehaviour, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BP_BTT_FinishPolitenessBehaviour_C_ExecuteUbergraph_BP_BTT_FinishPolitenessBehaviour::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function BP_BTT_FinishPolitenessBehaviour.BP_BTT_FinishPolitenessBehaviour_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BP_BTT_FinishPolitenessBehaviour_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BTT_FinishPolitenessBehaviour_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BP_BTT_FinishPolitenessBehaviour_C_ReceiveExecuteAI");
static_assert(sizeof(BP_BTT_FinishPolitenessBehaviour_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BP_BTT_FinishPolitenessBehaviour_C_ReceiveExecuteAI");
static_assert(offsetof(BP_BTT_FinishPolitenessBehaviour_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BP_BTT_FinishPolitenessBehaviour_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BP_BTT_FinishPolitenessBehaviour_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BP_BTT_FinishPolitenessBehaviour_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

