#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BreachStateMachine

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_BreachStateMachine.BP_BreachStateMachine_C.UpdateActivation__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_BreachStateMachine_C_UpdateActivation__DelegateSignature final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BreachStateMachine_C_UpdateActivation__DelegateSignature) == 0x000004, "Wrong alignment on BP_BreachStateMachine_C_UpdateActivation__DelegateSignature");
static_assert(sizeof(BP_BreachStateMachine_C_UpdateActivation__DelegateSignature) == 0x000004, "Wrong size on BP_BreachStateMachine_C_UpdateActivation__DelegateSignature");
static_assert(offsetof(BP_BreachStateMachine_C_UpdateActivation__DelegateSignature, Progress) == 0x000000, "Member 'BP_BreachStateMachine_C_UpdateActivation__DelegateSignature::Progress' has a wrong offset!");

// Function BP_BreachStateMachine.BP_BreachStateMachine_C.EventPlaced__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_BreachStateMachine_C_EventPlaced__DelegateSignature final
{
public:
	class AActor*                                 User;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BreachStateMachine_C_EventPlaced__DelegateSignature) == 0x000008, "Wrong alignment on BP_BreachStateMachine_C_EventPlaced__DelegateSignature");
static_assert(sizeof(BP_BreachStateMachine_C_EventPlaced__DelegateSignature) == 0x000008, "Wrong size on BP_BreachStateMachine_C_EventPlaced__DelegateSignature");
static_assert(offsetof(BP_BreachStateMachine_C_EventPlaced__DelegateSignature, User) == 0x000000, "Member 'BP_BreachStateMachine_C_EventPlaced__DelegateSignature::User' has a wrong offset!");

// Function BP_BreachStateMachine.BP_BreachStateMachine_C.ExecuteUbergraph_BP_BreachStateMachine
// 0x0420 (0x0420 - 0x0000)
struct BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0040(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0054(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0068(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(struct FGameplayEffectSpec& Killing_effect_spec, float Delta_value)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x007C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* User)>           K2Node_CreateDelegate_OutputDelegate_7;            // 0x0090(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* User, bool WasCancelled)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x00A4(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x00B8(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* User)>           K2Node_CreateDelegate_OutputDelegate_10;           // 0x00CC(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue;               // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_1;             // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_2;             // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_3;             // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_4;             // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_5;             // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetProgressToTransition_ReturnValue;      // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpec                    K2Node_CustomEvent_killing_effect_spec;            // 0x0128(0x0298)(ConstParm)
	float                                         K2Node_CustomEvent_delta_value;                    // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x03C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TransitionToStateByName_ReturnValue;      // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAAbilitySystemComponent*              K2Node_DynamicCast_AsCAAbility_System_Component;   // 0x03D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_6;             // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAUsableState*                         CallFunc_GetUsableStateByName_ReturnValue;         // 0x03F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_User_2;                         // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_User_1;                         // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_WasCancelled;                   // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_7;             // 0x0410(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_User;                           // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine) == 0x000008, "Wrong alignment on BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine");
static_assert(sizeof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine) == 0x000420, "Wrong size on BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, EntryPoint) == 0x000000, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, K2Node_CreateDelegate_OutputDelegate_3) == 0x000040, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, K2Node_CreateDelegate_OutputDelegate_4) == 0x000054, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, K2Node_CreateDelegate_OutputDelegate_5) == 0x000068, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, K2Node_CreateDelegate_OutputDelegate_6) == 0x00007C, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, K2Node_CreateDelegate_OutputDelegate_7) == 0x000090, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000A4, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, K2Node_CreateDelegate_OutputDelegate_9) == 0x0000B8, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, K2Node_CreateDelegate_OutputDelegate_10) == 0x0000CC, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, CallFunc_GetStateByName_ReturnValue) == 0x0000E8, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::CallFunc_GetStateByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, CallFunc_GetStateByName_ReturnValue_1) == 0x0000F0, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::CallFunc_GetStateByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, CallFunc_GetStateByName_ReturnValue_2) == 0x0000F8, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::CallFunc_GetStateByName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, CallFunc_GetStateByName_ReturnValue_3) == 0x000100, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::CallFunc_GetStateByName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, CallFunc_GetStateByName_ReturnValue_4) == 0x000108, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::CallFunc_GetStateByName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, CallFunc_GetStateByName_ReturnValue_5) == 0x000110, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::CallFunc_GetStateByName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, CallFunc_GetProgressToTransition_ReturnValue) == 0x000118, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::CallFunc_GetProgressToTransition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, CallFunc_GetOwner_ReturnValue) == 0x000120, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, K2Node_CustomEvent_killing_effect_spec) == 0x000128, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::K2Node_CustomEvent_killing_effect_spec' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, K2Node_CustomEvent_delta_value) == 0x0003C0, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::K2Node_CustomEvent_delta_value' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0003C8, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, CallFunc_TransitionToStateByName_ReturnValue) == 0x0003D0, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::CallFunc_TransitionToStateByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, K2Node_DynamicCast_AsCAAbility_System_Component) == 0x0003D8, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::K2Node_DynamicCast_AsCAAbility_System_Component' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, K2Node_DynamicCast_bSuccess) == 0x0003E0, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, CallFunc_GetStateByName_ReturnValue_6) == 0x0003E8, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::CallFunc_GetStateByName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, CallFunc_GetUsableStateByName_ReturnValue) == 0x0003F0, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::CallFunc_GetUsableStateByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, K2Node_CustomEvent_User_2) == 0x0003F8, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::K2Node_CustomEvent_User_2' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, K2Node_CustomEvent_User_1) == 0x000400, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::K2Node_CustomEvent_User_1' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, K2Node_CustomEvent_WasCancelled) == 0x000408, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::K2Node_CustomEvent_WasCancelled' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, CallFunc_GetStateByName_ReturnValue_7) == 0x000410, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::CallFunc_GetStateByName_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine, K2Node_CustomEvent_User) == 0x000418, "Member 'BP_BreachStateMachine_C_ExecuteUbergraph_BP_BreachStateMachine::K2Node_CustomEvent_User' has a wrong offset!");

// Function BP_BreachStateMachine.BP_BreachStateMachine_C.Placed
// 0x0008 (0x0008 - 0x0000)
struct BP_BreachStateMachine_C_Placed final
{
public:
	class AActor*                                 User;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BreachStateMachine_C_Placed) == 0x000008, "Wrong alignment on BP_BreachStateMachine_C_Placed");
static_assert(sizeof(BP_BreachStateMachine_C_Placed) == 0x000008, "Wrong size on BP_BreachStateMachine_C_Placed");
static_assert(offsetof(BP_BreachStateMachine_C_Placed, User) == 0x000000, "Member 'BP_BreachStateMachine_C_Placed::User' has a wrong offset!");

// Function BP_BreachStateMachine.BP_BreachStateMachine_C.NotPlacing
// 0x0010 (0x0010 - 0x0000)
struct BP_BreachStateMachine_C_NotPlacing final
{
public:
	class AActor*                                 User;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WasCancelled;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BreachStateMachine_C_NotPlacing) == 0x000008, "Wrong alignment on BP_BreachStateMachine_C_NotPlacing");
static_assert(sizeof(BP_BreachStateMachine_C_NotPlacing) == 0x000010, "Wrong size on BP_BreachStateMachine_C_NotPlacing");
static_assert(offsetof(BP_BreachStateMachine_C_NotPlacing, User) == 0x000000, "Member 'BP_BreachStateMachine_C_NotPlacing::User' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_NotPlacing, WasCancelled) == 0x000008, "Member 'BP_BreachStateMachine_C_NotPlacing::WasCancelled' has a wrong offset!");

// Function BP_BreachStateMachine.BP_BreachStateMachine_C.Placing
// 0x0008 (0x0008 - 0x0000)
struct BP_BreachStateMachine_C_Placing final
{
public:
	class AActor*                                 User;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BreachStateMachine_C_Placing) == 0x000008, "Wrong alignment on BP_BreachStateMachine_C_Placing");
static_assert(sizeof(BP_BreachStateMachine_C_Placing) == 0x000008, "Wrong size on BP_BreachStateMachine_C_Placing");
static_assert(offsetof(BP_BreachStateMachine_C_Placing, User) == 0x000000, "Member 'BP_BreachStateMachine_C_Placing::User' has a wrong offset!");

// Function BP_BreachStateMachine.BP_BreachStateMachine_C.Reset
// 0x02A0 (0x02A0 - 0x0000)
struct BP_BreachStateMachine_C_Reset final
{
public:
	struct FGameplayEffectSpec                    Killing_effect_spec;                               // 0x0000(0x0298)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         Delta_value;                                       // 0x0298(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BreachStateMachine_C_Reset) == 0x000008, "Wrong alignment on BP_BreachStateMachine_C_Reset");
static_assert(sizeof(BP_BreachStateMachine_C_Reset) == 0x0002A0, "Wrong size on BP_BreachStateMachine_C_Reset");
static_assert(offsetof(BP_BreachStateMachine_C_Reset, Killing_effect_spec) == 0x000000, "Member 'BP_BreachStateMachine_C_Reset::Killing_effect_spec' has a wrong offset!");
static_assert(offsetof(BP_BreachStateMachine_C_Reset, Delta_value) == 0x000298, "Member 'BP_BreachStateMachine_C_Reset::Delta_value' has a wrong offset!");

// Function BP_BreachStateMachine.BP_BreachStateMachine_C.Force Enable
// 0x0001 (0x0001 - 0x0000)
struct BP_BreachStateMachine_C_Force_Enable final
{
public:
	bool                                          CallFunc_TransitionToStateByName_ReturnValue;      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BreachStateMachine_C_Force_Enable) == 0x000001, "Wrong alignment on BP_BreachStateMachine_C_Force_Enable");
static_assert(sizeof(BP_BreachStateMachine_C_Force_Enable) == 0x000001, "Wrong size on BP_BreachStateMachine_C_Force_Enable");
static_assert(offsetof(BP_BreachStateMachine_C_Force_Enable, CallFunc_TransitionToStateByName_ReturnValue) == 0x000000, "Member 'BP_BreachStateMachine_C_Force_Enable::CallFunc_TransitionToStateByName_ReturnValue' has a wrong offset!");

}

