#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BaseSwitch

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_BaseSwitch.BP_BaseSwitch_C.ExecuteUbergraph_BP_BaseSwitch
// 0x0010 (0x0010 - 0x0000)
struct BP_BaseSwitch_C_ExecuteUbergraph_BP_BaseSwitch final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BaseSwitch_C_ExecuteUbergraph_BP_BaseSwitch) == 0x000004, "Wrong alignment on BP_BaseSwitch_C_ExecuteUbergraph_BP_BaseSwitch");
static_assert(sizeof(BP_BaseSwitch_C_ExecuteUbergraph_BP_BaseSwitch) == 0x000010, "Wrong size on BP_BaseSwitch_C_ExecuteUbergraph_BP_BaseSwitch");
static_assert(offsetof(BP_BaseSwitch_C_ExecuteUbergraph_BP_BaseSwitch, EntryPoint) == 0x000000, "Member 'BP_BaseSwitch_C_ExecuteUbergraph_BP_BaseSwitch::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BaseSwitch_C_ExecuteUbergraph_BP_BaseSwitch, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000004, "Member 'BP_BaseSwitch_C_ExecuteUbergraph_BP_BaseSwitch::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseSwitch_C_ExecuteUbergraph_BP_BaseSwitch, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x00000C, "Member 'BP_BaseSwitch_C_ExecuteUbergraph_BP_BaseSwitch::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");

// Function BP_BaseSwitch.BP_BaseSwitch_C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct BP_BaseSwitch_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BaseSwitch_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_BaseSwitch_C_UserConstructionScript");
static_assert(sizeof(BP_BaseSwitch_C_UserConstructionScript) == 0x000004, "Wrong size on BP_BaseSwitch_C_UserConstructionScript");
static_assert(offsetof(BP_BaseSwitch_C_UserConstructionScript, CallFunc_Array_AddUnique_ReturnValue) == 0x000000, "Member 'BP_BaseSwitch_C_UserConstructionScript::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function BP_BaseSwitch.BP_BaseSwitch_C.HasSecurityClearance
// 0x0010 (0x0010 - 0x0000)
struct BP_BaseSwitch_C_HasSecurityClearance final
{
public:
	class AActor*                                 User;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasSecurityClearance_ReturnValue;         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RevokeSecurityClearance_ReturnValue;      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BaseSwitch_C_HasSecurityClearance) == 0x000008, "Wrong alignment on BP_BaseSwitch_C_HasSecurityClearance");
static_assert(sizeof(BP_BaseSwitch_C_HasSecurityClearance) == 0x000010, "Wrong size on BP_BaseSwitch_C_HasSecurityClearance");
static_assert(offsetof(BP_BaseSwitch_C_HasSecurityClearance, User) == 0x000000, "Member 'BP_BaseSwitch_C_HasSecurityClearance::User' has a wrong offset!");
static_assert(offsetof(BP_BaseSwitch_C_HasSecurityClearance, ReturnValue) == 0x000008, "Member 'BP_BaseSwitch_C_HasSecurityClearance::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseSwitch_C_HasSecurityClearance, CallFunc_HasSecurityClearance_ReturnValue) == 0x000009, "Member 'BP_BaseSwitch_C_HasSecurityClearance::CallFunc_HasSecurityClearance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseSwitch_C_HasSecurityClearance, CallFunc_RevokeSecurityClearance_ReturnValue) == 0x00000A, "Member 'BP_BaseSwitch_C_HasSecurityClearance::CallFunc_RevokeSecurityClearance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseSwitch_C_HasSecurityClearance, CallFunc_Not_PreBool_ReturnValue) == 0x00000B, "Member 'BP_BaseSwitch_C_HasSecurityClearance::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseSwitch_C_HasSecurityClearance, CallFunc_BooleanAND_ReturnValue) == 0x00000C, "Member 'BP_BaseSwitch_C_HasSecurityClearance::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

