#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BankRobber_PlaceTurret_Indicator

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BankRobber_PlaceTurret_Indicator.BP_BankRobber_PlaceTurret_Indicator_C.ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator
// 0x0310 (0x0310 - 0x0000)
struct BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable;                              // 0x0004(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Character_BankRobber_C*             K2Node_DynamicCast_AsBP_Character_Bank_Robber;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CameraInFirstPerson_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Find_Turret_Placement_From_Pawn_View_UseWallVariation; // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Find_Turret_Placement_From_Pawn_View_IndicatorPosition; // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Find_Turret_Placement_From_Pawn_View_IndicatorRoation; // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_Find_Turret_Placement_From_Pawn_View_TraceHit; // 0x004C(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                Temp_struct_Variable_1;                            // 0x00DC(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Validate_Turret_Placement_CanPlace;       // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x01B0(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_Select_Default_2;                           // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Select_Default_3;                           // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x01DC(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Select_Default_4;                           // 0x026C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x0278(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator) == 0x000008, "Wrong alignment on BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator");
static_assert(sizeof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator) == 0x000310, "Wrong size on BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, EntryPoint) == 0x000000, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, Temp_struct_Variable) == 0x000004, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, Temp_bool_Variable) == 0x000011, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, Temp_float_Variable) == 0x000014, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, Temp_float_Variable_1) == 0x000018, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, Temp_bool_Variable_1) == 0x00001C, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, Temp_bool_Variable_2) == 0x00001D, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, Temp_bool_Variable_3) == 0x00001E, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, K2Node_DynamicCast_AsBP_Character_Bank_Robber) == 0x000028, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::K2Node_DynamicCast_AsBP_Character_Bank_Robber' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_CameraInFirstPerson_ReturnValue) == 0x000031, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_CameraInFirstPerson_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_Find_Turret_Placement_From_Pawn_View_UseWallVariation) == 0x000032, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_Find_Turret_Placement_From_Pawn_View_UseWallVariation' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_Find_Turret_Placement_From_Pawn_View_IndicatorPosition) == 0x000034, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_Find_Turret_Placement_From_Pawn_View_IndicatorPosition' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_Find_Turret_Placement_From_Pawn_View_IndicatorRoation) == 0x000040, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_Find_Turret_Placement_From_Pawn_View_IndicatorRoation' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_Find_Turret_Placement_From_Pawn_View_TraceHit) == 0x00004C, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_Find_Turret_Placement_From_Pawn_View_TraceHit' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, Temp_struct_Variable_1) == 0x0000DC, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_BreakHitResult_bBlockingHit) == 0x0000E8, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000E9, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_BreakHitResult_Time) == 0x0000EC, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_BreakHitResult_Distance) == 0x0000F0, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_BreakHitResult_Location) == 0x0000F4, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_BreakHitResult_ImpactPoint) == 0x000100, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_BreakHitResult_Normal) == 0x00010C, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_BreakHitResult_ImpactNormal) == 0x000118, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_BreakHitResult_PhysMat) == 0x000128, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_BreakHitResult_HitActor) == 0x000130, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_BreakHitResult_HitComponent) == 0x000138, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_BreakHitResult_HitBoneName) == 0x000140, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_BreakHitResult_HitItem) == 0x00014C, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_BreakHitResult_ElementIndex) == 0x000150, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_BreakHitResult_FaceIndex) == 0x000154, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_BreakHitResult_TraceStart) == 0x000158, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_BreakHitResult_TraceEnd) == 0x000164, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, Temp_bool_Variable_4) == 0x000170, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, Temp_int_Variable) == 0x000174, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_Add_IntInt_ReturnValue) == 0x000178, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_Validate_Turret_Placement_CanPlace) == 0x00017C, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_Validate_Turret_Placement_CanPlace' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, K2Node_MakeArray_Array) == 0x000180, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_Array_Get_Item) == 0x000190, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_Array_Length_ReturnValue) == 0x000198, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_Less_IntInt_ReturnValue) == 0x00019C, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_Vector_Distance_ReturnValue) == 0x0001A0, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0001A4, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0001A8, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, K2Node_Select_Default) == 0x0001B0, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, K2Node_Select_Default_1) == 0x0001BC, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, K2Node_Select_Default_2) == 0x0001C0, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, K2Node_Select_Default_3) == 0x0001CC, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_MakeRotator_ReturnValue) == 0x0001D0, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0001DC, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, K2Node_Select_Default_4) == 0x00026C, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x000278, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator, K2Node_Event_DeltaSeconds) == 0x000308, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ExecuteUbergraph_BP_BankRobber_PlaceTurret_Indicator::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_BankRobber_PlaceTurret_Indicator.BP_BankRobber_PlaceTurret_Indicator_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_BankRobber_PlaceTurret_Indicator_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BankRobber_PlaceTurret_Indicator_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_BankRobber_PlaceTurret_Indicator_C_ReceiveTick");
static_assert(sizeof(BP_BankRobber_PlaceTurret_Indicator_C_ReceiveTick) == 0x000004, "Wrong size on BP_BankRobber_PlaceTurret_Indicator_C_ReceiveTick");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_BankRobber_PlaceTurret_Indicator.BP_BankRobber_PlaceTurret_Indicator_C.Calculate Turret Position and Rotation from Hit
// 0x0220 (0x0220 - 0x0000)
struct BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit final
{
public:
	struct FHitResult                             Hit_0;                                             // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          UseWallTurretVariation;                            // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Position;                                          // 0x0094(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x00A0(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          L_UseWallTurretVariation;                          // 0x00AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                L_Location;                                        // 0x00B0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               SpawnWithRotation;                                 // 0x00BC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                SpawnAtLocation;                                   // 0x00C8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 L_BankRobberTurret;                                // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                L_TraceEnd;                                        // 0x00E0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                L_TraceStart;                                      // 0x00EC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    L_HitComponent;                                    // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 L_HitActor;                                        // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                L_ImpactNormal;                                    // 0x0108(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                L_ImpactPoint;                                     // 0x0114(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_122[0x2];                                      // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_MathExpression_ReturnValue;                 // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_ProjectVectorOnToPlane_ReturnValue;       // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZX_ReturnValue;                // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_SelectRotator_ReturnValue_1;              // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit) == 0x000008, "Wrong alignment on BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit");
static_assert(sizeof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit) == 0x000220, "Wrong size on BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, Hit_0) == 0x000000, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::Hit_0' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, UseWallTurretVariation) == 0x000090, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::UseWallTurretVariation' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, Position) == 0x000094, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::Position' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, Rotation) == 0x0000A0, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::Rotation' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, L_UseWallTurretVariation) == 0x0000AC, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::L_UseWallTurretVariation' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, L_Location) == 0x0000B0, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::L_Location' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, SpawnWithRotation) == 0x0000BC, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::SpawnWithRotation' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, SpawnAtLocation) == 0x0000C8, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::SpawnAtLocation' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, L_BankRobberTurret) == 0x0000D8, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::L_BankRobberTurret' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, L_TraceEnd) == 0x0000E0, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::L_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, L_TraceStart) == 0x0000EC, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::L_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, L_HitComponent) == 0x0000F8, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::L_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, L_HitActor) == 0x000100, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::L_HitActor' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, L_ImpactNormal) == 0x000108, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::L_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, L_ImpactPoint) == 0x000114, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::L_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, CallFunc_BreakHitResult_bBlockingHit) == 0x000120, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, CallFunc_BreakHitResult_bInitialOverlap) == 0x000121, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, CallFunc_BreakHitResult_Time) == 0x000124, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, CallFunc_BreakHitResult_Distance) == 0x000128, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, CallFunc_BreakHitResult_Location) == 0x00012C, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, CallFunc_BreakHitResult_ImpactPoint) == 0x000138, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, CallFunc_BreakHitResult_Normal) == 0x000144, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, CallFunc_BreakHitResult_ImpactNormal) == 0x000150, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, CallFunc_BreakHitResult_PhysMat) == 0x000160, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, CallFunc_BreakHitResult_HitActor) == 0x000168, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, CallFunc_BreakHitResult_HitComponent) == 0x000170, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, CallFunc_BreakHitResult_HitBoneName) == 0x000178, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, CallFunc_BreakHitResult_HitItem) == 0x000184, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, CallFunc_BreakHitResult_ElementIndex) == 0x000188, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, CallFunc_BreakHitResult_FaceIndex) == 0x00018C, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, CallFunc_BreakHitResult_TraceStart) == 0x000190, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, CallFunc_BreakHitResult_TraceEnd) == 0x00019C, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001A8, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, CallFunc_Add_VectorVector_ReturnValue) == 0x0001B4, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, K2Node_MathExpression_ReturnValue) == 0x0001C0, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001CC, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, CallFunc_MakeRotFromX_ReturnValue) == 0x0001D8, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, CallFunc_ProjectVectorOnToPlane_ReturnValue) == 0x0001E4, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::CallFunc_ProjectVectorOnToPlane_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, CallFunc_MakeRotFromZX_ReturnValue) == 0x0001F0, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::CallFunc_MakeRotFromZX_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, CallFunc_SelectRotator_ReturnValue) == 0x0001FC, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::CallFunc_SelectRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, CallFunc_ComposeRotators_ReturnValue) == 0x000208, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit, CallFunc_SelectRotator_ReturnValue_1) == 0x000214, "Member 'BP_BankRobber_PlaceTurret_Indicator_C_Calculate_Turret_Position_and_Rotation_from_Hit::CallFunc_SelectRotator_ReturnValue_1' has a wrong offset!");

// Function BP_BankRobber_PlaceTurret_Indicator.BP_BankRobber_PlaceTurret_Indicator_C.Find Turret Placement From Pawn View
// 0x0280 (0x0280 - 0x0000)
struct BP_BankRobber_PlaceTurret_Indicator_C_Find_Turret_Placement_From_Pawn_View final
{
public:
	bool                                          UseWallVariation;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                IndicatorPosition;                                 // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               IndicatorRoation;                                  // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             TraceHit;                                          // 0x001C(0x0090)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                L_ImpactNormal;                                    // 0x00AC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             L_TraceHit;                                        // 0x00B8(0x0090)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceFromPawnView_OutHit;             // 0x01D0(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceFromPawnView_ReturnValue;        // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ValidateGadgetNormalPlacement_NormalWithinRangeOut; // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ValidateGadgetNormalPlacement_ReturnValue; // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0263(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Calculate_Turret_Position_and_Rotation_from_Hit_Position; // 0x0264(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Calculate_Turret_Position_and_Rotation_from_Hit_Rotation; // 0x0270(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BankRobber_PlaceTurret_Indicator_C_Find_Turret_Placement_From_Pawn_View) == 0x000008, "Wrong alignment on BP_BankRobber_PlaceTurret_Indicator_C_Find_Turret_Placement_From_Pawn_View");
static_assert(sizeof(BP_BankRobber_PlaceTurret_Indicator_C_Find_Turret_Placement_From_Pawn_View) == 0x000280, "Wrong size on BP_BankRobber_PlaceTurret_Indicator_C_Find_Turret_Placement_From_Pawn_View");
