#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Character_BankRobber

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Player_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Character_BankRobber.BP_Character_BankRobber_C
// 0x0030 (0x1D40 - 0x1D10)
class ABP_Character_BankRobber_C final : public ABP_Player_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Character_BankRobber_C;          // 0x1D08(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCAHUDBRAbilityComponent*               CAHUDBRAbility;                                    // 0x1D10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_BankRobberTurret_C*                BPC_BankRobberTurret;                              // 0x1D18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_NPC*                       Hero_Turret_Ref;                                   // 0x1D20(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldTriggerTurretAvailableDialogue;              // 0x1D28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D29[0x3];                                     // 0x1D29(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   OnAbilityAvailable;                                // 0x1D2C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TurretProperlyDestroyed;                           // 0x1D38(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void ExecuteUbergraph_BP_Character_BankRobber(int32 EntryPoint);
	void SetTurretActive(bool IsActive, const class ACACharacter_NPC*& Turret);
	void TurretDestroyed();
	void BndEvt__m_ability_system_component_K2Node_ComponentBoundEvent_0_OnTrackedTagChange__DelegateSignature(const struct FGameplayTag& Tag, int32 Count);
	void OnTurretDestroyed();
	void SetTurretHealth();
	void OnRep_TurretProperlyDestroyed();
	void OnDeath(class ACACharacter* Character_0, const struct FGameplayEffectSpec& Death_gameplay_effect_spec, float Damage_magnitude, const struct FNetworkedHit& Networked_hit, const class AActor* Killer);
	void ReceiveBeginPlay();

	void IsTurretDestroyed(bool* IsDestroyed) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Character_BankRobber_C">();
	}
	static class ABP_Character_BankRobber_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Character_BankRobber_C>();
	}
};
static_assert(alignof(ABP_Character_BankRobber_C) == 0x000010, "Wrong alignment on ABP_Character_BankRobber_C");
static_assert(sizeof(ABP_Character_BankRobber_C) == 0x001D40, "Wrong size on ABP_Character_BankRobber_C");
static_assert(offsetof(ABP_Character_BankRobber_C, UberGraphFrame_BP_Character_BankRobber_C) == 0x001D08, "Member 'ABP_Character_BankRobber_C::UberGraphFrame_BP_Character_BankRobber_C' has a wrong offset!");
static_assert(offsetof(ABP_Character_BankRobber_C, CAHUDBRAbility) == 0x001D10, "Member 'ABP_Character_BankRobber_C::CAHUDBRAbility' has a wrong offset!");
static_assert(offsetof(ABP_Character_BankRobber_C, BPC_BankRobberTurret) == 0x001D18, "Member 'ABP_Character_BankRobber_C::BPC_BankRobberTurret' has a wrong offset!");
static_assert(offsetof(ABP_Character_BankRobber_C, Hero_Turret_Ref) == 0x001D20, "Member 'ABP_Character_BankRobber_C::Hero_Turret_Ref' has a wrong offset!");
static_assert(offsetof(ABP_Character_BankRobber_C, ShouldTriggerTurretAvailableDialogue) == 0x001D28, "Member 'ABP_Character_BankRobber_C::ShouldTriggerTurretAvailableDialogue' has a wrong offset!");
static_assert(offsetof(ABP_Character_BankRobber_C, OnAbilityAvailable) == 0x001D2C, "Member 'ABP_Character_BankRobber_C::OnAbilityAvailable' has a wrong offset!");
static_assert(offsetof(ABP_Character_BankRobber_C, TurretProperlyDestroyed) == 0x001D38, "Member 'ABP_Character_BankRobber_C::TurretProperlyDestroyed' has a wrong offset!");

}

