#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CuttingBreach

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Keaton_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CAAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CuttingBreach.BP_CuttingBreach_C.ExecuteUbergraph_BP_CuttingBreach
// 0x0940 (0x0940 - 0x0000)
struct BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Percentage;                           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Event_Location;                             // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0074(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x0104(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0194(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Progress;               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_User;                   // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_2;     // 0x01BC(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Owner;                                // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnabled;                             // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICAVaultInterface>     K2Node_DynamicCast_AsCAVault_Interface;            // 0x0268(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A[0x2];                                      // 0x027A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAChallengeManager*                    CallFunc_GetChallengeManager_ReturnValue;          // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCADamageEffectInfo                    K2Node_ComponentBoundEvent_damage_effect_info;     // 0x02C0(0x02F8)(ConstParm)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x05B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BA[0x6];                                      // 0x05BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_VaultBase_C*                        K2Node_DynamicCast_AsBP_Vault_Base;                // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x05C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5CA[0x6];                                      // 0x05CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_VaultBase_C*                        K2Node_DynamicCast_AsBP_Vault_Base_1;              // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D9[0x3];                                      // 0x05D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCaptureProgress_ReturnValue;           // 0x05DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCaptureProgress_ReturnValue_1;         // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x05E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCATeamID                              K2Node_MakeStruct_CATeamID;                        // 0x05F0(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F4[0x4];                                      // 0x05F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_VaultBase_C*                        K2Node_DynamicCast_AsBP_Vault_Base_2;              // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_601[0x3];                                      // 0x0601(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCaptureProgress_ReturnValue_2;         // 0x0604(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_609[0x7];                                      // 0x0609(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_VaultBase_C*                        K2Node_DynamicCast_AsBP_Vault_Base_3;              // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x0619(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61A[0x2];                                      // 0x061A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_3;                             // 0x061C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0620(0x0014)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0634(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0638(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_644[0x4];                                      // 0x0644(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACACharacter_MainPlayer*>        CallFunc_GetAllPlayersWithinDistance_ReturnValue;  // 0x0648(0x0010)(ReferenceParm)
	class ACACharacter_MainPlayer*                CallFunc_Array_Get_Item;                           // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0660(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x066C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66D[0x3];                                      // 0x066D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCATeamID                              CallFunc_GetTeamID_ReturnValue;                    // 0x0670(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TeamIDTeamID_ReturnValue;      // 0x0674(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_675[0x3];                                      // 0x0675(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCATeamID                              CallFunc_GetTeamID_ReturnValue_1;                  // 0x0678(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FCATeamID                              CallFunc_GetTeamID_ReturnValue_2;                  // 0x067C(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0680(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_694[0x4];                                      // 0x0694(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACACharacter_MainPlayer*>        CallFunc_GetPlayersOnTeamWithinDistance_ReturnValue; // 0x0698(0x0010)(ReferenceParm)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x06A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_SortArrayByDistanceToActor_ReturnValue;   // 0x06B0(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x06C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACACharacter_MainPlayer*>        CallFunc_GetPlayersOnTeamWithinDistance_ReturnValue_1; // 0x06C8(0x0010)(ReferenceParm)
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x06D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E1[0x3];                                      // 0x06E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x06E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player_1;    // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x06F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F1[0x7];                                      // 0x06F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SortArrayByDistanceToActor_ReturnValue_1; // 0x06F8(0x0010)(ReferenceParm)
	class ACASecurityModule*                      CallFunc_GetCurrentSecurityModuleActor_ReturnValue; // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player_2;    // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_721[0x3];                                      // 0x0721(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0724(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_729[0x3];                                      // 0x0729(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCATeamID                              CallFunc_GetTeamID_ReturnValue_3;                  // 0x072C(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0730(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_744[0x4];                                      // 0x0744(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SecurityArea_C*                     K2Node_DynamicCast_AsBP_Security_Area;             // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_751[0x3];                                      // 0x0751(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x0754(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_2;                          // 0x0768(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_77C[0x4];                                      // 0x077C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0780(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0790(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_791[0x3];                                      // 0x0791(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCaptureEffectPeriod_Period;            // 0x0794(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBreachingUpgradeMagnatude_Magnatude;   // 0x0798(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetActivatingStateDuration_Duration;      // 0x079C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x07A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A4[0x4];                                      // 0x07A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAVaultActor*                          K2Node_DynamicCast_AsCAVault_Actor;                // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x07B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B1[0x3];                                      // 0x07B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x07B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C1[0x3];                                      // 0x07C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x07C4(0x000C)(NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x07D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_1;     // 0x07DC(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x07E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x07E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x07EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7EB[0x5];                                      // 0x07EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAFoamManagementComponent*             CallFunc_GetFirstActiveFoam_ReturnValue;           // 0x07F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x07F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F9[0x3];                                      // 0x07F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x07FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0800(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_801[0x7];                                      // 0x0801(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x0808(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x0818(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_819[0x3];                                      // 0x0819(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x081C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAVaultActor*                          K2Node_DynamicCast_AsCAVault_Actor_1;              // 0x0820(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0828(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0829(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82A[0x2];                                      // 0x082A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x082C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x0830(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_831[0x7];                                      // 0x0831(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_2;            // 0x0838(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_2;                 // 0x0848(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_849[0x3];                                      // 0x0849(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_4;                             // 0x084C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0850(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_3;     // 0x0854(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x08E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E5[0x3];                                      // 0x08E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCATeamID                              CallFunc_GetTeamID_ReturnValue_4;                  // 0x08E8(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8EC[0x4];                                      // 0x08EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACACharacter_MainPlayer*>        CallFunc_GetPlayersOnTeam_ReturnValue;             // 0x08F0(0x0010)(ReferenceParm)
	class ACACharacter_MainPlayer*                CallFunc_Array_Get_Item_3;                         // 0x0900(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0908(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x090C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_90D[0x3];                                      // 0x090D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACASecurityArea*                        CallFunc_GetCurrentSecurityArea_ReturnValue;       // 0x0910(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0918(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_919[0x3];                                      // 0x0919(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x091C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetSecurityAreas_Areas;                   // 0x0928(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_4;                         // 0x0938(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach) == 0x000010, "Wrong alignment on BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach");
static_assert(sizeof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach) == 0x000940, "Wrong size on BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, EntryPoint) == 0x000000, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, Temp_float_Variable) == 0x000004, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, Temp_int_Variable) == 0x000008, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_Event_Percentage) == 0x000018, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_Event_Percentage' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_Event_Location) == 0x000020, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_Event_Location' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_BreakTransform_Location) == 0x000050, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_BreakTransform_Rotation) == 0x00005C, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_BreakTransform_Scale) == 0x000068, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000074, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x000104, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000194, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, Temp_int_Array_Index_Variable_1) == 0x00019C, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_ComponentBoundEvent_Progress) == 0x0001A0, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_ComponentBoundEvent_Progress' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_ComponentBoundEvent_User) == 0x0001A8, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_ComponentBoundEvent_User' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_VLerp_ReturnValue) == 0x0001B0, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_K2_SetWorldLocation_SweepHitResult_2) == 0x0001BC, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_K2_SetWorldLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_Event_Owner) == 0x000250, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_Event_Owner' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_Event_bEnabled) == 0x000258, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_Event_bEnabled' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, Temp_int_Loop_Counter_Variable_1) == 0x00025C, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_Add_IntInt_ReturnValue_1) == 0x000260, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_DynamicCast_AsCAVault_Interface) == 0x000268, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_DynamicCast_AsCAVault_Interface' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_DynamicCast_bSuccess) == 0x000278, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000279, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_Add_IntInt_ReturnValue_2) == 0x00027C, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_HasAuthority_ReturnValue) == 0x000280, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, Temp_float_Variable_1) == 0x000284, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_HasAuthority_ReturnValue_1) == 0x000288, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_DynamicCast_AsPawn) == 0x000290, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_DynamicCast_bSuccess_1) == 0x000298, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_GetChallengeManager_ReturnValue) == 0x0002A0, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_GetChallengeManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_IsValid_ReturnValue) == 0x0002A8, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, Temp_float_Variable_2) == 0x0002AC, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0002B0, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_HasAuthority_ReturnValue_2) == 0x0002BC, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_ComponentBoundEvent_damage_effect_info) == 0x0002C0, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_ComponentBoundEvent_damage_effect_info' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_IsServer_ReturnValue) == 0x0005B8, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_BooleanAND_ReturnValue) == 0x0005B9, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_DynamicCast_AsBP_Vault_Base) == 0x0005C0, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_DynamicCast_AsBP_Vault_Base' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_DynamicCast_bSuccess_2) == 0x0005C8, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_BooleanAND_ReturnValue_1) == 0x0005C9, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_DynamicCast_AsBP_Vault_Base_1) == 0x0005D0, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_DynamicCast_AsBP_Vault_Base_1' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_DynamicCast_bSuccess_3) == 0x0005D8, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_GetCaptureProgress_ReturnValue) == 0x0005DC, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_GetCaptureProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_GetCaptureProgress_ReturnValue_1) == 0x0005E0, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_GetCaptureProgress_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_GetTagName_ReturnValue) == 0x0005E4, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_GetTagName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_MakeStruct_CATeamID) == 0x0005F0, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_MakeStruct_CATeamID' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_DynamicCast_AsBP_Vault_Base_2) == 0x0005F8, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_DynamicCast_AsBP_Vault_Base_2' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_DynamicCast_bSuccess_4) == 0x000600, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_GetCaptureProgress_ReturnValue_2) == 0x000604, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_GetCaptureProgress_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_HasAuthority_ReturnValue_3) == 0x000608, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_DynamicCast_AsBP_Vault_Base_3) == 0x000610, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_DynamicCast_AsBP_Vault_Base_3' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_DynamicCast_bSuccess_5) == 0x000618, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_HasAuthority_ReturnValue_4) == 0x000619, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_HasAuthority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, Temp_float_Variable_3) == 0x00061C, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_CreateDelegate_OutputDelegate) == 0x000620, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, Temp_int_Array_Index_Variable_2) == 0x000634, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000638, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_GetAllPlayersWithinDistance_ReturnValue) == 0x000648, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_GetAllPlayersWithinDistance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_Array_Get_Item) == 0x000658, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000660, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_IsValid_ReturnValue_1) == 0x00066C, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_GetTeamID_ReturnValue) == 0x000670, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_EqualEqual_TeamIDTeamID_ReturnValue) == 0x000674, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_EqualEqual_TeamIDTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_GetTeamID_ReturnValue_1) == 0x000678, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_GetTeamID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_GetTeamID_ReturnValue_2) == 0x00067C, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_GetTeamID_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_CreateDelegate_OutputDelegate_1) == 0x000680, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_GetPlayersOnTeamWithinDistance_ReturnValue) == 0x000698, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_GetPlayersOnTeamWithinDistance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0006A8, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_SortArrayByDistanceToActor_ReturnValue) == 0x0006B0, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_SortArrayByDistanceToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_Array_Get_Item_1) == 0x0006C0, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_GetPlayersOnTeamWithinDistance_ReturnValue_1) == 0x0006C8, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_GetPlayersOnTeamWithinDistance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x0006D8, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_DynamicCast_bSuccess_6) == 0x0006E0, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_Array_Length_ReturnValue) == 0x0006E4, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_DynamicCast_AsCACharacter_Main_Player_1) == 0x0006E8, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_DynamicCast_AsCACharacter_Main_Player_1' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_DynamicCast_bSuccess_7) == 0x0006F0, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_SortArrayByDistanceToActor_ReturnValue_1) == 0x0006F8, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_SortArrayByDistanceToActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_GetCurrentSecurityModuleActor_ReturnValue) == 0x000708, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_GetCurrentSecurityModuleActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_Array_Get_Item_2) == 0x000710, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_DynamicCast_AsCACharacter_Main_Player_2) == 0x000718, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_DynamicCast_AsCACharacter_Main_Player_2' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_DynamicCast_bSuccess_8) == 0x000720, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_Array_Length_ReturnValue_1) == 0x000724, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_Less_IntInt_ReturnValue) == 0x000728, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_GetTeamID_ReturnValue_3) == 0x00072C, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_GetTeamID_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, Temp_delegate_Variable) == 0x000730, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_DynamicCast_AsBP_Security_Area) == 0x000748, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_DynamicCast_AsBP_Security_Area' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_DynamicCast_bSuccess_9) == 0x000750, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, Temp_delegate_Variable_1) == 0x000754, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, Temp_delegate_Variable_2) == 0x000768, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_PlayEvent_playback_instance) == 0x000780, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_PlayEvent_play_success) == 0x000790, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_GetCaptureEffectPeriod_Period) == 0x000794, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_GetCaptureEffectPeriod_Period' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_GetBreachingUpgradeMagnatude_Magnatude) == 0x000798, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_GetBreachingUpgradeMagnatude_Magnatude' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_GetActivatingStateDuration_Duration) == 0x00079C, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_GetActivatingStateDuration_Duration' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0007A0, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_DynamicCast_AsCAVault_Actor) == 0x0007A8, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_DynamicCast_AsCAVault_Actor' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_DynamicCast_bSuccess_10) == 0x0007B0, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, Temp_name_Variable) == 0x0007B4, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, Temp_bool_Variable) == 0x0007C0, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x0007C4, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_Select_Default) == 0x0007D0, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_MakeLiteralGameplayTag_ReturnValue_1) == 0x0007DC, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_MakeLiteralGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_IsDedicatedServer_ReturnValue) == 0x0007E8, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0007E9, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_IsValid_ReturnValue_2) == 0x0007EA, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_GetFirstActiveFoam_ReturnValue) == 0x0007F0, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_GetFirstActiveFoam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_IsValid_ReturnValue_3) == 0x0007F8, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, Temp_int_Variable_1) == 0x0007FC, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000800, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_PlayEvent_playback_instance_1) == 0x000808, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, CallFunc_PlayEvent_play_success_1) == 0x000818, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::CallFunc_PlayEvent_play_success_1' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, Temp_int_Loop_Counter_Variable_2) == 0x00081C, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_DynamicCast_AsCAVault_Actor_1) == 0x000820, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_DynamicCast_AsCAVault_Actor_1' has a wrong offset!");
static_assert(offsetof(BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach, K2Node_DynamicCast_bSuccess_11) == 0x000828, "Member 'BP_CuttingBreach_C_ExecuteUbergraph_BP_CuttingBreach::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
