#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterNPCAudioComponent_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CharacterNPCAudioComponent_Base.BP_CharacterNPCAudioComponent_Base_C
// 0x0020 (0x0278 - 0x0258)
class UBP_CharacterNPCAudioComponent_Base_C : public UCACharacterAudioComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ACACharacter_NPC*                       OwnerCharacter;                                    // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnAwarenessStateChange;                            // 0x0268(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnAwarenessStateChange__DelegateSignature();
	void ExecuteUbergraph_BP_CharacterNPCAudioComponent_Base(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CharacterNPCAudioComponent_Base_C">();
	}
	static class UBP_CharacterNPCAudioComponent_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CharacterNPCAudioComponent_Base_C>();
	}
};
static_assert(alignof(UBP_CharacterNPCAudioComponent_Base_C) == 0x000008, "Wrong alignment on UBP_CharacterNPCAudioComponent_Base_C");
static_assert(sizeof(UBP_CharacterNPCAudioComponent_Base_C) == 0x000278, "Wrong size on UBP_CharacterNPCAudioComponent_Base_C");
static_assert(offsetof(UBP_CharacterNPCAudioComponent_Base_C, UberGraphFrame) == 0x000258, "Member 'UBP_CharacterNPCAudioComponent_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_CharacterNPCAudioComponent_Base_C, OwnerCharacter) == 0x000260, "Member 'UBP_CharacterNPCAudioComponent_Base_C::OwnerCharacter' has a wrong offset!");
static_assert(offsetof(UBP_CharacterNPCAudioComponent_Base_C, OnAwarenessStateChange) == 0x000268, "Member 'UBP_CharacterNPCAudioComponent_Base_C::OnAwarenessStateChange' has a wrong offset!");

}

