#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CarouselBox

#include "Basic.hpp"

#include "Keaton_structs.hpp"
#include "CAAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CarouselBox.BP_CarouselBox_C.ExecuteUbergraph_BP_CarouselBox
// 0x0248 (0x0248 - 0x0000)
struct BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Focused_data)>  K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0018(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x002C(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	class ACAPlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0048(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAPlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue_1;   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x0068(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCAServicesDataItem*>            CallFunc_GetSpecialists_ReturnValue;               // 0x0080(0x0010)(ReferenceParm)
	class UCAServicesDataItem*                    CallFunc_GetPendingSpecialist_ReturnValue;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_skip_unowned_entitlements;      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAUIEventData& Event_data)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x009C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAUIEventData& Event_data)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00B0(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAUIEventData                         K2Node_CustomEvent_event_data_1;                   // 0x00C8(0x0080)()
	struct FCAUIEventData                         K2Node_CustomEvent_event_data;                     // 0x0148(0x0080)()
	TDelegate<void(const struct FCAUIEventData& Event_data)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x01C8(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAUIEventData& Event_data)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x01DC(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Focused_data)>  K2Node_CreateDelegate_OutputDelegate_5;            // 0x01F0(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UObject*                          K2Node_CustomEvent_focused_data;                   // 0x0208(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAServicesDataItem*                    K2Node_DynamicCast_AsCAServices_Data_Item;         // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAServicesDataItem*                    CallFunc_GetPendingSpecialist_ReturnValue_1;       // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0228(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0240(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox) == 0x000008, "Wrong alignment on BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox");
static_assert(sizeof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox) == 0x000248, "Wrong size on BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox");
static_assert(offsetof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox, EntryPoint) == 0x000000, "Member 'BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox, Temp_delegate_Variable) == 0x000018, "Member 'BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox, Temp_delegate_Variable_1) == 0x00002C, "Member 'BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000040, "Member 'BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox, CallFunc_PlayEvent_playback_instance) == 0x000048, "Member 'BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox, CallFunc_PlayEvent_play_success) == 0x000058, "Member 'BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox, CallFunc_GetLocalPlayerController_ReturnValue_1) == 0x000060, "Member 'BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox::CallFunc_GetLocalPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox, CallFunc_PlayEvent_playback_instance_1) == 0x000068, "Member 'BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox, CallFunc_PlayEvent_play_success_1) == 0x000078, "Member 'BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox::CallFunc_PlayEvent_play_success_1' has a wrong offset!");
static_assert(offsetof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox, CallFunc_GetSpecialists_ReturnValue) == 0x000080, "Member 'BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox::CallFunc_GetSpecialists_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox, CallFunc_GetPendingSpecialist_ReturnValue) == 0x000090, "Member 'BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox::CallFunc_GetPendingSpecialist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox, K2Node_CustomEvent_skip_unowned_entitlements) == 0x000098, "Member 'BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox::K2Node_CustomEvent_skip_unowned_entitlements' has a wrong offset!");
static_assert(offsetof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox, K2Node_CreateDelegate_OutputDelegate_1) == 0x00009C, "Member 'BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000B0, "Member 'BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox, K2Node_CustomEvent_event_data_1) == 0x0000C8, "Member 'BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox::K2Node_CustomEvent_event_data_1' has a wrong offset!");
static_assert(offsetof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox, K2Node_CustomEvent_event_data) == 0x000148, "Member 'BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox::K2Node_CustomEvent_event_data' has a wrong offset!");
static_assert(offsetof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001C8, "Member 'BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001DC, "Member 'BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001F0, "Member 'BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox, K2Node_CustomEvent_focused_data) == 0x000208, "Member 'BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox::K2Node_CustomEvent_focused_data' has a wrong offset!");
static_assert(offsetof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox, K2Node_DynamicCast_AsCAServices_Data_Item) == 0x000210, "Member 'BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox::K2Node_DynamicCast_AsCAServices_Data_Item' has a wrong offset!");
static_assert(offsetof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox, K2Node_DynamicCast_bSuccess) == 0x000218, "Member 'BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox, CallFunc_GetPendingSpecialist_ReturnValue_1) == 0x000220, "Member 'BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox::CallFunc_GetPendingSpecialist_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox, K2Node_CreateDelegate_OutputDelegate_6) == 0x000228, "Member 'BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000240, "Member 'BP_CarouselBox_C_ExecuteUbergraph_BP_CarouselBox::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function BP_CarouselBox.BP_CarouselBox_C.OnCarouselFocusedEntryChanged
// 0x0008 (0x0008 - 0x0000)
struct BP_CarouselBox_C_OnCarouselFocusedEntryChanged final
{
public:
	const class UObject*                          Focused_data;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CarouselBox_C_OnCarouselFocusedEntryChanged) == 0x000008, "Wrong alignment on BP_CarouselBox_C_OnCarouselFocusedEntryChanged");
static_assert(sizeof(BP_CarouselBox_C_OnCarouselFocusedEntryChanged) == 0x000008, "Wrong size on BP_CarouselBox_C_OnCarouselFocusedEntryChanged");
static_assert(offsetof(BP_CarouselBox_C_OnCarouselFocusedEntryChanged, Focused_data) == 0x000000, "Member 'BP_CarouselBox_C_OnCarouselFocusedEntryChanged::Focused_data' has a wrong offset!");

// Function BP_CarouselBox.BP_CarouselBox_C.OnLateralPrevious
// 0x0080 (0x0080 - 0x0000)
struct BP_CarouselBox_C_OnLateralPrevious final
{
public:
	struct FCAUIEventData                         Event_data;                                        // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_CarouselBox_C_OnLateralPrevious) == 0x000008, "Wrong alignment on BP_CarouselBox_C_OnLateralPrevious");
static_assert(sizeof(BP_CarouselBox_C_OnLateralPrevious) == 0x000080, "Wrong size on BP_CarouselBox_C_OnLateralPrevious");
static_assert(offsetof(BP_CarouselBox_C_OnLateralPrevious, Event_data) == 0x000000, "Member 'BP_CarouselBox_C_OnLateralPrevious::Event_data' has a wrong offset!");

// Function BP_CarouselBox.BP_CarouselBox_C.OnLateralNext
// 0x0080 (0x0080 - 0x0000)
struct BP_CarouselBox_C_OnLateralNext final
{
public:
	struct FCAUIEventData                         Event_data;                                        // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_CarouselBox_C_OnLateralNext) == 0x000008, "Wrong alignment on BP_CarouselBox_C_OnLateralNext");
static_assert(sizeof(BP_CarouselBox_C_OnLateralNext) == 0x000080, "Wrong size on BP_CarouselBox_C_OnLateralNext");
static_assert(offsetof(BP_CarouselBox_C_OnLateralNext, Event_data) == 0x000000, "Member 'BP_CarouselBox_C_OnLateralNext::Event_data' has a wrong offset!");

// Function BP_CarouselBox.BP_CarouselBox_C.OnEnable
// 0x0001 (0x0001 - 0x0000)
struct BP_CarouselBox_C_OnEnable final
{
public:
	bool                                          Skip_unowned_entitlements;                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CarouselBox_C_OnEnable) == 0x000001, "Wrong alignment on BP_CarouselBox_C_OnEnable");
static_assert(sizeof(BP_CarouselBox_C_OnEnable) == 0x000001, "Wrong size on BP_CarouselBox_C_OnEnable");
static_assert(offsetof(BP_CarouselBox_C_OnEnable, Skip_unowned_entitlements) == 0x000000, "Member 'BP_CarouselBox_C_OnEnable::Skip_unowned_entitlements' has a wrong offset!");

}

