#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CarouselBoxItemDisplayElement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_CarouselBoxItemDisplayElement.BP_CarouselBoxItemDisplayElement_C
// 0x0018 (0x0328 - 0x0310)
class UBP_CarouselBoxItemDisplayElement_C final : public UCAServicesItemDisplayElement
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCATextBlock*                           Text_selected;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCACommonTextBlock*                     Text_selected_new;                                 // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CarouselBoxItemDisplayElement(int32 EntryPoint);
	void SetDisplay(const class UCAServicesDataItem* Services_data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CarouselBoxItemDisplayElement_C">();
	}
	static class UBP_CarouselBoxItemDisplayElement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CarouselBoxItemDisplayElement_C>();
	}
};
static_assert(alignof(UBP_CarouselBoxItemDisplayElement_C) == 0x000008, "Wrong alignment on UBP_CarouselBoxItemDisplayElement_C");
static_assert(sizeof(UBP_CarouselBoxItemDisplayElement_C) == 0x000328, "Wrong size on UBP_CarouselBoxItemDisplayElement_C");
static_assert(offsetof(UBP_CarouselBoxItemDisplayElement_C, UberGraphFrame) == 0x000310, "Member 'UBP_CarouselBoxItemDisplayElement_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_CarouselBoxItemDisplayElement_C, Text_selected) == 0x000318, "Member 'UBP_CarouselBoxItemDisplayElement_C::Text_selected' has a wrong offset!");
static_assert(offsetof(UBP_CarouselBoxItemDisplayElement_C, Text_selected_new) == 0x000320, "Member 'UBP_CarouselBoxItemDisplayElement_C::Text_selected_new' has a wrong offset!");

}

