#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CAAIController_SemiAutoTurret

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CAAIController_SemiAutoTurret.BP_CAAIController_SemiAutoTurret_C.ExecuteUbergraph_BP_CAAIController_SemiAutoTurret
// 0x0018 (0x0018 - 0x0000)
struct BP_CAAIController_SemiAutoTurret_C_ExecuteUbergraph_BP_CAAIController_SemiAutoTurret final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_UseBlackboard_BlackboardComponent;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseBlackboard_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RunBehaviorTree_ReturnValue;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CAAIController_SemiAutoTurret_C_ExecuteUbergraph_BP_CAAIController_SemiAutoTurret) == 0x000008, "Wrong alignment on BP_CAAIController_SemiAutoTurret_C_ExecuteUbergraph_BP_CAAIController_SemiAutoTurret");
static_assert(sizeof(BP_CAAIController_SemiAutoTurret_C_ExecuteUbergraph_BP_CAAIController_SemiAutoTurret) == 0x000018, "Wrong size on BP_CAAIController_SemiAutoTurret_C_ExecuteUbergraph_BP_CAAIController_SemiAutoTurret");
static_assert(offsetof(BP_CAAIController_SemiAutoTurret_C_ExecuteUbergraph_BP_CAAIController_SemiAutoTurret, EntryPoint) == 0x000000, "Member 'BP_CAAIController_SemiAutoTurret_C_ExecuteUbergraph_BP_CAAIController_SemiAutoTurret::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CAAIController_SemiAutoTurret_C_ExecuteUbergraph_BP_CAAIController_SemiAutoTurret, CallFunc_UseBlackboard_BlackboardComponent) == 0x000008, "Member 'BP_CAAIController_SemiAutoTurret_C_ExecuteUbergraph_BP_CAAIController_SemiAutoTurret::CallFunc_UseBlackboard_BlackboardComponent' has a wrong offset!");
static_assert(offsetof(BP_CAAIController_SemiAutoTurret_C_ExecuteUbergraph_BP_CAAIController_SemiAutoTurret, CallFunc_UseBlackboard_ReturnValue) == 0x000010, "Member 'BP_CAAIController_SemiAutoTurret_C_ExecuteUbergraph_BP_CAAIController_SemiAutoTurret::CallFunc_UseBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CAAIController_SemiAutoTurret_C_ExecuteUbergraph_BP_CAAIController_SemiAutoTurret, CallFunc_RunBehaviorTree_ReturnValue) == 0x000011, "Member 'BP_CAAIController_SemiAutoTurret_C_ExecuteUbergraph_BP_CAAIController_SemiAutoTurret::CallFunc_RunBehaviorTree_ReturnValue' has a wrong offset!");

}

