#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeathEffect_Grunt

#include "Basic.hpp"

#include "Keaton_structs.hpp"
#include "CAAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DeathEffect_Grunt.BP_DeathEffect_Grunt_C.ExecuteUbergraph_BP_DeathEffect_Grunt
// 0x0160 (0x0160 - 0x0000)
struct BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_tween_float_output;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOUT_EXEC_TWEEN                               CallFunc_tween_float_exec;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkedHit                          K2Node_Event_hit;                                  // 0x0010(0x0068)(ConstParm, NoDestructor)
	bool                                          K2Node_CustomEvent_is_in_pool;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x007C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0090(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPawnMesh_ReturnValue;                  // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAtLocation_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D3[0x1];                                       // 0x00D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00E4(0x0014)(ZeroConstructor, NoDestructor)
	class USkeletalMeshComponent*                 CallFunc_GetPawnMesh_ReturnValue_1;                // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BodyRemoval_C*                      CallFunc_SpawnCAAttachedEffect_ReturnValue;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x0108(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0120(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x0138(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue_1; // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0158(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt) == 0x000008, "Wrong alignment on BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt");
static_assert(sizeof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt) == 0x000160, "Wrong size on BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, EntryPoint) == 0x000000, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, CallFunc_tween_float_output) == 0x000008, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::CallFunc_tween_float_output' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, CallFunc_tween_float_exec) == 0x00000C, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::CallFunc_tween_float_exec' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, K2Node_SwitchEnum_CmpSuccess) == 0x00000D, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, CallFunc_IsValid_ReturnValue) == 0x00000E, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, K2Node_Event_hit) == 0x000010, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::K2Node_Event_hit' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, K2Node_CustomEvent_is_in_pool) == 0x000078, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::K2Node_CustomEvent_is_in_pool' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, K2Node_CreateDelegate_OutputDelegate) == 0x00007C, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, Temp_delegate_Variable) == 0x000090, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, CallFunc_IsValid_ReturnValue_1) == 0x0000A4, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, CallFunc_GetPawnMesh_ReturnValue) == 0x0000A8, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::CallFunc_GetPawnMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, CallFunc_IsValid_ReturnValue_2) == 0x0000B0, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, CallFunc_GetSocketLocation_ReturnValue) == 0x0000B4, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue) == 0x0000C0, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, CallFunc_SpawnCANiagaraSystemAtLocation_ReturnValue) == 0x0000C8, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::CallFunc_SpawnCANiagaraSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, CallFunc_IsValid_ReturnValue_3) == 0x0000D0, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000D1, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000D2, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, CallFunc_GetForwardVector_ReturnValue) == 0x0000D4, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, CallFunc_IsValid_ReturnValue_4) == 0x0000E0, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000E4, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, CallFunc_GetPawnMesh_ReturnValue_1) == 0x0000F8, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::CallFunc_GetPawnMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, CallFunc_SpawnCAAttachedEffect_ReturnValue) == 0x000100, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::CallFunc_SpawnCAAttachedEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, Temp_delegate_Variable_1) == 0x000108, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, CallFunc_PlayEvent_playback_instance) == 0x000120, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, CallFunc_PlayEvent_play_success) == 0x000130, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, CallFunc_PlayEvent_playback_instance_1) == 0x000138, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, CallFunc_PlayEvent_play_success_1) == 0x000148, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::CallFunc_PlayEvent_play_success_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue_1) == 0x000150, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000158, "Member 'BP_DeathEffect_Grunt_C_ExecuteUbergraph_BP_DeathEffect_Grunt::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function BP_DeathEffect_Grunt.BP_DeathEffect_Grunt_C.OnPoolStateChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_DeathEffect_Grunt_C_OnPoolStateChanged final
{
public:
	bool                                          Is_in_pool;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DeathEffect_Grunt_C_OnPoolStateChanged) == 0x000001, "Wrong alignment on BP_DeathEffect_Grunt_C_OnPoolStateChanged");
static_assert(sizeof(BP_DeathEffect_Grunt_C_OnPoolStateChanged) == 0x000001, "Wrong size on BP_DeathEffect_Grunt_C_OnPoolStateChanged");
static_assert(offsetof(BP_DeathEffect_Grunt_C_OnPoolStateChanged, Is_in_pool) == 0x000000, "Member 'BP_DeathEffect_Grunt_C_OnPoolStateChanged::Is_in_pool' has a wrong offset!");

// Function BP_DeathEffect_Grunt.BP_DeathEffect_Grunt_C.OnShotAfterDeath
// 0x0068 (0x0068 - 0x0000)
struct BP_DeathEffect_Grunt_C_OnShotAfterDeath final
{
public:
	struct FNetworkedHit                          Hit;                                               // 0x0000(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_DeathEffect_Grunt_C_OnShotAfterDeath) == 0x000008, "Wrong alignment on BP_DeathEffect_Grunt_C_OnShotAfterDeath");
static_assert(sizeof(BP_DeathEffect_Grunt_C_OnShotAfterDeath) == 0x000068, "Wrong size on BP_DeathEffect_Grunt_C_OnShotAfterDeath");
static_assert(offsetof(BP_DeathEffect_Grunt_C_OnShotAfterDeath, Hit) == 0x000000, "Member 'BP_DeathEffect_Grunt_C_OnShotAfterDeath::Hit' has a wrong offset!");

}

