#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeathEffect_Elite

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BS_PropNamePair_structs.hpp"
#include "Keaton_structs.hpp"
#include "Keaton_classes.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DeathEffect_Elite.BP_DeathEffect_Elite_C
// 0x00C8 (0x0658 - 0x0590)
class ABP_DeathEffect_Elite_C final : public ACADeathEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   PRC_ExoLowerArm_RT;                                // 0x05A0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   PRC_ExoLowerArm_LF;                                // 0x05AC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   PRC_ExoClavicle_RT;                                // 0x05B8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   PRC_ExoClavicle_LF;                                // 0x05C4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SKL_UpperLeg_RT;                                   // 0x05D0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SKL_UpperLeg_LF;                                   // 0x05DC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SKL_LowerLeg_RT;                                   // 0x05E8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SKL_LowerLeg_LF;                                   // 0x05F4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   PRC_exoShoeJA_RT;                                  // 0x0600(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   PRC_exoShoeJA_LF;                                  // 0x060C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpawnPropCount;                                    // 0x0618(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61C[0x4];                                      // 0x061C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBS_PropNamePair>               PropList;                                          // 0x0620(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Initial_Explosion_Spawn_Count;                     // 0x0630(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Explosion_Spawn_Count;                             // 0x0634(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FirstSmallExplosionPlayed;                         // 0x0638(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ZeroG;                                             // 0x0639(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          FailCheck;                                         // 0x063A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63B[0x5];                                      // 0x063B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      DeathVFX;                                          // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           FloorCheckTimer;                                   // 0x0648(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         VFXEndTime;                                        // 0x0650(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DeathEffect_Elite(int32 EntryPoint);
	void FailSave();
	void End();
	void OnDeath();
	void SpawnProps();
	void OnAnimNotifyDeath();
	void FallCheck();
	void FloorHit(EPhysicalSurface SurfaceType, const struct FHitResult& HitResult, const struct FCATraceAuxiliaryResult& AuxiliaryResult);
	void DisintegrateVFX();
	void VFXComplete();
	void CustomEvent(EPhysicalSurface SurfaceType, const struct FHitResult& HitResult, const struct FCATraceAuxiliaryResult& AuxiliaryResult);
	void BodyRemovalEnd();
	void Activate_BodyRemoval();
	void ActivateWeaponsRemoval(class ACACharacter* Actor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DeathEffect_Elite_C">();
	}
	static class ABP_DeathEffect_Elite_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DeathEffect_Elite_C>();
	}
};
static_assert(alignof(ABP_DeathEffect_Elite_C) == 0x000008, "Wrong alignment on ABP_DeathEffect_Elite_C");
static_assert(sizeof(ABP_DeathEffect_Elite_C) == 0x000658, "Wrong size on ABP_DeathEffect_Elite_C");
static_assert(offsetof(ABP_DeathEffect_Elite_C, UberGraphFrame) == 0x000590, "Member 'ABP_DeathEffect_Elite_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DeathEffect_Elite_C, DefaultSceneRoot) == 0x000598, "Member 'ABP_DeathEffect_Elite_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_DeathEffect_Elite_C, PRC_ExoLowerArm_RT) == 0x0005A0, "Member 'ABP_DeathEffect_Elite_C::PRC_ExoLowerArm_RT' has a wrong offset!");
static_assert(offsetof(ABP_DeathEffect_Elite_C, PRC_ExoLowerArm_LF) == 0x0005AC, "Member 'ABP_DeathEffect_Elite_C::PRC_ExoLowerArm_LF' has a wrong offset!");
static_assert(offsetof(ABP_DeathEffect_Elite_C, PRC_ExoClavicle_RT) == 0x0005B8, "Member 'ABP_DeathEffect_Elite_C::PRC_ExoClavicle_RT' has a wrong offset!");
static_assert(offsetof(ABP_DeathEffect_Elite_C, PRC_ExoClavicle_LF) == 0x0005C4, "Member 'ABP_DeathEffect_Elite_C::PRC_ExoClavicle_LF' has a wrong offset!");
static_assert(offsetof(ABP_DeathEffect_Elite_C, SKL_UpperLeg_RT) == 0x0005D0, "Member 'ABP_DeathEffect_Elite_C::SKL_UpperLeg_RT' has a wrong offset!");
static_assert(offsetof(ABP_DeathEffect_Elite_C, SKL_UpperLeg_LF) == 0x0005DC, "Member 'ABP_DeathEffect_Elite_C::SKL_UpperLeg_LF' has a wrong offset!");
static_assert(offsetof(ABP_DeathEffect_Elite_C, SKL_LowerLeg_RT) == 0x0005E8, "Member 'ABP_DeathEffect_Elite_C::SKL_LowerLeg_RT' has a wrong offset!");
static_assert(offsetof(ABP_DeathEffect_Elite_C, SKL_LowerLeg_LF) == 0x0005F4, "Member 'ABP_DeathEffect_Elite_C::SKL_LowerLeg_LF' has a wrong offset!");
static_assert(offsetof(ABP_DeathEffect_Elite_C, PRC_exoShoeJA_RT) == 0x000600, "Member 'ABP_DeathEffect_Elite_C::PRC_exoShoeJA_RT' has a wrong offset!");
static_assert(offsetof(ABP_DeathEffect_Elite_C, PRC_exoShoeJA_LF) == 0x00060C, "Member 'ABP_DeathEffect_Elite_C::PRC_exoShoeJA_LF' has a wrong offset!");
static_assert(offsetof(ABP_DeathEffect_Elite_C, SpawnPropCount) == 0x000618, "Member 'ABP_DeathEffect_Elite_C::SpawnPropCount' has a wrong offset!");
static_assert(offsetof(ABP_DeathEffect_Elite_C, PropList) == 0x000620, "Member 'ABP_DeathEffect_Elite_C::PropList' has a wrong offset!");
static_assert(offsetof(ABP_DeathEffect_Elite_C, Initial_Explosion_Spawn_Count) == 0x000630, "Member 'ABP_DeathEffect_Elite_C::Initial_Explosion_Spawn_Count' has a wrong offset!");
static_assert(offsetof(ABP_DeathEffect_Elite_C, Explosion_Spawn_Count) == 0x000634, "Member 'ABP_DeathEffect_Elite_C::Explosion_Spawn_Count' has a wrong offset!");
static_assert(offsetof(ABP_DeathEffect_Elite_C, FirstSmallExplosionPlayed) == 0x000638, "Member 'ABP_DeathEffect_Elite_C::FirstSmallExplosionPlayed' has a wrong offset!");
static_assert(offsetof(ABP_DeathEffect_Elite_C, ZeroG) == 0x000639, "Member 'ABP_DeathEffect_Elite_C::ZeroG' has a wrong offset!");
static_assert(offsetof(ABP_DeathEffect_Elite_C, FailCheck) == 0x00063A, "Member 'ABP_DeathEffect_Elite_C::FailCheck' has a wrong offset!");
static_assert(offsetof(ABP_DeathEffect_Elite_C, DeathVFX) == 0x000640, "Member 'ABP_DeathEffect_Elite_C::DeathVFX' has a wrong offset!");
static_assert(offsetof(ABP_DeathEffect_Elite_C, FloorCheckTimer) == 0x000648, "Member 'ABP_DeathEffect_Elite_C::FloorCheckTimer' has a wrong offset!");
static_assert(offsetof(ABP_DeathEffect_Elite_C, VFXEndTime) == 0x000650, "Member 'ABP_DeathEffect_Elite_C::VFXEndTime' has a wrong offset!");

}

