#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeathEffect_Elite

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Keaton_structs.hpp"
#include "CAAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_DeathEffect_Elite.BP_DeathEffect_Elite_C.ExecuteUbergraph_BP_DeathEffect_Elite
// 0x04F0 (0x04F0 - 0x0000)
struct BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	class UMaterialInterface*                     CallFunc_ZeroGMaterialSwitch_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPawnMesh_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BodyRemoval_C*                      CallFunc_SpawnCAAttachedEffect_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_1;       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZeroGravity_ReturnValue;              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPawnMesh_ReturnValue_1;                // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_6;         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              K2Node_CustomEvent_SurfaceType_1;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_HitResult_1;                    // 0x00CC(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FCATraceAuxiliaryResult                K2Node_CustomEvent_AuxiliaryResult_1;              // 0x015C(0x000C)(NoDestructor)
	TDelegate<void(EPhysicalSurface SurfaceType, const struct FHitResult& HitResult, const struct FCATraceAuxiliaryResult& AuxiliaryResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x0168(0x0014)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetImpactReflectionRoll_rotation_degrees; // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TraceAuxiliaryConeAsync_ReturnValue;      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_SpawnCADecalAtImpact_out_material_instance; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetImpactReflectionRotation_reflection_rotation; // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_SpawnCADecalAtImpact_out_material_instance_1; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetImpactReflectionNormal_reflection_normal; // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B6[0x2];                                      // 0x01B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x022C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0244(0x0014)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0260(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsImpactGlancing_is_glancing;             // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0274(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_SpawnCADecalAtImpact_out_material_instance_2; // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPhysicalSurface                              K2Node_CustomEvent_SurfaceType;                    // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28A[0x2];                                      // 0x028A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_HitResult;                      // 0x028C(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FCATraceAuxiliaryResult                K2Node_CustomEvent_AuxiliaryResult;                // 0x031C(0x000C)(NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32A[0x2];                                      // 0x032A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0334(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0340(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x034C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0358(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0378(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0380(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0398(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x03A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B5[0x3];                                      // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x03B8(0x0014)(ZeroConstructor, NoDestructor)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x03CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x03D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAEffectProp*                          CallFunc_SpawnCAEffectProp_ReturnValue;            // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetPawnMesh_ReturnValue_2;                // 0x03F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x03F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCAEmitterEnabledState>         Temp_struct_Variable;                              // 0x0408(0x0010)(ConstParm, ReferenceParm)
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAtLocation_ReturnValue; // 0x0418(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnCACascadeSystemAtImpact_ReturnValue; // 0x0420(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0428(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPawnMesh_ReturnValue_3;                // 0x0440(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0448(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x045C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45D[0x3];                                      // 0x045D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_2;          // 0x0460(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAtLocation_ReturnValue_1; // 0x0470(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_7;         // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVectorInConeInDegrees_ReturnValue; // 0x047C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_8;         // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x048C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0498(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInZeroG_ReturnValue;                    // 0x04A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4AA[0x6];                                      // 0x04AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x04B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x04B8(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_4CC[0x4];                                      // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x04D0(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E1[0x3];                                      // 0x04E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x04E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_tween_float_output;                       // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOUT_EXEC_TWEEN                               CallFunc_tween_float_exec;                         // 0x04EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x04ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite) == 0x000008, "Wrong alignment on BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite");
static_assert(sizeof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite) == 0x0004F0, "Wrong size on BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, EntryPoint) == 0x000000, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, Temp_int_Variable) == 0x000004, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, Temp_object_Variable) == 0x000010, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_ZeroGMaterialSwitch_ReturnValue) == 0x000020, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_ZeroGMaterialSwitch_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000028, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_GetPawnMesh_ReturnValue) == 0x000030, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_GetPawnMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_SpawnCAAttachedEffect_ReturnValue) == 0x000038, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_SpawnCAAttachedEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_RandomFloatInRange_ReturnValue) == 0x000040, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000044, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_RandomIntegerInRange_ReturnValue_1) == 0x000048, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_RandomIntegerInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x00004C, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000050, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000054, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x000060, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_RandomFloatInRange_ReturnValue_5) == 0x000064, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_RandomFloatInRange_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_MakeVector_ReturnValue) == 0x000068, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_IsValid_ReturnValue_1) == 0x000074, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000078, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000080, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x00008C, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_IsInZeroGravity_ReturnValue) == 0x000098, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_IsInZeroGravity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_GetPawnMesh_ReturnValue_1) == 0x0000A0, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_GetPawnMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_RandomFloatInRange_ReturnValue_6) == 0x0000A8, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_RandomFloatInRange_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_IsValid_ReturnValue_2) == 0x0000AC, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_MakeVector_ReturnValue_1) == 0x0000B0, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue) == 0x0000C0, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, K2Node_CustomEvent_SurfaceType_1) == 0x0000C8, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::K2Node_CustomEvent_SurfaceType_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, K2Node_CustomEvent_HitResult_1) == 0x0000CC, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::K2Node_CustomEvent_HitResult_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, K2Node_CustomEvent_AuxiliaryResult_1) == 0x00015C, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::K2Node_CustomEvent_AuxiliaryResult_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, K2Node_CreateDelegate_OutputDelegate) == 0x000168, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_GetImpactReflectionRoll_rotation_degrees) == 0x00017C, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_GetImpactReflectionRoll_rotation_degrees' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_TraceAuxiliaryConeAsync_ReturnValue) == 0x000180, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_TraceAuxiliaryConeAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_SpawnCADecalAtImpact_out_material_instance) == 0x000188, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_SpawnCADecalAtImpact_out_material_instance' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_GetImpactReflectionRotation_reflection_rotation) == 0x000190, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_GetImpactReflectionRotation_reflection_rotation' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_SpawnCADecalAtImpact_out_material_instance_1) == 0x0001A0, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_SpawnCADecalAtImpact_out_material_instance_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_GetImpactReflectionNormal_reflection_normal) == 0x0001A8, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_GetImpactReflectionNormal_reflection_normal' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_bBlockingHit) == 0x0001B4, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001B5, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_Time) == 0x0001B8, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_Distance) == 0x0001BC, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_Location) == 0x0001C0, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_ImpactPoint) == 0x0001CC, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_Normal) == 0x0001D8, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_ImpactNormal) == 0x0001E4, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_PhysMat) == 0x0001F0, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_HitActor) == 0x0001F8, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_HitComponent) == 0x000200, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_HitBoneName) == 0x000208, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_HitItem) == 0x000214, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_ElementIndex) == 0x000218, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_FaceIndex) == 0x00021C, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_TraceStart) == 0x000220, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_TraceEnd) == 0x00022C, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000238, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, K2Node_CreateDelegate_OutputDelegate_1) == 0x000244, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_VSize_ReturnValue) == 0x000258, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000260, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000268, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_IsImpactGlancing_is_glancing) == 0x00026C, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_IsImpactGlancing_is_glancing' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_MapRangeClamped_ReturnValue) == 0x000270, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_MakeVector_ReturnValue_2) == 0x000274, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_SpawnCADecalAtImpact_out_material_instance_2) == 0x000280, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_SpawnCADecalAtImpact_out_material_instance_2' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_IsValid_ReturnValue_3) == 0x000288, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, K2Node_CustomEvent_SurfaceType) == 0x000289, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::K2Node_CustomEvent_SurfaceType' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, K2Node_CustomEvent_HitResult) == 0x00028C, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::K2Node_CustomEvent_HitResult' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, K2Node_CustomEvent_AuxiliaryResult) == 0x00031C, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::K2Node_CustomEvent_AuxiliaryResult' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000328, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000329, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_Time_1) == 0x00032C, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_Distance_1) == 0x000330, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_Location_1) == 0x000334, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000340, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_Normal_1) == 0x00034C, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000358, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_PhysMat_1) == 0x000368, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_HitActor_1) == 0x000370, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_HitComponent_1) == 0x000378, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_HitBoneName_1) == 0x000380, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_HitItem_1) == 0x00038C, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_ElementIndex_1) == 0x000390, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_FaceIndex_1) == 0x000394, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_TraceStart_1) == 0x000398, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_BreakHitResult_TraceEnd_1) == 0x0003A4, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_Subtract_IntInt_ReturnValue) == 0x0003B0, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0003B4, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, K2Node_CreateDelegate_OutputDelegate_2) == 0x0003B8, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_GetSocketRotation_ReturnValue) == 0x0003CC, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_GetSocketRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_GetSocketLocation_ReturnValue) == 0x0003D8, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_SpawnCAEffectProp_ReturnValue) == 0x0003E8, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_SpawnCAEffectProp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_GetPawnMesh_ReturnValue_2) == 0x0003F0, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_GetPawnMesh_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_GetSocketLocation_ReturnValue_1) == 0x0003F8, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, Temp_struct_Variable) == 0x000408, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_SpawnCANiagaraSystemAtLocation_ReturnValue) == 0x000418, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_SpawnCANiagaraSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_SpawnCACascadeSystemAtImpact_ReturnValue) == 0x000420, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_SpawnCACascadeSystemAtImpact_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, K2Node_CreateDelegate_OutputDelegate_3) == 0x000428, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_GetPawnMesh_ReturnValue_3) == 0x000440, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_GetPawnMesh_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, Temp_delegate_Variable) == 0x000448, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_IsValid_ReturnValue_4) == 0x00045C, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_GetSocketLocation_ReturnValue_2) == 0x000460, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_GetSocketLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_SpawnCANiagaraSystemAtLocation_ReturnValue_1) == 0x000470, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_SpawnCANiagaraSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_RandomFloatInRange_ReturnValue_7) == 0x000478, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_RandomFloatInRange_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_RandomUnitVectorInConeInDegrees_ReturnValue) == 0x00047C, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_RandomUnitVectorInConeInDegrees_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_RandomFloatInRange_ReturnValue_8) == 0x000488, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_RandomFloatInRange_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00048C, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_PlayEvent_playback_instance) == 0x000498, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_PlayEvent_play_success) == 0x0004A8, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_IsInZeroG_ReturnValue) == 0x0004A9, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_IsInZeroG_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0004B0, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, Temp_delegate_Variable_1) == 0x0004B8, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_PlayEvent_playback_instance_1) == 0x0004D0, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_PlayEvent_play_success_1) == 0x0004E0, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_PlayEvent_play_success_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0004E4, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_tween_float_output) == 0x0004E8, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_tween_float_output' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, CallFunc_tween_float_exec) == 0x0004EC, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::CallFunc_tween_float_exec' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite, K2Node_SwitchEnum_CmpSuccess) == 0x0004ED, "Member 'BP_DeathEffect_Elite_C_ExecuteUbergraph_BP_DeathEffect_Elite::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_DeathEffect_Elite.BP_DeathEffect_Elite_C.FloorHit
// 0x00A0 (0x00A0 - 0x0000)
struct BP_DeathEffect_Elite_C_FloorHit final
{
public:
	EPhysicalSurface                              SurfaceType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             HitResult;                                         // 0x0004(0x0090)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FCATraceAuxiliaryResult                AuxiliaryResult;                                   // 0x0094(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_DeathEffect_Elite_C_FloorHit) == 0x000004, "Wrong alignment on BP_DeathEffect_Elite_C_FloorHit");
static_assert(sizeof(BP_DeathEffect_Elite_C_FloorHit) == 0x0000A0, "Wrong size on BP_DeathEffect_Elite_C_FloorHit");
static_assert(offsetof(BP_DeathEffect_Elite_C_FloorHit, SurfaceType) == 0x000000, "Member 'BP_DeathEffect_Elite_C_FloorHit::SurfaceType' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_FloorHit, HitResult) == 0x000004, "Member 'BP_DeathEffect_Elite_C_FloorHit::HitResult' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Elite_C_FloorHit, AuxiliaryResult) == 0x000094, "Member 'BP_DeathEffect_Elite_C_FloorHit::AuxiliaryResult' has a wrong offset!");

// Function BP_DeathEffect_Elite.BP_DeathEffect_Elite_C.CustomEvent
// 0x00A0 (0x00A0 - 0x0000)
struct BP_DeathEffect_Elite_C_CustomEvent final
{
public:
	EPhysicalSurface                              SurfaceType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             HitResult;                                         // 0x0004(0x0090)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FCATraceAuxiliaryResult                AuxiliaryResult;                                   // 0x0094(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_DeathEffect_Elite_C_CustomEvent) == 0x000004, "Wrong alignment on BP_DeathEffect_Elite_C_CustomEvent");
static_assert(sizeof(BP_DeathEffect_Elite_C_CustomEvent) == 0x0000A0, "Wrong size on BP_DeathEffect_Elite_C_CustomEvent");
