#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DoorSwitch_Lockable

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CAAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_DoorSwitch_Lockable.BP_DoorSwitch_Lockable_C.ExecuteUbergraph_BP_DoorSwitch_Lockable
// 0x02C0 (0x02C0 - 0x0000)
struct BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioEventType                      Temp_struct_Variable;                              // 0x0030(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioEventType                      Temp_struct_Variable_1;                            // 0x0034(0x0004)(ConstParm, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0038(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x004C(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0060(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0074(0x0014)(ZeroConstructor, NoDestructor)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GameMode_C*                         K2Node_DynamicCast_AsBP_Game_Mode;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DoorStateComponent_C*               CallFunc_GetComponentByClass_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DoorBaseV2_C*                       K2Node_DynamicCast_AsBP_Door_Base_V2;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_2;             // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x2];                                      // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0144(0x0014)(ZeroConstructor, NoDestructor)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1; // 0x0158(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue_1; // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_172[0x2];                                      // 0x0172(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioEventType                      K2Node_Select_Default;                             // 0x0174(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0178(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_4;                   // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_5;                   // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DoorStateComponent_C*               CallFunc_GetComponentByClass_ReturnValue_1;        // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_3;             // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_6;                   // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_DoorStateComponent_C*               CallFunc_GetComponentByClass_ReturnValue_2;        // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_7;                   // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasGameplayTag_ReturnValue;               // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DoorStateComponent_C*               CallFunc_GetComponentByClass_ReturnValue_3;        // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasGameplayTag_ReturnValue_1;             // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_8;                   // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_DoorStateComponent_C*               CallFunc_GetComponentByClass_ReturnValue_4;        // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasGameplayTag_ReturnValue_2;             // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x021C(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x0238(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_2; // 0x024C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_9;                   // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue_2; // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DoorStateComponent_C*               CallFunc_GetComponentByClass_ReturnValue_5;        // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_10;                  // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasGameplayTag_ReturnValue_3;             // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DoorStateComponent_C*               CallFunc_GetComponentByClass_ReturnValue_6;        // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TransitionToStateByName_ReturnValue;      // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_11;                  // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x029C(0x0014)(ZeroConstructor, NoDestructor)
	class ABP_DoorBaseV2_C*                       K2Node_DynamicCast_AsBP_Door_Base_V2_1;            // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable) == 0x000008, "Wrong alignment on BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable");
static_assert(sizeof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable) == 0x0002C0, "Wrong size on BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, EntryPoint) == 0x000000, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, Temp_bool_Variable) == 0x00002C, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, Temp_struct_Variable) == 0x000030, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, Temp_struct_Variable_1) == 0x000034, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, Temp_delegate_Variable) == 0x000038, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, Temp_delegate_Variable_1) == 0x00004C, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, K2Node_CreateDelegate_OutputDelegate_2) == 0x000060, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, K2Node_CreateDelegate_OutputDelegate_3) == 0x000074, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_GetGameMode_ReturnValue) == 0x000088, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_GetOwner_ReturnValue) == 0x000090, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, K2Node_DynamicCast_AsBP_Game_Mode) == 0x000098, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::K2Node_DynamicCast_AsBP_Game_Mode' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_GetComponentByClass_ReturnValue) == 0x0000A8, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x0000B0, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x0000B8, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_GetOwner_ReturnValue_1) == 0x0000C0, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, K2Node_DynamicCast_AsBP_Door_Base_V2) == 0x0000C8, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::K2Node_DynamicCast_AsBP_Door_Base_V2' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_GetDisplayName_ReturnValue) == 0x0000D8, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_Concat_StrStr_ReturnValue) == 0x0000E8, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_GetDisplayName_ReturnValue_1) == 0x0000F8, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_GetDisplayName_ReturnValue_2) == 0x000108, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_GetDisplayName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000118, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000128, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_GetOwner_ReturnValue_2) == 0x000138, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_IsValid_ReturnValue) == 0x000140, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_IsServer_ReturnValue) == 0x000141, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, K2Node_CreateDelegate_OutputDelegate_4) == 0x000144, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1) == 0x000158, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_RemoveActiveGameplayEffect_ReturnValue_1) == 0x000160, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_RemoveActiveGameplayEffect_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_GetOwner_ReturnValue_3) == 0x000168, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_IsValid_ReturnValue_1) == 0x000170, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_IsServer_ReturnValue_1) == 0x000171, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, K2Node_Select_Default) == 0x000174, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_PlayEvent_playback_instance) == 0x000178, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_PlayEvent_play_success) == 0x000188, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_GetOwner_ReturnValue_4) == 0x000190, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_GetOwner_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_GetOwner_ReturnValue_5) == 0x000198, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_GetOwner_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_IsValid_ReturnValue_2) == 0x0001A0, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_GetComponentByClass_ReturnValue_1) == 0x0001A8, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_IsServer_ReturnValue_2) == 0x0001B0, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_IsServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_GetDisplayName_ReturnValue_3) == 0x0001B8, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_GetDisplayName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0001C8, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_GetOwner_ReturnValue_6) == 0x0001D8, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_GetOwner_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_GetComponentByClass_ReturnValue_2) == 0x0001E0, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_GetOwner_ReturnValue_7) == 0x0001E8, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_GetOwner_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_HasGameplayTag_ReturnValue) == 0x0001F0, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_HasGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_GetComponentByClass_ReturnValue_3) == 0x0001F8, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_GetComponentByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_HasGameplayTag_ReturnValue_1) == 0x000200, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_HasGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_GetOwner_ReturnValue_8) == 0x000208, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_GetOwner_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_GetComponentByClass_ReturnValue_4) == 0x000210, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_GetComponentByClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_HasGameplayTag_ReturnValue_2) == 0x000218, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_HasGameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, K2Node_CreateDelegate_OutputDelegate_5) == 0x00021C, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_BooleanOR_ReturnValue) == 0x000230, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_PlayEvent_playback_instance_1) == 0x000238, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_PlayEvent_play_success_1) == 0x000248, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_PlayEvent_play_success_1' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_2) == 0x00024C, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_GetOwner_ReturnValue_9) == 0x000258, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_GetOwner_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_RemoveActiveGameplayEffect_ReturnValue_2) == 0x000260, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_RemoveActiveGameplayEffect_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_GetComponentByClass_ReturnValue_5) == 0x000268, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_GetComponentByClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_GetOwner_ReturnValue_10) == 0x000270, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_GetOwner_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_HasGameplayTag_ReturnValue_3) == 0x000278, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_HasGameplayTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_GetComponentByClass_ReturnValue_6) == 0x000280, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_GetComponentByClass_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_TransitionToStateByName_ReturnValue) == 0x000288, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_TransitionToStateByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_GetOwner_ReturnValue_11) == 0x000290, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_GetOwner_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, CallFunc_IsValid_ReturnValue_3) == 0x000298, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, K2Node_CreateDelegate_OutputDelegate_6) == 0x00029C, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, K2Node_DynamicCast_AsBP_Door_Base_V2_1) == 0x0002B0, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::K2Node_DynamicCast_AsBP_Door_Base_V2_1' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable, K2Node_DynamicCast_bSuccess_2) == 0x0002B8, "Member 'BP_DoorSwitch_Lockable_C_ExecuteUbergraph_BP_DoorSwitch_Lockable::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BP_DoorSwitch_Lockable.BP_DoorSwitch_Lockable_C.LockUnlockDoor
// 0x0018 (0x0018 - 0x0000)
struct BP_DoorSwitch_Lockable_C_LockUnlockDoor final
{
public:
	bool                                          ShouldLock;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DoorStateComponent_C*               DoorActor_0;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            ActiveGE;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DoorSwitch_Lockable_C_LockUnlockDoor) == 0x000008, "Wrong alignment on BP_DoorSwitch_Lockable_C_LockUnlockDoor");
static_assert(sizeof(BP_DoorSwitch_Lockable_C_LockUnlockDoor) == 0x000018, "Wrong size on BP_DoorSwitch_Lockable_C_LockUnlockDoor");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_LockUnlockDoor, ShouldLock) == 0x000000, "Member 'BP_DoorSwitch_Lockable_C_LockUnlockDoor::ShouldLock' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_LockUnlockDoor, DoorActor_0) == 0x000008, "Member 'BP_DoorSwitch_Lockable_C_LockUnlockDoor::DoorActor_0' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_LockUnlockDoor, ActiveGE) == 0x000010, "Member 'BP_DoorSwitch_Lockable_C_LockUnlockDoor::ActiveGE' has a wrong offset!");

// Function BP_DoorSwitch_Lockable.BP_DoorSwitch_Lockable_C.GetOwnerDoorStateMachine
// 0x0018 (0x0018 - 0x0000)
struct BP_DoorSwitch_Lockable_C_GetOwnerDoorStateMachine final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DoorBaseV2_C*                       K2Node_DynamicCast_AsBP_Door_Base_V2;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DoorSwitch_Lockable_C_GetOwnerDoorStateMachine) == 0x000008, "Wrong alignment on BP_DoorSwitch_Lockable_C_GetOwnerDoorStateMachine");
static_assert(sizeof(BP_DoorSwitch_Lockable_C_GetOwnerDoorStateMachine) == 0x000018, "Wrong size on BP_DoorSwitch_Lockable_C_GetOwnerDoorStateMachine");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_GetOwnerDoorStateMachine, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_DoorSwitch_Lockable_C_GetOwnerDoorStateMachine::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_GetOwnerDoorStateMachine, K2Node_DynamicCast_AsBP_Door_Base_V2) == 0x000008, "Member 'BP_DoorSwitch_Lockable_C_GetOwnerDoorStateMachine::K2Node_DynamicCast_AsBP_Door_Base_V2' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_GetOwnerDoorStateMachine, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_DoorSwitch_Lockable_C_GetOwnerDoorStateMachine::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_DoorSwitch_Lockable.BP_DoorSwitch_Lockable_C.EnableAR
// 0x0018 (0x0018 - 0x0000)
struct BP_DoorSwitch_Lockable_C_EnableAR final
{
public:
	bool                                          UsedARActive;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DoorSwitch_Lockable_C_EnableAR) == 0x000008, "Wrong alignment on BP_DoorSwitch_Lockable_C_EnableAR");
static_assert(sizeof(BP_DoorSwitch_Lockable_C_EnableAR) == 0x000018, "Wrong size on BP_DoorSwitch_Lockable_C_EnableAR");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_EnableAR, UsedARActive) == 0x000000, "Member 'BP_DoorSwitch_Lockable_C_EnableAR::UsedARActive' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_EnableAR, Temp_bool_Variable) == 0x000001, "Member 'BP_DoorSwitch_Lockable_C_EnableAR::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_EnableAR, K2Node_Select_Default) == 0x000008, "Member 'BP_DoorSwitch_Lockable_C_EnableAR::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_EnableAR, CallFunc_IsActive_ReturnValue) == 0x000010, "Member 'BP_DoorSwitch_Lockable_C_EnableAR::CallFunc_IsActive_ReturnValue' has a wrong offset!");

// Function BP_DoorSwitch_Lockable.BP_DoorSwitch_Lockable_C.SwitchAR
// 0x0018 (0x0018 - 0x0000)
struct BP_DoorSwitch_Lockable_C_SwitchAR final
{
public:
	bool                                          DoorLockedARActive;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default_1;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DoorSwitch_Lockable_C_SwitchAR) == 0x000008, "Wrong alignment on BP_DoorSwitch_Lockable_C_SwitchAR");
static_assert(sizeof(BP_DoorSwitch_Lockable_C_SwitchAR) == 0x000018, "Wrong size on BP_DoorSwitch_Lockable_C_SwitchAR");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_SwitchAR, DoorLockedARActive) == 0x000000, "Member 'BP_DoorSwitch_Lockable_C_SwitchAR::DoorLockedARActive' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_SwitchAR, Temp_bool_Variable) == 0x000001, "Member 'BP_DoorSwitch_Lockable_C_SwitchAR::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_DoorSwitch_Lockable_C_SwitchAR, Temp_bool_Variable_1) == 0x000002, "Member 'BP_DoorSwitch_Lockable_C_SwitchAR::Temp_bool_Variable_1' has a wrong offset!");
