#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DoorBaseV2

#include "Basic.hpp"

#include "CAAudio_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "F_EditorActorSnapToData_structs.hpp"
#include "Keaton_structs.hpp"
#include "DoorSwitchStruct_structs.hpp"


namespace SDK::Params
{

// Function BP_DoorBaseV2.BP_DoorBaseV2_C.ExecuteUbergraph_BP_DoorBaseV2
// 0x01B8 (0x01B8 - 0x0000)
struct BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0004(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x0018(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Percentage;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0038(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        K2Node_CustomEvent_OverlappedComponent_1;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor_1;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        K2Node_CustomEvent_OtherComp_1;                    // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFromSweep;                     // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_SweepResult;                    // 0x0070(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class USceneComponent*                        K2Node_CustomEvent_OverlappedComponent;            // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        K2Node_CustomEvent_OtherComp;                      // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class USceneComponent* OverlappedComponent, class AActor* OtherActor, class USceneComponent* OtherComp, int32 OtherBodyIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x011C(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_133[0x1];                                      // 0x0133(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_ComponentBoundEvent_Tag;                    // 0x0134(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Added;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x2];                                      // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCATeamID                              K2Node_MakeStruct_CATeamID;                        // 0x0144(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class USceneComponent* OverlappedComponent, class AActor* OtherActor, class USceneComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0148(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_2;                          // 0x015C(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x0170(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue;               // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_1;             // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentActiveState_ReturnValue;         // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCurrentActiveState_ReturnValue_1;       // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19B[0x5];                                      // 0x019B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_2;            // 0x01A0(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_2;                 // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnySwitchLocked_Locked;                 // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnySwitchLocked_Locked_1;               // 0x01B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2) == 0x000008, "Wrong alignment on BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2");
static_assert(sizeof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2) == 0x0001B8, "Wrong size on BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, EntryPoint) == 0x000000, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, Temp_delegate_Variable) == 0x000004, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, Temp_delegate_Variable_1) == 0x000018, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, CallFunc_IsValidClass_ReturnValue) == 0x00002C, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, K2Node_ComponentBoundEvent_Percentage) == 0x000030, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::K2Node_ComponentBoundEvent_Percentage' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, CallFunc_PlayEvent_playback_instance) == 0x000038, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, CallFunc_PlayEvent_play_success) == 0x000048, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, K2Node_CustomEvent_OverlappedComponent_1) == 0x000050, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::K2Node_CustomEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, K2Node_CustomEvent_OtherActor_1) == 0x000058, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::K2Node_CustomEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, K2Node_CustomEvent_OtherComp_1) == 0x000060, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::K2Node_CustomEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, K2Node_CustomEvent_OtherBodyIndex_1) == 0x000068, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::K2Node_CustomEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, K2Node_CustomEvent_bFromSweep) == 0x00006C, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::K2Node_CustomEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, K2Node_CustomEvent_SweepResult) == 0x000070, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::K2Node_CustomEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, K2Node_CustomEvent_OverlappedComponent) == 0x000100, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::K2Node_CustomEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, K2Node_CustomEvent_OtherActor) == 0x000108, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, K2Node_CustomEvent_OtherComp) == 0x000110, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::K2Node_CustomEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, K2Node_CustomEvent_OtherBodyIndex) == 0x000118, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::K2Node_CustomEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, K2Node_CreateDelegate_OutputDelegate) == 0x00011C, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, CallFunc_IsServer_ReturnValue) == 0x000130, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, CallFunc_IsServer_ReturnValue_1) == 0x000131, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, CallFunc_IsServer_ReturnValue_2) == 0x000132, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::CallFunc_IsServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, K2Node_ComponentBoundEvent_Tag) == 0x000134, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::K2Node_ComponentBoundEvent_Tag' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, K2Node_ComponentBoundEvent_Added) == 0x000140, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::K2Node_ComponentBoundEvent_Added' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000141, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, K2Node_MakeStruct_CATeamID) == 0x000144, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::K2Node_MakeStruct_CATeamID' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, K2Node_CreateDelegate_OutputDelegate_1) == 0x000148, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, Temp_delegate_Variable_2) == 0x00015C, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, CallFunc_PlayEvent_playback_instance_1) == 0x000170, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, CallFunc_PlayEvent_play_success_1) == 0x000180, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::CallFunc_PlayEvent_play_success_1' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, CallFunc_GetStateByName_ReturnValue) == 0x000188, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::CallFunc_GetStateByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, CallFunc_GetStateByName_ReturnValue_1) == 0x000190, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::CallFunc_GetStateByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, CallFunc_IsCurrentActiveState_ReturnValue) == 0x000198, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::CallFunc_IsCurrentActiveState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, CallFunc_IsCurrentActiveState_ReturnValue_1) == 0x000199, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::CallFunc_IsCurrentActiveState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, CallFunc_BooleanOR_ReturnValue) == 0x00019A, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, CallFunc_PlayEvent_playback_instance_2) == 0x0001A0, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::CallFunc_PlayEvent_playback_instance_2' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, CallFunc_PlayEvent_play_success_2) == 0x0001B0, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::CallFunc_PlayEvent_play_success_2' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, CallFunc_IsDedicatedServer_ReturnValue) == 0x0001B1, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, CallFunc_IsAnySwitchLocked_Locked) == 0x0001B2, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::CallFunc_IsAnySwitchLocked_Locked' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2, CallFunc_IsAnySwitchLocked_Locked_1) == 0x0001B3, "Member 'BP_DoorBaseV2_C_ExecuteUbergraph_BP_DoorBaseV2::CallFunc_IsAnySwitchLocked_Locked_1' has a wrong offset!");

// Function BP_DoorBaseV2.BP_DoorBaseV2_C.BndEvt__BP_DoorBaseV2_StateMachineComponent_K2Node_ComponentBoundEvent_7_StateTagChangedDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_DoorBaseV2_C_BndEvt__BP_DoorBaseV2_StateMachineComponent_K2Node_ComponentBoundEvent_7_StateTagChangedDelegate__DelegateSignature final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          Added;                                             // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DoorBaseV2_C_BndEvt__BP_DoorBaseV2_StateMachineComponent_K2Node_ComponentBoundEvent_7_StateTagChangedDelegate__DelegateSignature) == 0x000004, "Wrong alignment on BP_DoorBaseV2_C_BndEvt__BP_DoorBaseV2_StateMachineComponent_K2Node_ComponentBoundEvent_7_StateTagChangedDelegate__DelegateSignature");
static_assert(sizeof(BP_DoorBaseV2_C_BndEvt__BP_DoorBaseV2_StateMachineComponent_K2Node_ComponentBoundEvent_7_StateTagChangedDelegate__DelegateSignature) == 0x000010, "Wrong size on BP_DoorBaseV2_C_BndEvt__BP_DoorBaseV2_StateMachineComponent_K2Node_ComponentBoundEvent_7_StateTagChangedDelegate__DelegateSignature");
static_assert(offsetof(BP_DoorBaseV2_C_BndEvt__BP_DoorBaseV2_StateMachineComponent_K2Node_ComponentBoundEvent_7_StateTagChangedDelegate__DelegateSignature, Tag) == 0x000000, "Member 'BP_DoorBaseV2_C_BndEvt__BP_DoorBaseV2_StateMachineComponent_K2Node_ComponentBoundEvent_7_StateTagChangedDelegate__DelegateSignature::Tag' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_BndEvt__BP_DoorBaseV2_StateMachineComponent_K2Node_ComponentBoundEvent_7_StateTagChangedDelegate__DelegateSignature, Added) == 0x00000C, "Member 'BP_DoorBaseV2_C_BndEvt__BP_DoorBaseV2_StateMachineComponent_K2Node_ComponentBoundEvent_7_StateTagChangedDelegate__DelegateSignature::Added' has a wrong offset!");

// Function BP_DoorBaseV2.BP_DoorBaseV2_C.OnActorEndBlocking
// 0x0020 (0x0020 - 0x0000)
struct BP_DoorBaseV2_C_OnActorEndBlocking final
{
public:
	class USceneComponent*                        OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DoorBaseV2_C_OnActorEndBlocking) == 0x000008, "Wrong alignment on BP_DoorBaseV2_C_OnActorEndBlocking");
static_assert(sizeof(BP_DoorBaseV2_C_OnActorEndBlocking) == 0x000020, "Wrong size on BP_DoorBaseV2_C_OnActorEndBlocking");
static_assert(offsetof(BP_DoorBaseV2_C_OnActorEndBlocking, OverlappedComponent) == 0x000000, "Member 'BP_DoorBaseV2_C_OnActorEndBlocking::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_OnActorEndBlocking, OtherActor) == 0x000008, "Member 'BP_DoorBaseV2_C_OnActorEndBlocking::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_OnActorEndBlocking, OtherComp) == 0x000010, "Member 'BP_DoorBaseV2_C_OnActorEndBlocking::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_OnActorEndBlocking, OtherBodyIndex) == 0x000018, "Member 'BP_DoorBaseV2_C_OnActorEndBlocking::OtherBodyIndex' has a wrong offset!");

// Function BP_DoorBaseV2.BP_DoorBaseV2_C.OnActorBlocking
// 0x00B0 (0x00B0 - 0x0000)
struct BP_DoorBaseV2_C_OnActorBlocking final
{
public:
	class USceneComponent*                        OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_DoorBaseV2_C_OnActorBlocking) == 0x000008, "Wrong alignment on BP_DoorBaseV2_C_OnActorBlocking");
static_assert(sizeof(BP_DoorBaseV2_C_OnActorBlocking) == 0x0000B0, "Wrong size on BP_DoorBaseV2_C_OnActorBlocking");
static_assert(offsetof(BP_DoorBaseV2_C_OnActorBlocking, OverlappedComponent) == 0x000000, "Member 'BP_DoorBaseV2_C_OnActorBlocking::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_OnActorBlocking, OtherActor) == 0x000008, "Member 'BP_DoorBaseV2_C_OnActorBlocking::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_OnActorBlocking, OtherComp) == 0x000010, "Member 'BP_DoorBaseV2_C_OnActorBlocking::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_OnActorBlocking, OtherBodyIndex) == 0x000018, "Member 'BP_DoorBaseV2_C_OnActorBlocking::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_OnActorBlocking, bFromSweep) == 0x00001C, "Member 'BP_DoorBaseV2_C_OnActorBlocking::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_OnActorBlocking, SweepResult) == 0x000020, "Member 'BP_DoorBaseV2_C_OnActorBlocking::SweepResult' has a wrong offset!");

// Function BP_DoorBaseV2.BP_DoorBaseV2_C.BndEvt__StateMachineComponent_K2Node_ComponentBoundEvent_4_UpdateOpen__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_DoorBaseV2_C_BndEvt__StateMachineComponent_K2Node_ComponentBoundEvent_4_UpdateOpen__DelegateSignature final
{
public:
	float                                         Percentage;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DoorBaseV2_C_BndEvt__StateMachineComponent_K2Node_ComponentBoundEvent_4_UpdateOpen__DelegateSignature) == 0x000004, "Wrong alignment on BP_DoorBaseV2_C_BndEvt__StateMachineComponent_K2Node_ComponentBoundEvent_4_UpdateOpen__DelegateSignature");
static_assert(sizeof(BP_DoorBaseV2_C_BndEvt__StateMachineComponent_K2Node_ComponentBoundEvent_4_UpdateOpen__DelegateSignature) == 0x000004, "Wrong size on BP_DoorBaseV2_C_BndEvt__StateMachineComponent_K2Node_ComponentBoundEvent_4_UpdateOpen__DelegateSignature");
static_assert(offsetof(BP_DoorBaseV2_C_BndEvt__StateMachineComponent_K2Node_ComponentBoundEvent_4_UpdateOpen__DelegateSignature, Percentage) == 0x000000, "Member 'BP_DoorBaseV2_C_BndEvt__StateMachineComponent_K2Node_ComponentBoundEvent_4_UpdateOpen__DelegateSignature::Percentage' has a wrong offset!");

// Function BP_DoorBaseV2.BP_DoorBaseV2_C.UserConstructionScript
// 0x00F0 (0x00F0 - 0x0000)
struct BP_DoorBaseV2_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0008(0x0018)(NoDestructor)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0020(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0038(0x0018)()
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle_1;            // 0x0070(0x0018)(NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue_1;       // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DoorBaseV2_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_DoorBaseV2_C_UserConstructionScript");
static_assert(sizeof(BP_DoorBaseV2_C_UserConstructionScript) == 0x0000F0, "Wrong size on BP_DoorBaseV2_C_UserConstructionScript");
static_assert(offsetof(BP_DoorBaseV2_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'BP_DoorBaseV2_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_UserConstructionScript, CallFunc_BooleanAND_ReturnValue) == 0x000001, "Member 'BP_DoorBaseV2_C_UserConstructionScript::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_UserConstructionScript, K2Node_MakeStruct_DataTableRowHandle) == 0x000008, "Member 'BP_DoorBaseV2_C_UserConstructionScript::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_UserConstructionScript, CallFunc_MakeLiteralText_ReturnValue) == 0x000020, "Member 'BP_DoorBaseV2_C_UserConstructionScript::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_UserConstructionScript, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000038, "Member 'BP_DoorBaseV2_C_UserConstructionScript::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_UserConstructionScript, CallFunc_GetDisplayName_ReturnValue) == 0x000050, "Member 'BP_DoorBaseV2_C_UserConstructionScript::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_UserConstructionScript, CallFunc_Concat_StrStr_ReturnValue) == 0x000060, "Member 'BP_DoorBaseV2_C_UserConstructionScript::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_UserConstructionScript, K2Node_MakeStruct_DataTableRowHandle_1) == 0x000070, "Member 'BP_DoorBaseV2_C_UserConstructionScript::K2Node_MakeStruct_DataTableRowHandle_1' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_UserConstructionScript, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000088, "Member 'BP_DoorBaseV2_C_UserConstructionScript::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue_1) == 0x000089, "Member 'BP_DoorBaseV2_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_UserConstructionScript, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x00008A, "Member 'BP_DoorBaseV2_C_UserConstructionScript::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_UserConstructionScript, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x00008B, "Member 'BP_DoorBaseV2_C_UserConstructionScript::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_UserConstructionScript, CallFunc_BooleanOR_ReturnValue) == 0x00008C, "Member 'BP_DoorBaseV2_C_UserConstructionScript::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_UserConstructionScript, CallFunc_GetRelativeTransform_ReturnValue) == 0x000090, "Member 'BP_DoorBaseV2_C_UserConstructionScript::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_UserConstructionScript, CallFunc_GetRelativeTransform_ReturnValue_1) == 0x0000C0, "Member 'BP_DoorBaseV2_C_UserConstructionScript::CallFunc_GetRelativeTransform_ReturnValue_1' has a wrong offset!");

// Function BP_DoorBaseV2.BP_DoorBaseV2_C.SetOpen
// 0x0002 (0x0002 - 0x0000)
struct BP_DoorBaseV2_C_SetOpen final
{
public:
	bool                                          Open;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Visibility;                                        // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DoorBaseV2_C_SetOpen) == 0x000001, "Wrong alignment on BP_DoorBaseV2_C_SetOpen");
static_assert(sizeof(BP_DoorBaseV2_C_SetOpen) == 0x000002, "Wrong size on BP_DoorBaseV2_C_SetOpen");
static_assert(offsetof(BP_DoorBaseV2_C_SetOpen, Open) == 0x000000, "Member 'BP_DoorBaseV2_C_SetOpen::Open' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_SetOpen, Visibility) == 0x000001, "Member 'BP_DoorBaseV2_C_SetOpen::Visibility' has a wrong offset!");

// Function BP_DoorBaseV2.BP_DoorBaseV2_C.ShowLockedState
// 0x0001 (0x0001 - 0x0000)
struct BP_DoorBaseV2_C_ShowLockedState final
{
public:
	bool                                          ShowLocked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DoorBaseV2_C_ShowLockedState) == 0x000001, "Wrong alignment on BP_DoorBaseV2_C_ShowLockedState");
static_assert(sizeof(BP_DoorBaseV2_C_ShowLockedState) == 0x000001, "Wrong size on BP_DoorBaseV2_C_ShowLockedState");
static_assert(offsetof(BP_DoorBaseV2_C_ShowLockedState, ShowLocked) == 0x000000, "Member 'BP_DoorBaseV2_C_ShowLockedState::ShowLocked' has a wrong offset!");

// Function BP_DoorBaseV2.BP_DoorBaseV2_C.EnableFoam
// 0x0018 (0x0018 - 0x0000)
struct BP_DoorBaseV2_C_EnableFoam final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAFoamAlignmentComponent*              CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DoorBaseV2_C_EnableFoam) == 0x000008, "Wrong alignment on BP_DoorBaseV2_C_EnableFoam");
static_assert(sizeof(BP_DoorBaseV2_C_EnableFoam) == 0x000018, "Wrong size on BP_DoorBaseV2_C_EnableFoam");
static_assert(offsetof(BP_DoorBaseV2_C_EnableFoam, Enable) == 0x000000, "Member 'BP_DoorBaseV2_C_EnableFoam::Enable' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_EnableFoam, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'BP_DoorBaseV2_C_EnableFoam::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_EnableFoam, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_DoorBaseV2_C_EnableFoam::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_DoorBaseV2.BP_DoorBaseV2_C.UpdateLockedStatus
// 0x0020 (0x0020 - 0x0000)
struct BP_DoorBaseV2_C_UpdateLockedStatus final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasGameplayTag_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICAGameplayAuthorityInterface> CallFunc_RequiresAuthorization_self_CastInput;     // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RequiresAuthorization_ReturnValue;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DoorBaseV2_C_UpdateLockedStatus) == 0x000008, "Wrong alignment on BP_DoorBaseV2_C_UpdateLockedStatus");
static_assert(sizeof(BP_DoorBaseV2_C_UpdateLockedStatus) == 0x000020, "Wrong size on BP_DoorBaseV2_C_UpdateLockedStatus");
static_assert(offsetof(BP_DoorBaseV2_C_UpdateLockedStatus, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_DoorBaseV2_C_UpdateLockedStatus::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_UpdateLockedStatus, CallFunc_HasGameplayTag_ReturnValue) == 0x000001, "Member 'BP_DoorBaseV2_C_UpdateLockedStatus::CallFunc_HasGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_UpdateLockedStatus, CallFunc_RequiresAuthorization_self_CastInput) == 0x000008, "Member 'BP_DoorBaseV2_C_UpdateLockedStatus::CallFunc_RequiresAuthorization_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_UpdateLockedStatus, CallFunc_RequiresAuthorization_ReturnValue) == 0x000018, "Member 'BP_DoorBaseV2_C_UpdateLockedStatus::CallFunc_RequiresAuthorization_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_UpdateLockedStatus, CallFunc_BooleanAND_ReturnValue) == 0x000019, "Member 'BP_DoorBaseV2_C_UpdateLockedStatus::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_DoorBaseV2.BP_DoorBaseV2_C.GetDoorSwitchLocation
// 0x04D0 (0x04D0 - 0x0000)
struct BP_DoorBaseV2_C_GetDoorSwitchLocation final
{
public:
	struct FTransform                             Switch2Transform;                                  // 0x0000(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FTransform                             Switch1Transform;                                  // 0x0030(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class AActor*                                 ClosestBackSwitch;                                 // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ClosestFrontSwitch;                                // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         BackDoorSwitch;                                    // 0x0070(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AActor*>                         FrontDoorSwitch;                                   // 0x0080(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          HasDoorSwitchLocation;                             // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x00F0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeRelativeTransform_ReturnValue;        // 0x0120(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0150(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E2[0x6];                                      // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_212[0xE];                                      // 0x0212(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue_1;       // 0x0220(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeRelativeTransform_ReturnValue_1;      // 0x0250(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult_1; // 0x0280(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0xF];                                      // 0x0321(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0330(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0360(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x036C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0378(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0xC];                                      // 0x0384(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0390(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C5[0x3];                                      // 0x03C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x03CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CD[0x3];                                      // 0x03CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue_1;              // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x03E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E5[0x3];                                      // 0x03E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue_2;              // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_3;                         // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FD[0x3];                                      // 0x03FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue_3;              // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0404(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0405(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_406[0x2];                                      // 0x0406(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_overlaps;            // 0x0410(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_4;                         // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDotProductTo_ReturnValue;              // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x0435(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_436[0x2];                                      // 0x0436(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x043C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x043D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43E[0x2];                                      // 0x043E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0440(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0470(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x047C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0488(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_494[0xC];                                      // 0x0494(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x04A0(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DoorBaseV2_C_GetDoorSwitchLocation) == 0x000010, "Wrong alignment on BP_DoorBaseV2_C_GetDoorSwitchLocation");
static_assert(sizeof(BP_DoorBaseV2_C_GetDoorSwitchLocation) == 0x0004D0, "Wrong size on BP_DoorBaseV2_C_GetDoorSwitchLocation");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, Switch2Transform) == 0x000000, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::Switch2Transform' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, Switch1Transform) == 0x000030, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::Switch1Transform' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, ClosestBackSwitch) == 0x000060, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::ClosestBackSwitch' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, ClosestFrontSwitch) == 0x000068, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::ClosestFrontSwitch' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, BackDoorSwitch) == 0x000070, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::BackDoorSwitch' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, FrontDoorSwitch) == 0x000080, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::FrontDoorSwitch' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, HasDoorSwitchLocation) == 0x000090, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::HasDoorSwitchLocation' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, Temp_int_Loop_Counter_Variable) == 0x000094, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, Temp_int_Loop_Counter_Variable_1) == 0x000098, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, CallFunc_Add_IntInt_ReturnValue) == 0x00009C, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A0, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, Temp_int_Array_Index_Variable) == 0x0000A4, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, Temp_int_Array_Index_Variable_1) == 0x0000A8, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, Temp_int_Array_Index_Variable_2) == 0x0000AC, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, CallFunc_GetDisplayName_ReturnValue) == 0x0000B0, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, CallFunc_Concat_StrStr_ReturnValue) == 0x0000C0, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, CallFunc_MakeRotator_ReturnValue) == 0x0000D0, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, CallFunc_MakeRotator_ReturnValue_1) == 0x0000DC, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, CallFunc_GetRelativeTransform_ReturnValue) == 0x0000F0, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, CallFunc_MakeRelativeTransform_ReturnValue) == 0x000120, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::CallFunc_MakeRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x000150, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, CallFunc_IsValid_ReturnValue) == 0x0001E0, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, CallFunc_IsValid_ReturnValue_1) == 0x0001E1, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, CallFunc_GetDisplayName_ReturnValue_1) == 0x0001E8, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, CallFunc_Not_PreBool_ReturnValue) == 0x0001F8, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000200, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, CallFunc_BooleanAND_ReturnValue) == 0x000210, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorBaseV2_C_GetDoorSwitchLocation, CallFunc_BooleanAND_ReturnValue_1) == 0x000211, "Member 'BP_DoorBaseV2_C_GetDoorSwitchLocation::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
