#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DownedAR_Character

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DownedAR_Character.BP_DownedAR_Character_C.ExecuteUbergraph_BP_DownedAR_Character
// 0x0198 (0x0198 - 0x0000)
struct BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0064(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            Temp_object_Variable;                              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            Temp_object_Variable_1;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         Temp_object_Variable_2;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Temp_object_Variable_3;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSliding_ReturnValue;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetThirdPersonMesh_ReturnValue;           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            K2Node_Select_Default;                             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetCurrentActiveMontageInSlot_ReturnValue; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00F4(0x0014)(ZeroConstructor, NoDestructor)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0110(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x012C(0x0014)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x016C(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_Select_Default_1;                           // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character) == 0x000008, "Wrong alignment on BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character");
static_assert(sizeof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character) == 0x000198, "Wrong size on BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, EntryPoint) == 0x000000, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, K2Node_CustomEvent_NotifyName_3) == 0x000004, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, CallFunc_GetAnimInstance_ReturnValue) == 0x000010, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, K2Node_CustomEvent_NotifyName_2) == 0x000018, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, K2Node_CustomEvent_NotifyName_1) == 0x000038, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, K2Node_CreateDelegate_OutputDelegate_1) == 0x000044, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, K2Node_CustomEvent_NotifyName) == 0x000058, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, K2Node_CreateDelegate_OutputDelegate_2) == 0x000064, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, Temp_name_Variable) == 0x000078, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, Temp_bool_Variable) == 0x000084, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, Temp_object_Variable) == 0x000088, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, Temp_object_Variable_1) == 0x000090, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, Temp_bool_Variable_1) == 0x000098, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, Temp_object_Variable_2) == 0x0000A0, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, Temp_object_Variable_3) == 0x0000A8, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, CallFunc_GetOwner_ReturnValue) == 0x0000B0, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x0000B8, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, CallFunc_IsSliding_ReturnValue) == 0x0000C1, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::CallFunc_IsSliding_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, CallFunc_BooleanOR_ReturnValue) == 0x0000C2, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, CallFunc_GetThirdPersonMesh_ReturnValue) == 0x0000C8, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::CallFunc_GetThirdPersonMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, K2Node_Select_Default) == 0x0000D0, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, K2Node_Event_DeltaSeconds) == 0x0000D8, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, CallFunc_IsValid_ReturnValue) == 0x0000DC, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, CallFunc_GetAnimInstance_ReturnValue_1) == 0x0000E0, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, CallFunc_GetCurrentActiveMontageInSlot_ReturnValue) == 0x0000E8, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::CallFunc_GetCurrentActiveMontageInSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, CallFunc_Not_PreBool_ReturnValue) == 0x0000F0, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000F4, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000108, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000110, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, CallFunc_IsValid_ReturnValue_1) == 0x000118, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, CallFunc_GetAnimInstance_ReturnValue_2) == 0x000120, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::CallFunc_GetAnimInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, CallFunc_Add_FloatFloat_ReturnValue) == 0x000128, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, K2Node_CreateDelegate_OutputDelegate_4) == 0x00012C, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, CallFunc_GetFloatValue_ReturnValue) == 0x000140, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, CallFunc_GetOwner_ReturnValue_1) == 0x000148, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, K2Node_CustomEvent_NotifyName_4) == 0x000150, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000160, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, CallFunc_IsValid_ReturnValue_2) == 0x000168, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, K2Node_CreateDelegate_OutputDelegate_5) == 0x00016C, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000180, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, K2Node_Select_Default_1) == 0x000188, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue) == 0x000190, "Member 'BP_DownedAR_Character_C_ExecuteUbergraph_BP_DownedAR_Character::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue' has a wrong offset!");

// Function BP_DownedAR_Character.BP_DownedAR_Character_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_DownedAR_Character_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DownedAR_Character_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_DownedAR_Character_C_ReceiveTick");
static_assert(sizeof(BP_DownedAR_Character_C_ReceiveTick) == 0x000004, "Wrong size on BP_DownedAR_Character_C_ReceiveTick");
static_assert(offsetof(BP_DownedAR_Character_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_DownedAR_Character_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_DownedAR_Character.BP_DownedAR_Character_C.OnCompleted_1711BF2548BEBB9D636806B65AB59336
// 0x000C (0x000C - 0x0000)
struct BP_DownedAR_Character_C_OnCompleted_1711BF2548BEBB9D636806B65AB59336 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DownedAR_Character_C_OnCompleted_1711BF2548BEBB9D636806B65AB59336) == 0x000004, "Wrong alignment on BP_DownedAR_Character_C_OnCompleted_1711BF2548BEBB9D636806B65AB59336");
static_assert(sizeof(BP_DownedAR_Character_C_OnCompleted_1711BF2548BEBB9D636806B65AB59336) == 0x00000C, "Wrong size on BP_DownedAR_Character_C_OnCompleted_1711BF2548BEBB9D636806B65AB59336");
static_assert(offsetof(BP_DownedAR_Character_C_OnCompleted_1711BF2548BEBB9D636806B65AB59336, NotifyName) == 0x000000, "Member 'BP_DownedAR_Character_C_OnCompleted_1711BF2548BEBB9D636806B65AB59336::NotifyName' has a wrong offset!");

// Function BP_DownedAR_Character.BP_DownedAR_Character_C.OnBlendOut_1711BF2548BEBB9D636806B65AB59336
// 0x000C (0x000C - 0x0000)
struct BP_DownedAR_Character_C_OnBlendOut_1711BF2548BEBB9D636806B65AB59336 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DownedAR_Character_C_OnBlendOut_1711BF2548BEBB9D636806B65AB59336) == 0x000004, "Wrong alignment on BP_DownedAR_Character_C_OnBlendOut_1711BF2548BEBB9D636806B65AB59336");
static_assert(sizeof(BP_DownedAR_Character_C_OnBlendOut_1711BF2548BEBB9D636806B65AB59336) == 0x00000C, "Wrong size on BP_DownedAR_Character_C_OnBlendOut_1711BF2548BEBB9D636806B65AB59336");
static_assert(offsetof(BP_DownedAR_Character_C_OnBlendOut_1711BF2548BEBB9D636806B65AB59336, NotifyName) == 0x000000, "Member 'BP_DownedAR_Character_C_OnBlendOut_1711BF2548BEBB9D636806B65AB59336::NotifyName' has a wrong offset!");

// Function BP_DownedAR_Character.BP_DownedAR_Character_C.OnInterrupted_1711BF2548BEBB9D636806B65AB59336
// 0x000C (0x000C - 0x0000)
struct BP_DownedAR_Character_C_OnInterrupted_1711BF2548BEBB9D636806B65AB59336 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DownedAR_Character_C_OnInterrupted_1711BF2548BEBB9D636806B65AB59336) == 0x000004, "Wrong alignment on BP_DownedAR_Character_C_OnInterrupted_1711BF2548BEBB9D636806B65AB59336");
static_assert(sizeof(BP_DownedAR_Character_C_OnInterrupted_1711BF2548BEBB9D636806B65AB59336) == 0x00000C, "Wrong size on BP_DownedAR_Character_C_OnInterrupted_1711BF2548BEBB9D636806B65AB59336");
static_assert(offsetof(BP_DownedAR_Character_C_OnInterrupted_1711BF2548BEBB9D636806B65AB59336, NotifyName) == 0x000000, "Member 'BP_DownedAR_Character_C_OnInterrupted_1711BF2548BEBB9D636806B65AB59336::NotifyName' has a wrong offset!");

// Function BP_DownedAR_Character.BP_DownedAR_Character_C.OnNotifyBegin_1711BF2548BEBB9D636806B65AB59336
// 0x000C (0x000C - 0x0000)
struct BP_DownedAR_Character_C_OnNotifyBegin_1711BF2548BEBB9D636806B65AB59336 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DownedAR_Character_C_OnNotifyBegin_1711BF2548BEBB9D636806B65AB59336) == 0x000004, "Wrong alignment on BP_DownedAR_Character_C_OnNotifyBegin_1711BF2548BEBB9D636806B65AB59336");
static_assert(sizeof(BP_DownedAR_Character_C_OnNotifyBegin_1711BF2548BEBB9D636806B65AB59336) == 0x00000C, "Wrong size on BP_DownedAR_Character_C_OnNotifyBegin_1711BF2548BEBB9D636806B65AB59336");
static_assert(offsetof(BP_DownedAR_Character_C_OnNotifyBegin_1711BF2548BEBB9D636806B65AB59336, NotifyName) == 0x000000, "Member 'BP_DownedAR_Character_C_OnNotifyBegin_1711BF2548BEBB9D636806B65AB59336::NotifyName' has a wrong offset!");

// Function BP_DownedAR_Character.BP_DownedAR_Character_C.OnNotifyEnd_1711BF2548BEBB9D636806B65AB59336
// 0x000C (0x000C - 0x0000)
struct BP_DownedAR_Character_C_OnNotifyEnd_1711BF2548BEBB9D636806B65AB59336 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DownedAR_Character_C_OnNotifyEnd_1711BF2548BEBB9D636806B65AB59336) == 0x000004, "Wrong alignment on BP_DownedAR_Character_C_OnNotifyEnd_1711BF2548BEBB9D636806B65AB59336");
static_assert(sizeof(BP_DownedAR_Character_C_OnNotifyEnd_1711BF2548BEBB9D636806B65AB59336) == 0x00000C, "Wrong size on BP_DownedAR_Character_C_OnNotifyEnd_1711BF2548BEBB9D636806B65AB59336");
static_assert(offsetof(BP_DownedAR_Character_C_OnNotifyEnd_1711BF2548BEBB9D636806B65AB59336, NotifyName) == 0x000000, "Member 'BP_DownedAR_Character_C_OnNotifyEnd_1711BF2548BEBB9D636806B65AB59336::NotifyName' has a wrong offset!");

// Function BP_DownedAR_Character.BP_DownedAR_Character_C.Initialise Hit Information
// 0x01F8 (0x01F8 - 0x0000)
struct BP_DownedAR_Character_C_Initialise_Hit_Information final
{
public:
	struct FGameplayCueParameters                 Cue_Parameters;                                    // 0x0000(0x00F0)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0100(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0118(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0124(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0130(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0150(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   CallFunc_BreakGameplayTagContainer_GameplayTags;   // 0x01C0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x01E0(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EF[0x1];                                      // 0x01EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DownedAR_Character_C_Initialise_Hit_Information) == 0x000008, "Wrong alignment on BP_DownedAR_Character_C_Initialise_Hit_Information");
static_assert(sizeof(BP_DownedAR_Character_C_Initialise_Hit_Information) == 0x0001F8, "Wrong size on BP_DownedAR_Character_C_Initialise_Hit_Information");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, Cue_Parameters) == 0x000000, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::Cue_Parameters' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, Temp_bool_True_if_break_was_hit_Variable) == 0x0000F0, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0000F4, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x0000F8, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000100, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000118, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000124, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000130, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000150, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, CallFunc_BreakGameplayCueParameters_Location) == 0x000170, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, CallFunc_BreakGameplayCueParameters_Normal) == 0x00017C, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000188, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000190, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000198, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001A0, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001A8, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001AC, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001B0, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001B8, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, CallFunc_BreakGameplayTagContainer_GameplayTags) == 0x0001C0, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::CallFunc_BreakGameplayTagContainer_GameplayTags' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, CallFunc_Not_PreBool_ReturnValue) == 0x0001D0, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, CallFunc_Array_Length_ReturnValue) == 0x0001D4, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, Temp_int_Array_Index_Variable) == 0x0001D8, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, Temp_int_Loop_Counter_Variable) == 0x0001DC, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, CallFunc_Array_Get_Item) == 0x0001E0, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, CallFunc_MatchesTag_ReturnValue) == 0x0001EC, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, CallFunc_Less_IntInt_ReturnValue) == 0x0001ED, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, CallFunc_BooleanAND_ReturnValue) == 0x0001EE, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_Initialise_Hit_Information, CallFunc_Add_IntInt_ReturnValue) == 0x0001F0, "Member 'BP_DownedAR_Character_C_Initialise_Hit_Information::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_DownedAR_Character.BP_DownedAR_Character_C.SpawnARShot
// 0x0078 (0x0078 - 0x0000)
struct BP_DownedAR_Character_C_SpawnARShot final
{
public:
	class FName                                   Temp_name_Variable;                                // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Temp_object_Variable_1;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAWeapon*                              K2Node_DynamicCast_AsCAWeapon;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_1;                           // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DownedAR_Character_C_SpawnARShot) == 0x000008, "Wrong alignment on BP_DownedAR_Character_C_SpawnARShot");
static_assert(sizeof(BP_DownedAR_Character_C_SpawnARShot) == 0x000078, "Wrong size on BP_DownedAR_Character_C_SpawnARShot");
static_assert(offsetof(BP_DownedAR_Character_C_SpawnARShot, Temp_name_Variable) == 0x000000, "Member 'BP_DownedAR_Character_C_SpawnARShot::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_SpawnARShot, Temp_name_Variable_1) == 0x00000C, "Member 'BP_DownedAR_Character_C_SpawnARShot::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DownedAR_Character_C_SpawnARShot, Temp_bool_Variable) == 0x000018, "Member 'BP_DownedAR_Character_C_SpawnARShot::Temp_bool_Variable' has a wrong offset!");
