#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DoorStateComponent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_DoorStateComponent.BP_DoorStateComponent_C.UpdateOpen__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_DoorStateComponent_C_UpdateOpen__DelegateSignature final
{
public:
	float                                         Percentage;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DoorStateComponent_C_UpdateOpen__DelegateSignature) == 0x000004, "Wrong alignment on BP_DoorStateComponent_C_UpdateOpen__DelegateSignature");
static_assert(sizeof(BP_DoorStateComponent_C_UpdateOpen__DelegateSignature) == 0x000004, "Wrong size on BP_DoorStateComponent_C_UpdateOpen__DelegateSignature");
static_assert(offsetof(BP_DoorStateComponent_C_UpdateOpen__DelegateSignature, Percentage) == 0x000000, "Member 'BP_DoorStateComponent_C_UpdateOpen__DelegateSignature::Percentage' has a wrong offset!");

// Function BP_DoorStateComponent.BP_DoorStateComponent_C.ExecuteUbergraph_BP_DoorStateComponent
// 0x0168 (0x0168 - 0x0000)
struct BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0040(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0058(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue;               // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_1;             // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_2;             // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_3;             // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICAGameplayAuthorityInterface> K2Node_DynamicCast_AsCAGameplay_Authority_Interface; // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_4;             // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_5;             // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_6;             // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasGameplayTag_ReturnValue;               // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_7;             // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimProgress_ReturnValue;              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_Tag;                                  // 0x0100(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Added;                                // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_2;     // 0x010F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_User_1;                               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x011C(0x0014)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_Event_User;                                 // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthorization_ReturnValue;             // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x013C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0150(0x0014)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent) == 0x000008, "Wrong alignment on BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent");
static_assert(sizeof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent) == 0x000168, "Wrong size on BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, EntryPoint) == 0x000000, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, K2Node_CreateDelegate_OutputDelegate_3) == 0x000040, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, Temp_bool_Variable) == 0x000054, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, K2Node_CreateDelegate_OutputDelegate_4) == 0x000058, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, Temp_name_Variable) == 0x00006C, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, Temp_name_Variable_1) == 0x000078, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, CallFunc_GetStateByName_ReturnValue) == 0x000088, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::CallFunc_GetStateByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, CallFunc_GetStateByName_ReturnValue_1) == 0x000090, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::CallFunc_GetStateByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, CallFunc_GetStateByName_ReturnValue_2) == 0x000098, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::CallFunc_GetStateByName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, CallFunc_GetOwner_ReturnValue) == 0x0000A0, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, CallFunc_GetStateByName_ReturnValue_3) == 0x0000A8, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::CallFunc_GetStateByName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, K2Node_DynamicCast_AsCAGameplay_Authority_Interface) == 0x0000B0, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::K2Node_DynamicCast_AsCAGameplay_Authority_Interface' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, CallFunc_GetStateByName_ReturnValue_4) == 0x0000C8, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::CallFunc_GetStateByName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, CallFunc_GetStateByName_ReturnValue_5) == 0x0000D0, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::CallFunc_GetStateByName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, CallFunc_GetStateByName_ReturnValue_6) == 0x0000D8, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::CallFunc_GetStateByName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, K2Node_Event_DeltaSeconds) == 0x0000E0, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, CallFunc_HasGameplayTag_ReturnValue) == 0x0000E4, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::CallFunc_HasGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, CallFunc_GetStateByName_ReturnValue_7) == 0x0000E8, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::CallFunc_GetStateByName_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, K2Node_Select_Default) == 0x0000F0, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, CallFunc_GetAnimProgress_ReturnValue) == 0x0000FC, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::CallFunc_GetAnimProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, K2Node_Event_Tag) == 0x000100, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::K2Node_Event_Tag' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, K2Node_Event_Added) == 0x00010C, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::K2Node_Event_Added' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x00010D, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, CallFunc_EqualEqual_GameplayTag_ReturnValue_1) == 0x00010E, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::CallFunc_EqualEqual_GameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, CallFunc_EqualEqual_GameplayTag_ReturnValue_2) == 0x00010F, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::CallFunc_EqualEqual_GameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, K2Node_Event_User_1) == 0x000110, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::K2Node_Event_User_1' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, Temp_bool_Variable_1) == 0x000118, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, K2Node_CreateDelegate_OutputDelegate_5) == 0x00011C, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, K2Node_Event_User) == 0x000130, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::K2Node_Event_User' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, CallFunc_HasAuthorization_ReturnValue) == 0x000138, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::CallFunc_HasAuthorization_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, K2Node_CreateDelegate_OutputDelegate_6) == 0x00013C, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent, K2Node_CreateDelegate_OutputDelegate_7) == 0x000150, "Member 'BP_DoorStateComponent_C_ExecuteUbergraph_BP_DoorStateComponent::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");

// Function BP_DoorStateComponent.BP_DoorStateComponent_C.OnActorEnteredArea
// 0x0008 (0x0008 - 0x0000)
struct BP_DoorStateComponent_C_OnActorEnteredArea final
{
public:
	class AActor*                                 User;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DoorStateComponent_C_OnActorEnteredArea) == 0x000008, "Wrong alignment on BP_DoorStateComponent_C_OnActorEnteredArea");
static_assert(sizeof(BP_DoorStateComponent_C_OnActorEnteredArea) == 0x000008, "Wrong size on BP_DoorStateComponent_C_OnActorEnteredArea");
static_assert(offsetof(BP_DoorStateComponent_C_OnActorEnteredArea, User) == 0x000000, "Member 'BP_DoorStateComponent_C_OnActorEnteredArea::User' has a wrong offset!");

// Function BP_DoorStateComponent.BP_DoorStateComponent_C.OnActorExitedArea
// 0x0008 (0x0008 - 0x0000)
struct BP_DoorStateComponent_C_OnActorExitedArea final
{
public:
	class AActor*                                 User;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DoorStateComponent_C_OnActorExitedArea) == 0x000008, "Wrong alignment on BP_DoorStateComponent_C_OnActorExitedArea");
static_assert(sizeof(BP_DoorStateComponent_C_OnActorExitedArea) == 0x000008, "Wrong size on BP_DoorStateComponent_C_OnActorExitedArea");
static_assert(offsetof(BP_DoorStateComponent_C_OnActorExitedArea, User) == 0x000000, "Member 'BP_DoorStateComponent_C_OnActorExitedArea::User' has a wrong offset!");

// Function BP_DoorStateComponent.BP_DoorStateComponent_C.TagChanged
// 0x0010 (0x0010 - 0x0000)
struct BP_DoorStateComponent_C_TagChanged final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          Added;                                             // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DoorStateComponent_C_TagChanged) == 0x000004, "Wrong alignment on BP_DoorStateComponent_C_TagChanged");
static_assert(sizeof(BP_DoorStateComponent_C_TagChanged) == 0x000010, "Wrong size on BP_DoorStateComponent_C_TagChanged");
static_assert(offsetof(BP_DoorStateComponent_C_TagChanged, Tag) == 0x000000, "Member 'BP_DoorStateComponent_C_TagChanged::Tag' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_TagChanged, Added) == 0x00000C, "Member 'BP_DoorStateComponent_C_TagChanged::Added' has a wrong offset!");

// Function BP_DoorStateComponent.BP_DoorStateComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_DoorStateComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DoorStateComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_DoorStateComponent_C_ReceiveTick");
static_assert(sizeof(BP_DoorStateComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_DoorStateComponent_C_ReceiveTick");
static_assert(offsetof(BP_DoorStateComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_DoorStateComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_DoorStateComponent.BP_DoorStateComponent_C.SetLockedState
// 0x0001 (0x0001 - 0x0000)
struct BP_DoorStateComponent_C_SetLockedState final
{
public:
	bool                                          Locked;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DoorStateComponent_C_SetLockedState) == 0x000001, "Wrong alignment on BP_DoorStateComponent_C_SetLockedState");
static_assert(sizeof(BP_DoorStateComponent_C_SetLockedState) == 0x000001, "Wrong size on BP_DoorStateComponent_C_SetLockedState");
static_assert(offsetof(BP_DoorStateComponent_C_SetLockedState, Locked) == 0x000000, "Member 'BP_DoorStateComponent_C_SetLockedState::Locked' has a wrong offset!");

// Function BP_DoorStateComponent.BP_DoorStateComponent_C.SetAutomaticState
// 0x0001 (0x0001 - 0x0000)
struct BP_DoorStateComponent_C_SetAutomaticState final
{
public:
	bool                                          Automatic;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DoorStateComponent_C_SetAutomaticState) == 0x000001, "Wrong alignment on BP_DoorStateComponent_C_SetAutomaticState");
static_assert(sizeof(BP_DoorStateComponent_C_SetAutomaticState) == 0x000001, "Wrong size on BP_DoorStateComponent_C_SetAutomaticState");
static_assert(offsetof(BP_DoorStateComponent_C_SetAutomaticState, Automatic) == 0x000000, "Member 'BP_DoorStateComponent_C_SetAutomaticState::Automatic' has a wrong offset!");

// Function BP_DoorStateComponent.BP_DoorStateComponent_C.SetPoweredState
// 0x0001 (0x0001 - 0x0000)
struct BP_DoorStateComponent_C_SetPoweredState final
{
public:
	bool                                          Powered;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DoorStateComponent_C_SetPoweredState) == 0x000001, "Wrong alignment on BP_DoorStateComponent_C_SetPoweredState");
static_assert(sizeof(BP_DoorStateComponent_C_SetPoweredState) == 0x000001, "Wrong size on BP_DoorStateComponent_C_SetPoweredState");
static_assert(offsetof(BP_DoorStateComponent_C_SetPoweredState, Powered) == 0x000000, "Member 'BP_DoorStateComponent_C_SetPoweredState::Powered' has a wrong offset!");

// Function BP_DoorStateComponent.BP_DoorStateComponent_C.SetIgnoreLockdown
// 0x0001 (0x0001 - 0x0000)
struct BP_DoorStateComponent_C_SetIgnoreLockdown final
{
public:
	bool                                          Ignore;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DoorStateComponent_C_SetIgnoreLockdown) == 0x000001, "Wrong alignment on BP_DoorStateComponent_C_SetIgnoreLockdown");
static_assert(sizeof(BP_DoorStateComponent_C_SetIgnoreLockdown) == 0x000001, "Wrong size on BP_DoorStateComponent_C_SetIgnoreLockdown");
static_assert(offsetof(BP_DoorStateComponent_C_SetIgnoreLockdown, Ignore) == 0x000000, "Member 'BP_DoorStateComponent_C_SetIgnoreLockdown::Ignore' has a wrong offset!");

// Function BP_DoorStateComponent.BP_DoorStateComponent_C.AutomaticClose
// 0x0004 (0x0004 - 0x0000)
struct BP_DoorStateComponent_C_AutomaticClose final
{
public:
	bool                                          CallFunc_HasGameplayTag_ReturnValue;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasGameplayTag_ReturnValue_1;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasUsers_ReturnValue;                     // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TransitionToStateByName_ReturnValue;      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DoorStateComponent_C_AutomaticClose) == 0x000001, "Wrong alignment on BP_DoorStateComponent_C_AutomaticClose");
static_assert(sizeof(BP_DoorStateComponent_C_AutomaticClose) == 0x000004, "Wrong size on BP_DoorStateComponent_C_AutomaticClose");
static_assert(offsetof(BP_DoorStateComponent_C_AutomaticClose, CallFunc_HasGameplayTag_ReturnValue) == 0x000000, "Member 'BP_DoorStateComponent_C_AutomaticClose::CallFunc_HasGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_AutomaticClose, CallFunc_HasGameplayTag_ReturnValue_1) == 0x000001, "Member 'BP_DoorStateComponent_C_AutomaticClose::CallFunc_HasGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_AutomaticClose, CallFunc_HasUsers_ReturnValue) == 0x000002, "Member 'BP_DoorStateComponent_C_AutomaticClose::CallFunc_HasUsers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_AutomaticClose, CallFunc_TransitionToStateByName_ReturnValue) == 0x000003, "Member 'BP_DoorStateComponent_C_AutomaticClose::CallFunc_TransitionToStateByName_ReturnValue' has a wrong offset!");

// Function BP_DoorStateComponent.BP_DoorStateComponent_C.SetHeldOpen
// 0x0001 (0x0001 - 0x0000)
struct BP_DoorStateComponent_C_SetHeldOpen final
{
public:
	bool                                          Hold;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DoorStateComponent_C_SetHeldOpen) == 0x000001, "Wrong alignment on BP_DoorStateComponent_C_SetHeldOpen");
static_assert(sizeof(BP_DoorStateComponent_C_SetHeldOpen) == 0x000001, "Wrong size on BP_DoorStateComponent_C_SetHeldOpen");
static_assert(offsetof(BP_DoorStateComponent_C_SetHeldOpen, Hold) == 0x000000, "Member 'BP_DoorStateComponent_C_SetHeldOpen::Hold' has a wrong offset!");

// Function BP_DoorStateComponent.BP_DoorStateComponent_C.SetOverridable
// 0x0001 (0x0001 - 0x0000)
struct BP_DoorStateComponent_C_SetOverridable final
{
public:
	bool                                          Overridable;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DoorStateComponent_C_SetOverridable) == 0x000001, "Wrong alignment on BP_DoorStateComponent_C_SetOverridable");
static_assert(sizeof(BP_DoorStateComponent_C_SetOverridable) == 0x000001, "Wrong size on BP_DoorStateComponent_C_SetOverridable");
static_assert(offsetof(BP_DoorStateComponent_C_SetOverridable, Overridable) == 0x000000, "Member 'BP_DoorStateComponent_C_SetOverridable::Overridable' has a wrong offset!");

// Function BP_DoorStateComponent.BP_DoorStateComponent_C.CanEnterArea
// 0x0010 (0x0010 - 0x0000)
struct BP_DoorStateComponent_C_CanEnterArea final
{
public:
	class AActor*                                 User;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayer_Result;                          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUserNPC_Result;                         // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DoorStateComponent_C_CanEnterArea) == 0x000008, "Wrong alignment on BP_DoorStateComponent_C_CanEnterArea");
static_assert(sizeof(BP_DoorStateComponent_C_CanEnterArea) == 0x000010, "Wrong size on BP_DoorStateComponent_C_CanEnterArea");
static_assert(offsetof(BP_DoorStateComponent_C_CanEnterArea, User) == 0x000000, "Member 'BP_DoorStateComponent_C_CanEnterArea::User' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_CanEnterArea, ReturnValue) == 0x000008, "Member 'BP_DoorStateComponent_C_CanEnterArea::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_CanEnterArea, CallFunc_IsPlayer_Result) == 0x000009, "Member 'BP_DoorStateComponent_C_CanEnterArea::CallFunc_IsPlayer_Result' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_CanEnterArea, CallFunc_IsUserNPC_Result) == 0x00000A, "Member 'BP_DoorStateComponent_C_CanEnterArea::CallFunc_IsUserNPC_Result' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_CanEnterArea, CallFunc_BooleanOR_ReturnValue) == 0x00000B, "Member 'BP_DoorStateComponent_C_CanEnterArea::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_DoorStateComponent.BP_DoorStateComponent_C.IsPlayer
// 0x0020 (0x0020 - 0x0000)
struct BP_DoorStateComponent_C_IsPlayer final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DoorStateComponent_C_IsPlayer) == 0x000008, "Wrong alignment on BP_DoorStateComponent_C_IsPlayer");
static_assert(sizeof(BP_DoorStateComponent_C_IsPlayer) == 0x000020, "Wrong size on BP_DoorStateComponent_C_IsPlayer");
static_assert(offsetof(BP_DoorStateComponent_C_IsPlayer, Object) == 0x000000, "Member 'BP_DoorStateComponent_C_IsPlayer::Object' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_IsPlayer, Result) == 0x000008, "Member 'BP_DoorStateComponent_C_IsPlayer::Result' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_IsPlayer, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x000010, "Member 'BP_DoorStateComponent_C_IsPlayer::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_IsPlayer, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_DoorStateComponent_C_IsPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_IsPlayer, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BP_DoorStateComponent_C_IsPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_DoorStateComponent.BP_DoorStateComponent_C.IsUserNPC
// 0x0020 (0x0020 - 0x0000)
struct BP_DoorStateComponent_C_IsUserNPC final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_NPC*                       K2Node_DynamicCast_AsCACharacter_NPC;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UsesDevices_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DoorStateComponent_C_IsUserNPC) == 0x000008, "Wrong alignment on BP_DoorStateComponent_C_IsUserNPC");
static_assert(sizeof(BP_DoorStateComponent_C_IsUserNPC) == 0x000020, "Wrong size on BP_DoorStateComponent_C_IsUserNPC");
static_assert(offsetof(BP_DoorStateComponent_C_IsUserNPC, Object) == 0x000000, "Member 'BP_DoorStateComponent_C_IsUserNPC::Object' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_IsUserNPC, Result) == 0x000008, "Member 'BP_DoorStateComponent_C_IsUserNPC::Result' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_IsUserNPC, K2Node_DynamicCast_AsCACharacter_NPC) == 0x000010, "Member 'BP_DoorStateComponent_C_IsUserNPC::K2Node_DynamicCast_AsCACharacter_NPC' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_IsUserNPC, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_DoorStateComponent_C_IsUserNPC::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_IsUserNPC, CallFunc_UsesDevices_ReturnValue) == 0x000019, "Member 'BP_DoorStateComponent_C_IsUserNPC::CallFunc_UsesDevices_ReturnValue' has a wrong offset!");

// Function BP_DoorStateComponent.BP_DoorStateComponent_C.HasAuthorisedUsers
// 0x0060 (0x0060 - 0x0000)
struct BP_DoorStateComponent_C_HasAuthorisedUsers final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICAGameplayAuthorityInterface> K2Node_DynamicCast_AsCAGameplay_Authority_Interface; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetUsers_ReturnValue;                     // 0x0038(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthorization_ReturnValue;             // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DoorStateComponent_C_HasAuthorisedUsers) == 0x000008, "Wrong alignment on BP_DoorStateComponent_C_HasAuthorisedUsers");
static_assert(sizeof(BP_DoorStateComponent_C_HasAuthorisedUsers) == 0x000060, "Wrong size on BP_DoorStateComponent_C_HasAuthorisedUsers");
static_assert(offsetof(BP_DoorStateComponent_C_HasAuthorisedUsers, Result) == 0x000000, "Member 'BP_DoorStateComponent_C_HasAuthorisedUsers::Result' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_HasAuthorisedUsers, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_DoorStateComponent_C_HasAuthorisedUsers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DoorStateComponent_C_HasAuthorisedUsers, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_DoorStateComponent_C_HasAuthorisedUsers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
