#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeathEffect_Player

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CAAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_DeathEffect_Player.BP_DeathEffect_Player_C.ExecuteUbergraph_BP_DeathEffect_Player
// 0x0120 (0x0120 - 0x0000)
struct BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0014)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetPawnMesh_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x003C(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x0050(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPawnMesh_ReturnValue_1;                // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAtLocation_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPawnMesh_ReturnValue_2;                // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayerCharacter_ReturnValue;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue_1; // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x00D0(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayerCharacter_ReturnValue_1;    // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x00F0(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0104(0x0014)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player) == 0x000008, "Wrong alignment on BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player");
static_assert(sizeof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player) == 0x000120, "Wrong size on BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, EntryPoint) == 0x000000, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, CallFunc_GetInstigator_ReturnValue) == 0x000008, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, CallFunc_GetPawnMesh_ReturnValue) == 0x000030, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::CallFunc_GetPawnMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, CallFunc_IsValid_ReturnValue_2) == 0x000039, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, Temp_delegate_Variable) == 0x00003C, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, Temp_delegate_Variable_1) == 0x000050, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, K2Node_SwitchEnum_CmpSuccess) == 0x000064, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, CallFunc_GetForwardVector_ReturnValue) == 0x000068, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, CallFunc_GetPawnMesh_ReturnValue_1) == 0x000078, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::CallFunc_GetPawnMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue) == 0x000080, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, CallFunc_IsValid_ReturnValue_3) == 0x000088, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, CallFunc_GetSocketLocation_ReturnValue) == 0x00008C, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, CallFunc_SpawnCANiagaraSystemAtLocation_ReturnValue) == 0x000098, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::CallFunc_SpawnCANiagaraSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, CallFunc_IsValid_ReturnValue_4) == 0x0000A0, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, CallFunc_GetPawnMesh_ReturnValue_2) == 0x0000A8, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::CallFunc_GetPawnMesh_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, CallFunc_GetLocalPlayerCharacter_ReturnValue) == 0x0000B0, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::CallFunc_GetLocalPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, CallFunc_IsValid_ReturnValue_5) == 0x0000B8, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue_1) == 0x0000C0, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, CallFunc_GetInstigator_ReturnValue_1) == 0x0000C8, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, CallFunc_PlayEvent_playback_instance) == 0x0000D0, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, CallFunc_PlayEvent_play_success) == 0x0000E0, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000E1, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, CallFunc_GetLocalPlayerCharacter_ReturnValue_1) == 0x0000E8, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::CallFunc_GetLocalPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, CallFunc_PlayEvent_playback_instance_1) == 0x0000F0, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, CallFunc_PlayEvent_play_success_1) == 0x000100, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::CallFunc_PlayEvent_play_success_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, K2Node_CreateDelegate_OutputDelegate_1) == 0x000104, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000118, "Member 'BP_DeathEffect_Player_C_ExecuteUbergraph_BP_DeathEffect_Player::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");

}

