#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeathEffect_NPCTurret

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DeathEffect_NPCTurret.BP_DeathEffect_NPCTurret_C
// 0x0028 (0x05B8 - 0x0590)
class ABP_DeathEffect_NPCTurret_C final : public ACADeathEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCAEmitterEnabledState>         NewVar_0;                                          // 0x05A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         SpawnPropCount;                                    // 0x05B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DeathEffect_NPCTurret(int32 EntryPoint);
	void DeathEffectEnd();
	void OnDeath();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DeathEffect_NPCTurret_C">();
	}
	static class ABP_DeathEffect_NPCTurret_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DeathEffect_NPCTurret_C>();
	}
};
static_assert(alignof(ABP_DeathEffect_NPCTurret_C) == 0x000008, "Wrong alignment on ABP_DeathEffect_NPCTurret_C");
static_assert(sizeof(ABP_DeathEffect_NPCTurret_C) == 0x0005B8, "Wrong size on ABP_DeathEffect_NPCTurret_C");
static_assert(offsetof(ABP_DeathEffect_NPCTurret_C, UberGraphFrame) == 0x000590, "Member 'ABP_DeathEffect_NPCTurret_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DeathEffect_NPCTurret_C, DefaultSceneRoot) == 0x000598, "Member 'ABP_DeathEffect_NPCTurret_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_DeathEffect_NPCTurret_C, NewVar_0) == 0x0005A0, "Member 'ABP_DeathEffect_NPCTurret_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(ABP_DeathEffect_NPCTurret_C, SpawnPropCount) == 0x0005B0, "Member 'ABP_DeathEffect_NPCTurret_C::SpawnPropCount' has a wrong offset!");

}

