#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExplosionTankSlam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ExplosionTankSlam.BP_ExplosionTankSlam_C
// 0x0030 (0x0288 - 0x0258)
class ABP_ExplosionTankSlam_C final : public ACAExplosionEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Epicenter;                                         // 0x026C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Surface_Normal;                                    // 0x0278(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Attached_To_Surface;                               // 0x0284(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_ExplosionTankSlam(int32 EntryPoint);
	void OnTrigger(const struct FVector& Epicenter_0, float Radius_0, bool Attached_to_surface, const struct FVector& Surface_normal, const struct FVector& Incoming_direction, bool Friendly, float Duration);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ExplosionTankSlam_C">();
	}
	static class ABP_ExplosionTankSlam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ExplosionTankSlam_C>();
	}
};
static_assert(alignof(ABP_ExplosionTankSlam_C) == 0x000008, "Wrong alignment on ABP_ExplosionTankSlam_C");
static_assert(sizeof(ABP_ExplosionTankSlam_C) == 0x000288, "Wrong size on ABP_ExplosionTankSlam_C");
static_assert(offsetof(ABP_ExplosionTankSlam_C, UberGraphFrame) == 0x000258, "Member 'ABP_ExplosionTankSlam_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ExplosionTankSlam_C, DefaultSceneRoot) == 0x000260, "Member 'ABP_ExplosionTankSlam_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ExplosionTankSlam_C, Radius) == 0x000268, "Member 'ABP_ExplosionTankSlam_C::Radius' has a wrong offset!");
static_assert(offsetof(ABP_ExplosionTankSlam_C, Epicenter) == 0x00026C, "Member 'ABP_ExplosionTankSlam_C::Epicenter' has a wrong offset!");
static_assert(offsetof(ABP_ExplosionTankSlam_C, Surface_Normal) == 0x000278, "Member 'ABP_ExplosionTankSlam_C::Surface_Normal' has a wrong offset!");
static_assert(offsetof(ABP_ExplosionTankSlam_C, Attached_To_Surface) == 0x000284, "Member 'ABP_ExplosionTankSlam_C::Attached_To_Surface' has a wrong offset!");

}

