#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EffectProp_Head

#include "Basic.hpp"

#include "CAAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_EffectProp_Head.BP_EffectProp_Head_C.ExecuteUbergraph_BP_EffectProp_Head
// 0x00E8 (0x00E8 - 0x0000)
struct BP_EffectProp_Head_C_ExecuteUbergraph_BP_EffectProp_Head final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0004(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0018(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_splat_counter;                        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_hit_component;                        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_other_actor;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_other_comp;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_normal_impulse;                       // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_hit;                                  // 0x0054(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_EffectProp_Head_C_ExecuteUbergraph_BP_EffectProp_Head) == 0x000008, "Wrong alignment on BP_EffectProp_Head_C_ExecuteUbergraph_BP_EffectProp_Head");
static_assert(sizeof(BP_EffectProp_Head_C_ExecuteUbergraph_BP_EffectProp_Head) == 0x0000E8, "Wrong size on BP_EffectProp_Head_C_ExecuteUbergraph_BP_EffectProp_Head");
static_assert(offsetof(BP_EffectProp_Head_C_ExecuteUbergraph_BP_EffectProp_Head, EntryPoint) == 0x000000, "Member 'BP_EffectProp_Head_C_ExecuteUbergraph_BP_EffectProp_Head::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EffectProp_Head_C_ExecuteUbergraph_BP_EffectProp_Head, Temp_delegate_Variable) == 0x000004, "Member 'BP_EffectProp_Head_C_ExecuteUbergraph_BP_EffectProp_Head::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_EffectProp_Head_C_ExecuteUbergraph_BP_EffectProp_Head, CallFunc_PlayEvent_playback_instance) == 0x000018, "Member 'BP_EffectProp_Head_C_ExecuteUbergraph_BP_EffectProp_Head::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_EffectProp_Head_C_ExecuteUbergraph_BP_EffectProp_Head, CallFunc_PlayEvent_play_success) == 0x000028, "Member 'BP_EffectProp_Head_C_ExecuteUbergraph_BP_EffectProp_Head::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(BP_EffectProp_Head_C_ExecuteUbergraph_BP_EffectProp_Head, K2Node_Event_splat_counter) == 0x00002C, "Member 'BP_EffectProp_Head_C_ExecuteUbergraph_BP_EffectProp_Head::K2Node_Event_splat_counter' has a wrong offset!");
static_assert(offsetof(BP_EffectProp_Head_C_ExecuteUbergraph_BP_EffectProp_Head, K2Node_Event_hit_component) == 0x000030, "Member 'BP_EffectProp_Head_C_ExecuteUbergraph_BP_EffectProp_Head::K2Node_Event_hit_component' has a wrong offset!");
static_assert(offsetof(BP_EffectProp_Head_C_ExecuteUbergraph_BP_EffectProp_Head, K2Node_Event_other_actor) == 0x000038, "Member 'BP_EffectProp_Head_C_ExecuteUbergraph_BP_EffectProp_Head::K2Node_Event_other_actor' has a wrong offset!");
static_assert(offsetof(BP_EffectProp_Head_C_ExecuteUbergraph_BP_EffectProp_Head, K2Node_Event_other_comp) == 0x000040, "Member 'BP_EffectProp_Head_C_ExecuteUbergraph_BP_EffectProp_Head::K2Node_Event_other_comp' has a wrong offset!");
static_assert(offsetof(BP_EffectProp_Head_C_ExecuteUbergraph_BP_EffectProp_Head, K2Node_Event_normal_impulse) == 0x000048, "Member 'BP_EffectProp_Head_C_ExecuteUbergraph_BP_EffectProp_Head::K2Node_Event_normal_impulse' has a wrong offset!");
static_assert(offsetof(BP_EffectProp_Head_C_ExecuteUbergraph_BP_EffectProp_Head, K2Node_Event_hit) == 0x000054, "Member 'BP_EffectProp_Head_C_ExecuteUbergraph_BP_EffectProp_Head::K2Node_Event_hit' has a wrong offset!");

// Function BP_EffectProp_Head.BP_EffectProp_Head_C.OnSplat
// 0x00C0 (0x00C0 - 0x0000)
struct BP_EffectProp_Head_C_OnSplat final
{
public:
	int32                                         Splat_counter;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    Hit_component;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other_actor;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Other_comp;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Normal_impulse;                                    // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x002C(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_EffectProp_Head_C_OnSplat) == 0x000008, "Wrong alignment on BP_EffectProp_Head_C_OnSplat");
static_assert(sizeof(BP_EffectProp_Head_C_OnSplat) == 0x0000C0, "Wrong size on BP_EffectProp_Head_C_OnSplat");
static_assert(offsetof(BP_EffectProp_Head_C_OnSplat, Splat_counter) == 0x000000, "Member 'BP_EffectProp_Head_C_OnSplat::Splat_counter' has a wrong offset!");
static_assert(offsetof(BP_EffectProp_Head_C_OnSplat, Hit_component) == 0x000008, "Member 'BP_EffectProp_Head_C_OnSplat::Hit_component' has a wrong offset!");
static_assert(offsetof(BP_EffectProp_Head_C_OnSplat, Other_actor) == 0x000010, "Member 'BP_EffectProp_Head_C_OnSplat::Other_actor' has a wrong offset!");
static_assert(offsetof(BP_EffectProp_Head_C_OnSplat, Other_comp) == 0x000018, "Member 'BP_EffectProp_Head_C_OnSplat::Other_comp' has a wrong offset!");
static_assert(offsetof(BP_EffectProp_Head_C_OnSplat, Normal_impulse) == 0x000020, "Member 'BP_EffectProp_Head_C_OnSplat::Normal_impulse' has a wrong offset!");
static_assert(offsetof(BP_EffectProp_Head_C_OnSplat, Hit) == 0x00002C, "Member 'BP_EffectProp_Head_C_OnSplat::Hit' has a wrong offset!");

}

