#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnemyRevealEventManager

#include "Basic.hpp"

#include "Keaton_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_EnemyRevealEventManager.BP_EnemyRevealEventManager_C.ExecuteUbergraph_BP_EnemyRevealEventManager
// 0x0118 (0x0118 - 0x0000)
struct BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_EventLifetime;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAGameState*                           CallFunc_GetGameState_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACACharacter_MainPlayer*>        CallFunc_GetAllPlayers_ReturnValue;                // 0x0040(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantize                    K2Node_MakeStruct_Vector_NetQuantize;              // 0x0090(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAMapEntityPayload                    K2Node_MakeStruct_CAMapEntityPayload;              // 0x00A0(0x0070)()
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager) == 0x000008, "Wrong alignment on BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager");
static_assert(sizeof(BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager) == 0x000118, "Wrong size on BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager");
static_assert(offsetof(BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager, EntryPoint) == 0x000000, "Member 'BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager, K2Node_CustomEvent_EventLifetime) == 0x000004, "Member 'BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager::K2Node_CustomEvent_EventLifetime' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager, CallFunc_HasAuthority_ReturnValue) == 0x00000C, "Member 'BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager, K2Node_Event_DeltaSeconds) == 0x000030, "Member 'BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager, CallFunc_GetGameState_ReturnValue) == 0x000038, "Member 'BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager, CallFunc_GetAllPlayers_ReturnValue) == 0x000040, "Member 'BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager::CallFunc_GetAllPlayers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager, CallFunc_GetController_ReturnValue) == 0x000068, "Member 'BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000074, "Member 'BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager, CallFunc_BreakVector_X) == 0x000080, "Member 'BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager, CallFunc_BreakVector_Y) == 0x000084, "Member 'BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager, CallFunc_BreakVector_Z) == 0x000088, "Member 'BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager, CallFunc_Array_Length_ReturnValue) == 0x00008C, "Member 'BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager, K2Node_MakeStruct_Vector_NetQuantize) == 0x000090, "Member 'BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager::K2Node_MakeStruct_Vector_NetQuantize' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager, CallFunc_Less_IntInt_ReturnValue) == 0x00009C, "Member 'BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager, K2Node_MakeStruct_CAMapEntityPayload) == 0x0000A0, "Member 'BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager::K2Node_MakeStruct_CAMapEntityPayload' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager, CallFunc_HasAuthority_ReturnValue_1) == 0x000110, "Member 'BP_EnemyRevealEventManager_C_ExecuteUbergraph_BP_EnemyRevealEventManager::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");

// Function BP_EnemyRevealEventManager.BP_EnemyRevealEventManager_C.StartRevealEvent
// 0x0004 (0x0004 - 0x0000)
struct BP_EnemyRevealEventManager_C_StartRevealEvent final
{
public:
	float                                         EventLifetime_0;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyRevealEventManager_C_StartRevealEvent) == 0x000004, "Wrong alignment on BP_EnemyRevealEventManager_C_StartRevealEvent");
static_assert(sizeof(BP_EnemyRevealEventManager_C_StartRevealEvent) == 0x000004, "Wrong size on BP_EnemyRevealEventManager_C_StartRevealEvent");
static_assert(offsetof(BP_EnemyRevealEventManager_C_StartRevealEvent, EventLifetime_0) == 0x000000, "Member 'BP_EnemyRevealEventManager_C_StartRevealEvent::EventLifetime_0' has a wrong offset!");

// Function BP_EnemyRevealEventManager.BP_EnemyRevealEventManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_EnemyRevealEventManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyRevealEventManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_EnemyRevealEventManager_C_ReceiveTick");
static_assert(sizeof(BP_EnemyRevealEventManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_EnemyRevealEventManager_C_ReceiveTick");
static_assert(offsetof(BP_EnemyRevealEventManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_EnemyRevealEventManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_EnemyRevealEventManager.BP_EnemyRevealEventManager_C.SetInformationRevealForTeams
// 0x0040 (0x0040 - 0x0000)
struct BP_EnemyRevealEventManager_C_SetInformationRevealForTeams final
{
public:
	ECAInformationControlLevel                    IntelLevel;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ended_;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAGameState*                           CallFunc_GetGameState_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACACharacter_MainPlayer*>        CallFunc_GetAllPlayers_ReturnValue;                // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCATeamID                              CallFunc_GetTeamID_ReturnValue;                    // 0x003C(0x0004)(ConstParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnemyRevealEventManager_C_SetInformationRevealForTeams) == 0x000008, "Wrong alignment on BP_EnemyRevealEventManager_C_SetInformationRevealForTeams");
static_assert(sizeof(BP_EnemyRevealEventManager_C_SetInformationRevealForTeams) == 0x000040, "Wrong size on BP_EnemyRevealEventManager_C_SetInformationRevealForTeams");
static_assert(offsetof(BP_EnemyRevealEventManager_C_SetInformationRevealForTeams, IntelLevel) == 0x000000, "Member 'BP_EnemyRevealEventManager_C_SetInformationRevealForTeams::IntelLevel' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_SetInformationRevealForTeams, Ended_) == 0x000001, "Member 'BP_EnemyRevealEventManager_C_SetInformationRevealForTeams::Ended_' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_SetInformationRevealForTeams, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_EnemyRevealEventManager_C_SetInformationRevealForTeams::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_SetInformationRevealForTeams, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_EnemyRevealEventManager_C_SetInformationRevealForTeams::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_SetInformationRevealForTeams, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_EnemyRevealEventManager_C_SetInformationRevealForTeams::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_SetInformationRevealForTeams, CallFunc_GetGameState_ReturnValue) == 0x000010, "Member 'BP_EnemyRevealEventManager_C_SetInformationRevealForTeams::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_SetInformationRevealForTeams, CallFunc_GetAllPlayers_ReturnValue) == 0x000018, "Member 'BP_EnemyRevealEventManager_C_SetInformationRevealForTeams::CallFunc_GetAllPlayers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_SetInformationRevealForTeams, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_EnemyRevealEventManager_C_SetInformationRevealForTeams::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_SetInformationRevealForTeams, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_EnemyRevealEventManager_C_SetInformationRevealForTeams::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_SetInformationRevealForTeams, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_EnemyRevealEventManager_C_SetInformationRevealForTeams::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnemyRevealEventManager_C_SetInformationRevealForTeams, CallFunc_GetTeamID_ReturnValue) == 0x00003C, "Member 'BP_EnemyRevealEventManager_C_SetInformationRevealForTeams::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");

}

