#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ElectricalArcEffect_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CAAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_ElectricalArcEffect_Base.BP_ElectricalArcEffect_Base_C.ExecuteUbergraph_BP_ElectricalArcEffect_Base
// 0x0100 (0x0100 - 0x0000)
struct BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEventInWorld_playback_instance;       // 0x0008(0x0010)()
	bool                                          CallFunc_PlayEventInWorld_play_success;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEventInWorld_playback_instance_1;     // 0x0020(0x0010)()
	bool                                          CallFunc_PlayEventInWorld_play_success_1;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAtLocation_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_arc_source_actor;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_arc_target_actor;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_ExtractRandomSocketsFromActor_socket_names; // 0x0060(0x0010)(ReferenceParm)
	TArray<class UMeshComponent*>                 CallFunc_ExtractRandomSocketsFromActor_mesh_components; // 0x0070(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_ExtractRandomSocketsFromActor_socket_names_1; // 0x00B8(0x0010)(ReferenceParm)
	TArray<class UMeshComponent*>                 CallFunc_ExtractRandomSocketsFromActor_mesh_components_1; // 0x00C8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UMeshComponent*                         CallFunc_Array_Get_Item_2;                         // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_3;                         // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base) == 0x000008, "Wrong alignment on BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base");
static_assert(sizeof(BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base) == 0x000100, "Wrong size on BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base");
static_assert(offsetof(BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base, EntryPoint) == 0x000000, "Member 'BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base, CallFunc_PlayEventInWorld_playback_instance) == 0x000008, "Member 'BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base::CallFunc_PlayEventInWorld_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base, CallFunc_PlayEventInWorld_play_success) == 0x000018, "Member 'BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base::CallFunc_PlayEventInWorld_play_success' has a wrong offset!");
static_assert(offsetof(BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base, CallFunc_PlayEventInWorld_playback_instance_1) == 0x000020, "Member 'BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base::CallFunc_PlayEventInWorld_playback_instance_1' has a wrong offset!");
static_assert(offsetof(BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base, CallFunc_PlayEventInWorld_play_success_1) == 0x000030, "Member 'BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base::CallFunc_PlayEventInWorld_play_success_1' has a wrong offset!");
static_assert(offsetof(BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base, CallFunc_SpawnCANiagaraSystemAtLocation_ReturnValue) == 0x000038, "Member 'BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base::CallFunc_SpawnCANiagaraSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base, K2Node_Event_arc_source_actor) == 0x000040, "Member 'BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base::K2Node_Event_arc_source_actor' has a wrong offset!");
static_assert(offsetof(BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base, K2Node_Event_arc_target_actor) == 0x000048, "Member 'BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base::K2Node_Event_arc_target_actor' has a wrong offset!");
static_assert(offsetof(BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base, CallFunc_ExtractRandomSocketsFromActor_socket_names) == 0x000060, "Member 'BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base::CallFunc_ExtractRandomSocketsFromActor_socket_names' has a wrong offset!");
static_assert(offsetof(BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base, CallFunc_ExtractRandomSocketsFromActor_mesh_components) == 0x000070, "Member 'BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base::CallFunc_ExtractRandomSocketsFromActor_mesh_components' has a wrong offset!");
static_assert(offsetof(BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base, CallFunc_Array_Get_Item) == 0x000080, "Member 'BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base, CallFunc_Array_Get_Item_1) == 0x00008C, "Member 'BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base, CallFunc_Greater_IntInt_ReturnValue) == 0x000098, "Member 'BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base, CallFunc_GetSocketLocation_ReturnValue) == 0x00009C, "Member 'BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000A8, "Member 'BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base, CallFunc_ExtractRandomSocketsFromActor_socket_names_1) == 0x0000B8, "Member 'BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base::CallFunc_ExtractRandomSocketsFromActor_socket_names_1' has a wrong offset!");
static_assert(offsetof(BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base, CallFunc_ExtractRandomSocketsFromActor_mesh_components_1) == 0x0000C8, "Member 'BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base::CallFunc_ExtractRandomSocketsFromActor_mesh_components_1' has a wrong offset!");
static_assert(offsetof(BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base, CallFunc_Array_Get_Item_2) == 0x0000D8, "Member 'BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base, CallFunc_Array_Length_ReturnValue_1) == 0x0000E0, "Member 'BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base, CallFunc_Array_Get_Item_3) == 0x0000E4, "Member 'BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000F0, "Member 'BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base, CallFunc_GetSocketLocation_ReturnValue_1) == 0x0000F4, "Member 'BP_ElectricalArcEffect_Base_C_ExecuteUbergraph_BP_ElectricalArcEffect_Base::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");

// Function BP_ElectricalArcEffect_Base.BP_ElectricalArcEffect_Base_C.OnTrigger
// 0x0010 (0x0010 - 0x0000)
struct BP_ElectricalArcEffect_Base_C_OnTrigger final
{
public:
	class AActor*                                 Arc_source_actor;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Arc_target_actor;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ElectricalArcEffect_Base_C_OnTrigger) == 0x000008, "Wrong alignment on BP_ElectricalArcEffect_Base_C_OnTrigger");
static_assert(sizeof(BP_ElectricalArcEffect_Base_C_OnTrigger) == 0x000010, "Wrong size on BP_ElectricalArcEffect_Base_C_OnTrigger");
static_assert(offsetof(BP_ElectricalArcEffect_Base_C_OnTrigger, Arc_source_actor) == 0x000000, "Member 'BP_ElectricalArcEffect_Base_C_OnTrigger::Arc_source_actor' has a wrong offset!");
static_assert(offsetof(BP_ElectricalArcEffect_Base_C_OnTrigger, Arc_target_actor) == 0x000008, "Member 'BP_ElectricalArcEffect_Base_C_OnTrigger::Arc_target_actor' has a wrong offset!");

}

