#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Explosion_UnstableReaction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Explosion_UnstableReaction.BP_Explosion_UnstableReaction_C
// 0x0028 (0x0280 - 0x0258)
class ABP_Explosion_UnstableReaction_C final : public ACAExplosionEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Epicenter;                                         // 0x0268(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsZeroG;                                           // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Explosion_UnstableReaction(int32 EntryPoint);
	void OnTrigger(const struct FVector& Epicenter_0, float Radius_0, bool Attached_to_surface, const struct FVector& Surface_normal, const struct FVector& Incoming_direction, bool Friendly, float Duration);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Explosion_UnstableReaction_C">();
	}
	static class ABP_Explosion_UnstableReaction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Explosion_UnstableReaction_C>();
	}
};
static_assert(alignof(ABP_Explosion_UnstableReaction_C) == 0x000008, "Wrong alignment on ABP_Explosion_UnstableReaction_C");
static_assert(sizeof(ABP_Explosion_UnstableReaction_C) == 0x000280, "Wrong size on ABP_Explosion_UnstableReaction_C");
static_assert(offsetof(ABP_Explosion_UnstableReaction_C, UberGraphFrame) == 0x000258, "Member 'ABP_Explosion_UnstableReaction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Explosion_UnstableReaction_C, DefaultSceneRoot) == 0x000260, "Member 'ABP_Explosion_UnstableReaction_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Explosion_UnstableReaction_C, Epicenter) == 0x000268, "Member 'ABP_Explosion_UnstableReaction_C::Epicenter' has a wrong offset!");
static_assert(offsetof(ABP_Explosion_UnstableReaction_C, Radius) == 0x000274, "Member 'ABP_Explosion_UnstableReaction_C::Radius' has a wrong offset!");
static_assert(offsetof(ABP_Explosion_UnstableReaction_C, IsZeroG) == 0x000278, "Member 'ABP_Explosion_UnstableReaction_C::IsZeroG' has a wrong offset!");

}

