#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExplosionFoamDestruction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ExplosionFoamDestruction.BP_ExplosionFoamDestruction_C
// 0x0068 (0x02C0 - 0x0258)
class ABP_ExplosionFoamDestruction_C final : public ACAExplosionEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         SpawnPropCount;                                    // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentGravity;                                    // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class UNiagaraComponent*, struct FVector> NiagaraSystems;                                    // 0x0270(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_BP_ExplosionFoamDestruction(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void OnTrigger(const struct FVector& Epicenter, float Radius, bool Attached_to_surface, const struct FVector& Surface_normal, const struct FVector& Incoming_direction, bool Friendly, float Duration);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ExplosionFoamDestruction_C">();
	}
	static class ABP_ExplosionFoamDestruction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ExplosionFoamDestruction_C>();
	}
};
static_assert(alignof(ABP_ExplosionFoamDestruction_C) == 0x000008, "Wrong alignment on ABP_ExplosionFoamDestruction_C");
static_assert(sizeof(ABP_ExplosionFoamDestruction_C) == 0x0002C0, "Wrong size on ABP_ExplosionFoamDestruction_C");
static_assert(offsetof(ABP_ExplosionFoamDestruction_C, UberGraphFrame) == 0x000258, "Member 'ABP_ExplosionFoamDestruction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ExplosionFoamDestruction_C, DefaultSceneRoot) == 0x000260, "Member 'ABP_ExplosionFoamDestruction_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ExplosionFoamDestruction_C, SpawnPropCount) == 0x000268, "Member 'ABP_ExplosionFoamDestruction_C::SpawnPropCount' has a wrong offset!");
static_assert(offsetof(ABP_ExplosionFoamDestruction_C, CurrentGravity) == 0x00026C, "Member 'ABP_ExplosionFoamDestruction_C::CurrentGravity' has a wrong offset!");
static_assert(offsetof(ABP_ExplosionFoamDestruction_C, NiagaraSystems) == 0x000270, "Member 'ABP_ExplosionFoamDestruction_C::NiagaraSystems' has a wrong offset!");

}

