#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExplosionEliteFacePlate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ExplosionEliteFacePlate.BP_ExplosionEliteFacePlate_C
// 0x0020 (0x0278 - 0x0258)
class ABP_ExplosionEliteFacePlate_C final : public ACAExplosionEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         GroundDistance;                                    // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ExplosionEliteFacePlate(int32 EntryPoint);
	void OnTrigger(const struct FVector& Epicenter, float Radius, bool Attached_to_surface, const struct FVector& Surface_normal, const struct FVector& Incoming_direction, bool Friendly, float Duration);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ExplosionEliteFacePlate_C">();
	}
	static class ABP_ExplosionEliteFacePlate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ExplosionEliteFacePlate_C>();
	}
};
static_assert(alignof(ABP_ExplosionEliteFacePlate_C) == 0x000008, "Wrong alignment on ABP_ExplosionEliteFacePlate_C");
static_assert(sizeof(ABP_ExplosionEliteFacePlate_C) == 0x000278, "Wrong size on ABP_ExplosionEliteFacePlate_C");
static_assert(offsetof(ABP_ExplosionEliteFacePlate_C, UberGraphFrame) == 0x000258, "Member 'ABP_ExplosionEliteFacePlate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ExplosionEliteFacePlate_C, StaticMesh) == 0x000260, "Member 'ABP_ExplosionEliteFacePlate_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_ExplosionEliteFacePlate_C, DefaultSceneRoot) == 0x000268, "Member 'ABP_ExplosionEliteFacePlate_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ExplosionEliteFacePlate_C, GroundDistance) == 0x000270, "Member 'ABP_ExplosionEliteFacePlate_C::GroundDistance' has a wrong offset!");

}

