#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExplosionFoam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ExplosionFoam.BP_ExplosionFoam_C
// 0x0030 (0x0288 - 0x0258)
class ABP_ExplosionFoam_C final : public ACAExplosionEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        AirParticle;                                       // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        AirParticleZeroG;                                  // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DecalSize;                                         // 0x0278(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ExplosionFoam(int32 EntryPoint);
	void OnTrigger(const struct FVector& Epicenter, float Radius, bool Attached_to_surface, const struct FVector& Surface_normal, const struct FVector& Incoming_direction, bool Friendly, float Duration);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ExplosionFoam_C">();
	}
	static class ABP_ExplosionFoam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ExplosionFoam_C>();
	}
};
static_assert(alignof(ABP_ExplosionFoam_C) == 0x000008, "Wrong alignment on ABP_ExplosionFoam_C");
static_assert(sizeof(ABP_ExplosionFoam_C) == 0x000288, "Wrong size on ABP_ExplosionFoam_C");
static_assert(offsetof(ABP_ExplosionFoam_C, UberGraphFrame) == 0x000258, "Member 'ABP_ExplosionFoam_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ExplosionFoam_C, DefaultSceneRoot) == 0x000260, "Member 'ABP_ExplosionFoam_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ExplosionFoam_C, AirParticle) == 0x000268, "Member 'ABP_ExplosionFoam_C::AirParticle' has a wrong offset!");
static_assert(offsetof(ABP_ExplosionFoam_C, AirParticleZeroG) == 0x000270, "Member 'ABP_ExplosionFoam_C::AirParticleZeroG' has a wrong offset!");
static_assert(offsetof(ABP_ExplosionFoam_C, DecalSize) == 0x000278, "Member 'ABP_ExplosionFoam_C::DecalSize' has a wrong offset!");

}

