#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExplosionGruntGrenade

#include "Basic.hpp"

#include "CAAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ExplosionGruntGrenade.BP_ExplosionGruntGrenade_C.ExecuteUbergraph_BP_ExplosionGruntGrenade
// 0x0068 (0x0068 - 0x0000)
struct BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_epicenter;                            // 0x0004(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_radius;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_attached_to_surface;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_surface_normal;                       // 0x0018(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_incoming_direction;                   // 0x0024(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_friendly;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_duration;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInZeroGravity_ReturnValue;              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAtLocation_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayPortalledEventInWorld_playback_instance; // 0x0050(0x0010)()
	bool                                          CallFunc_PlayPortalledEventInWorld_play_success;   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_fuse_time;                            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade) == 0x000008, "Wrong alignment on BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade");
static_assert(sizeof(BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade) == 0x000068, "Wrong size on BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade");
static_assert(offsetof(BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade, EntryPoint) == 0x000000, "Member 'BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade, K2Node_Event_epicenter) == 0x000004, "Member 'BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade::K2Node_Event_epicenter' has a wrong offset!");
static_assert(offsetof(BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade, K2Node_Event_radius) == 0x000010, "Member 'BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade::K2Node_Event_radius' has a wrong offset!");
static_assert(offsetof(BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade, K2Node_Event_attached_to_surface) == 0x000014, "Member 'BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade::K2Node_Event_attached_to_surface' has a wrong offset!");
static_assert(offsetof(BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade, K2Node_Event_surface_normal) == 0x000018, "Member 'BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade::K2Node_Event_surface_normal' has a wrong offset!");
static_assert(offsetof(BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade, K2Node_Event_incoming_direction) == 0x000024, "Member 'BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade::K2Node_Event_incoming_direction' has a wrong offset!");
static_assert(offsetof(BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade, K2Node_Event_friendly) == 0x000030, "Member 'BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade::K2Node_Event_friendly' has a wrong offset!");
static_assert(offsetof(BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade, K2Node_Event_duration) == 0x000034, "Member 'BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade::K2Node_Event_duration' has a wrong offset!");
static_assert(offsetof(BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade, CallFunc_MakeRotFromZ_ReturnValue) == 0x000038, "Member 'BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade::CallFunc_MakeRotFromZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade, CallFunc_IsInZeroGravity_ReturnValue) == 0x000044, "Member 'BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade::CallFunc_IsInZeroGravity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade, CallFunc_SpawnCANiagaraSystemAtLocation_ReturnValue) == 0x000048, "Member 'BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade::CallFunc_SpawnCANiagaraSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade, CallFunc_PlayPortalledEventInWorld_playback_instance) == 0x000050, "Member 'BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade::CallFunc_PlayPortalledEventInWorld_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade, CallFunc_PlayPortalledEventInWorld_play_success) == 0x000060, "Member 'BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade::CallFunc_PlayPortalledEventInWorld_play_success' has a wrong offset!");
static_assert(offsetof(BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade, K2Node_Event_fuse_time) == 0x000064, "Member 'BP_ExplosionGruntGrenade_C_ExecuteUbergraph_BP_ExplosionGruntGrenade::K2Node_Event_fuse_time' has a wrong offset!");

// Function BP_ExplosionGruntGrenade.BP_ExplosionGruntGrenade_C.PreloadExplosionVFX
// 0x0004 (0x0004 - 0x0000)
struct BP_ExplosionGruntGrenade_C_PreloadExplosionVFX final
{
public:
	float                                         Fuse_time;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExplosionGruntGrenade_C_PreloadExplosionVFX) == 0x000004, "Wrong alignment on BP_ExplosionGruntGrenade_C_PreloadExplosionVFX");
static_assert(sizeof(BP_ExplosionGruntGrenade_C_PreloadExplosionVFX) == 0x000004, "Wrong size on BP_ExplosionGruntGrenade_C_PreloadExplosionVFX");
static_assert(offsetof(BP_ExplosionGruntGrenade_C_PreloadExplosionVFX, Fuse_time) == 0x000000, "Member 'BP_ExplosionGruntGrenade_C_PreloadExplosionVFX::Fuse_time' has a wrong offset!");

// Function BP_ExplosionGruntGrenade.BP_ExplosionGruntGrenade_C.OnTrigger
// 0x0034 (0x0034 - 0x0000)
struct BP_ExplosionGruntGrenade_C_OnTrigger final
{
public:
	struct FVector                                Epicenter_0;                                       // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius_0;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Attached_to_surface;                               // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Surface_normal;                                    // 0x0014(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Incoming_direction;                                // 0x0020(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Friendly;                                          // 0x002C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Duration;                                          // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExplosionGruntGrenade_C_OnTrigger) == 0x000004, "Wrong alignment on BP_ExplosionGruntGrenade_C_OnTrigger");
static_assert(sizeof(BP_ExplosionGruntGrenade_C_OnTrigger) == 0x000034, "Wrong size on BP_ExplosionGruntGrenade_C_OnTrigger");
static_assert(offsetof(BP_ExplosionGruntGrenade_C_OnTrigger, Epicenter_0) == 0x000000, "Member 'BP_ExplosionGruntGrenade_C_OnTrigger::Epicenter_0' has a wrong offset!");
static_assert(offsetof(BP_ExplosionGruntGrenade_C_OnTrigger, Radius_0) == 0x00000C, "Member 'BP_ExplosionGruntGrenade_C_OnTrigger::Radius_0' has a wrong offset!");
static_assert(offsetof(BP_ExplosionGruntGrenade_C_OnTrigger, Attached_to_surface) == 0x000010, "Member 'BP_ExplosionGruntGrenade_C_OnTrigger::Attached_to_surface' has a wrong offset!");
static_assert(offsetof(BP_ExplosionGruntGrenade_C_OnTrigger, Surface_normal) == 0x000014, "Member 'BP_ExplosionGruntGrenade_C_OnTrigger::Surface_normal' has a wrong offset!");
static_assert(offsetof(BP_ExplosionGruntGrenade_C_OnTrigger, Incoming_direction) == 0x000020, "Member 'BP_ExplosionGruntGrenade_C_OnTrigger::Incoming_direction' has a wrong offset!");
static_assert(offsetof(BP_ExplosionGruntGrenade_C_OnTrigger, Friendly) == 0x00002C, "Member 'BP_ExplosionGruntGrenade_C_OnTrigger::Friendly' has a wrong offset!");
static_assert(offsetof(BP_ExplosionGruntGrenade_C_OnTrigger, Duration) == 0x000030, "Member 'BP_ExplosionGruntGrenade_C_OnTrigger::Duration' has a wrong offset!");

}

