#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnemyRevealEventManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Keaton_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EnemyRevealEventManager.BP_EnemyRevealEventManager_C
// 0x0018 (0x0270 - 0x0258)
class ABP_EnemyRevealEventManager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         EventLifetime;                                     // 0x0268(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCATeamID                              ActivatingTeam;                                    // 0x026C(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_EnemyRevealEventManager(int32 EntryPoint);
	void StartRevealEvent(float EventLifetime_0);
	void EventOver();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void SetInformationRevealForTeams(ECAInformationControlLevel IntelLevel, bool Ended_);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EnemyRevealEventManager_C">();
	}
	static class ABP_EnemyRevealEventManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EnemyRevealEventManager_C>();
	}
};
static_assert(alignof(ABP_EnemyRevealEventManager_C) == 0x000008, "Wrong alignment on ABP_EnemyRevealEventManager_C");
static_assert(sizeof(ABP_EnemyRevealEventManager_C) == 0x000270, "Wrong size on ABP_EnemyRevealEventManager_C");
static_assert(offsetof(ABP_EnemyRevealEventManager_C, UberGraphFrame) == 0x000258, "Member 'ABP_EnemyRevealEventManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EnemyRevealEventManager_C, DefaultSceneRoot) == 0x000260, "Member 'ABP_EnemyRevealEventManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_EnemyRevealEventManager_C, EventLifetime) == 0x000268, "Member 'ABP_EnemyRevealEventManager_C::EventLifetime' has a wrong offset!");
static_assert(offsetof(ABP_EnemyRevealEventManager_C, ActivatingTeam) == 0x00026C, "Member 'ABP_EnemyRevealEventManager_C::ActivatingTeam' has a wrong offset!");

}

