#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ElectricalArcEffect_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ElectricalArcEffect_Base.BP_ElectricalArcEffect_Base_C
// 0x0028 (0x0280 - 0x0258)
class ABP_ElectricalArcEffect_Base_C final : public ACAElectricalArcEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SourceLocation;                                    // 0x0268(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation;                                    // 0x0274(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ElectricalArcEffect_Base(int32 EntryPoint);
	void OnTrigger(class AActor* Arc_source_actor, class AActor* Arc_target_actor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ElectricalArcEffect_Base_C">();
	}
	static class ABP_ElectricalArcEffect_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ElectricalArcEffect_Base_C>();
	}
};
static_assert(alignof(ABP_ElectricalArcEffect_Base_C) == 0x000008, "Wrong alignment on ABP_ElectricalArcEffect_Base_C");
static_assert(sizeof(ABP_ElectricalArcEffect_Base_C) == 0x000280, "Wrong size on ABP_ElectricalArcEffect_Base_C");
static_assert(offsetof(ABP_ElectricalArcEffect_Base_C, UberGraphFrame) == 0x000258, "Member 'ABP_ElectricalArcEffect_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ElectricalArcEffect_Base_C, DefaultSceneRoot) == 0x000260, "Member 'ABP_ElectricalArcEffect_Base_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ElectricalArcEffect_Base_C, SourceLocation) == 0x000268, "Member 'ABP_ElectricalArcEffect_Base_C::SourceLocation' has a wrong offset!");
static_assert(offsetof(ABP_ElectricalArcEffect_Base_C, TargetLocation) == 0x000274, "Member 'ABP_ElectricalArcEffect_Base_C::TargetLocation' has a wrong offset!");

}

