#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnvQueryTest_TimeSinceJobUsed

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_EnvQueryTest_TimeSinceJobUsed.BP_EnvQueryTest_TimeSinceJobUsed_C.ScoreItemActor
// 0x0030 (0x0030 - 0x0000)
struct BP_EnvQueryTest_TimeSinceJobUsed_C_ScoreItemActor final
{
public:
	TArray<class AActor*>                         Item_actors;                                       // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Item_actor_index;                                  // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAJob*                                 K2Node_DynamicCast_AsCAJob;                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeJobLastClaimed_ReturnValue;        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvQueryTest_TimeSinceJobUsed_C_ScoreItemActor) == 0x000008, "Wrong alignment on BP_EnvQueryTest_TimeSinceJobUsed_C_ScoreItemActor");
static_assert(sizeof(BP_EnvQueryTest_TimeSinceJobUsed_C_ScoreItemActor) == 0x000030, "Wrong size on BP_EnvQueryTest_TimeSinceJobUsed_C_ScoreItemActor");
static_assert(offsetof(BP_EnvQueryTest_TimeSinceJobUsed_C_ScoreItemActor, Item_actors) == 0x000000, "Member 'BP_EnvQueryTest_TimeSinceJobUsed_C_ScoreItemActor::Item_actors' has a wrong offset!");
static_assert(offsetof(BP_EnvQueryTest_TimeSinceJobUsed_C_ScoreItemActor, Item_actor_index) == 0x000010, "Member 'BP_EnvQueryTest_TimeSinceJobUsed_C_ScoreItemActor::Item_actor_index' has a wrong offset!");
static_assert(offsetof(BP_EnvQueryTest_TimeSinceJobUsed_C_ScoreItemActor, ReturnValue) == 0x000014, "Member 'BP_EnvQueryTest_TimeSinceJobUsed_C_ScoreItemActor::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvQueryTest_TimeSinceJobUsed_C_ScoreItemActor, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_EnvQueryTest_TimeSinceJobUsed_C_ScoreItemActor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EnvQueryTest_TimeSinceJobUsed_C_ScoreItemActor, K2Node_DynamicCast_AsCAJob) == 0x000020, "Member 'BP_EnvQueryTest_TimeSinceJobUsed_C_ScoreItemActor::K2Node_DynamicCast_AsCAJob' has a wrong offset!");
static_assert(offsetof(BP_EnvQueryTest_TimeSinceJobUsed_C_ScoreItemActor, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_EnvQueryTest_TimeSinceJobUsed_C_ScoreItemActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EnvQueryTest_TimeSinceJobUsed_C_ScoreItemActor, CallFunc_GetTimeJobLastClaimed_ReturnValue) == 0x00002C, "Member 'BP_EnvQueryTest_TimeSinceJobUsed_C_ScoreItemActor::CallFunc_GetTimeJobLastClaimed_ReturnValue' has a wrong offset!");

}

