#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FE_TextChatWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_FE_TextChatWidget.BP_FE_TextChatWidget_C.ExecuteUbergraph_BP_FE_TextChatWidget
// 0x0038 (0x0038 - 0x0000)
struct BP_FE_TextChatWidget_C_ExecuteUbergraph_BP_FE_TextChatWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_FE_TextChatWidget_C*                K2Node_CustomEvent_BP_FE_TextChatWidget_C_4;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_is_visible;                           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        CallFunc_GetListItems_ReturnValue;                 // 0x0018(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FE_TextChatWidget_C_ExecuteUbergraph_BP_FE_TextChatWidget) == 0x000008, "Wrong alignment on BP_FE_TextChatWidget_C_ExecuteUbergraph_BP_FE_TextChatWidget");
static_assert(sizeof(BP_FE_TextChatWidget_C_ExecuteUbergraph_BP_FE_TextChatWidget) == 0x000038, "Wrong size on BP_FE_TextChatWidget_C_ExecuteUbergraph_BP_FE_TextChatWidget");
static_assert(offsetof(BP_FE_TextChatWidget_C_ExecuteUbergraph_BP_FE_TextChatWidget, EntryPoint) == 0x000000, "Member 'BP_FE_TextChatWidget_C_ExecuteUbergraph_BP_FE_TextChatWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FE_TextChatWidget_C_ExecuteUbergraph_BP_FE_TextChatWidget, K2Node_CustomEvent_BP_FE_TextChatWidget_C_4) == 0x000008, "Member 'BP_FE_TextChatWidget_C_ExecuteUbergraph_BP_FE_TextChatWidget::K2Node_CustomEvent_BP_FE_TextChatWidget_C_4' has a wrong offset!");
static_assert(offsetof(BP_FE_TextChatWidget_C_ExecuteUbergraph_BP_FE_TextChatWidget, K2Node_Event_is_visible) == 0x000010, "Member 'BP_FE_TextChatWidget_C_ExecuteUbergraph_BP_FE_TextChatWidget::K2Node_Event_is_visible' has a wrong offset!");
static_assert(offsetof(BP_FE_TextChatWidget_C_ExecuteUbergraph_BP_FE_TextChatWidget, CallFunc_GetListItems_ReturnValue) == 0x000018, "Member 'BP_FE_TextChatWidget_C_ExecuteUbergraph_BP_FE_TextChatWidget::CallFunc_GetListItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FE_TextChatWidget_C_ExecuteUbergraph_BP_FE_TextChatWidget, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_FE_TextChatWidget_C_ExecuteUbergraph_BP_FE_TextChatWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FE_TextChatWidget_C_ExecuteUbergraph_BP_FE_TextChatWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'BP_FE_TextChatWidget_C_ExecuteUbergraph_BP_FE_TextChatWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FE_TextChatWidget_C_ExecuteUbergraph_BP_FE_TextChatWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'BP_FE_TextChatWidget_C_ExecuteUbergraph_BP_FE_TextChatWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BP_FE_TextChatWidget.BP_FE_TextChatWidget_C.OnVisibilitySet
// 0x0001 (0x0001 - 0x0000)
struct BP_FE_TextChatWidget_C_OnVisibilitySet final
{
public:
	bool                                          Is_visible;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FE_TextChatWidget_C_OnVisibilitySet) == 0x000001, "Wrong alignment on BP_FE_TextChatWidget_C_OnVisibilitySet");
static_assert(sizeof(BP_FE_TextChatWidget_C_OnVisibilitySet) == 0x000001, "Wrong size on BP_FE_TextChatWidget_C_OnVisibilitySet");
static_assert(offsetof(BP_FE_TextChatWidget_C_OnVisibilitySet, Is_visible) == 0x000000, "Member 'BP_FE_TextChatWidget_C_OnVisibilitySet::Is_visible' has a wrong offset!");

// Function BP_FE_TextChatWidget.BP_FE_TextChatWidget_C.BP_FE_TextChatWidget_C_4_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BP_FE_TextChatWidget_C_BP_FE_TextChatWidget_C_4_Event_0 final
{
public:
	class UBP_FE_TextChatWidget_C*                BP_FE_TextChatWidget_C_4;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FE_TextChatWidget_C_BP_FE_TextChatWidget_C_4_Event_0) == 0x000008, "Wrong alignment on BP_FE_TextChatWidget_C_BP_FE_TextChatWidget_C_4_Event_0");
static_assert(sizeof(BP_FE_TextChatWidget_C_BP_FE_TextChatWidget_C_4_Event_0) == 0x000008, "Wrong size on BP_FE_TextChatWidget_C_BP_FE_TextChatWidget_C_4_Event_0");
static_assert(offsetof(BP_FE_TextChatWidget_C_BP_FE_TextChatWidget_C_4_Event_0, BP_FE_TextChatWidget_C_4) == 0x000000, "Member 'BP_FE_TextChatWidget_C_BP_FE_TextChatWidget_C_4_Event_0::BP_FE_TextChatWidget_C_4' has a wrong offset!");

// Function BP_FE_TextChatWidget.BP_FE_TextChatWidget_C.SequenceEvent__ENTRYPOINTBP_FE_TextChatWidget_0
// 0x0008 (0x0008 - 0x0000)
struct BP_FE_TextChatWidget_C_SequenceEvent__ENTRYPOINTBP_FE_TextChatWidget_0 final
{
public:
	class UBP_FE_TextChatWidget_C*                BP_FE_TextChatWidget_C_4;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FE_TextChatWidget_C_SequenceEvent__ENTRYPOINTBP_FE_TextChatWidget_0) == 0x000008, "Wrong alignment on BP_FE_TextChatWidget_C_SequenceEvent__ENTRYPOINTBP_FE_TextChatWidget_0");
static_assert(sizeof(BP_FE_TextChatWidget_C_SequenceEvent__ENTRYPOINTBP_FE_TextChatWidget_0) == 0x000008, "Wrong size on BP_FE_TextChatWidget_C_SequenceEvent__ENTRYPOINTBP_FE_TextChatWidget_0");
static_assert(offsetof(BP_FE_TextChatWidget_C_SequenceEvent__ENTRYPOINTBP_FE_TextChatWidget_0, BP_FE_TextChatWidget_C_4) == 0x000000, "Member 'BP_FE_TextChatWidget_C_SequenceEvent__ENTRYPOINTBP_FE_TextChatWidget_0::BP_FE_TextChatWidget_C_4' has a wrong offset!");

}

