#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Frontend_HeroLootIsolated

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Frontend_HeroLootIsolated.BP_Frontend_HeroLootIsolated_C
// 0x0020 (0x0278 - 0x0258)
class ABP_Frontend_HeroLootIsolated_C final : public AActor
{
public:
	class UStaticMeshComponent*                   EditorOnlyStaticMesh;                              // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCAFrontendHeroLootEventHandler*        CAFrontendHeroLootEventHandler;                    // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Frontend_HeroLootIsolated_C">();
	}
	static class ABP_Frontend_HeroLootIsolated_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Frontend_HeroLootIsolated_C>();
	}
};
static_assert(alignof(ABP_Frontend_HeroLootIsolated_C) == 0x000008, "Wrong alignment on ABP_Frontend_HeroLootIsolated_C");
static_assert(sizeof(ABP_Frontend_HeroLootIsolated_C) == 0x000278, "Wrong size on ABP_Frontend_HeroLootIsolated_C");
static_assert(offsetof(ABP_Frontend_HeroLootIsolated_C, EditorOnlyStaticMesh) == 0x000258, "Member 'ABP_Frontend_HeroLootIsolated_C::EditorOnlyStaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_HeroLootIsolated_C, CAFrontendHeroLootEventHandler) == 0x000260, "Member 'ABP_Frontend_HeroLootIsolated_C::CAFrontendHeroLootEventHandler' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_HeroLootIsolated_C, StaticMesh) == 0x000268, "Member 'ABP_Frontend_HeroLootIsolated_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_HeroLootIsolated_C, DefaultSceneRoot) == 0x000270, "Member 'ABP_Frontend_HeroLootIsolated_C::DefaultSceneRoot' has a wrong offset!");

}

