#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FoamInstancedMeshComponent

#include "Basic.hpp"

#include "CAAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_FoamInstancedMeshComponent.BP_FoamInstancedMeshComponent_C.ExecuteUbergraph_BP_FoamInstancedMeshComponent
// 0x0050 (0x0050 - 0x0000)
struct BP_FoamInstancedMeshComponent_C_ExecuteUbergraph_BP_FoamInstancedMeshComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_Location_1;                           // 0x0008(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Location;                             // 0x0014(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayPortalledEventInWorld_playback_instance; // 0x0020(0x0010)()
	bool                                          CallFunc_PlayPortalledEventInWorld_play_success;   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayPortalledEventInWorld_playback_instance_1; // 0x0038(0x0010)()
	bool                                          CallFunc_PlayPortalledEventInWorld_play_success_1; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FoamInstancedMeshComponent_C_ExecuteUbergraph_BP_FoamInstancedMeshComponent) == 0x000008, "Wrong alignment on BP_FoamInstancedMeshComponent_C_ExecuteUbergraph_BP_FoamInstancedMeshComponent");
static_assert(sizeof(BP_FoamInstancedMeshComponent_C_ExecuteUbergraph_BP_FoamInstancedMeshComponent) == 0x000050, "Wrong size on BP_FoamInstancedMeshComponent_C_ExecuteUbergraph_BP_FoamInstancedMeshComponent");
static_assert(offsetof(BP_FoamInstancedMeshComponent_C_ExecuteUbergraph_BP_FoamInstancedMeshComponent, EntryPoint) == 0x000000, "Member 'BP_FoamInstancedMeshComponent_C_ExecuteUbergraph_BP_FoamInstancedMeshComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FoamInstancedMeshComponent_C_ExecuteUbergraph_BP_FoamInstancedMeshComponent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'BP_FoamInstancedMeshComponent_C_ExecuteUbergraph_BP_FoamInstancedMeshComponent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoamInstancedMeshComponent_C_ExecuteUbergraph_BP_FoamInstancedMeshComponent, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000005, "Member 'BP_FoamInstancedMeshComponent_C_ExecuteUbergraph_BP_FoamInstancedMeshComponent::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FoamInstancedMeshComponent_C_ExecuteUbergraph_BP_FoamInstancedMeshComponent, K2Node_Event_Location_1) == 0x000008, "Member 'BP_FoamInstancedMeshComponent_C_ExecuteUbergraph_BP_FoamInstancedMeshComponent::K2Node_Event_Location_1' has a wrong offset!");
static_assert(offsetof(BP_FoamInstancedMeshComponent_C_ExecuteUbergraph_BP_FoamInstancedMeshComponent, K2Node_Event_Location) == 0x000014, "Member 'BP_FoamInstancedMeshComponent_C_ExecuteUbergraph_BP_FoamInstancedMeshComponent::K2Node_Event_Location' has a wrong offset!");
static_assert(offsetof(BP_FoamInstancedMeshComponent_C_ExecuteUbergraph_BP_FoamInstancedMeshComponent, CallFunc_PlayPortalledEventInWorld_playback_instance) == 0x000020, "Member 'BP_FoamInstancedMeshComponent_C_ExecuteUbergraph_BP_FoamInstancedMeshComponent::CallFunc_PlayPortalledEventInWorld_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_FoamInstancedMeshComponent_C_ExecuteUbergraph_BP_FoamInstancedMeshComponent, CallFunc_PlayPortalledEventInWorld_play_success) == 0x000030, "Member 'BP_FoamInstancedMeshComponent_C_ExecuteUbergraph_BP_FoamInstancedMeshComponent::CallFunc_PlayPortalledEventInWorld_play_success' has a wrong offset!");
static_assert(offsetof(BP_FoamInstancedMeshComponent_C_ExecuteUbergraph_BP_FoamInstancedMeshComponent, CallFunc_PlayPortalledEventInWorld_playback_instance_1) == 0x000038, "Member 'BP_FoamInstancedMeshComponent_C_ExecuteUbergraph_BP_FoamInstancedMeshComponent::CallFunc_PlayPortalledEventInWorld_playback_instance_1' has a wrong offset!");
static_assert(offsetof(BP_FoamInstancedMeshComponent_C_ExecuteUbergraph_BP_FoamInstancedMeshComponent, CallFunc_PlayPortalledEventInWorld_play_success_1) == 0x000048, "Member 'BP_FoamInstancedMeshComponent_C_ExecuteUbergraph_BP_FoamInstancedMeshComponent::CallFunc_PlayPortalledEventInWorld_play_success_1' has a wrong offset!");

// Function BP_FoamInstancedMeshComponent.BP_FoamInstancedMeshComponent_C.OnFoamForming
// 0x000C (0x000C - 0x0000)
struct BP_FoamInstancedMeshComponent_C_OnFoamForming final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FoamInstancedMeshComponent_C_OnFoamForming) == 0x000004, "Wrong alignment on BP_FoamInstancedMeshComponent_C_OnFoamForming");
static_assert(sizeof(BP_FoamInstancedMeshComponent_C_OnFoamForming) == 0x00000C, "Wrong size on BP_FoamInstancedMeshComponent_C_OnFoamForming");
static_assert(offsetof(BP_FoamInstancedMeshComponent_C_OnFoamForming, Location) == 0x000000, "Member 'BP_FoamInstancedMeshComponent_C_OnFoamForming::Location' has a wrong offset!");

// Function BP_FoamInstancedMeshComponent.BP_FoamInstancedMeshComponent_C.OnFoamDestroyed
// 0x000C (0x000C - 0x0000)
struct BP_FoamInstancedMeshComponent_C_OnFoamDestroyed final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FoamInstancedMeshComponent_C_OnFoamDestroyed) == 0x000004, "Wrong alignment on BP_FoamInstancedMeshComponent_C_OnFoamDestroyed");
static_assert(sizeof(BP_FoamInstancedMeshComponent_C_OnFoamDestroyed) == 0x00000C, "Wrong size on BP_FoamInstancedMeshComponent_C_OnFoamDestroyed");
static_assert(offsetof(BP_FoamInstancedMeshComponent_C_OnFoamDestroyed, Location) == 0x000000, "Member 'BP_FoamInstancedMeshComponent_C_OnFoamDestroyed::Location' has a wrong offset!");

}

