#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FE_TextChatWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_FE_TextChatWidget.BP_FE_TextChatWidget_C
// 0x0030 (0x0318 - 0x02E8)
class UBP_FE_TextChatWidget_C final : public UCAFrontendTextChatWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               BorderCont;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_input_box_background;                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       Invalidation_box;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_228;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FE_TextChatWidget(int32 EntryPoint);
	void OnVisibilitySet(bool Is_visible);
	void ShowAll();
	void ShowHistoryOnly();
	void BP_FE_TextChatWidget_C_4_Event_0(class UBP_FE_TextChatWidget_C* BP_FE_TextChatWidget_C_4);
	void SequenceEvent__ENTRYPOINTBP_FE_TextChatWidget_0(class UBP_FE_TextChatWidget_C* BP_FE_TextChatWidget_C_4);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FE_TextChatWidget_C">();
	}
	static class UBP_FE_TextChatWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FE_TextChatWidget_C>();
	}
};
static_assert(alignof(UBP_FE_TextChatWidget_C) == 0x000008, "Wrong alignment on UBP_FE_TextChatWidget_C");
static_assert(sizeof(UBP_FE_TextChatWidget_C) == 0x000318, "Wrong size on UBP_FE_TextChatWidget_C");
static_assert(offsetof(UBP_FE_TextChatWidget_C, UberGraphFrame) == 0x0002E8, "Member 'UBP_FE_TextChatWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_FE_TextChatWidget_C, FadeOut) == 0x0002F0, "Member 'UBP_FE_TextChatWidget_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UBP_FE_TextChatWidget_C, BorderCont) == 0x0002F8, "Member 'UBP_FE_TextChatWidget_C::BorderCont' has a wrong offset!");
static_assert(offsetof(UBP_FE_TextChatWidget_C, Img_input_box_background) == 0x000300, "Member 'UBP_FE_TextChatWidget_C::Img_input_box_background' has a wrong offset!");
static_assert(offsetof(UBP_FE_TextChatWidget_C, Invalidation_box) == 0x000308, "Member 'UBP_FE_TextChatWidget_C::Invalidation_box' has a wrong offset!");
static_assert(offsetof(UBP_FE_TextChatWidget_C, Overlay_228) == 0x000310, "Member 'UBP_FE_TextChatWidget_C::Overlay_228' has a wrong offset!");

}

