#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Foam

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Foam.BP_Foam_C.ExecuteUbergraph_BP_Foam
// 0x0050 (0x0050 - 0x0000)
struct BP_Foam_C_ExecuteUbergraph_BP_Foam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_overlaps;            // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAFoamQueryBox*                        K2Node_DynamicCast_AsCAFoam_Query_Box;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Foam_C_ExecuteUbergraph_BP_Foam) == 0x000008, "Wrong alignment on BP_Foam_C_ExecuteUbergraph_BP_Foam");
static_assert(sizeof(BP_Foam_C_ExecuteUbergraph_BP_Foam) == 0x000050, "Wrong size on BP_Foam_C_ExecuteUbergraph_BP_Foam");
static_assert(offsetof(BP_Foam_C_ExecuteUbergraph_BP_Foam, EntryPoint) == 0x000000, "Member 'BP_Foam_C_ExecuteUbergraph_BP_Foam::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Foam_C_ExecuteUbergraph_BP_Foam, Temp_bool_True_if_break_was_hit_Variable) == 0x000004, "Member 'BP_Foam_C_ExecuteUbergraph_BP_Foam::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_Foam_C_ExecuteUbergraph_BP_Foam, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_Foam_C_ExecuteUbergraph_BP_Foam::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Foam_C_ExecuteUbergraph_BP_Foam, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'BP_Foam_C_ExecuteUbergraph_BP_Foam::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Foam_C_ExecuteUbergraph_BP_Foam, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_Foam_C_ExecuteUbergraph_BP_Foam::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Foam_C_ExecuteUbergraph_BP_Foam, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_Foam_C_ExecuteUbergraph_BP_Foam::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Foam_C_ExecuteUbergraph_BP_Foam, CallFunc_GetOverlappingActors_overlaps) == 0x000018, "Member 'BP_Foam_C_ExecuteUbergraph_BP_Foam::CallFunc_GetOverlappingActors_overlaps' has a wrong offset!");
static_assert(offsetof(BP_Foam_C_ExecuteUbergraph_BP_Foam, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_Foam_C_ExecuteUbergraph_BP_Foam::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Foam_C_ExecuteUbergraph_BP_Foam, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_Foam_C_ExecuteUbergraph_BP_Foam::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Foam_C_ExecuteUbergraph_BP_Foam, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_Foam_C_ExecuteUbergraph_BP_Foam::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Foam_C_ExecuteUbergraph_BP_Foam, K2Node_DynamicCast_AsCAFoam_Query_Box) == 0x000040, "Member 'BP_Foam_C_ExecuteUbergraph_BP_Foam::K2Node_DynamicCast_AsCAFoam_Query_Box' has a wrong offset!");
static_assert(offsetof(BP_Foam_C_ExecuteUbergraph_BP_Foam, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_Foam_C_ExecuteUbergraph_BP_Foam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Foam_C_ExecuteUbergraph_BP_Foam, CallFunc_BooleanAND_ReturnValue) == 0x000049, "Member 'BP_Foam_C_ExecuteUbergraph_BP_Foam::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

