#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FoamCharacterComponent

#include "Basic.hpp"

#include "CAAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_FoamCharacterComponent.BP_FoamCharacterComponent_C.ExecuteUbergraph_BP_FoamCharacterComponent
// 0x00C0 (0x00C0 - 0x0000)
struct BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0004(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0028(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Event_Location_1;                           // 0x0048(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Scale_1;                              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Location;                             // 0x0058(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Scale;                                // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZeroGravity_ReturnValue;              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAtLocation_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAtLocation_ReturnValue_1; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x0094(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x00A8(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent) == 0x000008, "Wrong alignment on BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent");
static_assert(sizeof(BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent) == 0x0000C0, "Wrong size on BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent");
static_assert(offsetof(BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent, EntryPoint) == 0x000000, "Member 'BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent, Temp_delegate_Variable) == 0x000004, "Member 'BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000018, "Member 'BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent, CallFunc_PlayEvent_playback_instance) == 0x000028, "Member 'BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent, CallFunc_PlayEvent_play_success) == 0x000038, "Member 'BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x00003C, "Member 'BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent, K2Node_Event_Location_1) == 0x000048, "Member 'BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent::K2Node_Event_Location_1' has a wrong offset!");
static_assert(offsetof(BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent, K2Node_Event_Scale_1) == 0x000054, "Member 'BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent::K2Node_Event_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent, K2Node_Event_Location) == 0x000058, "Member 'BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent::K2Node_Event_Location' has a wrong offset!");
static_assert(offsetof(BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent, K2Node_Event_Scale) == 0x000064, "Member 'BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent::K2Node_Event_Scale' has a wrong offset!");
static_assert(offsetof(BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent, CallFunc_IsInZeroGravity_ReturnValue) == 0x000068, "Member 'BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent::CallFunc_IsInZeroGravity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent, CallFunc_SpawnCANiagaraSystemAtLocation_ReturnValue) == 0x000070, "Member 'BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent::CallFunc_SpawnCANiagaraSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent, CallFunc_K2_GetComponentRotation_ReturnValue_1) == 0x000078, "Member 'BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent::CallFunc_K2_GetComponentRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent, CallFunc_SpawnCANiagaraSystemAtLocation_ReturnValue_1) == 0x000088, "Member 'BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent::CallFunc_SpawnCANiagaraSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000090, "Member 'BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent, Temp_delegate_Variable_1) == 0x000094, "Member 'BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent, CallFunc_PlayEvent_playback_instance_1) == 0x0000A8, "Member 'BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent, CallFunc_PlayEvent_play_success_1) == 0x0000B8, "Member 'BP_FoamCharacterComponent_C_ExecuteUbergraph_BP_FoamCharacterComponent::CallFunc_PlayEvent_play_success_1' has a wrong offset!");

// Function BP_FoamCharacterComponent.BP_FoamCharacterComponent_C.OnFoamForming
// 0x0010 (0x0010 - 0x0000)
struct BP_FoamCharacterComponent_C_OnFoamForming final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Scale;                                             // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FoamCharacterComponent_C_OnFoamForming) == 0x000004, "Wrong alignment on BP_FoamCharacterComponent_C_OnFoamForming");
static_assert(sizeof(BP_FoamCharacterComponent_C_OnFoamForming) == 0x000010, "Wrong size on BP_FoamCharacterComponent_C_OnFoamForming");
static_assert(offsetof(BP_FoamCharacterComponent_C_OnFoamForming, Location) == 0x000000, "Member 'BP_FoamCharacterComponent_C_OnFoamForming::Location' has a wrong offset!");
static_assert(offsetof(BP_FoamCharacterComponent_C_OnFoamForming, Scale) == 0x00000C, "Member 'BP_FoamCharacterComponent_C_OnFoamForming::Scale' has a wrong offset!");

// Function BP_FoamCharacterComponent.BP_FoamCharacterComponent_C.OnFoamDestroyed
// 0x0010 (0x0010 - 0x0000)
struct BP_FoamCharacterComponent_C_OnFoamDestroyed final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Scale;                                             // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FoamCharacterComponent_C_OnFoamDestroyed) == 0x000004, "Wrong alignment on BP_FoamCharacterComponent_C_OnFoamDestroyed");
static_assert(sizeof(BP_FoamCharacterComponent_C_OnFoamDestroyed) == 0x000010, "Wrong size on BP_FoamCharacterComponent_C_OnFoamDestroyed");
static_assert(offsetof(BP_FoamCharacterComponent_C_OnFoamDestroyed, Location) == 0x000000, "Member 'BP_FoamCharacterComponent_C_OnFoamDestroyed::Location' has a wrong offset!");
static_assert(offsetof(BP_FoamCharacterComponent_C_OnFoamDestroyed, Scale) == 0x00000C, "Member 'BP_FoamCharacterComponent_C_OnFoamDestroyed::Scale' has a wrong offset!");

}

