#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Foam_Explosion_Grenade

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Foam_Explosion_Grenade.BP_Foam_Explosion_Grenade_C.ExecuteUbergraph_BP_Foam_Explosion_Grenade
// 0x00A0 (0x00A0 - 0x0000)
struct BP_Foam_Explosion_Grenade_C_ExecuteUbergraph_BP_Foam_Explosion_Grenade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Foam_Explosion_Grenade_C_ExecuteUbergraph_BP_Foam_Explosion_Grenade) == 0x000010, "Wrong alignment on BP_Foam_Explosion_Grenade_C_ExecuteUbergraph_BP_Foam_Explosion_Grenade");
static_assert(sizeof(BP_Foam_Explosion_Grenade_C_ExecuteUbergraph_BP_Foam_Explosion_Grenade) == 0x0000A0, "Wrong size on BP_Foam_Explosion_Grenade_C_ExecuteUbergraph_BP_Foam_Explosion_Grenade");
static_assert(offsetof(BP_Foam_Explosion_Grenade_C_ExecuteUbergraph_BP_Foam_Explosion_Grenade, EntryPoint) == 0x000000, "Member 'BP_Foam_Explosion_Grenade_C_ExecuteUbergraph_BP_Foam_Explosion_Grenade::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Foam_Explosion_Grenade_C_ExecuteUbergraph_BP_Foam_Explosion_Grenade, CallFunc_GetActorForwardVector_ReturnValue) == 0x000004, "Member 'BP_Foam_Explosion_Grenade_C_ExecuteUbergraph_BP_Foam_Explosion_Grenade::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Foam_Explosion_Grenade_C_ExecuteUbergraph_BP_Foam_Explosion_Grenade, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_Foam_Explosion_Grenade_C_ExecuteUbergraph_BP_Foam_Explosion_Grenade::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Foam_Explosion_Grenade_C_ExecuteUbergraph_BP_Foam_Explosion_Grenade, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'BP_Foam_Explosion_Grenade_C_ExecuteUbergraph_BP_Foam_Explosion_Grenade::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Foam_Explosion_Grenade_C_ExecuteUbergraph_BP_Foam_Explosion_Grenade, CallFunc_BreakTransform_Location) == 0x000050, "Member 'BP_Foam_Explosion_Grenade_C_ExecuteUbergraph_BP_Foam_Explosion_Grenade::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_Foam_Explosion_Grenade_C_ExecuteUbergraph_BP_Foam_Explosion_Grenade, CallFunc_BreakTransform_Rotation) == 0x00005C, "Member 'BP_Foam_Explosion_Grenade_C_ExecuteUbergraph_BP_Foam_Explosion_Grenade::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_Foam_Explosion_Grenade_C_ExecuteUbergraph_BP_Foam_Explosion_Grenade, CallFunc_BreakTransform_Scale) == 0x000068, "Member 'BP_Foam_Explosion_Grenade_C_ExecuteUbergraph_BP_Foam_Explosion_Grenade::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_Foam_Explosion_Grenade_C_ExecuteUbergraph_BP_Foam_Explosion_Grenade, CallFunc_GetUpVector_ReturnValue) == 0x000074, "Member 'BP_Foam_Explosion_Grenade_C_ExecuteUbergraph_BP_Foam_Explosion_Grenade::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Foam_Explosion_Grenade_C_ExecuteUbergraph_BP_Foam_Explosion_Grenade, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000080, "Member 'BP_Foam_Explosion_Grenade_C_ExecuteUbergraph_BP_Foam_Explosion_Grenade::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Foam_Explosion_Grenade_C_ExecuteUbergraph_BP_Foam_Explosion_Grenade, CallFunc_Add_VectorVector_ReturnValue) == 0x00008C, "Member 'BP_Foam_Explosion_Grenade_C_ExecuteUbergraph_BP_Foam_Explosion_Grenade::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

}

