#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FrontendFigure

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_FrontendFigure.BP_FrontendFigure_C.BndEvt__BP_FrontendWeapon_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_FrontendFigure_C_BndEvt__BP_FrontendWeapon_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature final
{
public:
	class UActorComponent*                        Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FrontendFigure_C_BndEvt__BP_FrontendWeapon_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_FrontendFigure_C_BndEvt__BP_FrontendWeapon_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature");
static_assert(sizeof(BP_FrontendFigure_C_BndEvt__BP_FrontendWeapon_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature) == 0x000010, "Wrong size on BP_FrontendFigure_C_BndEvt__BP_FrontendWeapon_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature");
static_assert(offsetof(BP_FrontendFigure_C_BndEvt__BP_FrontendWeapon_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature, Component) == 0x000000, "Member 'BP_FrontendFigure_C_BndEvt__BP_FrontendWeapon_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature::Component' has a wrong offset!");
static_assert(offsetof(BP_FrontendFigure_C_BndEvt__BP_FrontendWeapon_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature, bReset) == 0x000008, "Member 'BP_FrontendFigure_C_BndEvt__BP_FrontendWeapon_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature::bReset' has a wrong offset!");

// Function BP_FrontendFigure.BP_FrontendFigure_C.ExecuteUbergraph_BP_FrontendFigure
// 0x0028 (0x0028 - 0x0000)
struct BP_FrontendFigure_C_ExecuteUbergraph_BP_FrontendFigure final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        K2Node_ComponentBoundEvent_Component;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bReset;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FrontendWeapon_C*                   K2Node_DynamicCast_AsBP_Frontend_Weapon;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FrontendFigure_C_ExecuteUbergraph_BP_FrontendFigure) == 0x000008, "Wrong alignment on BP_FrontendFigure_C_ExecuteUbergraph_BP_FrontendFigure");
static_assert(sizeof(BP_FrontendFigure_C_ExecuteUbergraph_BP_FrontendFigure) == 0x000028, "Wrong size on BP_FrontendFigure_C_ExecuteUbergraph_BP_FrontendFigure");
static_assert(offsetof(BP_FrontendFigure_C_ExecuteUbergraph_BP_FrontendFigure, EntryPoint) == 0x000000, "Member 'BP_FrontendFigure_C_ExecuteUbergraph_BP_FrontendFigure::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FrontendFigure_C_ExecuteUbergraph_BP_FrontendFigure, K2Node_ComponentBoundEvent_Component) == 0x000008, "Member 'BP_FrontendFigure_C_ExecuteUbergraph_BP_FrontendFigure::K2Node_ComponentBoundEvent_Component' has a wrong offset!");
static_assert(offsetof(BP_FrontendFigure_C_ExecuteUbergraph_BP_FrontendFigure, K2Node_ComponentBoundEvent_bReset) == 0x000010, "Member 'BP_FrontendFigure_C_ExecuteUbergraph_BP_FrontendFigure::K2Node_ComponentBoundEvent_bReset' has a wrong offset!");
static_assert(offsetof(BP_FrontendFigure_C_ExecuteUbergraph_BP_FrontendFigure, K2Node_DynamicCast_AsBP_Frontend_Weapon) == 0x000018, "Member 'BP_FrontendFigure_C_ExecuteUbergraph_BP_FrontendFigure::K2Node_DynamicCast_AsBP_Frontend_Weapon' has a wrong offset!");
static_assert(offsetof(BP_FrontendFigure_C_ExecuteUbergraph_BP_FrontendFigure, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_FrontendFigure_C_ExecuteUbergraph_BP_FrontendFigure::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_FrontendFigure.BP_FrontendFigure_C.GetFigureMesh
// 0x0008 (0x0008 - 0x0000)
struct BP_FrontendFigure_C_GetFigureMesh final
{
public:
	class USkeletalMeshComponent*                 Skeleton;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FrontendFigure_C_GetFigureMesh) == 0x000008, "Wrong alignment on BP_FrontendFigure_C_GetFigureMesh");
static_assert(sizeof(BP_FrontendFigure_C_GetFigureMesh) == 0x000008, "Wrong size on BP_FrontendFigure_C_GetFigureMesh");
static_assert(offsetof(BP_FrontendFigure_C_GetFigureMesh, Skeleton) == 0x000000, "Member 'BP_FrontendFigure_C_GetFigureMesh::Skeleton' has a wrong offset!");

// Function BP_FrontendFigure.BP_FrontendFigure_C.GetComponentForCameraWithName
// 0x0020 (0x0020 - 0x0000)
struct BP_FrontendFigure_C_GetComponentForCameraWithName final
{
public:
	class FName                                   Camera_name;                                       // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FrontendFigure_C_GetComponentForCameraWithName) == 0x000008, "Wrong alignment on BP_FrontendFigure_C_GetComponentForCameraWithName");
static_assert(sizeof(BP_FrontendFigure_C_GetComponentForCameraWithName) == 0x000020, "Wrong size on BP_FrontendFigure_C_GetComponentForCameraWithName");
static_assert(offsetof(BP_FrontendFigure_C_GetComponentForCameraWithName, Camera_name) == 0x000000, "Member 'BP_FrontendFigure_C_GetComponentForCameraWithName::Camera_name' has a wrong offset!");
static_assert(offsetof(BP_FrontendFigure_C_GetComponentForCameraWithName, ReturnValue) == 0x000010, "Member 'BP_FrontendFigure_C_GetComponentForCameraWithName::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FrontendFigure_C_GetComponentForCameraWithName, K2Node_SwitchName_CmpSuccess) == 0x000018, "Member 'BP_FrontendFigure_C_GetComponentForCameraWithName::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

}

