#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GadgetBox

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GadgetBox.BP_GadgetBox_C.ExecuteUbergraph_BP_GadgetBox
// 0x0090 (0x0090 - 0x0000)
struct BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAPickUp*                              CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        K2Node_ComponentBoundEvent_OtherComp;              // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0068(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACAPickUp*>                      CallFunc_Drop_Item_ItemSpawned;                    // 0x0080(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox) == 0x000008, "Wrong alignment on BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox");
static_assert(sizeof(BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox) == 0x000090, "Wrong size on BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox");
static_assert(offsetof(BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox, EntryPoint) == 0x000000, "Member 'BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox, CallFunc_IsServer_ReturnValue) == 0x000010, "Member 'BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox, CallFunc_Less_IntInt_ReturnValue) == 0x000025, "Member 'BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox, CallFunc_IsDedicatedServer_ReturnValue) == 0x00003C, "Member 'BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000040, "Member 'BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000048, "Member 'BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox, K2Node_ComponentBoundEvent_OtherActor) == 0x000050, "Member 'BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox, K2Node_ComponentBoundEvent_OtherComp) == 0x000058, "Member 'BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000060, "Member 'BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox, CallFunc_IsValid_ReturnValue_1) == 0x000064, "Member 'BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox, K2Node_CreateDelegate_OutputDelegate_1) == 0x000068, "Member 'BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox, CallFunc_BooleanAND_ReturnValue) == 0x00007C, "Member 'BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox, CallFunc_Drop_Item_ItemSpawned) == 0x000080, "Member 'BP_GadgetBox_C_ExecuteUbergraph_BP_GadgetBox::CallFunc_Drop_Item_ItemSpawned' has a wrong offset!");

// Function BP_GadgetBox.BP_GadgetBox_C.BndEvt__ResetOverlap_K2Node_ComponentBoundEvent_1_SceneComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_GadgetBox_C_BndEvt__ResetOverlap_K2Node_ComponentBoundEvent_1_SceneComponentEndOverlapSignature__DelegateSignature final
{
public:
	class USceneComponent*                        OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GadgetBox_C_BndEvt__ResetOverlap_K2Node_ComponentBoundEvent_1_SceneComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_GadgetBox_C_BndEvt__ResetOverlap_K2Node_ComponentBoundEvent_1_SceneComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_GadgetBox_C_BndEvt__ResetOverlap_K2Node_ComponentBoundEvent_1_SceneComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_GadgetBox_C_BndEvt__ResetOverlap_K2Node_ComponentBoundEvent_1_SceneComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_GadgetBox_C_BndEvt__ResetOverlap_K2Node_ComponentBoundEvent_1_SceneComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_GadgetBox_C_BndEvt__ResetOverlap_K2Node_ComponentBoundEvent_1_SceneComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_BndEvt__ResetOverlap_K2Node_ComponentBoundEvent_1_SceneComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_GadgetBox_C_BndEvt__ResetOverlap_K2Node_ComponentBoundEvent_1_SceneComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_BndEvt__ResetOverlap_K2Node_ComponentBoundEvent_1_SceneComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_GadgetBox_C_BndEvt__ResetOverlap_K2Node_ComponentBoundEvent_1_SceneComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_BndEvt__ResetOverlap_K2Node_ComponentBoundEvent_1_SceneComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_GadgetBox_C_BndEvt__ResetOverlap_K2Node_ComponentBoundEvent_1_SceneComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_GadgetBox.BP_GadgetBox_C.OnRep_IsOpen
// 0x0006 (0x0006 - 0x0000)
struct BP_GadgetBox_C_OnRep_IsOpen final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GadgetBox_C_OnRep_IsOpen) == 0x000001, "Wrong alignment on BP_GadgetBox_C_OnRep_IsOpen");
static_assert(sizeof(BP_GadgetBox_C_OnRep_IsOpen) == 0x000006, "Wrong size on BP_GadgetBox_C_OnRep_IsOpen");
static_assert(offsetof(BP_GadgetBox_C_OnRep_IsOpen, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_GadgetBox_C_OnRep_IsOpen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_OnRep_IsOpen, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'BP_GadgetBox_C_OnRep_IsOpen::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_OnRep_IsOpen, CallFunc_IsDedicatedServer_ReturnValue) == 0x000002, "Member 'BP_GadgetBox_C_OnRep_IsOpen::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_OnRep_IsOpen, CallFunc_IsValid_ReturnValue_2) == 0x000003, "Member 'BP_GadgetBox_C_OnRep_IsOpen::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_OnRep_IsOpen, CallFunc_SetStaticMesh_ReturnValue) == 0x000004, "Member 'BP_GadgetBox_C_OnRep_IsOpen::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GadgetBox_C_OnRep_IsOpen, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000005, "Member 'BP_GadgetBox_C_OnRep_IsOpen::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");

}

