#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Grunt_AudioComponent

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Keaton_structs.hpp"


namespace SDK::Params
{

// Function BP_Grunt_AudioComponent.BP_Grunt_AudioComponent_C.ExecuteUbergraph_BP_Grunt_AudioComponent
// 0x0328 (0x0328 - 0x0000)
struct BP_Grunt_AudioComponent_C_ExecuteUbergraph_BP_Grunt_AudioComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter*                           K2Node_CustomEvent_character;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpec                    K2Node_CustomEvent_death_gameplay_effect_spec;     // 0x0010(0x0298)(ConstParm)
	float                                         K2Node_CustomEvent_damage_magnitude;               // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkedHit                          K2Node_CustomEvent_networked_hit;                  // 0x02B0(0x0068)(ConstParm, NoDestructor)
	const class AActor*                           K2Node_CustomEvent_killer;                         // 0x0318(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAAwarenessState                             K2Node_CustomEvent_New_Awareness_State;            // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECAZeroGLocoState                             K2Node_CustomEvent_New_Zero_G_Loco_State;          // 0x0322(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Grunt_AudioComponent_C_ExecuteUbergraph_BP_Grunt_AudioComponent) == 0x000008, "Wrong alignment on BP_Grunt_AudioComponent_C_ExecuteUbergraph_BP_Grunt_AudioComponent");
static_assert(sizeof(BP_Grunt_AudioComponent_C_ExecuteUbergraph_BP_Grunt_AudioComponent) == 0x000328, "Wrong size on BP_Grunt_AudioComponent_C_ExecuteUbergraph_BP_Grunt_AudioComponent");
static_assert(offsetof(BP_Grunt_AudioComponent_C_ExecuteUbergraph_BP_Grunt_AudioComponent, EntryPoint) == 0x000000, "Member 'BP_Grunt_AudioComponent_C_ExecuteUbergraph_BP_Grunt_AudioComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Grunt_AudioComponent_C_ExecuteUbergraph_BP_Grunt_AudioComponent, K2Node_CustomEvent_character) == 0x000008, "Member 'BP_Grunt_AudioComponent_C_ExecuteUbergraph_BP_Grunt_AudioComponent::K2Node_CustomEvent_character' has a wrong offset!");
static_assert(offsetof(BP_Grunt_AudioComponent_C_ExecuteUbergraph_BP_Grunt_AudioComponent, K2Node_CustomEvent_death_gameplay_effect_spec) == 0x000010, "Member 'BP_Grunt_AudioComponent_C_ExecuteUbergraph_BP_Grunt_AudioComponent::K2Node_CustomEvent_death_gameplay_effect_spec' has a wrong offset!");
static_assert(offsetof(BP_Grunt_AudioComponent_C_ExecuteUbergraph_BP_Grunt_AudioComponent, K2Node_CustomEvent_damage_magnitude) == 0x0002A8, "Member 'BP_Grunt_AudioComponent_C_ExecuteUbergraph_BP_Grunt_AudioComponent::K2Node_CustomEvent_damage_magnitude' has a wrong offset!");
static_assert(offsetof(BP_Grunt_AudioComponent_C_ExecuteUbergraph_BP_Grunt_AudioComponent, K2Node_CustomEvent_networked_hit) == 0x0002B0, "Member 'BP_Grunt_AudioComponent_C_ExecuteUbergraph_BP_Grunt_AudioComponent::K2Node_CustomEvent_networked_hit' has a wrong offset!");
static_assert(offsetof(BP_Grunt_AudioComponent_C_ExecuteUbergraph_BP_Grunt_AudioComponent, K2Node_CustomEvent_killer) == 0x000318, "Member 'BP_Grunt_AudioComponent_C_ExecuteUbergraph_BP_Grunt_AudioComponent::K2Node_CustomEvent_killer' has a wrong offset!");
static_assert(offsetof(BP_Grunt_AudioComponent_C_ExecuteUbergraph_BP_Grunt_AudioComponent, K2Node_CustomEvent_New_Awareness_State) == 0x000320, "Member 'BP_Grunt_AudioComponent_C_ExecuteUbergraph_BP_Grunt_AudioComponent::K2Node_CustomEvent_New_Awareness_State' has a wrong offset!");
static_assert(offsetof(BP_Grunt_AudioComponent_C_ExecuteUbergraph_BP_Grunt_AudioComponent, K2Node_SwitchEnum_CmpSuccess) == 0x000321, "Member 'BP_Grunt_AudioComponent_C_ExecuteUbergraph_BP_Grunt_AudioComponent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Grunt_AudioComponent_C_ExecuteUbergraph_BP_Grunt_AudioComponent, K2Node_CustomEvent_New_Zero_G_Loco_State) == 0x000322, "Member 'BP_Grunt_AudioComponent_C_ExecuteUbergraph_BP_Grunt_AudioComponent::K2Node_CustomEvent_New_Zero_G_Loco_State' has a wrong offset!");

// Function BP_Grunt_AudioComponent.BP_Grunt_AudioComponent_C.OnDeath_New
// 0x0318 (0x0318 - 0x0000)
struct BP_Grunt_AudioComponent_C_OnDeath_New final
{
public:
	class ACACharacter*                           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpec                    Death_gameplay_effect_spec;                        // 0x0008(0x0298)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         Damage_magnitude;                                  // 0x02A0(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkedHit                          Networked_hit;                                     // 0x02A8(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	const class AActor*                           Killer;                                            // 0x0310(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Grunt_AudioComponent_C_OnDeath_New) == 0x000008, "Wrong alignment on BP_Grunt_AudioComponent_C_OnDeath_New");
static_assert(sizeof(BP_Grunt_AudioComponent_C_OnDeath_New) == 0x000318, "Wrong size on BP_Grunt_AudioComponent_C_OnDeath_New");
static_assert(offsetof(BP_Grunt_AudioComponent_C_OnDeath_New, Character) == 0x000000, "Member 'BP_Grunt_AudioComponent_C_OnDeath_New::Character' has a wrong offset!");
static_assert(offsetof(BP_Grunt_AudioComponent_C_OnDeath_New, Death_gameplay_effect_spec) == 0x000008, "Member 'BP_Grunt_AudioComponent_C_OnDeath_New::Death_gameplay_effect_spec' has a wrong offset!");
static_assert(offsetof(BP_Grunt_AudioComponent_C_OnDeath_New, Damage_magnitude) == 0x0002A0, "Member 'BP_Grunt_AudioComponent_C_OnDeath_New::Damage_magnitude' has a wrong offset!");
static_assert(offsetof(BP_Grunt_AudioComponent_C_OnDeath_New, Networked_hit) == 0x0002A8, "Member 'BP_Grunt_AudioComponent_C_OnDeath_New::Networked_hit' has a wrong offset!");
static_assert(offsetof(BP_Grunt_AudioComponent_C_OnDeath_New, Killer) == 0x000310, "Member 'BP_Grunt_AudioComponent_C_OnDeath_New::Killer' has a wrong offset!");

// Function BP_Grunt_AudioComponent.BP_Grunt_AudioComponent_C.OnZeroGLocoStateChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_Grunt_AudioComponent_C_OnZeroGLocoStateChanged final
{
public:
	ECAZeroGLocoState                             New_Zero_G_Loco_State;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Grunt_AudioComponent_C_OnZeroGLocoStateChanged) == 0x000001, "Wrong alignment on BP_Grunt_AudioComponent_C_OnZeroGLocoStateChanged");
static_assert(sizeof(BP_Grunt_AudioComponent_C_OnZeroGLocoStateChanged) == 0x000001, "Wrong size on BP_Grunt_AudioComponent_C_OnZeroGLocoStateChanged");
static_assert(offsetof(BP_Grunt_AudioComponent_C_OnZeroGLocoStateChanged, New_Zero_G_Loco_State) == 0x000000, "Member 'BP_Grunt_AudioComponent_C_OnZeroGLocoStateChanged::New_Zero_G_Loco_State' has a wrong offset!");

// Function BP_Grunt_AudioComponent.BP_Grunt_AudioComponent_C.OnAwarenessStateChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_Grunt_AudioComponent_C_OnAwarenessStateChanged final
{
public:
	ECAAwarenessState                             New_Awareness_State;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Grunt_AudioComponent_C_OnAwarenessStateChanged) == 0x000001, "Wrong alignment on BP_Grunt_AudioComponent_C_OnAwarenessStateChanged");
static_assert(sizeof(BP_Grunt_AudioComponent_C_OnAwarenessStateChanged) == 0x000001, "Wrong size on BP_Grunt_AudioComponent_C_OnAwarenessStateChanged");
static_assert(offsetof(BP_Grunt_AudioComponent_C_OnAwarenessStateChanged, New_Awareness_State) == 0x000000, "Member 'BP_Grunt_AudioComponent_C_OnAwarenessStateChanged::New_Awareness_State' has a wrong offset!");

}

