#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameMode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GameMode.BP_GameMode_C
// 0x0038 (0x0600 - 0x05C8)
class ABP_GameMode_C : public ACAGameMode
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x05D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ACAPlayerController*>            Players;                                           // 0x05D8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FGameplayTag                           DefaultShipTheme;                                  // 0x05E8(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ShipTheme;                                         // 0x05F4(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_GameMode(int32 EntryPoint);
	void StartGame();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GameMode_C">();
	}
	static class ABP_GameMode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GameMode_C>();
	}
};
static_assert(alignof(ABP_GameMode_C) == 0x000008, "Wrong alignment on ABP_GameMode_C");
static_assert(sizeof(ABP_GameMode_C) == 0x000600, "Wrong size on ABP_GameMode_C");
static_assert(offsetof(ABP_GameMode_C, UberGraphFrame) == 0x0005C8, "Member 'ABP_GameMode_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GameMode_C, DefaultSceneRoot) == 0x0005D0, "Member 'ABP_GameMode_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_GameMode_C, Players) == 0x0005D8, "Member 'ABP_GameMode_C::Players' has a wrong offset!");
static_assert(offsetof(ABP_GameMode_C, DefaultShipTheme) == 0x0005E8, "Member 'ABP_GameMode_C::DefaultShipTheme' has a wrong offset!");
static_assert(offsetof(ABP_GameMode_C, ShipTheme) == 0x0005F4, "Member 'ABP_GameMode_C::ShipTheme' has a wrong offset!");

}

