#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HeaderMenu

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_HeaderMenu.BP_HeaderMenu_C.ExecuteUbergraph_BP_HeaderMenu
// 0x0030 (0x0030 - 0x0000)
struct BP_HeaderMenu_C_ExecuteUbergraph_BP_HeaderMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_show;                                 // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HeaderMenu_C_ExecuteUbergraph_BP_HeaderMenu) == 0x000008, "Wrong alignment on BP_HeaderMenu_C_ExecuteUbergraph_BP_HeaderMenu");
static_assert(sizeof(BP_HeaderMenu_C_ExecuteUbergraph_BP_HeaderMenu) == 0x000030, "Wrong size on BP_HeaderMenu_C_ExecuteUbergraph_BP_HeaderMenu");
static_assert(offsetof(BP_HeaderMenu_C_ExecuteUbergraph_BP_HeaderMenu, EntryPoint) == 0x000000, "Member 'BP_HeaderMenu_C_ExecuteUbergraph_BP_HeaderMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HeaderMenu_C_ExecuteUbergraph_BP_HeaderMenu, Temp_bool_Variable) == 0x000004, "Member 'BP_HeaderMenu_C_ExecuteUbergraph_BP_HeaderMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_HeaderMenu_C_ExecuteUbergraph_BP_HeaderMenu, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'BP_HeaderMenu_C_ExecuteUbergraph_BP_HeaderMenu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HeaderMenu_C_ExecuteUbergraph_BP_HeaderMenu, Temp_byte_Variable) == 0x000010, "Member 'BP_HeaderMenu_C_ExecuteUbergraph_BP_HeaderMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_HeaderMenu_C_ExecuteUbergraph_BP_HeaderMenu, Temp_byte_Variable_1) == 0x000011, "Member 'BP_HeaderMenu_C_ExecuteUbergraph_BP_HeaderMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HeaderMenu_C_ExecuteUbergraph_BP_HeaderMenu, K2Node_Event_show) == 0x000012, "Member 'BP_HeaderMenu_C_ExecuteUbergraph_BP_HeaderMenu::K2Node_Event_show' has a wrong offset!");
static_assert(offsetof(BP_HeaderMenu_C_ExecuteUbergraph_BP_HeaderMenu, K2Node_Select_Default) == 0x000013, "Member 'BP_HeaderMenu_C_ExecuteUbergraph_BP_HeaderMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_HeaderMenu_C_ExecuteUbergraph_BP_HeaderMenu, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'BP_HeaderMenu_C_ExecuteUbergraph_BP_HeaderMenu::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HeaderMenu_C_ExecuteUbergraph_BP_HeaderMenu, CallFunc_PlayAnimation_ReturnValue_2) == 0x000020, "Member 'BP_HeaderMenu_C_ExecuteUbergraph_BP_HeaderMenu::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HeaderMenu_C_ExecuteUbergraph_BP_HeaderMenu, CallFunc_PlayAnimation_ReturnValue_3) == 0x000028, "Member 'BP_HeaderMenu_C_ExecuteUbergraph_BP_HeaderMenu::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");

// Function BP_HeaderMenu.BP_HeaderMenu_C.ShowActionHints
// 0x0001 (0x0001 - 0x0000)
struct BP_HeaderMenu_C_ShowActionHints final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HeaderMenu_C_ShowActionHints) == 0x000001, "Wrong alignment on BP_HeaderMenu_C_ShowActionHints");
static_assert(sizeof(BP_HeaderMenu_C_ShowActionHints) == 0x000001, "Wrong size on BP_HeaderMenu_C_ShowActionHints");
static_assert(offsetof(BP_HeaderMenu_C_ShowActionHints, Show) == 0x000000, "Member 'BP_HeaderMenu_C_ShowActionHints::Show' has a wrong offset!");

}

