#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ImpactEffect_Melee

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Keaton_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CAAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_ImpactEffect_Melee.BP_ImpactEffect_Melee_C.ExecuteUbergraph_BP_ImpactEffect_Melee
// 0x01A0 (0x01A0 - 0x0000)
struct BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCAEmitterEnabledState>         Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	EPhysicalSurface                              K2Node_Event_surface_type;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_surface_hit;                          // 0x001C(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAtImpact_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnCACascadeSystemAtImpact_ReturnValue; // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioSwitchValueType                CallFunc_ConvertSurfaceToAudio_Switch;             // 0x014C(0x0004)(NoDestructor)
	struct FCAAudioBankNameType                   CallFunc_ConvertSurfaceToAudio_FootstepBank;       // 0x0150(0x0004)(NoDestructor)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCAEmitterEnabledState>         Temp_struct_Variable_1;                            // 0x0158(0x0010)(ConstParm, ReferenceParm)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEventInWorld_playback_instance;       // 0x0168(0x0010)()
	bool                                          CallFunc_PlayEventInWorld_play_success;            // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnCACascadeSystemAtImpact_ReturnValue_1; // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCAEmitterEnabledState>         Temp_struct_Variable_2;                            // 0x0188(0x0010)(ConstParm, ReferenceParm)
	class UParticleSystemComponent*               CallFunc_SpawnCACascadeSystemAtImpact_ReturnValue_2; // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee) == 0x000008, "Wrong alignment on BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee");
static_assert(sizeof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee) == 0x0001A0, "Wrong size on BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, EntryPoint) == 0x000000, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, Temp_struct_Variable) == 0x000008, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, K2Node_Event_surface_type) == 0x000018, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::K2Node_Event_surface_type' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, K2Node_Event_surface_hit) == 0x00001C, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::K2Node_Event_surface_hit' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, CallFunc_SpawnCANiagaraSystemAtImpact_ReturnValue) == 0x0000B0, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::CallFunc_SpawnCANiagaraSystemAtImpact_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, CallFunc_SpawnCACascadeSystemAtImpact_ReturnValue) == 0x0000B8, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::CallFunc_SpawnCACascadeSystemAtImpact_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, CallFunc_BreakHitResult_bBlockingHit) == 0x0000C0, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000C1, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, CallFunc_BreakHitResult_Time) == 0x0000C4, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, CallFunc_BreakHitResult_Distance) == 0x0000C8, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, CallFunc_BreakHitResult_Location) == 0x0000CC, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, CallFunc_BreakHitResult_ImpactPoint) == 0x0000D8, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, CallFunc_BreakHitResult_Normal) == 0x0000E4, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, CallFunc_BreakHitResult_ImpactNormal) == 0x0000F0, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, CallFunc_BreakHitResult_PhysMat) == 0x000100, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, CallFunc_BreakHitResult_HitActor) == 0x000108, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, CallFunc_BreakHitResult_HitComponent) == 0x000110, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, CallFunc_BreakHitResult_HitBoneName) == 0x000118, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, CallFunc_BreakHitResult_HitItem) == 0x000124, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, CallFunc_BreakHitResult_ElementIndex) == 0x000128, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, CallFunc_BreakHitResult_FaceIndex) == 0x00012C, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, CallFunc_BreakHitResult_TraceStart) == 0x000130, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, CallFunc_BreakHitResult_TraceEnd) == 0x00013C, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, K2Node_SwitchEnum_CmpSuccess) == 0x000148, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, CallFunc_ConvertSurfaceToAudio_Switch) == 0x00014C, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::CallFunc_ConvertSurfaceToAudio_Switch' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, CallFunc_ConvertSurfaceToAudio_FootstepBank) == 0x000150, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::CallFunc_ConvertSurfaceToAudio_FootstepBank' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, Temp_struct_Variable_1) == 0x000158, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, CallFunc_PlayEventInWorld_playback_instance) == 0x000168, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::CallFunc_PlayEventInWorld_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, CallFunc_PlayEventInWorld_play_success) == 0x000178, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::CallFunc_PlayEventInWorld_play_success' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, CallFunc_SpawnCACascadeSystemAtImpact_ReturnValue_1) == 0x000180, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::CallFunc_SpawnCACascadeSystemAtImpact_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, Temp_struct_Variable_2) == 0x000188, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee, CallFunc_SpawnCACascadeSystemAtImpact_ReturnValue_2) == 0x000198, "Member 'BP_ImpactEffect_Melee_C_ExecuteUbergraph_BP_ImpactEffect_Melee::CallFunc_SpawnCACascadeSystemAtImpact_ReturnValue_2' has a wrong offset!");

// Function BP_ImpactEffect_Melee.BP_ImpactEffect_Melee_C.OnSpawnImpact
// 0x0094 (0x0094 - 0x0000)
struct BP_ImpactEffect_Melee_C_OnSpawnImpact final
{
public:
	EPhysicalSurface                              Surface_type;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Surface_hit;                                       // 0x0004(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ImpactEffect_Melee_C_OnSpawnImpact) == 0x000004, "Wrong alignment on BP_ImpactEffect_Melee_C_OnSpawnImpact");
static_assert(sizeof(BP_ImpactEffect_Melee_C_OnSpawnImpact) == 0x000094, "Wrong size on BP_ImpactEffect_Melee_C_OnSpawnImpact");
static_assert(offsetof(BP_ImpactEffect_Melee_C_OnSpawnImpact, Surface_type) == 0x000000, "Member 'BP_ImpactEffect_Melee_C_OnSpawnImpact::Surface_type' has a wrong offset!");
static_assert(offsetof(BP_ImpactEffect_Melee_C_OnSpawnImpact, Surface_hit) == 0x000004, "Member 'BP_ImpactEffect_Melee_C_OnSpawnImpact::Surface_hit' has a wrong offset!");

}

