#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ImpactEffect_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CAAudio_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ImpactEffect_Base.BP_ImpactEffect_Base_C
// 0x0018 (0x05C8 - 0x05B0)
class ABP_ImpactEffect_Base_C : public ACAImpactEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioSwitchValueType                MaterialSwitch;                                    // 0x05C0(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_BP_ImpactEffect_Base(int32 EntryPoint);
	void TriggerAudio(const struct FVector& ReflectionNormal);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ImpactEffect_Base_C">();
	}
	static class ABP_ImpactEffect_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ImpactEffect_Base_C>();
	}
};
static_assert(alignof(ABP_ImpactEffect_Base_C) == 0x000008, "Wrong alignment on ABP_ImpactEffect_Base_C");
static_assert(sizeof(ABP_ImpactEffect_Base_C) == 0x0005C8, "Wrong size on ABP_ImpactEffect_Base_C");
static_assert(offsetof(ABP_ImpactEffect_Base_C, UberGraphFrame) == 0x0005B0, "Member 'ABP_ImpactEffect_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ImpactEffect_Base_C, DefaultSceneRoot) == 0x0005B8, "Member 'ABP_ImpactEffect_Base_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ImpactEffect_Base_C, MaterialSwitch) == 0x0005C0, "Member 'ABP_ImpactEffect_Base_C::MaterialSwitch' has a wrong offset!");

}

