#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IngredientStateMachine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_IngredientStateMachine.BP_IngredientStateMachine_C
// 0x0048 (0x0DA8 - 0x0D60)
class UBP_IngredientStateMachine_C final : public UCAStateMachineComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	FMulticastInlineDelegateProperty_             EventActivated;                                    // 0x0D68(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EventDeactivated;                                  // 0x0D78(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EventActivating;                                   // 0x0D88(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EventDeactivating;                                 // 0x0D98(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void EventActivated__DelegateSignature();
	void EventDeactivated__DelegateSignature();
	void EventActivating__DelegateSignature();
	void EventDeactivating__DelegateSignature();
	void ExecuteUbergraph_BP_IngredientStateMachine(int32 EntryPoint);
	void Deactivating();
	void Activating();
	void Deactivated();
	void Activated();
	void BindDelegates();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_IngredientStateMachine_C">();
	}
	static class UBP_IngredientStateMachine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_IngredientStateMachine_C>();
	}
};
static_assert(alignof(UBP_IngredientStateMachine_C) == 0x000008, "Wrong alignment on UBP_IngredientStateMachine_C");
static_assert(sizeof(UBP_IngredientStateMachine_C) == 0x000DA8, "Wrong size on UBP_IngredientStateMachine_C");
static_assert(offsetof(UBP_IngredientStateMachine_C, UberGraphFrame) == 0x000D60, "Member 'UBP_IngredientStateMachine_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_IngredientStateMachine_C, EventActivated) == 0x000D68, "Member 'UBP_IngredientStateMachine_C::EventActivated' has a wrong offset!");
static_assert(offsetof(UBP_IngredientStateMachine_C, EventDeactivated) == 0x000D78, "Member 'UBP_IngredientStateMachine_C::EventDeactivated' has a wrong offset!");
static_assert(offsetof(UBP_IngredientStateMachine_C, EventActivating) == 0x000D88, "Member 'UBP_IngredientStateMachine_C::EventActivating' has a wrong offset!");
static_assert(offsetof(UBP_IngredientStateMachine_C, EventDeactivating) == 0x000D98, "Member 'UBP_IngredientStateMachine_C::EventDeactivating' has a wrong offset!");

}

