#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_KeyDisplayWidget

#include "Basic.hpp"

#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function BP_KeyDisplayWidget.BP_KeyDisplayWidget_C.ExecuteUbergraph_BP_KeyDisplayWidget
// 0x0080 (0x0080 - 0x0000)
struct BP_KeyDisplayWidget_C_ExecuteUbergraph_BP_KeyDisplayWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_CustomEvent_key;                            // 0x0008(0x0020)(HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_label_1;                        // 0x0028(0x0018)()
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue;           // 0x0040(0x0018)()
	bool                                          CallFunc_SetKey_ReturnValue;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_label;                          // 0x0060(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_KeyDisplayWidget_C_ExecuteUbergraph_BP_KeyDisplayWidget) == 0x000008, "Wrong alignment on BP_KeyDisplayWidget_C_ExecuteUbergraph_BP_KeyDisplayWidget");
static_assert(sizeof(BP_KeyDisplayWidget_C_ExecuteUbergraph_BP_KeyDisplayWidget) == 0x000080, "Wrong size on BP_KeyDisplayWidget_C_ExecuteUbergraph_BP_KeyDisplayWidget");
static_assert(offsetof(BP_KeyDisplayWidget_C_ExecuteUbergraph_BP_KeyDisplayWidget, EntryPoint) == 0x000000, "Member 'BP_KeyDisplayWidget_C_ExecuteUbergraph_BP_KeyDisplayWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_KeyDisplayWidget_C_ExecuteUbergraph_BP_KeyDisplayWidget, K2Node_CustomEvent_key) == 0x000008, "Member 'BP_KeyDisplayWidget_C_ExecuteUbergraph_BP_KeyDisplayWidget::K2Node_CustomEvent_key' has a wrong offset!");
static_assert(offsetof(BP_KeyDisplayWidget_C_ExecuteUbergraph_BP_KeyDisplayWidget, K2Node_CustomEvent_label_1) == 0x000028, "Member 'BP_KeyDisplayWidget_C_ExecuteUbergraph_BP_KeyDisplayWidget::K2Node_CustomEvent_label_1' has a wrong offset!");
static_assert(offsetof(BP_KeyDisplayWidget_C_ExecuteUbergraph_BP_KeyDisplayWidget, CallFunc_Key_GetDisplayName_ReturnValue) == 0x000040, "Member 'BP_KeyDisplayWidget_C_ExecuteUbergraph_BP_KeyDisplayWidget::CallFunc_Key_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KeyDisplayWidget_C_ExecuteUbergraph_BP_KeyDisplayWidget, CallFunc_SetKey_ReturnValue) == 0x000058, "Member 'BP_KeyDisplayWidget_C_ExecuteUbergraph_BP_KeyDisplayWidget::CallFunc_SetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KeyDisplayWidget_C_ExecuteUbergraph_BP_KeyDisplayWidget, K2Node_CustomEvent_label) == 0x000060, "Member 'BP_KeyDisplayWidget_C_ExecuteUbergraph_BP_KeyDisplayWidget::K2Node_CustomEvent_label' has a wrong offset!");
static_assert(offsetof(BP_KeyDisplayWidget_C_ExecuteUbergraph_BP_KeyDisplayWidget, K2Node_Event_IsDesignTime) == 0x000078, "Member 'BP_KeyDisplayWidget_C_ExecuteUbergraph_BP_KeyDisplayWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function BP_KeyDisplayWidget.BP_KeyDisplayWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_KeyDisplayWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_KeyDisplayWidget_C_PreConstruct) == 0x000001, "Wrong alignment on BP_KeyDisplayWidget_C_PreConstruct");
static_assert(sizeof(BP_KeyDisplayWidget_C_PreConstruct) == 0x000001, "Wrong size on BP_KeyDisplayWidget_C_PreConstruct");
static_assert(offsetof(BP_KeyDisplayWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_KeyDisplayWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_KeyDisplayWidget.BP_KeyDisplayWidget_C.ShowLabel
// 0x0018 (0x0018 - 0x0000)
struct BP_KeyDisplayWidget_C_ShowLabel final
{
public:
	class FText                                   Label_0;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_KeyDisplayWidget_C_ShowLabel) == 0x000008, "Wrong alignment on BP_KeyDisplayWidget_C_ShowLabel");
static_assert(sizeof(BP_KeyDisplayWidget_C_ShowLabel) == 0x000018, "Wrong size on BP_KeyDisplayWidget_C_ShowLabel");
static_assert(offsetof(BP_KeyDisplayWidget_C_ShowLabel, Label_0) == 0x000000, "Member 'BP_KeyDisplayWidget_C_ShowLabel::Label_0' has a wrong offset!");

// Function BP_KeyDisplayWidget.BP_KeyDisplayWidget_C.SetKey
// 0x0038 (0x0038 - 0x0000)
struct BP_KeyDisplayWidget_C_SetKey final
{
public:
	struct FKey                                   Key_0;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FText                                   Label_0;                                           // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_KeyDisplayWidget_C_SetKey) == 0x000008, "Wrong alignment on BP_KeyDisplayWidget_C_SetKey");
static_assert(sizeof(BP_KeyDisplayWidget_C_SetKey) == 0x000038, "Wrong size on BP_KeyDisplayWidget_C_SetKey");
static_assert(offsetof(BP_KeyDisplayWidget_C_SetKey, Key_0) == 0x000000, "Member 'BP_KeyDisplayWidget_C_SetKey::Key_0' has a wrong offset!");
static_assert(offsetof(BP_KeyDisplayWidget_C_SetKey, Label_0) == 0x000020, "Member 'BP_KeyDisplayWidget_C_SetKey::Label_0' has a wrong offset!");

}

