#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_KeybindingInputPanel

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CALocalisationRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_KeybindingInputPanel.BP_KeybindingInputPanel_C.ExecuteUbergraph_BP_KeybindingInputPanel
// 0x0298 (0x0298 - 0x0000)
struct BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeTextFromCAText_text;                  // 0x0010(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAText                                K2Node_Select_Default;                             // 0x0030(0x0030)()
	class FText                                   CallFunc_MakeTextFromCAText_text_1;                // 0x0060(0x0018)()
	class FText                                   CallFunc_MakeTextFromCAText_text_2;                // 0x0078(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0090(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
	class FText                                   CallFunc_MakeTextFromCAText_text_3;                // 0x00F8(0x0018)()
	struct FCAText                                K2Node_Select_Default_1;                           // 0x0110(0x0030)()
	class FText                                   CallFunc_MakeTextFromCAText_text_4;                // 0x0140(0x0018)()
	class FText                                   CallFunc_MakeTextFromCAText_text_5;                // 0x0158(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0170(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01B0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01C0(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetRebindIDText_ReturnValue;              // 0x01E0(0x0018)()
	class FText                                   CallFunc_MakeTextFromCAText_text_6;                // 0x01F8(0x0018)()
	class FText                                   CallFunc_MakeTextFromCAText_text_7;                // 0x0210(0x0018)()
	bool                                          CallFunc_IsPrimaryKeySlot_ReturnValue;             // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_GetKey_key;                               // 0x0230(0x0020)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetKey_text;                              // 0x0250(0x0018)()
	class FText                                   K2Node_Select_Default_3;                           // 0x0268(0x0018)()
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_1;               // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button;                 // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel) == 0x000008, "Wrong alignment on BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel");
static_assert(sizeof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel) == 0x000298, "Wrong size on BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, EntryPoint) == 0x000000, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, Temp_bool_Variable) == 0x000004, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, Temp_bool_Variable_1) == 0x000005, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, Temp_bool_Variable_2) == 0x000006, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, Temp_byte_Variable) == 0x000007, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, Temp_byte_Variable_1) == 0x000008, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, Temp_bool_Variable_3) == 0x000009, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, CallFunc_MakeTextFromCAText_text) == 0x000010, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::CallFunc_MakeTextFromCAText_text' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000028, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, K2Node_Select_Default) == 0x000030, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, CallFunc_MakeTextFromCAText_text_1) == 0x000060, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::CallFunc_MakeTextFromCAText_text_1' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, CallFunc_MakeTextFromCAText_text_2) == 0x000078, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::CallFunc_MakeTextFromCAText_text_2' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, K2Node_MakeStruct_FormatArgumentData) == 0x000090, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, K2Node_MakeArray_Array) == 0x0000D0, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, CallFunc_MakeTextFromCAText_text_3) == 0x0000F8, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::CallFunc_MakeTextFromCAText_text_3' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, K2Node_Select_Default_1) == 0x000110, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, CallFunc_MakeTextFromCAText_text_4) == 0x000140, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::CallFunc_MakeTextFromCAText_text_4' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, CallFunc_MakeTextFromCAText_text_5) == 0x000158, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::CallFunc_MakeTextFromCAText_text_5' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, K2Node_MakeStruct_FormatArgumentData_1) == 0x000170, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, K2Node_MakeArray_Array_1) == 0x0001B0, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, CallFunc_Format_ReturnValue_1) == 0x0001C0, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, K2Node_Select_Default_2) == 0x0001D8, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, CallFunc_GetRebindIDText_ReturnValue) == 0x0001E0, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::CallFunc_GetRebindIDText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, CallFunc_MakeTextFromCAText_text_6) == 0x0001F8, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::CallFunc_MakeTextFromCAText_text_6' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, CallFunc_MakeTextFromCAText_text_7) == 0x000210, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::CallFunc_MakeTextFromCAText_text_7' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, CallFunc_IsPrimaryKeySlot_ReturnValue) == 0x000228, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::CallFunc_IsPrimaryKeySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, CallFunc_GetKey_key) == 0x000230, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::CallFunc_GetKey_key' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, CallFunc_GetKey_text) == 0x000250, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::CallFunc_GetKey_text' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, K2Node_Select_Default_3) == 0x000268, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, K2Node_ComponentBoundEvent_button_1) == 0x000280, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::K2Node_ComponentBoundEvent_button_1' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, CallFunc_PlayAnimation_ReturnValue) == 0x000288, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel, K2Node_ComponentBoundEvent_button) == 0x000290, "Member 'BP_KeybindingInputPanel_C_ExecuteUbergraph_BP_KeybindingInputPanel::K2Node_ComponentBoundEvent_button' has a wrong offset!");

// Function BP_KeybindingInputPanel.BP_KeybindingInputPanel_C.BndEvt__BP_KeybindingInputPanel_cancel_button_K2Node_ComponentBoundEvent_1_UIElementInternalClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_KeybindingInputPanel_C_BndEvt__BP_KeybindingInputPanel_cancel_button_K2Node_ComponentBoundEvent_1_UIElementInternalClick__DelegateSignature final
{
public:
	class UCABaseUIElement*                       button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KeybindingInputPanel_C_BndEvt__BP_KeybindingInputPanel_cancel_button_K2Node_ComponentBoundEvent_1_UIElementInternalClick__DelegateSignature) == 0x000008, "Wrong alignment on BP_KeybindingInputPanel_C_BndEvt__BP_KeybindingInputPanel_cancel_button_K2Node_ComponentBoundEvent_1_UIElementInternalClick__DelegateSignature");
static_assert(sizeof(BP_KeybindingInputPanel_C_BndEvt__BP_KeybindingInputPanel_cancel_button_K2Node_ComponentBoundEvent_1_UIElementInternalClick__DelegateSignature) == 0x000008, "Wrong size on BP_KeybindingInputPanel_C_BndEvt__BP_KeybindingInputPanel_cancel_button_K2Node_ComponentBoundEvent_1_UIElementInternalClick__DelegateSignature");
static_assert(offsetof(BP_KeybindingInputPanel_C_BndEvt__BP_KeybindingInputPanel_cancel_button_K2Node_ComponentBoundEvent_1_UIElementInternalClick__DelegateSignature, button) == 0x000000, "Member 'BP_KeybindingInputPanel_C_BndEvt__BP_KeybindingInputPanel_cancel_button_K2Node_ComponentBoundEvent_1_UIElementInternalClick__DelegateSignature::button' has a wrong offset!");

// Function BP_KeybindingInputPanel.BP_KeybindingInputPanel_C.BndEvt__BP_KeybindingInputPanel_cancel_button_K2Node_ComponentBoundEvent_0_UIElementSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_KeybindingInputPanel_C_BndEvt__BP_KeybindingInputPanel_cancel_button_K2Node_ComponentBoundEvent_0_UIElementSelected__DelegateSignature final
{
public:
	class UCABaseUIElement*                       button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KeybindingInputPanel_C_BndEvt__BP_KeybindingInputPanel_cancel_button_K2Node_ComponentBoundEvent_0_UIElementSelected__DelegateSignature) == 0x000008, "Wrong alignment on BP_KeybindingInputPanel_C_BndEvt__BP_KeybindingInputPanel_cancel_button_K2Node_ComponentBoundEvent_0_UIElementSelected__DelegateSignature");
static_assert(sizeof(BP_KeybindingInputPanel_C_BndEvt__BP_KeybindingInputPanel_cancel_button_K2Node_ComponentBoundEvent_0_UIElementSelected__DelegateSignature) == 0x000008, "Wrong size on BP_KeybindingInputPanel_C_BndEvt__BP_KeybindingInputPanel_cancel_button_K2Node_ComponentBoundEvent_0_UIElementSelected__DelegateSignature");
static_assert(offsetof(BP_KeybindingInputPanel_C_BndEvt__BP_KeybindingInputPanel_cancel_button_K2Node_ComponentBoundEvent_0_UIElementSelected__DelegateSignature, button) == 0x000000, "Member 'BP_KeybindingInputPanel_C_BndEvt__BP_KeybindingInputPanel_cancel_button_K2Node_ComponentBoundEvent_0_UIElementSelected__DelegateSignature::button' has a wrong offset!");

}

