#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LootEvent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Keaton_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_LootEvent.BP_LootEvent_C.ExecuteUbergraph_BP_LootEvent
// 0x0020 (0x0020 - 0x0000)
struct BP_LootEvent_C_ExecuteUbergraph_BP_LootEvent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                K2Node_CustomEvent_LootingPlayer;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LootEvent_C_ExecuteUbergraph_BP_LootEvent) == 0x000008, "Wrong alignment on BP_LootEvent_C_ExecuteUbergraph_BP_LootEvent");
static_assert(sizeof(BP_LootEvent_C_ExecuteUbergraph_BP_LootEvent) == 0x000020, "Wrong size on BP_LootEvent_C_ExecuteUbergraph_BP_LootEvent");
static_assert(offsetof(BP_LootEvent_C_ExecuteUbergraph_BP_LootEvent, EntryPoint) == 0x000000, "Member 'BP_LootEvent_C_ExecuteUbergraph_BP_LootEvent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ExecuteUbergraph_BP_LootEvent, K2Node_CustomEvent_LootingPlayer) == 0x000008, "Member 'BP_LootEvent_C_ExecuteUbergraph_BP_LootEvent::K2Node_CustomEvent_LootingPlayer' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ExecuteUbergraph_BP_LootEvent, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_LootEvent_C_ExecuteUbergraph_BP_LootEvent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ExecuteUbergraph_BP_LootEvent, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BP_LootEvent_C_ExecuteUbergraph_BP_LootEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ExecuteUbergraph_BP_LootEvent, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_LootEvent_C_ExecuteUbergraph_BP_LootEvent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ExecuteUbergraph_BP_LootEvent, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00001C, "Member 'BP_LootEvent_C_ExecuteUbergraph_BP_LootEvent::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ExecuteUbergraph_BP_LootEvent, CallFunc_HasAuthority_ReturnValue) == 0x00001D, "Member 'BP_LootEvent_C_ExecuteUbergraph_BP_LootEvent::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function BP_LootEvent.BP_LootEvent_C.CrateLooted
// 0x0008 (0x0008 - 0x0000)
struct BP_LootEvent_C_CrateLooted final
{
public:
	class ACACharacter_MainPlayer*                LootingPlayer;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootEvent_C_CrateLooted) == 0x000008, "Wrong alignment on BP_LootEvent_C_CrateLooted");
static_assert(sizeof(BP_LootEvent_C_CrateLooted) == 0x000008, "Wrong size on BP_LootEvent_C_CrateLooted");
static_assert(offsetof(BP_LootEvent_C_CrateLooted, LootingPlayer) == 0x000000, "Member 'BP_LootEvent_C_CrateLooted::LootingPlayer' has a wrong offset!");

// Function BP_LootEvent.BP_LootEvent_C.SetUpSpawnPoints
// 0x00B0 (0x00B0 - 0x0000)
struct BP_LootEvent_C_SetUpSpawnPoints final
{
public:
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_2;     // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	TArray<struct FTransform>                     K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ReferenceParm)
	TArray<class UBPC_NPCSpawnPoint_C*>           K2Node_MakeArray_Array_1;                          // 0x00A0(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_LootEvent_C_SetUpSpawnPoints) == 0x000010, "Wrong alignment on BP_LootEvent_C_SetUpSpawnPoints");
static_assert(sizeof(BP_LootEvent_C_SetUpSpawnPoints) == 0x0000B0, "Wrong size on BP_LootEvent_C_SetUpSpawnPoints");
static_assert(offsetof(BP_LootEvent_C_SetUpSpawnPoints, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000000, "Member 'BP_LootEvent_C_SetUpSpawnPoints::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_SetUpSpawnPoints, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x000030, "Member 'BP_LootEvent_C_SetUpSpawnPoints::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_SetUpSpawnPoints, CallFunc_K2_GetComponentToWorld_ReturnValue_2) == 0x000060, "Member 'BP_LootEvent_C_SetUpSpawnPoints::CallFunc_K2_GetComponentToWorld_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_SetUpSpawnPoints, K2Node_MakeArray_Array) == 0x000090, "Member 'BP_LootEvent_C_SetUpSpawnPoints::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_SetUpSpawnPoints, K2Node_MakeArray_Array_1) == 0x0000A0, "Member 'BP_LootEvent_C_SetUpSpawnPoints::K2Node_MakeArray_Array_1' has a wrong offset!");

// Function BP_LootEvent.BP_LootEvent_C.SpawnNPCs
// 0x0080 (0x0080 - 0x0000)
struct BP_LootEvent_C_SpawnNPCs final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBPC_NPCSpawnPoint_C*                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACASpawnManager*                        CallFunc_GetSpawnManager_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ACACharacter_NPC>           CallFunc_NPCTypeEnumToClass_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_SpawnActor_ReturnValue;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LootEvent_C_SpawnNPCs) == 0x000010, "Wrong alignment on BP_LootEvent_C_SpawnNPCs");
static_assert(sizeof(BP_LootEvent_C_SpawnNPCs) == 0x000080, "Wrong size on BP_LootEvent_C_SpawnNPCs");
static_assert(offsetof(BP_LootEvent_C_SpawnNPCs, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_LootEvent_C_SpawnNPCs::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_SpawnNPCs, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_LootEvent_C_SpawnNPCs::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_SpawnNPCs, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_LootEvent_C_SpawnNPCs::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_SpawnNPCs, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_LootEvent_C_SpawnNPCs::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_SpawnNPCs, CallFunc_GetSpawnManager_ReturnValue) == 0x000018, "Member 'BP_LootEvent_C_SpawnNPCs::CallFunc_GetSpawnManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_SpawnNPCs, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000020, "Member 'BP_LootEvent_C_SpawnNPCs::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_SpawnNPCs, CallFunc_NPCTypeEnumToClass_ReturnValue) == 0x000028, "Member 'BP_LootEvent_C_SpawnNPCs::CallFunc_NPCTypeEnumToClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_SpawnNPCs, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000030, "Member 'BP_LootEvent_C_SpawnNPCs::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_SpawnNPCs, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'BP_LootEvent_C_SpawnNPCs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_SpawnNPCs, CallFunc_SpawnActor_ReturnValue) == 0x000068, "Member 'BP_LootEvent_C_SpawnNPCs::CallFunc_SpawnActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_SpawnNPCs, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'BP_LootEvent_C_SpawnNPCs::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_LootEvent.BP_LootEvent_C.SpawnLootCrates
// 0x0060 (0x0060 - 0x0000)
struct BP_LootEvent_C_SpawnLootCrates final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_Array_Get_Item;                           // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LootEventCrate_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootEvent_C_SpawnLootCrates) == 0x000010, "Wrong alignment on BP_LootEvent_C_SpawnLootCrates");
static_assert(sizeof(BP_LootEvent_C_SpawnLootCrates) == 0x000060, "Wrong size on BP_LootEvent_C_SpawnLootCrates");
static_assert(offsetof(BP_LootEvent_C_SpawnLootCrates, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_LootEvent_C_SpawnLootCrates::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_SpawnLootCrates, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_LootEvent_C_SpawnLootCrates::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_SpawnLootCrates, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_LootEvent_C_SpawnLootCrates::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_SpawnLootCrates, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BP_LootEvent_C_SpawnLootCrates::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_SpawnLootCrates, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_LootEvent_C_SpawnLootCrates::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_SpawnLootCrates, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_LootEvent_C_SpawnLootCrates::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_SpawnLootCrates, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000048, "Member 'BP_LootEvent_C_SpawnLootCrates::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_SpawnLootCrates, CallFunc_FinishSpawningActor_ReturnValue) == 0x000050, "Member 'BP_LootEvent_C_SpawnLootCrates::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_LootEvent.BP_LootEvent_C.RegisterMapEntity
// 0x00A0 (0x00A0 - 0x0000)
struct BP_LootEvent_C_RegisterMapEntity final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantize                    K2Node_MakeStruct_Vector_NetQuantize;              // 0x0018(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAMapEntityPayload                    K2Node_MakeStruct_CAMapEntityPayload;              // 0x0028(0x0070)()
	int32                                         CallFunc_RegisterMapEntity_ReturnValue;            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootEvent_C_RegisterMapEntity) == 0x000008, "Wrong alignment on BP_LootEvent_C_RegisterMapEntity");
static_assert(sizeof(BP_LootEvent_C_RegisterMapEntity) == 0x0000A0, "Wrong size on BP_LootEvent_C_RegisterMapEntity");
static_assert(offsetof(BP_LootEvent_C_RegisterMapEntity, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'BP_LootEvent_C_RegisterMapEntity::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_RegisterMapEntity, CallFunc_BreakVector_X) == 0x00000C, "Member 'BP_LootEvent_C_RegisterMapEntity::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_RegisterMapEntity, CallFunc_BreakVector_Y) == 0x000010, "Member 'BP_LootEvent_C_RegisterMapEntity::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_RegisterMapEntity, CallFunc_BreakVector_Z) == 0x000014, "Member 'BP_LootEvent_C_RegisterMapEntity::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_RegisterMapEntity, K2Node_MakeStruct_Vector_NetQuantize) == 0x000018, "Member 'BP_LootEvent_C_RegisterMapEntity::K2Node_MakeStruct_Vector_NetQuantize' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_RegisterMapEntity, K2Node_MakeStruct_CAMapEntityPayload) == 0x000028, "Member 'BP_LootEvent_C_RegisterMapEntity::K2Node_MakeStruct_CAMapEntityPayload' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_RegisterMapEntity, CallFunc_RegisterMapEntity_ReturnValue) == 0x000098, "Member 'BP_LootEvent_C_RegisterMapEntity::CallFunc_RegisterMapEntity_ReturnValue' has a wrong offset!");

// Function BP_LootEvent.BP_LootEvent_C.ChangeIntelToAllPlayers
// 0x0050 (0x0050 - 0x0000)
struct BP_LootEvent_C_ChangeIntelToAllPlayers final
{
public:
	ECAInformationControlLevel                    IntelLevel;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAGameState*                           CallFunc_GetGameState_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACACharacter_MainPlayer*>        CallFunc_GetAllPlayers_ReturnValue;                // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCATeamID                              CallFunc_GetTeamID_ReturnValue;                    // 0x003C(0x0004)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FCATeamID>                      K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_LootEvent_C_ChangeIntelToAllPlayers) == 0x000008, "Wrong alignment on BP_LootEvent_C_ChangeIntelToAllPlayers");
static_assert(sizeof(BP_LootEvent_C_ChangeIntelToAllPlayers) == 0x000050, "Wrong size on BP_LootEvent_C_ChangeIntelToAllPlayers");
static_assert(offsetof(BP_LootEvent_C_ChangeIntelToAllPlayers, IntelLevel) == 0x000000, "Member 'BP_LootEvent_C_ChangeIntelToAllPlayers::IntelLevel' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ChangeIntelToAllPlayers, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_LootEvent_C_ChangeIntelToAllPlayers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ChangeIntelToAllPlayers, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_LootEvent_C_ChangeIntelToAllPlayers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ChangeIntelToAllPlayers, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_LootEvent_C_ChangeIntelToAllPlayers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ChangeIntelToAllPlayers, CallFunc_GetGameState_ReturnValue) == 0x000010, "Member 'BP_LootEvent_C_ChangeIntelToAllPlayers::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ChangeIntelToAllPlayers, CallFunc_GetAllPlayers_ReturnValue) == 0x000018, "Member 'BP_LootEvent_C_ChangeIntelToAllPlayers::CallFunc_GetAllPlayers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ChangeIntelToAllPlayers, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_LootEvent_C_ChangeIntelToAllPlayers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ChangeIntelToAllPlayers, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_LootEvent_C_ChangeIntelToAllPlayers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ChangeIntelToAllPlayers, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_LootEvent_C_ChangeIntelToAllPlayers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ChangeIntelToAllPlayers, CallFunc_GetTeamID_ReturnValue) == 0x00003C, "Member 'BP_LootEvent_C_ChangeIntelToAllPlayers::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ChangeIntelToAllPlayers, K2Node_MakeArray_Array) == 0x000040, "Member 'BP_LootEvent_C_ChangeIntelToAllPlayers::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_LootEvent.BP_LootEvent_C.SendPrimaryMessagingToPlayers
// 0x0001 (0x0001 - 0x0000)
struct BP_LootEvent_C_SendPrimaryMessagingToPlayers final
{
public:
	bool                                          Ended_;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LootEvent_C_SendPrimaryMessagingToPlayers) == 0x000001, "Wrong alignment on BP_LootEvent_C_SendPrimaryMessagingToPlayers");
static_assert(sizeof(BP_LootEvent_C_SendPrimaryMessagingToPlayers) == 0x000001, "Wrong size on BP_LootEvent_C_SendPrimaryMessagingToPlayers");
static_assert(offsetof(BP_LootEvent_C_SendPrimaryMessagingToPlayers, Ended_) == 0x000000, "Member 'BP_LootEvent_C_SendPrimaryMessagingToPlayers::Ended_' has a wrong offset!");

// Function BP_LootEvent.BP_LootEvent_C.ActivateSecurityArea
// 0x0068 (0x0068 - 0x0000)
struct BP_LootEvent_C_ActivateSecurityArea final
{
public:
	class UCAShipAIMissionManager*                Temp_object_Variable;                              // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetSecurityAreas_Areas;                   // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICASecurityModuleInterface> K2Node_DynamicCast_AsCASecurity_Module_Interface;  // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAShipAIMissionManager*                CallFunc_GetShipAIMissionManager_ReturnValue;      // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootEvent_C_ActivateSecurityArea) == 0x000008, "Wrong alignment on BP_LootEvent_C_ActivateSecurityArea");
static_assert(sizeof(BP_LootEvent_C_ActivateSecurityArea) == 0x000068, "Wrong size on BP_LootEvent_C_ActivateSecurityArea");
static_assert(offsetof(BP_LootEvent_C_ActivateSecurityArea, Temp_object_Variable) == 0x000000, "Member 'BP_LootEvent_C_ActivateSecurityArea::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ActivateSecurityArea, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_LootEvent_C_ActivateSecurityArea::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ActivateSecurityArea, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_LootEvent_C_ActivateSecurityArea::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ActivateSecurityArea, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_LootEvent_C_ActivateSecurityArea::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ActivateSecurityArea, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000014, "Member 'BP_LootEvent_C_ActivateSecurityArea::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ActivateSecurityArea, CallFunc_GetSecurityAreas_Areas) == 0x000020, "Member 'BP_LootEvent_C_ActivateSecurityArea::CallFunc_GetSecurityAreas_Areas' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ActivateSecurityArea, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_LootEvent_C_ActivateSecurityArea::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ActivateSecurityArea, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_LootEvent_C_ActivateSecurityArea::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ActivateSecurityArea, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_LootEvent_C_ActivateSecurityArea::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ActivateSecurityArea, K2Node_DynamicCast_AsCASecurity_Module_Interface) == 0x000048, "Member 'BP_LootEvent_C_ActivateSecurityArea::K2Node_DynamicCast_AsCASecurity_Module_Interface' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ActivateSecurityArea, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_LootEvent_C_ActivateSecurityArea::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LootEvent_C_ActivateSecurityArea, CallFunc_GetShipAIMissionManager_ReturnValue) == 0x000060, "Member 'BP_LootEvent_C_ActivateSecurityArea::CallFunc_GetShipAIMissionManager_ReturnValue' has a wrong offset!");

}

