#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LootEventCrate

#include "Basic.hpp"

#include "CAAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_LootEventCrate.BP_LootEventCrate_C.ExecuteUbergraph_BP_LootEventCrate
// 0x0098 (0x0098 - 0x0000)
struct BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0008(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0020(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_User_1;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_User;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x005C(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	class ABP_LootEvent_C*                        K2Node_DynamicCast_AsBP_Loot_Event;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x0080(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate) == 0x000008, "Wrong alignment on BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate");
static_assert(sizeof(BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate) == 0x000098, "Wrong size on BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate");
static_assert(offsetof(BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate, EntryPoint) == 0x000000, "Member 'BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate, Temp_bool_Has_Been_Initd_Variable_1) == 0x000005, "Member 'BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate, Temp_delegate_Variable) == 0x000008, "Member 'BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate, CallFunc_PlayEvent_playback_instance) == 0x000020, "Member 'BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate, CallFunc_PlayEvent_play_success) == 0x000030, "Member 'BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate, K2Node_ComponentBoundEvent_User_1) == 0x000038, "Member 'BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate::K2Node_ComponentBoundEvent_User_1' has a wrong offset!");
static_assert(offsetof(BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate, K2Node_ComponentBoundEvent_User) == 0x000040, "Member 'BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate::K2Node_ComponentBoundEvent_User' has a wrong offset!");
static_assert(offsetof(BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate, Temp_bool_IsClosed_Variable) == 0x000048, "Member 'BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x000050, "Member 'BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate, Temp_delegate_Variable_1) == 0x00005C, "Member 'BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate, K2Node_DynamicCast_AsBP_Loot_Event) == 0x000070, "Member 'BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate::K2Node_DynamicCast_AsBP_Loot_Event' has a wrong offset!");
static_assert(offsetof(BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate, CallFunc_PlayEvent_playback_instance_1) == 0x000080, "Member 'BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate, CallFunc_PlayEvent_play_success_1) == 0x000090, "Member 'BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate::CallFunc_PlayEvent_play_success_1' has a wrong offset!");
static_assert(offsetof(BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate, CallFunc_IsValid_ReturnValue) == 0x000091, "Member 'BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate, Temp_bool_IsClosed_Variable_1) == 0x000092, "Member 'BP_LootEventCrate_C_ExecuteUbergraph_BP_LootEventCrate::Temp_bool_IsClosed_Variable_1' has a wrong offset!");

// Function BP_LootEventCrate.BP_LootEventCrate_C.BndEvt__BPC_UseableGadgetBox_K2Node_ComponentBoundEvent_1_UseAbilityCompleted__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_LootEventCrate_C_BndEvt__BPC_UseableGadgetBox_K2Node_ComponentBoundEvent_1_UseAbilityCompleted__DelegateSignature final
{
public:
	class AActor*                                 User;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootEventCrate_C_BndEvt__BPC_UseableGadgetBox_K2Node_ComponentBoundEvent_1_UseAbilityCompleted__DelegateSignature) == 0x000008, "Wrong alignment on BP_LootEventCrate_C_BndEvt__BPC_UseableGadgetBox_K2Node_ComponentBoundEvent_1_UseAbilityCompleted__DelegateSignature");
static_assert(sizeof(BP_LootEventCrate_C_BndEvt__BPC_UseableGadgetBox_K2Node_ComponentBoundEvent_1_UseAbilityCompleted__DelegateSignature) == 0x000008, "Wrong size on BP_LootEventCrate_C_BndEvt__BPC_UseableGadgetBox_K2Node_ComponentBoundEvent_1_UseAbilityCompleted__DelegateSignature");
static_assert(offsetof(BP_LootEventCrate_C_BndEvt__BPC_UseableGadgetBox_K2Node_ComponentBoundEvent_1_UseAbilityCompleted__DelegateSignature, User) == 0x000000, "Member 'BP_LootEventCrate_C_BndEvt__BPC_UseableGadgetBox_K2Node_ComponentBoundEvent_1_UseAbilityCompleted__DelegateSignature::User' has a wrong offset!");

// Function BP_LootEventCrate.BP_LootEventCrate_C.BndEvt__BPC_UseableGadgetBox_K2Node_ComponentBoundEvent_0_UseAbilityActivated__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_LootEventCrate_C_BndEvt__BPC_UseableGadgetBox_K2Node_ComponentBoundEvent_0_UseAbilityActivated__DelegateSignature final
{
public:
	class AActor*                                 User;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootEventCrate_C_BndEvt__BPC_UseableGadgetBox_K2Node_ComponentBoundEvent_0_UseAbilityActivated__DelegateSignature) == 0x000008, "Wrong alignment on BP_LootEventCrate_C_BndEvt__BPC_UseableGadgetBox_K2Node_ComponentBoundEvent_0_UseAbilityActivated__DelegateSignature");
static_assert(sizeof(BP_LootEventCrate_C_BndEvt__BPC_UseableGadgetBox_K2Node_ComponentBoundEvent_0_UseAbilityActivated__DelegateSignature) == 0x000008, "Wrong size on BP_LootEventCrate_C_BndEvt__BPC_UseableGadgetBox_K2Node_ComponentBoundEvent_0_UseAbilityActivated__DelegateSignature");
static_assert(offsetof(BP_LootEventCrate_C_BndEvt__BPC_UseableGadgetBox_K2Node_ComponentBoundEvent_0_UseAbilityActivated__DelegateSignature, User) == 0x000000, "Member 'BP_LootEventCrate_C_BndEvt__BPC_UseableGadgetBox_K2Node_ComponentBoundEvent_0_UseAbilityActivated__DelegateSignature::User' has a wrong offset!");

// Function BP_LootEventCrate.BP_LootEventCrate_C.SetParent
// 0x0008 (0x0008 - 0x0000)
struct BP_LootEventCrate_C_SetParent final
{
public:
	class AActor*                                 NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LootEventCrate_C_SetParent) == 0x000008, "Wrong alignment on BP_LootEventCrate_C_SetParent");
static_assert(sizeof(BP_LootEventCrate_C_SetParent) == 0x000008, "Wrong size on BP_LootEventCrate_C_SetParent");
static_assert(offsetof(BP_LootEventCrate_C_SetParent, NewParam) == 0x000000, "Member 'BP_LootEventCrate_C_SetParent::NewParam' has a wrong offset!");

}

