#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MatchendFigure

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MatchendFigure.BP_MatchendFigure_C
// 0x0068 (0x0428 - 0x03C0)
class ABP_MatchendFigure_C final : public ACAFrontEndFigure
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   ChildActorCamera_WelcomeScreen;                    // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm_WelcomeScreen;                           // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActorCamera_CharacterParty;                   // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActorCamera_CharacterReadyUp;                 // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm_CharacterReadyUp;                        // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActorCamera_CharacterProfile;                 // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm_CharacterProfile;                        // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActorCamera_CollectionSpecialist;             // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm_CollectionSpecialist;                    // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActorCamera_Character;                        // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm_Character;                               // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_FrontendWeapon;                                 // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MatchendFigure(int32 EntryPoint);
	void BndEvt__BP_FrontendWeapon_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature(class UActorComponent* Component, bool bReset);
	void ReceiveBeginPlay();

	class UChildActorComponent* GetComponentForCameraWithName(const class FName Camera_name) const;
	void GetFigureMesh(class USkeletalMeshComponent** Skeleton) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MatchendFigure_C">();
	}
	static class ABP_MatchendFigure_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MatchendFigure_C>();
	}
};
static_assert(alignof(ABP_MatchendFigure_C) == 0x000008, "Wrong alignment on ABP_MatchendFigure_C");
static_assert(sizeof(ABP_MatchendFigure_C) == 0x000428, "Wrong size on ABP_MatchendFigure_C");
static_assert(offsetof(ABP_MatchendFigure_C, UberGraphFrame) == 0x0003C0, "Member 'ABP_MatchendFigure_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MatchendFigure_C, ChildActorCamera_WelcomeScreen) == 0x0003C8, "Member 'ABP_MatchendFigure_C::ChildActorCamera_WelcomeScreen' has a wrong offset!");
static_assert(offsetof(ABP_MatchendFigure_C, SpringArm_WelcomeScreen) == 0x0003D0, "Member 'ABP_MatchendFigure_C::SpringArm_WelcomeScreen' has a wrong offset!");
static_assert(offsetof(ABP_MatchendFigure_C, ChildActorCamera_CharacterParty) == 0x0003D8, "Member 'ABP_MatchendFigure_C::ChildActorCamera_CharacterParty' has a wrong offset!");
static_assert(offsetof(ABP_MatchendFigure_C, ChildActorCamera_CharacterReadyUp) == 0x0003E0, "Member 'ABP_MatchendFigure_C::ChildActorCamera_CharacterReadyUp' has a wrong offset!");
static_assert(offsetof(ABP_MatchendFigure_C, SpringArm_CharacterReadyUp) == 0x0003E8, "Member 'ABP_MatchendFigure_C::SpringArm_CharacterReadyUp' has a wrong offset!");
static_assert(offsetof(ABP_MatchendFigure_C, ChildActorCamera_CharacterProfile) == 0x0003F0, "Member 'ABP_MatchendFigure_C::ChildActorCamera_CharacterProfile' has a wrong offset!");
static_assert(offsetof(ABP_MatchendFigure_C, SpringArm_CharacterProfile) == 0x0003F8, "Member 'ABP_MatchendFigure_C::SpringArm_CharacterProfile' has a wrong offset!");
static_assert(offsetof(ABP_MatchendFigure_C, ChildActorCamera_CollectionSpecialist) == 0x000400, "Member 'ABP_MatchendFigure_C::ChildActorCamera_CollectionSpecialist' has a wrong offset!");
static_assert(offsetof(ABP_MatchendFigure_C, SpringArm_CollectionSpecialist) == 0x000408, "Member 'ABP_MatchendFigure_C::SpringArm_CollectionSpecialist' has a wrong offset!");
static_assert(offsetof(ABP_MatchendFigure_C, ChildActorCamera_Character) == 0x000410, "Member 'ABP_MatchendFigure_C::ChildActorCamera_Character' has a wrong offset!");
static_assert(offsetof(ABP_MatchendFigure_C, SpringArm_Character) == 0x000418, "Member 'ABP_MatchendFigure_C::SpringArm_Character' has a wrong offset!");
static_assert(offsetof(ABP_MatchendFigure_C, BP_FrontendWeapon) == 0x000420, "Member 'ABP_MatchendFigure_C::BP_FrontendWeapon' has a wrong offset!");

}

