#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MuzzleEffect_Drone_SMG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CAAudio_structs.hpp"
#include "Keaton_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MuzzleEffect_Drone_SMG.BP_MuzzleEffect_Drone_SMG_C
// 0x0038 (0x0348 - 0x0310)
class ABP_MuzzleEffect_Drone_SMG_C final : public ACAMuzzleEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCAAudioComponent*                      CAAudioChargePortalling;                           // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SpawnedChargeVFX;                                  // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         ChargeVFX;                                         // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               ChargePlaybackInstance;                            // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG(int32 EntryPoint);
	void OnEndCharging();
	void OnStartCharging(float Duration);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MuzzleEffect_Drone_SMG_C">();
	}
	static class ABP_MuzzleEffect_Drone_SMG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MuzzleEffect_Drone_SMG_C>();
	}
};
static_assert(alignof(ABP_MuzzleEffect_Drone_SMG_C) == 0x000008, "Wrong alignment on ABP_MuzzleEffect_Drone_SMG_C");
static_assert(sizeof(ABP_MuzzleEffect_Drone_SMG_C) == 0x000348, "Wrong size on ABP_MuzzleEffect_Drone_SMG_C");
static_assert(offsetof(ABP_MuzzleEffect_Drone_SMG_C, UberGraphFrame) == 0x000310, "Member 'ABP_MuzzleEffect_Drone_SMG_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MuzzleEffect_Drone_SMG_C, CAAudioChargePortalling) == 0x000318, "Member 'ABP_MuzzleEffect_Drone_SMG_C::CAAudioChargePortalling' has a wrong offset!");
static_assert(offsetof(ABP_MuzzleEffect_Drone_SMG_C, DefaultSceneRoot) == 0x000320, "Member 'ABP_MuzzleEffect_Drone_SMG_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_MuzzleEffect_Drone_SMG_C, SpawnedChargeVFX) == 0x000328, "Member 'ABP_MuzzleEffect_Drone_SMG_C::SpawnedChargeVFX' has a wrong offset!");
static_assert(offsetof(ABP_MuzzleEffect_Drone_SMG_C, ChargeVFX) == 0x000330, "Member 'ABP_MuzzleEffect_Drone_SMG_C::ChargeVFX' has a wrong offset!");
static_assert(offsetof(ABP_MuzzleEffect_Drone_SMG_C, ChargePlaybackInstance) == 0x000338, "Member 'ABP_MuzzleEffect_Drone_SMG_C::ChargePlaybackInstance' has a wrong offset!");

}

