#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MuzzleEffect_NPC_Turret

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MuzzleEffect_NPC_Turret.BP_MuzzleEffect_NPC_Turret_C
// 0x0030 (0x0340 - 0x0310)
class ABP_MuzzleEffect_NPC_Turret_C final : public ACAMuzzleEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ChargingSystem;                                    // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AUDIO_HasStartedCharging;                          // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      Turret_Charge_System;                              // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDead;                                            // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_MuzzleEffect_NPC_Turret(int32 EntryPoint);
	void SFXChargeUp();
	void BindOnDeathAfterDelay();
	void NPCCharacterDeathDelegate(class ACACharacter* Character, const struct FGameplayEffectSpec& Death_gameplay_effect_spec, float Damage_magnitude, const struct FNetworkedHit& Networked_hit, const class AActor* Killer);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void OnEndCharging();
	void OnStartCharging(float Duration);
	void OnCharging(float Charge_value);
	void OnFire();
	void OnEquip();
	void OnReload();
	void OnIdle();
	void OnSecondaryAction();
	void OnPrimaryAction();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MuzzleEffect_NPC_Turret_C">();
	}
	static class ABP_MuzzleEffect_NPC_Turret_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MuzzleEffect_NPC_Turret_C>();
	}
};
static_assert(alignof(ABP_MuzzleEffect_NPC_Turret_C) == 0x000008, "Wrong alignment on ABP_MuzzleEffect_NPC_Turret_C");
static_assert(sizeof(ABP_MuzzleEffect_NPC_Turret_C) == 0x000340, "Wrong size on ABP_MuzzleEffect_NPC_Turret_C");
static_assert(offsetof(ABP_MuzzleEffect_NPC_Turret_C, UberGraphFrame) == 0x000310, "Member 'ABP_MuzzleEffect_NPC_Turret_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MuzzleEffect_NPC_Turret_C, DefaultSceneRoot) == 0x000318, "Member 'ABP_MuzzleEffect_NPC_Turret_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_MuzzleEffect_NPC_Turret_C, ChargingSystem) == 0x000320, "Member 'ABP_MuzzleEffect_NPC_Turret_C::ChargingSystem' has a wrong offset!");
static_assert(offsetof(ABP_MuzzleEffect_NPC_Turret_C, AUDIO_HasStartedCharging) == 0x000328, "Member 'ABP_MuzzleEffect_NPC_Turret_C::AUDIO_HasStartedCharging' has a wrong offset!");
static_assert(offsetof(ABP_MuzzleEffect_NPC_Turret_C, Turret_Charge_System) == 0x000330, "Member 'ABP_MuzzleEffect_NPC_Turret_C::Turret_Charge_System' has a wrong offset!");
static_assert(offsetof(ABP_MuzzleEffect_NPC_Turret_C, IsDead) == 0x000338, "Member 'ABP_MuzzleEffect_NPC_Turret_C::IsDead' has a wrong offset!");

}

