#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MuzzleEffect_GruntRocketeer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MuzzleEffect_GruntRocketeer.BP_MuzzleEffect_GruntRocketeer_C
// 0x0020 (0x0330 - 0x0310)
class ABP_MuzzleEffect_GruntRocketeer_C final : public ACAMuzzleEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCAAudioComponent*                      CAAudio_RocketeerMuzzlePortalling;                 // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Rocketeer_Projectile_Charge;                    // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MuzzleEffect_GruntRocketeer(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnPrimaryAction();
	void OnSecondaryAction();
	void OnEndCharging();
	void OnStartCharging(float Duration);
	void OnFire();
	void OnEquip();
	void OnReload();
	void OnIdle();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MuzzleEffect_GruntRocketeer_C">();
	}
	static class ABP_MuzzleEffect_GruntRocketeer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MuzzleEffect_GruntRocketeer_C>();
	}
};
static_assert(alignof(ABP_MuzzleEffect_GruntRocketeer_C) == 0x000008, "Wrong alignment on ABP_MuzzleEffect_GruntRocketeer_C");
static_assert(sizeof(ABP_MuzzleEffect_GruntRocketeer_C) == 0x000330, "Wrong size on ABP_MuzzleEffect_GruntRocketeer_C");
static_assert(offsetof(ABP_MuzzleEffect_GruntRocketeer_C, UberGraphFrame) == 0x000310, "Member 'ABP_MuzzleEffect_GruntRocketeer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MuzzleEffect_GruntRocketeer_C, CAAudio_RocketeerMuzzlePortalling) == 0x000318, "Member 'ABP_MuzzleEffect_GruntRocketeer_C::CAAudio_RocketeerMuzzlePortalling' has a wrong offset!");
static_assert(offsetof(ABP_MuzzleEffect_GruntRocketeer_C, NS_Rocketeer_Projectile_Charge) == 0x000320, "Member 'ABP_MuzzleEffect_GruntRocketeer_C::NS_Rocketeer_Projectile_Charge' has a wrong offset!");
static_assert(offsetof(ABP_MuzzleEffect_GruntRocketeer_C, DefaultSceneRoot) == 0x000328, "Member 'ABP_MuzzleEffect_GruntRocketeer_C::DefaultSceneRoot' has a wrong offset!");

}

