#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MuzzleEffect_Elite_Pulse_Laser

#include "Basic.hpp"

#include "CAAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_MuzzleEffect_Elite_Pulse_Laser.BP_MuzzleEffect_Elite_Pulse_Laser_C.ExecuteUbergraph_BP_MuzzleEffect_Elite_Pulse_Laser
// 0x0060 (0x0060 - 0x0000)
struct BP_MuzzleEffect_Elite_Pulse_Laser_C_ExecuteUbergraph_BP_MuzzleEffect_Elite_Pulse_Laser final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0004(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0018(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetMuzzleMeshComponent_ReturnValue;       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_duration;                             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MuzzleEffect_Elite_Pulse_Laser_C_ExecuteUbergraph_BP_MuzzleEffect_Elite_Pulse_Laser) == 0x000008, "Wrong alignment on BP_MuzzleEffect_Elite_Pulse_Laser_C_ExecuteUbergraph_BP_MuzzleEffect_Elite_Pulse_Laser");
static_assert(sizeof(BP_MuzzleEffect_Elite_Pulse_Laser_C_ExecuteUbergraph_BP_MuzzleEffect_Elite_Pulse_Laser) == 0x000060, "Wrong size on BP_MuzzleEffect_Elite_Pulse_Laser_C_ExecuteUbergraph_BP_MuzzleEffect_Elite_Pulse_Laser");
static_assert(offsetof(BP_MuzzleEffect_Elite_Pulse_Laser_C_ExecuteUbergraph_BP_MuzzleEffect_Elite_Pulse_Laser, EntryPoint) == 0x000000, "Member 'BP_MuzzleEffect_Elite_Pulse_Laser_C_ExecuteUbergraph_BP_MuzzleEffect_Elite_Pulse_Laser::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MuzzleEffect_Elite_Pulse_Laser_C_ExecuteUbergraph_BP_MuzzleEffect_Elite_Pulse_Laser, Temp_delegate_Variable) == 0x000004, "Member 'BP_MuzzleEffect_Elite_Pulse_Laser_C_ExecuteUbergraph_BP_MuzzleEffect_Elite_Pulse_Laser::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_MuzzleEffect_Elite_Pulse_Laser_C_ExecuteUbergraph_BP_MuzzleEffect_Elite_Pulse_Laser, CallFunc_PlayEvent_playback_instance) == 0x000018, "Member 'BP_MuzzleEffect_Elite_Pulse_Laser_C_ExecuteUbergraph_BP_MuzzleEffect_Elite_Pulse_Laser::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_MuzzleEffect_Elite_Pulse_Laser_C_ExecuteUbergraph_BP_MuzzleEffect_Elite_Pulse_Laser, CallFunc_PlayEvent_play_success) == 0x000028, "Member 'BP_MuzzleEffect_Elite_Pulse_Laser_C_ExecuteUbergraph_BP_MuzzleEffect_Elite_Pulse_Laser::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(BP_MuzzleEffect_Elite_Pulse_Laser_C_ExecuteUbergraph_BP_MuzzleEffect_Elite_Pulse_Laser, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'BP_MuzzleEffect_Elite_Pulse_Laser_C_ExecuteUbergraph_BP_MuzzleEffect_Elite_Pulse_Laser::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MuzzleEffect_Elite_Pulse_Laser_C_ExecuteUbergraph_BP_MuzzleEffect_Elite_Pulse_Laser, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_MuzzleEffect_Elite_Pulse_Laser_C_ExecuteUbergraph_BP_MuzzleEffect_Elite_Pulse_Laser::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MuzzleEffect_Elite_Pulse_Laser_C_ExecuteUbergraph_BP_MuzzleEffect_Elite_Pulse_Laser, CallFunc_GetMuzzleMeshComponent_ReturnValue) == 0x000048, "Member 'BP_MuzzleEffect_Elite_Pulse_Laser_C_ExecuteUbergraph_BP_MuzzleEffect_Elite_Pulse_Laser::CallFunc_GetMuzzleMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MuzzleEffect_Elite_Pulse_Laser_C_ExecuteUbergraph_BP_MuzzleEffect_Elite_Pulse_Laser, K2Node_Event_duration) == 0x000050, "Member 'BP_MuzzleEffect_Elite_Pulse_Laser_C_ExecuteUbergraph_BP_MuzzleEffect_Elite_Pulse_Laser::K2Node_Event_duration' has a wrong offset!");
static_assert(offsetof(BP_MuzzleEffect_Elite_Pulse_Laser_C_ExecuteUbergraph_BP_MuzzleEffect_Elite_Pulse_Laser, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000054, "Member 'BP_MuzzleEffect_Elite_Pulse_Laser_C_ExecuteUbergraph_BP_MuzzleEffect_Elite_Pulse_Laser::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MuzzleEffect_Elite_Pulse_Laser_C_ExecuteUbergraph_BP_MuzzleEffect_Elite_Pulse_Laser, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000058, "Member 'BP_MuzzleEffect_Elite_Pulse_Laser_C_ExecuteUbergraph_BP_MuzzleEffect_Elite_Pulse_Laser::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function BP_MuzzleEffect_Elite_Pulse_Laser.BP_MuzzleEffect_Elite_Pulse_Laser_C.OnStartCharging
// 0x0004 (0x0004 - 0x0000)
struct BP_MuzzleEffect_Elite_Pulse_Laser_C_OnStartCharging final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MuzzleEffect_Elite_Pulse_Laser_C_OnStartCharging) == 0x000004, "Wrong alignment on BP_MuzzleEffect_Elite_Pulse_Laser_C_OnStartCharging");
static_assert(sizeof(BP_MuzzleEffect_Elite_Pulse_Laser_C_OnStartCharging) == 0x000004, "Wrong size on BP_MuzzleEffect_Elite_Pulse_Laser_C_OnStartCharging");
static_assert(offsetof(BP_MuzzleEffect_Elite_Pulse_Laser_C_OnStartCharging, Duration) == 0x000000, "Member 'BP_MuzzleEffect_Elite_Pulse_Laser_C_OnStartCharging::Duration' has a wrong offset!");

}

