#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MatchmakingProxy

#include "Basic.hpp"

#include "OnlineSubsystemUtils_structs.hpp"
#include "Keaton_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_MatchmakingProxy.BP_MatchmakingProxy_C.OnFailure_8EBE7AB14B3CA5BB3FDDC69F76AE8515
// 0x0010 (0x0010 - 0x0000)
struct BP_MatchmakingProxy_C_OnFailure_8EBE7AB14B3CA5BB3FDDC69F76AE8515 final
{
public:
	TArray<struct FBlueprintSessionResult>        Results;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_MatchmakingProxy_C_OnFailure_8EBE7AB14B3CA5BB3FDDC69F76AE8515) == 0x000008, "Wrong alignment on BP_MatchmakingProxy_C_OnFailure_8EBE7AB14B3CA5BB3FDDC69F76AE8515");
static_assert(sizeof(BP_MatchmakingProxy_C_OnFailure_8EBE7AB14B3CA5BB3FDDC69F76AE8515) == 0x000010, "Wrong size on BP_MatchmakingProxy_C_OnFailure_8EBE7AB14B3CA5BB3FDDC69F76AE8515");
static_assert(offsetof(BP_MatchmakingProxy_C_OnFailure_8EBE7AB14B3CA5BB3FDDC69F76AE8515, Results) == 0x000000, "Member 'BP_MatchmakingProxy_C_OnFailure_8EBE7AB14B3CA5BB3FDDC69F76AE8515::Results' has a wrong offset!");

// Function BP_MatchmakingProxy.BP_MatchmakingProxy_C.OnSuccess_8EBE7AB14B3CA5BB3FDDC69F76AE8515
// 0x0010 (0x0010 - 0x0000)
struct BP_MatchmakingProxy_C_OnSuccess_8EBE7AB14B3CA5BB3FDDC69F76AE8515 final
{
public:
	TArray<struct FBlueprintSessionResult>        Results;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_MatchmakingProxy_C_OnSuccess_8EBE7AB14B3CA5BB3FDDC69F76AE8515) == 0x000008, "Wrong alignment on BP_MatchmakingProxy_C_OnSuccess_8EBE7AB14B3CA5BB3FDDC69F76AE8515");
static_assert(sizeof(BP_MatchmakingProxy_C_OnSuccess_8EBE7AB14B3CA5BB3FDDC69F76AE8515) == 0x000010, "Wrong size on BP_MatchmakingProxy_C_OnSuccess_8EBE7AB14B3CA5BB3FDDC69F76AE8515");
static_assert(offsetof(BP_MatchmakingProxy_C_OnSuccess_8EBE7AB14B3CA5BB3FDDC69F76AE8515, Results) == 0x000000, "Member 'BP_MatchmakingProxy_C_OnSuccess_8EBE7AB14B3CA5BB3FDDC69F76AE8515::Results' has a wrong offset!");

// Function BP_MatchmakingProxy.BP_MatchmakingProxy_C.JoinSession
// 0x0108 (0x0108 - 0x0000)
struct BP_MatchmakingProxy_C_JoinSession final
{
public:
	struct FBlueprintSessionResult                Session;                                           // 0x0000(0x0108)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_MatchmakingProxy_C_JoinSession) == 0x000008, "Wrong alignment on BP_MatchmakingProxy_C_JoinSession");
static_assert(sizeof(BP_MatchmakingProxy_C_JoinSession) == 0x000108, "Wrong size on BP_MatchmakingProxy_C_JoinSession");
static_assert(offsetof(BP_MatchmakingProxy_C_JoinSession, Session) == 0x000000, "Member 'BP_MatchmakingProxy_C_JoinSession::Session' has a wrong offset!");

// Function BP_MatchmakingProxy.BP_MatchmakingProxy_C.OnServicesErrorCancelMM
// 0x0080 (0x0080 - 0x0000)
struct BP_MatchmakingProxy_C_OnServicesErrorCancelMM final
{
public:
	struct FCAUIEventData                         Event_data;                                        // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_MatchmakingProxy_C_OnServicesErrorCancelMM) == 0x000008, "Wrong alignment on BP_MatchmakingProxy_C_OnServicesErrorCancelMM");
static_assert(sizeof(BP_MatchmakingProxy_C_OnServicesErrorCancelMM) == 0x000080, "Wrong size on BP_MatchmakingProxy_C_OnServicesErrorCancelMM");
static_assert(offsetof(BP_MatchmakingProxy_C_OnServicesErrorCancelMM, Event_data) == 0x000000, "Member 'BP_MatchmakingProxy_C_OnServicesErrorCancelMM::Event_data' has a wrong offset!");

// Function BP_MatchmakingProxy.BP_MatchmakingProxy_C.MatchMakeQueue
// 0x0010 (0x0010 - 0x0000)
struct BP_MatchmakingProxy_C_MatchMakeQueue final
{
public:
	class FString                                 Queue_name_0;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MatchmakingProxy_C_MatchMakeQueue) == 0x000008, "Wrong alignment on BP_MatchmakingProxy_C_MatchMakeQueue");
static_assert(sizeof(BP_MatchmakingProxy_C_MatchMakeQueue) == 0x000010, "Wrong size on BP_MatchmakingProxy_C_MatchMakeQueue");
static_assert(offsetof(BP_MatchmakingProxy_C_MatchMakeQueue, Queue_name_0) == 0x000000, "Member 'BP_MatchmakingProxy_C_MatchMakeQueue::Queue_name_0' has a wrong offset!");

// Function BP_MatchmakingProxy.BP_MatchmakingProxy_C.LoadFlyThrough
// 0x0001 (0x0001 - 0x0000)
struct BP_MatchmakingProxy_C_LoadFlyThrough final
{
public:
	bool                                          Launch_in_editor;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MatchmakingProxy_C_LoadFlyThrough) == 0x000001, "Wrong alignment on BP_MatchmakingProxy_C_LoadFlyThrough");
static_assert(sizeof(BP_MatchmakingProxy_C_LoadFlyThrough) == 0x000001, "Wrong size on BP_MatchmakingProxy_C_LoadFlyThrough");
static_assert(offsetof(BP_MatchmakingProxy_C_LoadFlyThrough, Launch_in_editor) == 0x000000, "Member 'BP_MatchmakingProxy_C_LoadFlyThrough::Launch_in_editor' has a wrong offset!");

// Function BP_MatchmakingProxy.BP_MatchmakingProxy_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_MatchmakingProxy_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MatchmakingProxy_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_MatchmakingProxy_C_ReceiveEndPlay");
static_assert(sizeof(BP_MatchmakingProxy_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_MatchmakingProxy_C_ReceiveEndPlay");
static_assert(offsetof(BP_MatchmakingProxy_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_MatchmakingProxy_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_MatchmakingProxy.BP_MatchmakingProxy_C.ExecuteUbergraph_BP_MatchmakingProxy
// 0x0560 (0x0560 - 0x0000)
struct BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBlueprintSessionResult>        Temp_struct_Variable;                              // 0x0008(0x0010)(ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0054(0x0014)(ZeroConstructor, NoDestructor)
	class UCACancelMatchmakingAsyncAction*        CallFunc_CancelMatchmaking_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0088(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0108(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x011C(0x0014)(ZeroConstructor, NoDestructor)
	TArray<struct FBlueprintSessionResult>        K2Node_CustomEvent_Results;                        // 0x0130(0x0010)(ConstParm, ReferenceParm)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFindSessionsCallbackProxy*             CallFunc_FindSessions_ReturnValue;                 // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0168(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01A8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01E8(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x01F8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0208(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0220(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FBlueprintSessionResult                K2Node_CustomEvent_session;                        // 0x0258(0x0108)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJoinSessionCallbackProxy*              CallFunc_JoinSession_ReturnValue;                  // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_372[0x6];                                      // 0x0372(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0378(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TArray<struct FBlueprintSessionResult>& Results)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x038C(0x0014)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_TimeSecondsToString_ReturnValue;          // 0x03A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsUserInParty_ReturnValue;             // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_LeftChop_ReturnValue;                     // 0x03C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x03D8(0x0018)()
	bool                                          CallFunc_GetIsUserInParty_ReturnValue_1;           // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x03F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsUserAloneInParty_ReturnValue;        // 0x03F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsUserAloneInParty_ReturnValue_1;      // 0x03F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x03F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x03F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F6[0x2];                                      // 0x03F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x03F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasFakeMatchmakingCmdLine_ReturnValue;    // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasFakeMatchmakingCmdLine_ReturnValue_1;  // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_402[0x6];                                      // 0x0402(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x0408(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetFakeMatchmakingIP_ip;                  // 0x0410(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFakeMatchmakingIP_ReturnValue;         // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0428(0x0018)()
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_2;                // 0x0440(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAUIEventData& Event_data)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x044C(0x0014)(ZeroConstructor, NoDestructor)
	struct FCAUIEventData                         K2Node_CustomEvent_event_data;                     // 0x0460(0x0080)()
	TDelegate<void(const struct FCAUIEventData& Event_data)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x04E0(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4F4[0x4];                                      // 0x04F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_queue_name;                     // 0x04F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCAEnterMatchmakingJob*                 CallFunc_EnterMatchmaking_ReturnValue;             // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_launch_in_editor;               // 0x0511(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_512[0x6];                                      // 0x0512(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBlueprintSessionResult>        K2Node_CustomEvent_Results_1;                      // 0x0520(0x0010)(ConstParm, ReferenceParm)
	class UCAGameInstance*                        K2Node_DynamicCast_AsCAGame_Instance;              // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_3;                // 0x0540(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TArray<struct FBlueprintSessionResult>& Results)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0548(0x0014)(ZeroConstructor, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x055C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnrollmentComplete_ReturnValue;         // 0x055D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy) == 0x000008, "Wrong alignment on BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy");
static_assert(sizeof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy) == 0x000560, "Wrong size on BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, EntryPoint) == 0x000000, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, Temp_struct_Variable) == 0x000008, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, K2Node_CreateDelegate_OutputDelegate_2) == 0x000040, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, K2Node_CreateDelegate_OutputDelegate_3) == 0x000054, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_CancelMatchmaking_ReturnValue) == 0x000068, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_CancelMatchmaking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, K2Node_MakeStruct_FormatArgumentData) == 0x000088, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, K2Node_MakeArray_Array) == 0x0000C8, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_IsValid_ReturnValue) == 0x0000D8, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_Conv_TextToString_ReturnValue) == 0x0000F8, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, K2Node_CreateDelegate_OutputDelegate_4) == 0x000108, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, K2Node_CreateDelegate_OutputDelegate_5) == 0x00011C, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, K2Node_CustomEvent_Results) == 0x000130, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::K2Node_CustomEvent_Results' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_Conv_StringToName_ReturnValue) == 0x000140, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_IsDedicatedServer_ReturnValue) == 0x00014C, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_GetPlayerController_ReturnValue) == 0x000150, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_FindSessions_ReturnValue) == 0x000158, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_FindSessions_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_IsValid_ReturnValue_1) == 0x000160, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, K2Node_MakeStruct_FormatArgumentData_1) == 0x000168, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, K2Node_MakeStruct_FormatArgumentData_2) == 0x0001A8, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, K2Node_MakeArray_Array_1) == 0x0001E8, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, K2Node_MakeArray_Array_2) == 0x0001F8, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_Format_ReturnValue_1) == 0x000208, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_Format_ReturnValue_2) == 0x000220, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000238, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000248, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, K2Node_CustomEvent_session) == 0x000258, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::K2Node_CustomEvent_session' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_GetPlayerController_ReturnValue_1) == 0x000360, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_JoinSession_ReturnValue) == 0x000368, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_JoinSession_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_Contains_ReturnValue) == 0x000370, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_IsValid_ReturnValue_2) == 0x000371, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_Concat_StrStr_ReturnValue) == 0x000378, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000388, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, K2Node_CreateDelegate_OutputDelegate_6) == 0x00038C, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0003A0, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_TimeSecondsToString_ReturnValue) == 0x0003A8, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_TimeSecondsToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_GetIsUserInParty_ReturnValue) == 0x0003B8, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_GetIsUserInParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_LeftChop_ReturnValue) == 0x0003C0, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_LeftChop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_Not_PreBool_ReturnValue) == 0x0003D0, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0003D8, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_GetIsUserInParty_ReturnValue_1) == 0x0003F0, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_GetIsUserInParty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_Not_PreBool_ReturnValue_1) == 0x0003F1, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_GetIsUserAloneInParty_ReturnValue) == 0x0003F2, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_GetIsUserAloneInParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_GetIsUserAloneInParty_ReturnValue_1) == 0x0003F3, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_GetIsUserAloneInParty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_BooleanOR_ReturnValue) == 0x0003F4, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_BooleanOR_ReturnValue_1) == 0x0003F5, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_K2_SetTimer_ReturnValue) == 0x0003F8, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_HasFakeMatchmakingCmdLine_ReturnValue) == 0x000400, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_HasFakeMatchmakingCmdLine_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_HasFakeMatchmakingCmdLine_ReturnValue_1) == 0x000401, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_HasFakeMatchmakingCmdLine_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_K2_SetTimer_ReturnValue_1) == 0x000408, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_K2_SetTimer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_GetFakeMatchmakingIP_ip) == 0x000410, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_GetFakeMatchmakingIP_ip' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_GetFakeMatchmakingIP_ReturnValue) == 0x000420, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_GetFakeMatchmakingIP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_MakeLiteralText_ReturnValue) == 0x000428, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_K2_SetTimer_ReturnValue_2) == 0x000440, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_K2_SetTimer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x000448, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, K2Node_CreateDelegate_OutputDelegate_7) == 0x00044C, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, K2Node_CustomEvent_event_data) == 0x000460, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::K2Node_CustomEvent_event_data' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, K2Node_CreateDelegate_OutputDelegate_8) == 0x0004E0, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, K2Node_CustomEvent_queue_name) == 0x0004F8, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::K2Node_CustomEvent_queue_name' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_EnterMatchmaking_ReturnValue) == 0x000508, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_EnterMatchmaking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_IsValid_ReturnValue_3) == 0x000510, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, K2Node_CustomEvent_launch_in_editor) == 0x000511, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::K2Node_CustomEvent_launch_in_editor' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_GetGameInstance_ReturnValue) == 0x000518, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, K2Node_CustomEvent_Results_1) == 0x000520, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::K2Node_CustomEvent_Results_1' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, K2Node_DynamicCast_AsCAGame_Instance) == 0x000530, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::K2Node_DynamicCast_AsCAGame_Instance' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, K2Node_DynamicCast_bSuccess) == 0x000538, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_K2_SetTimer_ReturnValue_3) == 0x000540, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_K2_SetTimer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, K2Node_CreateDelegate_OutputDelegate_9) == 0x000548, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, K2Node_Event_EndPlayReason) == 0x00055C, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy, CallFunc_IsEnrollmentComplete_ReturnValue) == 0x00055D, "Member 'BP_MatchmakingProxy_C_ExecuteUbergraph_BP_MatchmakingProxy::CallFunc_IsEnrollmentComplete_ReturnValue' has a wrong offset!");

// Function BP_MatchmakingProxy.BP_MatchmakingProxy_C.MatchMakingCancelled__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_MatchmakingProxy_C_MatchMakingCancelled__DelegateSignature final
{
public:
	bool                                          Results;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MatchmakingProxy_C_MatchMakingCancelled__DelegateSignature) == 0x000001, "Wrong alignment on BP_MatchmakingProxy_C_MatchMakingCancelled__DelegateSignature");
static_assert(sizeof(BP_MatchmakingProxy_C_MatchMakingCancelled__DelegateSignature) == 0x000001, "Wrong size on BP_MatchmakingProxy_C_MatchMakingCancelled__DelegateSignature");
static_assert(offsetof(BP_MatchmakingProxy_C_MatchMakingCancelled__DelegateSignature, Results) == 0x000000, "Member 'BP_MatchmakingProxy_C_MatchMakingCancelled__DelegateSignature::Results' has a wrong offset!");

// Function BP_MatchmakingProxy.BP_MatchmakingProxy_C.SessionsRefreshed__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_MatchmakingProxy_C_SessionsRefreshed__DelegateSignature final
{
public:
	bool                                          Results;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBlueprintSessionResult>        Sessions_0;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_MatchmakingProxy_C_SessionsRefreshed__DelegateSignature) == 0x000008, "Wrong alignment on BP_MatchmakingProxy_C_SessionsRefreshed__DelegateSignature");
static_assert(sizeof(BP_MatchmakingProxy_C_SessionsRefreshed__DelegateSignature) == 0x000018, "Wrong size on BP_MatchmakingProxy_C_SessionsRefreshed__DelegateSignature");
static_assert(offsetof(BP_MatchmakingProxy_C_SessionsRefreshed__DelegateSignature, Results) == 0x000000, "Member 'BP_MatchmakingProxy_C_SessionsRefreshed__DelegateSignature::Results' has a wrong offset!");
static_assert(offsetof(BP_MatchmakingProxy_C_SessionsRefreshed__DelegateSignature, Sessions_0) == 0x000008, "Member 'BP_MatchmakingProxy_C_SessionsRefreshed__DelegateSignature::Sessions_0' has a wrong offset!");

}

