#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MatchmakingProxy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OnlineSubsystemUtils_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MatchmakingProxy.BP_MatchmakingProxy_C
// 0x0090 (0x01E8 - 0x0158)
class UBP_MatchmakingProxy_C final : public UCAMatchmakerProxy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0158(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FString                                 Ip_address;                                        // 0x0160(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             SessionsRefreshed;                                 // 0x0170(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FBlueprintSessionResult>        Sessions;                                          // 0x0180(0x0010)(Edit, BlueprintVisible)
	class FText                                   Level_name;                                        // 0x0190(0x0018)(Edit, BlueprintVisible)
	class FText                                   build_config;                                      // 0x01A8(0x0018)(Edit, BlueprintVisible)
	float                                         Matchmaking_start_time;                            // 0x01C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             MatchMakingCancelled;                              // 0x01C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FString                                 Queue_name;                                        // 0x01D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void OnFailure_8EBE7AB14B3CA5BB3FDDC69F76AE8515(const TArray<struct FBlueprintSessionResult>& Results);
	void OnSuccess_8EBE7AB14B3CA5BB3FDDC69F76AE8515(const TArray<struct FBlueprintSessionResult>& Results);
	void OnFailure_AF54FDED4D37AEB76C0F89B9E967378A();
	void OnSuccess_AF54FDED4D37AEB76C0F89B9E967378A();
	void CancelFailed_F589E72D45E34A10F876868FC903B28B();
	void CancelComplete_F589E72D45E34A10F876868FC903B28B();
	void RequestFailed_E5FEE9DC446A19C39414549D7C74E0A1();
	void RequestSucceeded_E5FEE9DC446A19C39414549D7C74E0A1();
	void ConnectToLocalServer();
	void RefreshSessions();
	void ReceiveBeginPlay();
	void JoinSession(const struct FBlueprintSessionResult& Session);
	void OnSetMatchmakingTimer();
	void CancelMatchmake();
	void ClearMatchmakingTimer();
	void StartMatchmakingTimer();
	void OnServicesErrorCancelMM(const struct FCAUIEventData& Event_data);
	void MatchMakeQueue(const class FString& Queue_name_0);
	void LoadFlyThrough(bool Launch_in_editor);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void LaunchLocalServer();
	void ExecuteUbergraph_BP_MatchmakingProxy(int32 EntryPoint);
	void MatchMakingCancelled__DelegateSignature(bool Results);
	void SessionsRefreshed__DelegateSignature(bool Results, TArray<struct FBlueprintSessionResult>& Sessions_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MatchmakingProxy_C">();
	}
	static class UBP_MatchmakingProxy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MatchmakingProxy_C>();
	}
};
static_assert(alignof(UBP_MatchmakingProxy_C) == 0x000008, "Wrong alignment on UBP_MatchmakingProxy_C");
static_assert(sizeof(UBP_MatchmakingProxy_C) == 0x0001E8, "Wrong size on UBP_MatchmakingProxy_C");
static_assert(offsetof(UBP_MatchmakingProxy_C, UberGraphFrame) == 0x000158, "Member 'UBP_MatchmakingProxy_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_MatchmakingProxy_C, Ip_address) == 0x000160, "Member 'UBP_MatchmakingProxy_C::Ip_address' has a wrong offset!");
static_assert(offsetof(UBP_MatchmakingProxy_C, SessionsRefreshed) == 0x000170, "Member 'UBP_MatchmakingProxy_C::SessionsRefreshed' has a wrong offset!");
static_assert(offsetof(UBP_MatchmakingProxy_C, Sessions) == 0x000180, "Member 'UBP_MatchmakingProxy_C::Sessions' has a wrong offset!");
static_assert(offsetof(UBP_MatchmakingProxy_C, Level_name) == 0x000190, "Member 'UBP_MatchmakingProxy_C::Level_name' has a wrong offset!");
static_assert(offsetof(UBP_MatchmakingProxy_C, build_config) == 0x0001A8, "Member 'UBP_MatchmakingProxy_C::build_config' has a wrong offset!");
static_assert(offsetof(UBP_MatchmakingProxy_C, Matchmaking_start_time) == 0x0001C0, "Member 'UBP_MatchmakingProxy_C::Matchmaking_start_time' has a wrong offset!");
static_assert(offsetof(UBP_MatchmakingProxy_C, MatchMakingCancelled) == 0x0001C8, "Member 'UBP_MatchmakingProxy_C::MatchMakingCancelled' has a wrong offset!");
static_assert(offsetof(UBP_MatchmakingProxy_C, Queue_name) == 0x0001D8, "Member 'UBP_MatchmakingProxy_C::Queue_name' has a wrong offset!");

}

