#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MuzzleEffect_Drone_SMG

#include "Basic.hpp"

#include "Keaton_structs.hpp"
#include "CAAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_MuzzleEffect_Drone_SMG.BP_MuzzleEffect_Drone_SMG_C.ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG
// 0x0058 (0x0058 - 0x0000)
struct BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_duration;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_tween_float_output;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOUT_EXEC_TWEEN                               CallFunc_tween_float_exec;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetMuzzleMeshComponent_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0028(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0040(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG) == 0x000008, "Wrong alignment on BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG");
static_assert(sizeof(BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG) == 0x000058, "Wrong size on BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG");
static_assert(offsetof(BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG, EntryPoint) == 0x000000, "Member 'BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG, K2Node_Event_duration) == 0x000008, "Member 'BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG::K2Node_Event_duration' has a wrong offset!");
static_assert(offsetof(BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG, CallFunc_tween_float_output) == 0x00000C, "Member 'BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG::CallFunc_tween_float_output' has a wrong offset!");
static_assert(offsetof(BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG, CallFunc_tween_float_exec) == 0x000010, "Member 'BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG::CallFunc_tween_float_exec' has a wrong offset!");
static_assert(offsetof(BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG, CallFunc_IsValid_ReturnValue_1) == 0x000012, "Member 'BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue) == 0x000018, "Member 'BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG, CallFunc_GetMuzzleMeshComponent_ReturnValue) == 0x000020, "Member 'BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG::CallFunc_GetMuzzleMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG, Temp_delegate_Variable) == 0x000028, "Member 'BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG, CallFunc_K2_AttachToComponent_ReturnValue) == 0x00003C, "Member 'BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG, CallFunc_PlayEvent_playback_instance) == 0x000040, "Member 'BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG, CallFunc_PlayEvent_play_success) == 0x000050, "Member 'BP_MuzzleEffect_Drone_SMG_C_ExecuteUbergraph_BP_MuzzleEffect_Drone_SMG::CallFunc_PlayEvent_play_success' has a wrong offset!");

// Function BP_MuzzleEffect_Drone_SMG.BP_MuzzleEffect_Drone_SMG_C.OnStartCharging
// 0x0004 (0x0004 - 0x0000)
struct BP_MuzzleEffect_Drone_SMG_C_OnStartCharging final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MuzzleEffect_Drone_SMG_C_OnStartCharging) == 0x000004, "Wrong alignment on BP_MuzzleEffect_Drone_SMG_C_OnStartCharging");
static_assert(sizeof(BP_MuzzleEffect_Drone_SMG_C_OnStartCharging) == 0x000004, "Wrong size on BP_MuzzleEffect_Drone_SMG_C_OnStartCharging");
static_assert(offsetof(BP_MuzzleEffect_Drone_SMG_C_OnStartCharging, Duration) == 0x000000, "Member 'BP_MuzzleEffect_Drone_SMG_C_OnStartCharging::Duration' has a wrong offset!");

}

