#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_Character

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Keaton_structs.hpp"
#include "CAAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_NPC_Character.BP_NPC_Character_C.OnTeleport__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_NPC_Character_C_OnTeleport__DelegateSignature final
{
public:
	float                                         TeleportDuration;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          In;                                                // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPC_Character_C_OnTeleport__DelegateSignature) == 0x000004, "Wrong alignment on BP_NPC_Character_C_OnTeleport__DelegateSignature");
static_assert(sizeof(BP_NPC_Character_C_OnTeleport__DelegateSignature) == 0x000008, "Wrong size on BP_NPC_Character_C_OnTeleport__DelegateSignature");
static_assert(offsetof(BP_NPC_Character_C_OnTeleport__DelegateSignature, TeleportDuration) == 0x000000, "Member 'BP_NPC_Character_C_OnTeleport__DelegateSignature::TeleportDuration' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_OnTeleport__DelegateSignature, In) == 0x000004, "Member 'BP_NPC_Character_C_OnTeleport__DelegateSignature::In' has a wrong offset!");

// Function BP_NPC_Character.BP_NPC_Character_C.ExecuteUbergraph_BP_NPC_Character
// 0x0768 (0x0768 - 0x0000)
struct BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_teleport_duration;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_teleport_duration_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkedHit                          K2Node_ComponentBoundEvent_hit;                    // 0x0020(0x0068)(ConstParm, NoDestructor)
	bool                                          K2Node_Event_is_in_pool;                           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_CanBeDialogueSpokesperson_ReturnValue; // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1; // 0x0094(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_2; // 0x009C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_target_is_npc;                        // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_target_actor;                         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Amount;                               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00B4(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsInNPCSpawnPool_ReturnValue;             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_duration;                             // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCADamageEffectInfo                    K2Node_ComponentBoundEvent_damage_effect_info;     // 0x00D0(0x02F8)(ConstParm)
	class ABP_NPC_Character_C*                    K2Node_DynamicCast_AsBP_NPC_Character;             // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_CanBeDialogueSpokesperson_ReturnValue_1; // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D2[0x6];                                      // 0x03D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAAIController*                        CallFunc_GetCAAIController_ReturnValue;            // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACASecurityArea*                        CallFunc_GetCurrentSecurityArea_ReturnValue;       // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UCAComponent_NPCTargetManager*    CallFunc_GetNPCTargetManager_ReturnValue;          // 0x03E8(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCurrentTargetObjectPriority_ReturnValue; // 0x03F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F2[0x2];                                      // 0x03F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAMissionManagerVaultState                   K2Node_CustomEvent_new_vault_state;                // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FA[0x2];                                      // 0x03FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ACACharacter* Character, struct FGameplayEffectSpec& Death_gameplay_effect_spec, float Damage_magnitude, struct FNetworkedHit& Networked_hit, class AActor* Killer)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x03FC(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(ECAMissionManagerVaultState New_vault_state)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0410(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0424(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_425[0x3];                                      // 0x0425(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0428(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0440(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter*                           K2Node_CustomEvent_character;                      // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpec                    K2Node_CustomEvent_death_gameplay_effect_spec;     // 0x0458(0x0298)(ConstParm)
	float                                         K2Node_CustomEvent_damage_magnitude;               // 0x06F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F4[0x4];                                      // 0x06F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkedHit                          K2Node_CustomEvent_networked_hit;                  // 0x06F8(0x0068)(ConstParm, NoDestructor)
	const class AActor*                           K2Node_CustomEvent_killer;                         // 0x0760(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character) == 0x000008, "Wrong alignment on BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character");
static_assert(sizeof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character) == 0x000768, "Wrong size on BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, EntryPoint) == 0x000000, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000004, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, CallFunc_HasAuthority_ReturnValue) == 0x00000C, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, K2Node_Event_teleport_duration) == 0x000010, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::K2Node_Event_teleport_duration' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, K2Node_Event_teleport_duration_1) == 0x000018, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::K2Node_Event_teleport_duration_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, CallFunc_IsValid_ReturnValue_1) == 0x00001C, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, K2Node_ComponentBoundEvent_hit) == 0x000020, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::K2Node_ComponentBoundEvent_hit' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, K2Node_Event_is_in_pool) == 0x000088, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::K2Node_Event_is_in_pool' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x000089, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x00008C, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, CallFunc_BP_CanBeDialogueSpokesperson_ReturnValue) == 0x000090, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::CallFunc_BP_CanBeDialogueSpokesperson_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000091, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1) == 0x000094, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_2) == 0x00009C, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, K2Node_Event_target_is_npc) == 0x0000A4, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::K2Node_Event_target_is_npc' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, K2Node_Event_target_actor) == 0x0000A8, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::K2Node_Event_target_actor' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, K2Node_Event_Amount) == 0x0000B0, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::K2Node_Event_Amount' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, K2Node_CreateDelegate_OutputDelegate) == 0x0000B4, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, CallFunc_IsInNPCSpawnPool_ReturnValue) == 0x0000C8, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::CallFunc_IsInNPCSpawnPool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, K2Node_Event_duration) == 0x0000CC, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::K2Node_Event_duration' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, K2Node_ComponentBoundEvent_damage_effect_info) == 0x0000D0, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::K2Node_ComponentBoundEvent_damage_effect_info' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, K2Node_DynamicCast_AsBP_NPC_Character) == 0x0003C8, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::K2Node_DynamicCast_AsBP_NPC_Character' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, K2Node_DynamicCast_bSuccess) == 0x0003D0, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, CallFunc_BP_CanBeDialogueSpokesperson_ReturnValue_1) == 0x0003D1, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::CallFunc_BP_CanBeDialogueSpokesperson_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, CallFunc_GetCAAIController_ReturnValue) == 0x0003D8, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::CallFunc_GetCAAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, CallFunc_GetCurrentSecurityArea_ReturnValue) == 0x0003E0, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::CallFunc_GetCurrentSecurityArea_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, CallFunc_GetNPCTargetManager_ReturnValue) == 0x0003E8, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::CallFunc_GetNPCTargetManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, CallFunc_IsValid_ReturnValue_2) == 0x0003F0, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, CallFunc_IsCurrentTargetObjectPriority_ReturnValue) == 0x0003F1, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::CallFunc_IsCurrentTargetObjectPriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, CallFunc_RandomFloatInRange_ReturnValue) == 0x0003F4, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, K2Node_CustomEvent_new_vault_state) == 0x0003F8, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::K2Node_CustomEvent_new_vault_state' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0003F9, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, K2Node_CreateDelegate_OutputDelegate_1) == 0x0003FC, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, K2Node_CreateDelegate_OutputDelegate_2) == 0x000410, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000424, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, K2Node_CreateDelegate_OutputDelegate_3) == 0x000428, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000440, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, CallFunc_HasAuthority_ReturnValue_1) == 0x000448, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, K2Node_CustomEvent_character) == 0x000450, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::K2Node_CustomEvent_character' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, K2Node_CustomEvent_death_gameplay_effect_spec) == 0x000458, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::K2Node_CustomEvent_death_gameplay_effect_spec' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, K2Node_CustomEvent_damage_magnitude) == 0x0006F0, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::K2Node_CustomEvent_damage_magnitude' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, K2Node_CustomEvent_networked_hit) == 0x0006F8, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::K2Node_CustomEvent_networked_hit' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character, K2Node_CustomEvent_killer) == 0x000760, "Member 'BP_NPC_Character_C_ExecuteUbergraph_BP_NPC_Character::K2Node_CustomEvent_killer' has a wrong offset!");

// Function BP_NPC_Character.BP_NPC_Character_C.OnDeath
// 0x0318 (0x0318 - 0x0000)
struct BP_NPC_Character_C_OnDeath final
{
public:
	class ACACharacter*                           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpec                    Death_gameplay_effect_spec;                        // 0x0008(0x0298)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         Damage_magnitude;                                  // 0x02A0(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkedHit                          Networked_hit;                                     // 0x02A8(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	const class AActor*                           Killer;                                            // 0x0310(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Character_C_OnDeath) == 0x000008, "Wrong alignment on BP_NPC_Character_C_OnDeath");
static_assert(sizeof(BP_NPC_Character_C_OnDeath) == 0x000318, "Wrong size on BP_NPC_Character_C_OnDeath");
static_assert(offsetof(BP_NPC_Character_C_OnDeath, Character) == 0x000000, "Member 'BP_NPC_Character_C_OnDeath::Character' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_OnDeath, Death_gameplay_effect_spec) == 0x000008, "Member 'BP_NPC_Character_C_OnDeath::Death_gameplay_effect_spec' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_OnDeath, Damage_magnitude) == 0x0002A0, "Member 'BP_NPC_Character_C_OnDeath::Damage_magnitude' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_OnDeath, Networked_hit) == 0x0002A8, "Member 'BP_NPC_Character_C_OnDeath::Networked_hit' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_OnDeath, Killer) == 0x000310, "Member 'BP_NPC_Character_C_OnDeath::Killer' has a wrong offset!");

// Function BP_NPC_Character.BP_NPC_Character_C.VaultStateChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_NPC_Character_C_VaultStateChanged final
{
public:
	ECAMissionManagerVaultState                   New_vault_state;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Character_C_VaultStateChanged) == 0x000001, "Wrong alignment on BP_NPC_Character_C_VaultStateChanged");
static_assert(sizeof(BP_NPC_Character_C_VaultStateChanged) == 0x000001, "Wrong size on BP_NPC_Character_C_VaultStateChanged");
static_assert(offsetof(BP_NPC_Character_C_VaultStateChanged, New_vault_state) == 0x000000, "Member 'BP_NPC_Character_C_VaultStateChanged::New_vault_state' has a wrong offset!");

// Function BP_NPC_Character.BP_NPC_Character_C.BndEvt__BP_NPC_Character_m_ability_system_component_K2Node_ComponentBoundEvent_4_OnHitDelivered__DelegateSignature
// 0x02F8 (0x02F8 - 0x0000)
struct BP_NPC_Character_C_BndEvt__BP_NPC_Character_m_ability_system_component_K2Node_ComponentBoundEvent_4_OnHitDelivered__DelegateSignature final
{
public:
	struct FCADamageEffectInfo                    Damage_effect_info;                                // 0x0000(0x02F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_NPC_Character_C_BndEvt__BP_NPC_Character_m_ability_system_component_K2Node_ComponentBoundEvent_4_OnHitDelivered__DelegateSignature) == 0x000008, "Wrong alignment on BP_NPC_Character_C_BndEvt__BP_NPC_Character_m_ability_system_component_K2Node_ComponentBoundEvent_4_OnHitDelivered__DelegateSignature");
static_assert(sizeof(BP_NPC_Character_C_BndEvt__BP_NPC_Character_m_ability_system_component_K2Node_ComponentBoundEvent_4_OnHitDelivered__DelegateSignature) == 0x0002F8, "Wrong size on BP_NPC_Character_C_BndEvt__BP_NPC_Character_m_ability_system_component_K2Node_ComponentBoundEvent_4_OnHitDelivered__DelegateSignature");
static_assert(offsetof(BP_NPC_Character_C_BndEvt__BP_NPC_Character_m_ability_system_component_K2Node_ComponentBoundEvent_4_OnHitDelivered__DelegateSignature, Damage_effect_info) == 0x000000, "Member 'BP_NPC_Character_C_BndEvt__BP_NPC_Character_m_ability_system_component_K2Node_ComponentBoundEvent_4_OnHitDelivered__DelegateSignature::Damage_effect_info' has a wrong offset!");

// Function BP_NPC_Character.BP_NPC_Character_C.MakeTemporarilyUninspectable
// 0x0004 (0x0004 - 0x0000)
struct BP_NPC_Character_C_MakeTemporarilyUninspectable final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Character_C_MakeTemporarilyUninspectable) == 0x000004, "Wrong alignment on BP_NPC_Character_C_MakeTemporarilyUninspectable");
static_assert(sizeof(BP_NPC_Character_C_MakeTemporarilyUninspectable) == 0x000004, "Wrong size on BP_NPC_Character_C_MakeTemporarilyUninspectable");
static_assert(offsetof(BP_NPC_Character_C_MakeTemporarilyUninspectable, Duration) == 0x000000, "Member 'BP_NPC_Character_C_MakeTemporarilyUninspectable::Duration' has a wrong offset!");

// Function BP_NPC_Character.BP_NPC_Character_C.SetScanIntensity
// 0x0004 (0x0004 - 0x0000)
struct BP_NPC_Character_C_SetScanIntensity final
{
public:
	float                                         Amount;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Character_C_SetScanIntensity) == 0x000004, "Wrong alignment on BP_NPC_Character_C_SetScanIntensity");
static_assert(sizeof(BP_NPC_Character_C_SetScanIntensity) == 0x000004, "Wrong size on BP_NPC_Character_C_SetScanIntensity");
static_assert(offsetof(BP_NPC_Character_C_SetScanIntensity, Amount) == 0x000000, "Member 'BP_NPC_Character_C_SetScanIntensity::Amount' has a wrong offset!");

// Function BP_NPC_Character.BP_NPC_Character_C.EnterCombat
// 0x0010 (0x0010 - 0x0000)
struct BP_NPC_Character_C_EnterCombat final
{
public:
	bool                                          Target_is_npc;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Target_actor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Character_C_EnterCombat) == 0x000008, "Wrong alignment on BP_NPC_Character_C_EnterCombat");
static_assert(sizeof(BP_NPC_Character_C_EnterCombat) == 0x000010, "Wrong size on BP_NPC_Character_C_EnterCombat");
static_assert(offsetof(BP_NPC_Character_C_EnterCombat, Target_is_npc) == 0x000000, "Member 'BP_NPC_Character_C_EnterCombat::Target_is_npc' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_EnterCombat, Target_actor) == 0x000008, "Member 'BP_NPC_Character_C_EnterCombat::Target_actor' has a wrong offset!");

// Function BP_NPC_Character.BP_NPC_Character_C.OnPoolStatusChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_NPC_Character_C_OnPoolStatusChanged final
{
public:
	bool                                          Is_in_pool;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPC_Character_C_OnPoolStatusChanged) == 0x000001, "Wrong alignment on BP_NPC_Character_C_OnPoolStatusChanged");
static_assert(sizeof(BP_NPC_Character_C_OnPoolStatusChanged) == 0x000001, "Wrong size on BP_NPC_Character_C_OnPoolStatusChanged");
static_assert(offsetof(BP_NPC_Character_C_OnPoolStatusChanged, Is_in_pool) == 0x000000, "Member 'BP_NPC_Character_C_OnPoolStatusChanged::Is_in_pool' has a wrong offset!");

// Function BP_NPC_Character.BP_NPC_Character_C.BndEvt__BP_NPC_Grunt_m_hit_reaction_component_K2Node_ComponentBoundEvent_0_HitRecievedSignature__DelegateSignature
// 0x0068 (0x0068 - 0x0000)
struct BP_NPC_Character_C_BndEvt__BP_NPC_Grunt_m_hit_reaction_component_K2Node_ComponentBoundEvent_0_HitRecievedSignature__DelegateSignature final
{
public:
	struct FNetworkedHit                          Hit;                                               // 0x0000(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_NPC_Character_C_BndEvt__BP_NPC_Grunt_m_hit_reaction_component_K2Node_ComponentBoundEvent_0_HitRecievedSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_NPC_Character_C_BndEvt__BP_NPC_Grunt_m_hit_reaction_component_K2Node_ComponentBoundEvent_0_HitRecievedSignature__DelegateSignature");
static_assert(sizeof(BP_NPC_Character_C_BndEvt__BP_NPC_Grunt_m_hit_reaction_component_K2Node_ComponentBoundEvent_0_HitRecievedSignature__DelegateSignature) == 0x000068, "Wrong size on BP_NPC_Character_C_BndEvt__BP_NPC_Grunt_m_hit_reaction_component_K2Node_ComponentBoundEvent_0_HitRecievedSignature__DelegateSignature");
static_assert(offsetof(BP_NPC_Character_C_BndEvt__BP_NPC_Grunt_m_hit_reaction_component_K2Node_ComponentBoundEvent_0_HitRecievedSignature__DelegateSignature, Hit) == 0x000000, "Member 'BP_NPC_Character_C_BndEvt__BP_NPC_Grunt_m_hit_reaction_component_K2Node_ComponentBoundEvent_0_HitRecievedSignature__DelegateSignature::Hit' has a wrong offset!");

// Function BP_NPC_Character.BP_NPC_Character_C.OnTeleportOutBegin
// 0x0004 (0x0004 - 0x0000)
struct BP_NPC_Character_C_OnTeleportOutBegin final
{
public:
	float                                         Teleport_duration;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Character_C_OnTeleportOutBegin) == 0x000004, "Wrong alignment on BP_NPC_Character_C_OnTeleportOutBegin");
static_assert(sizeof(BP_NPC_Character_C_OnTeleportOutBegin) == 0x000004, "Wrong size on BP_NPC_Character_C_OnTeleportOutBegin");
static_assert(offsetof(BP_NPC_Character_C_OnTeleportOutBegin, Teleport_duration) == 0x000000, "Member 'BP_NPC_Character_C_OnTeleportOutBegin::Teleport_duration' has a wrong offset!");

// Function BP_NPC_Character.BP_NPC_Character_C.OnTeleportInBegin
// 0x0004 (0x0004 - 0x0000)
struct BP_NPC_Character_C_OnTeleportInBegin final
{
public:
	float                                         Teleport_duration;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Character_C_OnTeleportInBegin) == 0x000004, "Wrong alignment on BP_NPC_Character_C_OnTeleportInBegin");
static_assert(sizeof(BP_NPC_Character_C_OnTeleportInBegin) == 0x000004, "Wrong size on BP_NPC_Character_C_OnTeleportInBegin");
static_assert(offsetof(BP_NPC_Character_C_OnTeleportInBegin, Teleport_duration) == 0x000000, "Member 'BP_NPC_Character_C_OnTeleportInBegin::Teleport_duration' has a wrong offset!");

// Function BP_NPC_Character.BP_NPC_Character_C.PlayHitReceivedVox
// 0x0054 (0x0054 - 0x0000)
struct BP_NPC_Character_C_PlayHitReceivedVox final
{
public:
	float                                         HitBaseDamage;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBodyPart                                     HitBodyPart;                                       // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAWeaponClass                                HitWeaponClass;                                    // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioSwitchValueType                Temp_struct_Variable;                              // 0x0008(0x0004)(NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioSwitchValueType                Temp_struct_Variable_1;                            // 0x0010(0x0004)(NoDestructor)
	struct FCAAudioSwitchValueType                Temp_struct_Variable_2;                            // 0x0014(0x0004)(NoDestructor)
	struct FCAAudioSwitchValueType                Temp_struct_Variable_3;                            // 0x0018(0x0004)(NoDestructor)
	struct FCAAudioSwitchValueType                Temp_struct_Variable_4;                            // 0x001C(0x0004)(NoDestructor)
	struct FCAAudioSwitchValueType                Temp_struct_Variable_5;                            // 0x0020(0x0004)(NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECANPCType                                    CallFunc_GetNPCType_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBodyPart                                     Temp_byte_Variable;                                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioSwitchValueType                Temp_struct_Variable_6;                            // 0x0034(0x0004)(NoDestructor)
	struct FCAAudioSwitchValueType                K2Node_Select_Default;                             // 0x0038(0x0004)(NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_CanBeDialogueSpokesperson_ReturnValue; // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioSwitchValueType                K2Node_Select_Default_1;                           // 0x0040(0x0004)(NoDestructor)
	float                                         CallFunc_GetHealthNormalised_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasGameplayTag_ReturnValue;               // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPC_Character_C_PlayHitReceivedVox) == 0x000004, "Wrong alignment on BP_NPC_Character_C_PlayHitReceivedVox");
static_assert(sizeof(BP_NPC_Character_C_PlayHitReceivedVox) == 0x000054, "Wrong size on BP_NPC_Character_C_PlayHitReceivedVox");
static_assert(offsetof(BP_NPC_Character_C_PlayHitReceivedVox, HitBaseDamage) == 0x000000, "Member 'BP_NPC_Character_C_PlayHitReceivedVox::HitBaseDamage' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_PlayHitReceivedVox, HitBodyPart) == 0x000004, "Member 'BP_NPC_Character_C_PlayHitReceivedVox::HitBodyPart' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_C_PlayHitReceivedVox, HitWeaponClass) == 0x000005, "Member 'BP_NPC_Character_C_PlayHitReceivedVox::HitWeaponClass' has a wrong offset!");
