#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_EliteTank

#include "Basic.hpp"

#include "Keaton_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SMinMax_structs.hpp"


namespace SDK::Params
{

// Function BP_NPC_EliteTank.BP_NPC_EliteTank_C.OnDeath
// 0x0318 (0x0318 - 0x0000)
struct BP_NPC_EliteTank_C_OnDeath final
{
public:
	class ACACharacter*                           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpec                    Death_gameplay_effect_spec;                        // 0x0008(0x0298)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         Damage_magnitude;                                  // 0x02A0(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkedHit                          Networked_hit;                                     // 0x02A8(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	const class AActor*                           Killer;                                            // 0x0310(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_EliteTank_C_OnDeath) == 0x000008, "Wrong alignment on BP_NPC_EliteTank_C_OnDeath");
static_assert(sizeof(BP_NPC_EliteTank_C_OnDeath) == 0x000318, "Wrong size on BP_NPC_EliteTank_C_OnDeath");
static_assert(offsetof(BP_NPC_EliteTank_C_OnDeath, Character) == 0x000000, "Member 'BP_NPC_EliteTank_C_OnDeath::Character' has a wrong offset!");
static_assert(offsetof(BP_NPC_EliteTank_C_OnDeath, Death_gameplay_effect_spec) == 0x000008, "Member 'BP_NPC_EliteTank_C_OnDeath::Death_gameplay_effect_spec' has a wrong offset!");
static_assert(offsetof(BP_NPC_EliteTank_C_OnDeath, Damage_magnitude) == 0x0002A0, "Member 'BP_NPC_EliteTank_C_OnDeath::Damage_magnitude' has a wrong offset!");
static_assert(offsetof(BP_NPC_EliteTank_C_OnDeath, Networked_hit) == 0x0002A8, "Member 'BP_NPC_EliteTank_C_OnDeath::Networked_hit' has a wrong offset!");
static_assert(offsetof(BP_NPC_EliteTank_C_OnDeath, Killer) == 0x000310, "Member 'BP_NPC_EliteTank_C_OnDeath::Killer' has a wrong offset!");

// Function BP_NPC_EliteTank.BP_NPC_EliteTank_C.OnHitReceived
// 0x02F8 (0x02F8 - 0x0000)
struct BP_NPC_EliteTank_C_OnHitReceived final
{
public:
	struct FCADamageEffectInfo                    Damage_effect_info;                                // 0x0000(0x02F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_NPC_EliteTank_C_OnHitReceived) == 0x000008, "Wrong alignment on BP_NPC_EliteTank_C_OnHitReceived");
static_assert(sizeof(BP_NPC_EliteTank_C_OnHitReceived) == 0x0002F8, "Wrong size on BP_NPC_EliteTank_C_OnHitReceived");
static_assert(offsetof(BP_NPC_EliteTank_C_OnHitReceived, Damage_effect_info) == 0x000000, "Member 'BP_NPC_EliteTank_C_OnHitReceived::Damage_effect_info' has a wrong offset!");

// Function BP_NPC_EliteTank.BP_NPC_EliteTank_C.Special Ability State Changed
// 0x0001 (0x0001 - 0x0000)
struct BP_NPC_EliteTank_C_Special_Ability_State_Changed final
{
public:
	bool                                          Is_active;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPC_EliteTank_C_Special_Ability_State_Changed) == 0x000001, "Wrong alignment on BP_NPC_EliteTank_C_Special_Ability_State_Changed");
static_assert(sizeof(BP_NPC_EliteTank_C_Special_Ability_State_Changed) == 0x000001, "Wrong size on BP_NPC_EliteTank_C_Special_Ability_State_Changed");
static_assert(offsetof(BP_NPC_EliteTank_C_Special_Ability_State_Changed, Is_active) == 0x000000, "Member 'BP_NPC_EliteTank_C_Special_Ability_State_Changed::Is_active' has a wrong offset!");

// Function BP_NPC_EliteTank.BP_NPC_EliteTank_C.OnCollisionStateChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_NPC_EliteTank_C_OnCollisionStateChanged final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPC_EliteTank_C_OnCollisionStateChanged) == 0x000001, "Wrong alignment on BP_NPC_EliteTank_C_OnCollisionStateChanged");
static_assert(sizeof(BP_NPC_EliteTank_C_OnCollisionStateChanged) == 0x000001, "Wrong size on BP_NPC_EliteTank_C_OnCollisionStateChanged");
static_assert(offsetof(BP_NPC_EliteTank_C_OnCollisionStateChanged, Enabled) == 0x000000, "Member 'BP_NPC_EliteTank_C_OnCollisionStateChanged::Enabled' has a wrong offset!");

// Function BP_NPC_EliteTank.BP_NPC_EliteTank_C.TryEnableShieldCollision
// 0x0001 (0x0001 - 0x0000)
struct BP_NPC_EliteTank_C_TryEnableShieldCollision final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPC_EliteTank_C_TryEnableShieldCollision) == 0x000001, "Wrong alignment on BP_NPC_EliteTank_C_TryEnableShieldCollision");
static_assert(sizeof(BP_NPC_EliteTank_C_TryEnableShieldCollision) == 0x000001, "Wrong size on BP_NPC_EliteTank_C_TryEnableShieldCollision");
static_assert(offsetof(BP_NPC_EliteTank_C_TryEnableShieldCollision, bEnabled) == 0x000000, "Member 'BP_NPC_EliteTank_C_TryEnableShieldCollision::bEnabled' has a wrong offset!");

// Function BP_NPC_EliteTank.BP_NPC_EliteTank_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_NPC_EliteTank_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_EliteTank_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_NPC_EliteTank_C_ReceiveTick");
static_assert(sizeof(BP_NPC_EliteTank_C_ReceiveTick) == 0x000004, "Wrong size on BP_NPC_EliteTank_C_ReceiveTick");
static_assert(offsetof(BP_NPC_EliteTank_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_NPC_EliteTank_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_NPC_EliteTank.BP_NPC_EliteTank_C.ExecuteUbergraph_BP_NPC_EliteTank
// 0x08E0 (0x08E0 - 0x0000)
struct BP_NPC_EliteTank_C_ExecuteUbergraph_BP_NPC_EliteTank final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCADamageEffectInfo                    K2Node_CustomEvent_damage_effect_info;             // 0x0030(0x02F8)(ConstParm)
	bool                                          K2Node_CustomEvent_is_active;                      // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetActorEnableCollision_ReturnValue;      // 0x032A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x032B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_enabled;                              // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bEnabled;                       // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0332(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_333[0x1];                                      // 0x0333(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FCADamageEffectInfo& Damage_effect_info)> K2Node_CreateDelegate_OutputDelegate;              // 0x0334(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter*                           K2Node_CustomEvent_character;                      // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpec                    K2Node_CustomEvent_death_gameplay_effect_spec;     // 0x0360(0x0298)(ConstParm)
	float                                         K2Node_CustomEvent_damage_magnitude;               // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FC[0x4];                                      // 0x05FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkedHit                          K2Node_CustomEvent_networked_hit;                  // 0x0600(0x0068)(ConstParm, NoDestructor)
	const class AActor*                           K2Node_CustomEvent_killer;                         // 0x0668(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0670(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ACACharacter* Character, struct FGameplayEffectSpec& Death_gameplay_effect_spec, float Damage_magnitude, struct FNetworkedHit& Networked_hit, class AActor* Killer)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0674(0x0014)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0688(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTankShieldLocationOnClient_ReturnValue; // 0x0694(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTankShieldRotationOnClient_ReturnValue; // 0x06A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x06AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x06B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x06C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x06D0(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0760(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x076C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0778(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorInt_ReturnValue;           // 0x0784(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0794(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0798(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x079C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x07A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x07A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantize                    K2Node_MakeStruct_Vector_NetQuantize;              // 0x07A8(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantize                    K2Node_MakeStruct_Vector_NetQuantize_1;            // 0x07B4(0x000C)(NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x07C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowTankShieldsOnServer_ReturnValue; // 0x07C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C9[0x7];                                      // 0x07C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAPlayerController*                    K2Node_DynamicCast_AsCAPlayer_Controller;          // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x07D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D9[0x3];                                      // 0x07D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCACharacterSignifianceProperties      CallFunc_GetSignificance_ReturnValue;              // 0x07DC(0x0008)(ConstParm, NoDestructor)
	uint8                                         Pad_7E4[0xC];                                      // 0x07E4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x07F0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0820(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x082C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0838(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0844(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_845[0xB];                                      // 0x0845(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0850(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0880(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_881[0x3];                                      // 0x0881(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0884(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0890(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_891[0x7];                                      // 0x0891(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x0898(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x08A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A4[0x4];                                      // 0x08A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCACharacterMovementComponent*          K2Node_DynamicCast_AsCACharacter_Movement_Component; // 0x08A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x08B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B1[0x3];                                      // 0x08B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMinMax                               K2Node_MakeStruct_sMinMax;                         // 0x08B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x08BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ClampToMinMax_Result;                     // 0x08C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x08C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x08C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x08CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x08D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x08D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x08D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPC_EliteTank_C_ExecuteUbergraph_BP_NPC_EliteTank) == 0x000010, "Wrong alignment on BP_NPC_EliteTank_C_ExecuteUbergraph_BP_NPC_EliteTank");
static_assert(sizeof(BP_NPC_EliteTank_C_ExecuteUbergraph_BP_NPC_EliteTank) == 0x0008E0, "Wrong size on BP_NPC_EliteTank_C_ExecuteUbergraph_BP_NPC_EliteTank");
static_assert(offsetof(BP_NPC_EliteTank_C_ExecuteUbergraph_BP_NPC_EliteTank, EntryPoint) == 0x000000, "Member 'BP_NPC_EliteTank_C_ExecuteUbergraph_BP_NPC_EliteTank::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NPC_EliteTank_C_ExecuteUbergraph_BP_NPC_EliteTank, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'BP_NPC_EliteTank_C_ExecuteUbergraph_BP_NPC_EliteTank::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
