#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_EliteExosuit_Laser

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_NPC_Character_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPC_EliteExosuit_Laser.BP_NPC_EliteExosuit_Laser_C
// 0x0070 (0x20E0 - 0x2070)
class ABP_NPC_EliteExosuit_Laser_C final : public ABP_NPC_Character_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_NPC_EliteExosuit_Laser_C;        // 0x2070(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Projectile_Collision_Leg_R;                        // 0x2078(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Projectile_Collision_Leg_L;                        // 0x2080(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Projectile_Collision_Gun_R;                        // 0x2088(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Projectile_Collision_Gun_L;                        // 0x2090(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Projectile_Collision_Arm_R;                        // 0x2098(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Projectile_Collision_Arm_L;                        // 0x20A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      ProjectileOverlapCapsule;                          // 0x20A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Projectile_Collision_Shoulder_Right;               // 0x20B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Projectile_Collision_Shoulder_Left;                // 0x20B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      WeaponTraceOverlapCapsule;                         // 0x20C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPhysicalAnimationComponent*            PhysicalAnimation;                                 // 0x20C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_NPCLootSpawner_C*                  BPC_NPCLootSpawner;                                // 0x20D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             CollisionType;                                     // 0x20D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_NPC_EliteExosuit_Laser(int32 EntryPoint);
	void OnCollisionStateChanged(bool Enabled);
	void OnPerformLocalDeath();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NPC_EliteExosuit_Laser_C">();
	}
	static class ABP_NPC_EliteExosuit_Laser_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NPC_EliteExosuit_Laser_C>();
	}
};
static_assert(alignof(ABP_NPC_EliteExosuit_Laser_C) == 0x000010, "Wrong alignment on ABP_NPC_EliteExosuit_Laser_C");
static_assert(sizeof(ABP_NPC_EliteExosuit_Laser_C) == 0x0020E0, "Wrong size on ABP_NPC_EliteExosuit_Laser_C");
static_assert(offsetof(ABP_NPC_EliteExosuit_Laser_C, UberGraphFrame_BP_NPC_EliteExosuit_Laser_C) == 0x002070, "Member 'ABP_NPC_EliteExosuit_Laser_C::UberGraphFrame_BP_NPC_EliteExosuit_Laser_C' has a wrong offset!");
static_assert(offsetof(ABP_NPC_EliteExosuit_Laser_C, Projectile_Collision_Leg_R) == 0x002078, "Member 'ABP_NPC_EliteExosuit_Laser_C::Projectile_Collision_Leg_R' has a wrong offset!");
static_assert(offsetof(ABP_NPC_EliteExosuit_Laser_C, Projectile_Collision_Leg_L) == 0x002080, "Member 'ABP_NPC_EliteExosuit_Laser_C::Projectile_Collision_Leg_L' has a wrong offset!");
static_assert(offsetof(ABP_NPC_EliteExosuit_Laser_C, Projectile_Collision_Gun_R) == 0x002088, "Member 'ABP_NPC_EliteExosuit_Laser_C::Projectile_Collision_Gun_R' has a wrong offset!");
static_assert(offsetof(ABP_NPC_EliteExosuit_Laser_C, Projectile_Collision_Gun_L) == 0x002090, "Member 'ABP_NPC_EliteExosuit_Laser_C::Projectile_Collision_Gun_L' has a wrong offset!");
static_assert(offsetof(ABP_NPC_EliteExosuit_Laser_C, Projectile_Collision_Arm_R) == 0x002098, "Member 'ABP_NPC_EliteExosuit_Laser_C::Projectile_Collision_Arm_R' has a wrong offset!");
static_assert(offsetof(ABP_NPC_EliteExosuit_Laser_C, Projectile_Collision_Arm_L) == 0x0020A0, "Member 'ABP_NPC_EliteExosuit_Laser_C::Projectile_Collision_Arm_L' has a wrong offset!");
static_assert(offsetof(ABP_NPC_EliteExosuit_Laser_C, ProjectileOverlapCapsule) == 0x0020A8, "Member 'ABP_NPC_EliteExosuit_Laser_C::ProjectileOverlapCapsule' has a wrong offset!");
static_assert(offsetof(ABP_NPC_EliteExosuit_Laser_C, Projectile_Collision_Shoulder_Right) == 0x0020B0, "Member 'ABP_NPC_EliteExosuit_Laser_C::Projectile_Collision_Shoulder_Right' has a wrong offset!");
static_assert(offsetof(ABP_NPC_EliteExosuit_Laser_C, Projectile_Collision_Shoulder_Left) == 0x0020B8, "Member 'ABP_NPC_EliteExosuit_Laser_C::Projectile_Collision_Shoulder_Left' has a wrong offset!");
static_assert(offsetof(ABP_NPC_EliteExosuit_Laser_C, WeaponTraceOverlapCapsule) == 0x0020C0, "Member 'ABP_NPC_EliteExosuit_Laser_C::WeaponTraceOverlapCapsule' has a wrong offset!");
static_assert(offsetof(ABP_NPC_EliteExosuit_Laser_C, PhysicalAnimation) == 0x0020C8, "Member 'ABP_NPC_EliteExosuit_Laser_C::PhysicalAnimation' has a wrong offset!");
static_assert(offsetof(ABP_NPC_EliteExosuit_Laser_C, BPC_NPCLootSpawner) == 0x0020D0, "Member 'ABP_NPC_EliteExosuit_Laser_C::BPC_NPCLootSpawner' has a wrong offset!");
static_assert(offsetof(ABP_NPC_EliteExosuit_Laser_C, CollisionType) == 0x0020D8, "Member 'ABP_NPC_EliteExosuit_Laser_C::CollisionType' has a wrong offset!");

}

