#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_Character_DroneRusher

#include "Basic.hpp"

#include "CAAudio_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Keaton_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_NPC_Character_DroneRusher.BP_NPC_Character_DroneRusher_C.ExecuteUbergraph_BP_NPC_Character_DroneRusher
// 0x0530 (0x0530 - 0x0000)
struct BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0004(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0030(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0090(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter*                           K2Node_CustomEvent_character;                      // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpec                    K2Node_CustomEvent_death_gameplay_effect_spec;     // 0x0130(0x0298)(ConstParm)
	float                                         K2Node_CustomEvent_damage_magnitude;               // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkedHit                          K2Node_CustomEvent_networked_hit;                  // 0x03D0(0x0068)(ConstParm, NoDestructor)
	const class AActor*                           K2Node_CustomEvent_killer;                         // 0x0438(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_is_in_pool;                           // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Amount;                               // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZeroG_ReturnValue;                    // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECAAwarenessState Awareness_state)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x044C(0x0014)(ZeroConstructor, NoDestructor)
	ECAAwarenessState                             K2Node_CustomEvent_awareness_state;                // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x3];                                      // 0x0461(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_469[0x3];                                      // 0x0469(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x046C(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_2;                          // 0x0480(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_494[0x4];                                      // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x0498(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_2;            // 0x04B0(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_2;                 // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x04C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_3;                          // 0x04D0(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_3;            // 0x04E8(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_3;                 // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F9[0x3];                                      // 0x04F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ACACharacter* Character, struct FGameplayEffectSpec& Death_gameplay_effect_spec, float Damage_magnitude, struct FNetworkedHit& Networked_hit, class AActor* Killer)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x04FC(0x0014)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_ComponentBoundEvent_tag;                    // 0x0514(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_count;                  // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0524(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_525[0x3];                                      // 0x0525(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSpeed_ReturnValue;                     // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher) == 0x000008, "Wrong alignment on BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher");
static_assert(sizeof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher) == 0x000530, "Wrong size on BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, EntryPoint) == 0x000000, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, Temp_delegate_Variable) == 0x000004, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, CallFunc_PlayEvent_playback_instance) == 0x000030, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, CallFunc_PlayEvent_play_success) == 0x000040, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000048, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, K2Node_Event_MyComp) == 0x000050, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, K2Node_Event_Other) == 0x000058, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, K2Node_Event_OtherComp) == 0x000060, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, K2Node_Event_bSelfMoved) == 0x000068, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, K2Node_Event_HitLocation) == 0x00006C, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, K2Node_Event_HitNormal) == 0x000078, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, K2Node_Event_NormalImpulse) == 0x000084, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, K2Node_Event_Hit) == 0x000090, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, K2Node_Event_OtherActor) == 0x000120, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, K2Node_CustomEvent_character) == 0x000128, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::K2Node_CustomEvent_character' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, K2Node_CustomEvent_death_gameplay_effect_spec) == 0x000130, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::K2Node_CustomEvent_death_gameplay_effect_spec' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, K2Node_CustomEvent_damage_magnitude) == 0x0003C8, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::K2Node_CustomEvent_damage_magnitude' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, K2Node_CustomEvent_networked_hit) == 0x0003D0, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::K2Node_CustomEvent_networked_hit' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, K2Node_CustomEvent_killer) == 0x000438, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::K2Node_CustomEvent_killer' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, K2Node_Event_is_in_pool) == 0x000440, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::K2Node_Event_is_in_pool' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, K2Node_Event_Amount) == 0x000444, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::K2Node_Event_Amount' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, CallFunc_IsInZeroG_ReturnValue) == 0x000448, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::CallFunc_IsInZeroG_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, K2Node_CreateDelegate_OutputDelegate_1) == 0x00044C, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, K2Node_CustomEvent_awareness_state) == 0x000460, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::K2Node_CustomEvent_awareness_state' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, CallFunc_VSize_ReturnValue) == 0x000464, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, K2Node_SwitchEnum_CmpSuccess) == 0x000468, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, Temp_delegate_Variable_1) == 0x00046C, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, Temp_delegate_Variable_2) == 0x000480, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, CallFunc_PlayEvent_playback_instance_1) == 0x000498, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, CallFunc_PlayEvent_play_success_1) == 0x0004A8, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::CallFunc_PlayEvent_play_success_1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, CallFunc_PlayEvent_playback_instance_2) == 0x0004B0, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::CallFunc_PlayEvent_playback_instance_2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, CallFunc_PlayEvent_play_success_2) == 0x0004C0, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::CallFunc_PlayEvent_play_success_2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue) == 0x0004C8, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, Temp_delegate_Variable_3) == 0x0004D0, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, CallFunc_PlayEvent_playback_instance_3) == 0x0004E8, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::CallFunc_PlayEvent_playback_instance_3' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, CallFunc_PlayEvent_play_success_3) == 0x0004F8, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::CallFunc_PlayEvent_play_success_3' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, K2Node_CreateDelegate_OutputDelegate_2) == 0x0004FC, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, K2Node_Event_DeltaSeconds) == 0x000510, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, K2Node_ComponentBoundEvent_tag) == 0x000514, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::K2Node_ComponentBoundEvent_tag' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, K2Node_ComponentBoundEvent_count) == 0x000520, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::K2Node_ComponentBoundEvent_count' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, CallFunc_Greater_IntInt_ReturnValue) == 0x000524, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher, CallFunc_GetSpeed_ReturnValue) == 0x000528, "Member 'BP_NPC_Character_DroneRusher_C_ExecuteUbergraph_BP_NPC_Character_DroneRusher::CallFunc_GetSpeed_ReturnValue' has a wrong offset!");

// Function BP_NPC_Character_DroneRusher.BP_NPC_Character_DroneRusher_C.BndEvt__BP_NPC_Character_DroneLight_m_ability_system_component_K2Node_ComponentBoundEvent_0_OnTrackedTagChange__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_NPC_Character_DroneRusher_C_BndEvt__BP_NPC_Character_DroneLight_m_ability_system_component_K2Node_ComponentBoundEvent_0_OnTrackedTagChange__DelegateSignature final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Character_DroneRusher_C_BndEvt__BP_NPC_Character_DroneLight_m_ability_system_component_K2Node_ComponentBoundEvent_0_OnTrackedTagChange__DelegateSignature) == 0x000004, "Wrong alignment on BP_NPC_Character_DroneRusher_C_BndEvt__BP_NPC_Character_DroneLight_m_ability_system_component_K2Node_ComponentBoundEvent_0_OnTrackedTagChange__DelegateSignature");
static_assert(sizeof(BP_NPC_Character_DroneRusher_C_BndEvt__BP_NPC_Character_DroneLight_m_ability_system_component_K2Node_ComponentBoundEvent_0_OnTrackedTagChange__DelegateSignature) == 0x000010, "Wrong size on BP_NPC_Character_DroneRusher_C_BndEvt__BP_NPC_Character_DroneLight_m_ability_system_component_K2Node_ComponentBoundEvent_0_OnTrackedTagChange__DelegateSignature");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_BndEvt__BP_NPC_Character_DroneLight_m_ability_system_component_K2Node_ComponentBoundEvent_0_OnTrackedTagChange__DelegateSignature, Tag) == 0x000000, "Member 'BP_NPC_Character_DroneRusher_C_BndEvt__BP_NPC_Character_DroneLight_m_ability_system_component_K2Node_ComponentBoundEvent_0_OnTrackedTagChange__DelegateSignature::Tag' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_BndEvt__BP_NPC_Character_DroneLight_m_ability_system_component_K2Node_ComponentBoundEvent_0_OnTrackedTagChange__DelegateSignature, Count) == 0x00000C, "Member 'BP_NPC_Character_DroneRusher_C_BndEvt__BP_NPC_Character_DroneLight_m_ability_system_component_K2Node_ComponentBoundEvent_0_OnTrackedTagChange__DelegateSignature::Count' has a wrong offset!");

// Function BP_NPC_Character_DroneRusher.BP_NPC_Character_DroneRusher_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_NPC_Character_DroneRusher_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Character_DroneRusher_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_NPC_Character_DroneRusher_C_ReceiveTick");
static_assert(sizeof(BP_NPC_Character_DroneRusher_C_ReceiveTick) == 0x000004, "Wrong size on BP_NPC_Character_DroneRusher_C_ReceiveTick");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_NPC_Character_DroneRusher_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_NPC_Character_DroneRusher.BP_NPC_Character_DroneRusher_C.m_on_awareness_state_changed_Event_0
// 0x0001 (0x0001 - 0x0000)
struct BP_NPC_Character_DroneRusher_C_M_on_awareness_state_changed_Event_0 final
{
public:
	ECAAwarenessState                             Awareness_state;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Character_DroneRusher_C_M_on_awareness_state_changed_Event_0) == 0x000001, "Wrong alignment on BP_NPC_Character_DroneRusher_C_M_on_awareness_state_changed_Event_0");
static_assert(sizeof(BP_NPC_Character_DroneRusher_C_M_on_awareness_state_changed_Event_0) == 0x000001, "Wrong size on BP_NPC_Character_DroneRusher_C_M_on_awareness_state_changed_Event_0");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_M_on_awareness_state_changed_Event_0, Awareness_state) == 0x000000, "Member 'BP_NPC_Character_DroneRusher_C_M_on_awareness_state_changed_Event_0::Awareness_state' has a wrong offset!");

// Function BP_NPC_Character_DroneRusher.BP_NPC_Character_DroneRusher_C.SetScanIntensity
// 0x0004 (0x0004 - 0x0000)
struct BP_NPC_Character_DroneRusher_C_SetScanIntensity final
{
public:
	float                                         Amount;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Character_DroneRusher_C_SetScanIntensity) == 0x000004, "Wrong alignment on BP_NPC_Character_DroneRusher_C_SetScanIntensity");
static_assert(sizeof(BP_NPC_Character_DroneRusher_C_SetScanIntensity) == 0x000004, "Wrong size on BP_NPC_Character_DroneRusher_C_SetScanIntensity");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_SetScanIntensity, Amount) == 0x000000, "Member 'BP_NPC_Character_DroneRusher_C_SetScanIntensity::Amount' has a wrong offset!");

// Function BP_NPC_Character_DroneRusher.BP_NPC_Character_DroneRusher_C.OnPoolStatusChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_NPC_Character_DroneRusher_C_OnPoolStatusChanged final
{
public:
	bool                                          Is_in_pool;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPC_Character_DroneRusher_C_OnPoolStatusChanged) == 0x000001, "Wrong alignment on BP_NPC_Character_DroneRusher_C_OnPoolStatusChanged");
static_assert(sizeof(BP_NPC_Character_DroneRusher_C_OnPoolStatusChanged) == 0x000001, "Wrong size on BP_NPC_Character_DroneRusher_C_OnPoolStatusChanged");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_OnPoolStatusChanged, Is_in_pool) == 0x000000, "Member 'BP_NPC_Character_DroneRusher_C_OnPoolStatusChanged::Is_in_pool' has a wrong offset!");

// Function BP_NPC_Character_DroneRusher.BP_NPC_Character_DroneRusher_C.m_on_death_delegate_Event_0
// 0x0318 (0x0318 - 0x0000)
struct BP_NPC_Character_DroneRusher_C_M_on_death_delegate_Event_0 final
{
public:
	class ACACharacter*                           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpec                    Death_gameplay_effect_spec;                        // 0x0008(0x0298)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         Damage_magnitude;                                  // 0x02A0(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkedHit                          Networked_hit;                                     // 0x02A8(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	const class AActor*                           Killer;                                            // 0x0310(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Character_DroneRusher_C_M_on_death_delegate_Event_0) == 0x000008, "Wrong alignment on BP_NPC_Character_DroneRusher_C_M_on_death_delegate_Event_0");
static_assert(sizeof(BP_NPC_Character_DroneRusher_C_M_on_death_delegate_Event_0) == 0x000318, "Wrong size on BP_NPC_Character_DroneRusher_C_M_on_death_delegate_Event_0");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_M_on_death_delegate_Event_0, Character) == 0x000000, "Member 'BP_NPC_Character_DroneRusher_C_M_on_death_delegate_Event_0::Character' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_M_on_death_delegate_Event_0, Death_gameplay_effect_spec) == 0x000008, "Member 'BP_NPC_Character_DroneRusher_C_M_on_death_delegate_Event_0::Death_gameplay_effect_spec' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_M_on_death_delegate_Event_0, Damage_magnitude) == 0x0002A0, "Member 'BP_NPC_Character_DroneRusher_C_M_on_death_delegate_Event_0::Damage_magnitude' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_M_on_death_delegate_Event_0, Networked_hit) == 0x0002A8, "Member 'BP_NPC_Character_DroneRusher_C_M_on_death_delegate_Event_0::Networked_hit' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_M_on_death_delegate_Event_0, Killer) == 0x000310, "Member 'BP_NPC_Character_DroneRusher_C_M_on_death_delegate_Event_0::Killer' has a wrong offset!");

// Function BP_NPC_Character_DroneRusher.BP_NPC_Character_DroneRusher_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_NPC_Character_DroneRusher_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Character_DroneRusher_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_NPC_Character_DroneRusher_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_NPC_Character_DroneRusher_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_NPC_Character_DroneRusher_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_NPC_Character_DroneRusher_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_NPC_Character_DroneRusher.BP_NPC_Character_DroneRusher_C.ReceiveHit
// 0x00D0 (0x00D0 - 0x0000)
struct BP_NPC_Character_DroneRusher_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_NPC_Character_DroneRusher_C_ReceiveHit) == 0x000008, "Wrong alignment on BP_NPC_Character_DroneRusher_C_ReceiveHit");
static_assert(sizeof(BP_NPC_Character_DroneRusher_C_ReceiveHit) == 0x0000D0, "Wrong size on BP_NPC_Character_DroneRusher_C_ReceiveHit");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ReceiveHit, MyComp) == 0x000000, "Member 'BP_NPC_Character_DroneRusher_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ReceiveHit, Other) == 0x000008, "Member 'BP_NPC_Character_DroneRusher_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ReceiveHit, OtherComp) == 0x000010, "Member 'BP_NPC_Character_DroneRusher_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'BP_NPC_Character_DroneRusher_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ReceiveHit, HitLocation) == 0x00001C, "Member 'BP_NPC_Character_DroneRusher_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ReceiveHit, HitNormal) == 0x000028, "Member 'BP_NPC_Character_DroneRusher_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ReceiveHit, NormalImpulse) == 0x000034, "Member 'BP_NPC_Character_DroneRusher_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_ReceiveHit, Hit) == 0x000040, "Member 'BP_NPC_Character_DroneRusher_C_ReceiveHit::Hit' has a wrong offset!");

// Function BP_NPC_Character_DroneRusher.BP_NPC_Character_DroneRusher_C.IsPlayerInFutureDamageArea
// 0x0001 (0x0001 - 0x0000)
struct BP_NPC_Character_DroneRusher_C_IsPlayerInFutureDamageArea final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPC_Character_DroneRusher_C_IsPlayerInFutureDamageArea) == 0x000001, "Wrong alignment on BP_NPC_Character_DroneRusher_C_IsPlayerInFutureDamageArea");
static_assert(sizeof(BP_NPC_Character_DroneRusher_C_IsPlayerInFutureDamageArea) == 0x000001, "Wrong size on BP_NPC_Character_DroneRusher_C_IsPlayerInFutureDamageArea");
static_assert(offsetof(BP_NPC_Character_DroneRusher_C_IsPlayerInFutureDamageArea, ReturnValue) == 0x000000, "Member 'BP_NPC_Character_DroneRusher_C_IsPlayerInFutureDamageArea::ReturnValue' has a wrong offset!");

}

