#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_Dummy

#include "Basic.hpp"

#include "BP_NPC_Character_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPC_Dummy.BP_NPC_Dummy_C
// 0x0030 (0x20A0 - 0x2070)
class ABP_NPC_Dummy_C final : public ABP_NPC_Character_C
{
public:
	class UTextRenderComponent*                   TextRender3;                                       // 0x2070(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender2;                                       // 0x2078(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender1;                                       // 0x2080(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x2088(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x2090(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NPC_Dummy_C">();
	}
	static class ABP_NPC_Dummy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NPC_Dummy_C>();
	}
};
static_assert(alignof(ABP_NPC_Dummy_C) == 0x000010, "Wrong alignment on ABP_NPC_Dummy_C");
static_assert(sizeof(ABP_NPC_Dummy_C) == 0x0020A0, "Wrong size on ABP_NPC_Dummy_C");
static_assert(offsetof(ABP_NPC_Dummy_C, TextRender3) == 0x002070, "Member 'ABP_NPC_Dummy_C::TextRender3' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Dummy_C, TextRender2) == 0x002078, "Member 'ABP_NPC_Dummy_C::TextRender2' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Dummy_C, TextRender1) == 0x002080, "Member 'ABP_NPC_Dummy_C::TextRender1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Dummy_C, TextRender) == 0x002088, "Member 'ABP_NPC_Dummy_C::TextRender' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Dummy_C, StaticMesh) == 0x002090, "Member 'ABP_NPC_Dummy_C::StaticMesh' has a wrong offset!");

}

