#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PostProcess_Hit

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PostProcess_Hit.BP_PostProcess_Hit_C.ExecuteUbergraph_BP_PostProcess_Hit
// 0x0080 (0x0080 - 0x0000)
struct BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAPlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDamageToLocalPlayerThisFrame_ReturnValue; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRemappedDamage_DamageScalePostProcess; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRemappedDamage_DamageScaleCameraShake; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetLocalPlayerArmour_ReturnValue;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetHitDirectionSector_ReturnValue;        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetHitDirectionSector_ReturnValue_1;      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetMaterialInstance_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetMaterialInstance_ReturnValue_1;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDamageToLocalPlayerThisFrame_ReturnValue_1; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRemappedDamage_DamageScalePostProcess_1; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRemappedDamage_DamageScaleCameraShake_1; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDamageToLocalPlayerThisFrame_ReturnValue_2; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRemappedDamage_DamageScalePostProcess_2; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRemappedDamage_DamageScaleCameraShake_2; // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit) == 0x000008, "Wrong alignment on BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit");
static_assert(sizeof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit) == 0x000080, "Wrong size on BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, EntryPoint) == 0x000000, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, CallFunc_BreakVector_X) == 0x000004, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, CallFunc_BreakVector_Y) == 0x000008, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, CallFunc_BreakVector_Z) == 0x00000C, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000010, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, CallFunc_Add_FloatFloat_ReturnValue) == 0x00001C, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, CallFunc_GetDamageToLocalPlayerThisFrame_ReturnValue) == 0x000020, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::CallFunc_GetDamageToLocalPlayerThisFrame_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000024, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, CallFunc_GetRemappedDamage_DamageScalePostProcess) == 0x000028, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::CallFunc_GetRemappedDamage_DamageScalePostProcess' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, CallFunc_GetRemappedDamage_DamageScaleCameraShake) == 0x00002C, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::CallFunc_GetRemappedDamage_DamageScaleCameraShake' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000030, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, CallFunc_MakeRotator_ReturnValue) == 0x000034, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, CallFunc_GetLocalPlayerArmour_ReturnValue) == 0x000040, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::CallFunc_GetLocalPlayerArmour_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, CallFunc_GetHitDirectionSector_ReturnValue) == 0x000044, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::CallFunc_GetHitDirectionSector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000048, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00004C, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, CallFunc_GetHitDirectionSector_ReturnValue_1) == 0x000050, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::CallFunc_GetHitDirectionSector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000054, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, CallFunc_GetMaterialInstance_ReturnValue) == 0x000058, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::CallFunc_GetMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, CallFunc_GetMaterialInstance_ReturnValue_1) == 0x000060, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::CallFunc_GetMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, CallFunc_GetDamageToLocalPlayerThisFrame_ReturnValue_1) == 0x000068, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::CallFunc_GetDamageToLocalPlayerThisFrame_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, CallFunc_GetRemappedDamage_DamageScalePostProcess_1) == 0x00006C, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::CallFunc_GetRemappedDamage_DamageScalePostProcess_1' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, CallFunc_GetRemappedDamage_DamageScaleCameraShake_1) == 0x000070, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::CallFunc_GetRemappedDamage_DamageScaleCameraShake_1' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, CallFunc_GetDamageToLocalPlayerThisFrame_ReturnValue_2) == 0x000074, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::CallFunc_GetDamageToLocalPlayerThisFrame_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, CallFunc_GetRemappedDamage_DamageScalePostProcess_2) == 0x000078, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::CallFunc_GetRemappedDamage_DamageScalePostProcess_2' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit, CallFunc_GetRemappedDamage_DamageScaleCameraShake_2) == 0x00007C, "Member 'BP_PostProcess_Hit_C_ExecuteUbergraph_BP_PostProcess_Hit::CallFunc_GetRemappedDamage_DamageScaleCameraShake_2' has a wrong offset!");

// Function BP_PostProcess_Hit.BP_PostProcess_Hit_C.GetRemappedDamage
// 0x0014 (0x0014 - 0x0000)
struct BP_PostProcess_Hit_C_GetRemappedDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DamageScalePostProcess;                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DamageScaleCameraShake;                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue_1;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PostProcess_Hit_C_GetRemappedDamage) == 0x000004, "Wrong alignment on BP_PostProcess_Hit_C_GetRemappedDamage");
static_assert(sizeof(BP_PostProcess_Hit_C_GetRemappedDamage) == 0x000014, "Wrong size on BP_PostProcess_Hit_C_GetRemappedDamage");
static_assert(offsetof(BP_PostProcess_Hit_C_GetRemappedDamage, Damage) == 0x000000, "Member 'BP_PostProcess_Hit_C_GetRemappedDamage::Damage' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_GetRemappedDamage, DamageScalePostProcess) == 0x000004, "Member 'BP_PostProcess_Hit_C_GetRemappedDamage::DamageScalePostProcess' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_GetRemappedDamage, DamageScaleCameraShake) == 0x000008, "Member 'BP_PostProcess_Hit_C_GetRemappedDamage::DamageScaleCameraShake' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_GetRemappedDamage, CallFunc_MapRangeUnclamped_ReturnValue) == 0x00000C, "Member 'BP_PostProcess_Hit_C_GetRemappedDamage::CallFunc_MapRangeUnclamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_GetRemappedDamage, CallFunc_MapRangeUnclamped_ReturnValue_1) == 0x000010, "Member 'BP_PostProcess_Hit_C_GetRemappedDamage::CallFunc_MapRangeUnclamped_ReturnValue_1' has a wrong offset!");

// Function BP_PostProcess_Hit.BP_PostProcess_Hit_C.HitVisualsNiagara
// 0x01B0 (0x01B0 - 0x0000)
struct BP_PostProcess_Hit_C_HitVisualsNiagara final
{
public:
	struct FVector                                Temp_struct_Variable;                              // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_1;                            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_2;                            // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_3;                            // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_4;                            // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_5;                            // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_6;                            // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_7;                            // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_8;                            // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_9;                            // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_10;                           // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_11;                           // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_12;                           // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_13;                           // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_14;                           // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_15;                           // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_16;                           // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_17;                           // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_18;                           // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_19;                           // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_20;                           // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_21;                           // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_22;                           // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayerCharacter_ReturnValue;      // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayerCharacter_ReturnValue_1;    // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable_23;                           // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayerCharacter_ReturnValue_2;    // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZeroGravity_ReturnValue;              // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_182[0x2];                                      // 0x0182(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetHitDirectionSector_ReturnValue;        // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_1;                           // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_2;                           // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PostProcess_Hit_C_HitVisualsNiagara) == 0x000008, "Wrong alignment on BP_PostProcess_Hit_C_HitVisualsNiagara");
static_assert(sizeof(BP_PostProcess_Hit_C_HitVisualsNiagara) == 0x0001B0, "Wrong size on BP_PostProcess_Hit_C_HitVisualsNiagara");
static_assert(offsetof(BP_PostProcess_Hit_C_HitVisualsNiagara, Temp_struct_Variable) == 0x000000, "Member 'BP_PostProcess_Hit_C_HitVisualsNiagara::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_HitVisualsNiagara, Temp_struct_Variable_1) == 0x00000C, "Member 'BP_PostProcess_Hit_C_HitVisualsNiagara::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Hit_C_HitVisualsNiagara, Temp_struct_Variable_2) == 0x000018, "Member 'BP_PostProcess_Hit_C_HitVisualsNiagara::Temp_struct_Variable_2' has a wrong offset!");
