#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Projectile_Base.BP_Projectile_Base_C
// 0x0030 (0x0540 - 0x0510)
#pragma pack(push, 0x1)
class alignas(0x10) ABP_Projectile_Base_C : public ACAProjectileBase
{
public:
	uint8                                         Pad_508[0x8];                                      // 0x0508(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Predicted_Physics_Transform;                       // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCAPredictedPhysicsComponent*           CAPredictedPhysics;                                // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GravityStatusComponent_C*           BP_GravityStatusComponent;                         // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCACollisionComponent*                  CACollision;                                       // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Projectile_Base(int32 EntryPoint);
	void Defuse();
	void ReceiveBeginPlay();
	void BndEvt__BP_GravityStatusComponent_K2Node_ComponentBoundEvent_1_GameplayStateChanged__DelegateSignature();
	void BndEvt__BP_GravityStatusComponent_K2Node_ComponentBoundEvent_0_GameplayStateChanged__DelegateSignature();
	void UserConstructionScript();
	void SFX_Projectile_Travel_Audio_Start(const struct FCAAudioSwitchNameType& Switch_Group, const struct FCAAudioSwitchValueType& Switch_Value, const struct FCAAudioEventType& In_Flight_Audio_Event);
	void SFX_Projectile_Travel_Audio_Stop(const struct FCAAudioEventType& Stop_In_Flight_Audio_Event);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Projectile_Base_C">();
	}
	static class ABP_Projectile_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Projectile_Base_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(ABP_Projectile_Base_C) == 0x000010, "Wrong alignment on ABP_Projectile_Base_C");
static_assert(sizeof(ABP_Projectile_Base_C) == 0x000540, "Wrong size on ABP_Projectile_Base_C");
static_assert(offsetof(ABP_Projectile_Base_C, UberGraphFrame) == 0x000510, "Member 'ABP_Projectile_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Base_C, Predicted_Physics_Transform) == 0x000518, "Member 'ABP_Projectile_Base_C::Predicted_Physics_Transform' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Base_C, CAPredictedPhysics) == 0x000520, "Member 'ABP_Projectile_Base_C::CAPredictedPhysics' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Base_C, BP_GravityStatusComponent) == 0x000528, "Member 'ABP_Projectile_Base_C::BP_GravityStatusComponent' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Base_C, CACollision) == 0x000530, "Member 'ABP_Projectile_Base_C::CACollision' has a wrong offset!");

}

