#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PointOfInterestComponent

#include "Basic.hpp"

#include "Keaton_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_PointOfInterestComponent.BP_PointOfInterestComponent_C.ExecuteUbergraph_BP_PointOfInterestComponent
// 0x0298 (0x0298 - 0x0000)
struct BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        K2Node_CustomEvent_OverlappedComponent_1;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor_1;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        K2Node_CustomEvent_OtherComp_1;                    // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFromSweep;                     // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_SweepResult;                    // 0x0060(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class USceneComponent*                        K2Node_CustomEvent_OverlappedComponent;            // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        K2Node_CustomEvent_OtherComp;                      // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCATeamID                              CallFunc_GetTeamID_ReturnValue;                    // 0x010C(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FCATeamID                              CallFunc_GetTeamID_ReturnValue_1;                  // 0x0110(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCATeamID>                      K2Node_MakeArray_Array;                            // 0x0118(0x0010)(ReferenceParm)
	bool                                          CallFunc_Check_Spatial_Conditions_Result;          // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantize                    K2Node_MakeStruct_Vector_NetQuantize;              // 0x0150(0x000C)(NoDestructor, HasGetValueTypeHash)
	ECAInformationControlLevel                    CallFunc_GetInformationLevelForEntity_Server_ReturnValue; // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAMapEntityPayload                    K2Node_MakeStruct_CAMapEntityPayload;              // 0x0160(0x0070)()
	bool                                          CallFunc_Less_ByteByte_ReturnValue;                // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RegisterMapEntity_ReturnValue;            // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x01DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_overlaps;            // 0x01E8(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCATeamID                              CallFunc_GetTeamID_ReturnValue_2;                  // 0x0204(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TeamIDTeamID_ReturnValue;      // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class USceneComponent* OverlappedComponent, class AActor* OtherActor, class USceneComponent* OtherComp, int32 OtherBodyIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x020C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(class USceneComponent* OverlappedComponent, class AActor* OtherActor, class USceneComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0220(0x0014)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCATeamID                              CallFunc_GetTeamID_ReturnValue_3;                  // 0x0250(0x0004)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25A[0x2];                                      // 0x025A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x027D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27E[0x2];                                      // 0x027E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent) == 0x000008, "Wrong alignment on BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent");
static_assert(sizeof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent) == 0x000298, "Wrong size on BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, EntryPoint) == 0x000000, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_HasAuthority_ReturnValue) == 0x000014, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, Temp_int_Array_Index_Variable_1) == 0x000020, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, Temp_bool_True_if_break_was_hit_Variable) == 0x000024, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, Temp_int_Loop_Counter_Variable_1) == 0x000028, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_Add_IntInt_ReturnValue_1) == 0x00002C, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_Not_PreBool_ReturnValue) == 0x000030, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, Temp_int_Array_Index_Variable_2) == 0x000034, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_MakeLiteralByte_ReturnValue) == 0x000038, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, K2Node_CustomEvent_OverlappedComponent_1) == 0x000040, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::K2Node_CustomEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, K2Node_CustomEvent_OtherActor_1) == 0x000048, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::K2Node_CustomEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, K2Node_CustomEvent_OtherComp_1) == 0x000050, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::K2Node_CustomEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, K2Node_CustomEvent_OtherBodyIndex_1) == 0x000058, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::K2Node_CustomEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, K2Node_CustomEvent_bFromSweep) == 0x00005C, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::K2Node_CustomEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, K2Node_CustomEvent_SweepResult) == 0x000060, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::K2Node_CustomEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, K2Node_CustomEvent_OverlappedComponent) == 0x0000F0, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::K2Node_CustomEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, K2Node_CustomEvent_OtherActor) == 0x0000F8, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, K2Node_CustomEvent_OtherComp) == 0x000100, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::K2Node_CustomEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, K2Node_CustomEvent_OtherBodyIndex) == 0x000108, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::K2Node_CustomEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_GetTeamID_ReturnValue) == 0x00010C, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_GetTeamID_ReturnValue_1) == 0x000110, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_GetTeamID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, K2Node_MakeArray_Array) == 0x000118, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_Check_Spatial_Conditions_Result) == 0x000128, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_Check_Spatial_Conditions_Result' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000129, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_GetOwner_ReturnValue_1) == 0x000130, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000138, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_BreakVector_X) == 0x000144, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_BreakVector_Y) == 0x000148, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_BreakVector_Z) == 0x00014C, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, K2Node_MakeStruct_Vector_NetQuantize) == 0x000150, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::K2Node_MakeStruct_Vector_NetQuantize' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_GetInformationLevelForEntity_Server_ReturnValue) == 0x00015C, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_GetInformationLevelForEntity_Server_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, K2Node_MakeStruct_CAMapEntityPayload) == 0x000160, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::K2Node_MakeStruct_CAMapEntityPayload' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_Less_ByteByte_ReturnValue) == 0x0001D0, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_Less_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_RegisterMapEntity_ReturnValue) == 0x0001D4, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_RegisterMapEntity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_BooleanAND_ReturnValue) == 0x0001D8, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, K2Node_Event_EndPlayReason) == 0x0001D9, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_Greater_IntInt_ReturnValue) == 0x0001DA, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0001DB, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_GetOwner_ReturnValue_2) == 0x0001E0, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_GetOverlappingActors_overlaps) == 0x0001E8, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_GetOverlappingActors_overlaps' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_Array_Get_Item) == 0x0001F8, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_Array_Length_ReturnValue) == 0x000200, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_GetTeamID_ReturnValue_2) == 0x000204, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_GetTeamID_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_EqualEqual_TeamIDTeamID_ReturnValue) == 0x000208, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_EqualEqual_TeamIDTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, K2Node_CreateDelegate_OutputDelegate) == 0x00020C, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000220, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, K2Node_Event_DeltaSeconds) == 0x000234, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_Array_AddUnique_ReturnValue) == 0x000238, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_Array_Length_ReturnValue_1) == 0x00023C, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000240, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_Array_Get_Item_1) == 0x000248, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_GetTeamID_ReturnValue_3) == 0x000250, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_GetTeamID_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_Array_Length_ReturnValue_2) == 0x000254, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_Less_IntInt_ReturnValue) == 0x000258, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000259, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, Temp_int_Loop_Counter_Variable_2) == 0x00025C, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_Less_IntInt_ReturnValue_1) == 0x000260, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_Add_IntInt_ReturnValue_2) == 0x000264, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_BooleanAND_ReturnValue_1) == 0x000268, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_Array_AddUnique_ReturnValue_1) == 0x00026C, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_Array_Get_Item_2) == 0x000270, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_Array_Length_ReturnValue_3) == 0x000278, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_Less_IntInt_ReturnValue_2) == 0x00027C, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_Array_RemoveItem_ReturnValue) == 0x00027D, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_Array_Length_ReturnValue_4) == 0x000280, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000284, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_GetOwner_ReturnValue_3) == 0x000288, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent, CallFunc_HasAuthority_ReturnValue_1) == 0x000290, "Member 'BP_PointOfInterestComponent_C_ExecuteUbergraph_BP_PointOfInterestComponent::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");

// Function BP_PointOfInterestComponent.BP_PointOfInterestComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PointOfInterestComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PointOfInterestComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PointOfInterestComponent_C_ReceiveTick");
static_assert(sizeof(BP_PointOfInterestComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_PointOfInterestComponent_C_ReceiveTick");
static_assert(offsetof(BP_PointOfInterestComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PointOfInterestComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PointOfInterestComponent.BP_PointOfInterestComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_PointOfInterestComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PointOfInterestComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_PointOfInterestComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_PointOfInterestComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_PointOfInterestComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_PointOfInterestComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_PointOfInterestComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_PointOfInterestComponent.BP_PointOfInterestComponent_C.EndOverlap
// 0x0020 (0x0020 - 0x0000)
struct BP_PointOfInterestComponent_C_EndOverlap final
{
public:
	class USceneComponent*                        OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PointOfInterestComponent_C_EndOverlap) == 0x000008, "Wrong alignment on BP_PointOfInterestComponent_C_EndOverlap");
static_assert(sizeof(BP_PointOfInterestComponent_C_EndOverlap) == 0x000020, "Wrong size on BP_PointOfInterestComponent_C_EndOverlap");
static_assert(offsetof(BP_PointOfInterestComponent_C_EndOverlap, OverlappedComponent) == 0x000000, "Member 'BP_PointOfInterestComponent_C_EndOverlap::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_EndOverlap, OtherActor) == 0x000008, "Member 'BP_PointOfInterestComponent_C_EndOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_EndOverlap, OtherComp) == 0x000010, "Member 'BP_PointOfInterestComponent_C_EndOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_EndOverlap, OtherBodyIndex) == 0x000018, "Member 'BP_PointOfInterestComponent_C_EndOverlap::OtherBodyIndex' has a wrong offset!");

// Function BP_PointOfInterestComponent.BP_PointOfInterestComponent_C.BeginOverlap
// 0x00B0 (0x00B0 - 0x0000)
struct BP_PointOfInterestComponent_C_BeginOverlap final
{
public:
	class USceneComponent*                        OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_PointOfInterestComponent_C_BeginOverlap) == 0x000008, "Wrong alignment on BP_PointOfInterestComponent_C_BeginOverlap");
static_assert(sizeof(BP_PointOfInterestComponent_C_BeginOverlap) == 0x0000B0, "Wrong size on BP_PointOfInterestComponent_C_BeginOverlap");
static_assert(offsetof(BP_PointOfInterestComponent_C_BeginOverlap, OverlappedComponent) == 0x000000, "Member 'BP_PointOfInterestComponent_C_BeginOverlap::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_BeginOverlap, OtherActor) == 0x000008, "Member 'BP_PointOfInterestComponent_C_BeginOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_BeginOverlap, OtherComp) == 0x000010, "Member 'BP_PointOfInterestComponent_C_BeginOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_BeginOverlap, OtherBodyIndex) == 0x000018, "Member 'BP_PointOfInterestComponent_C_BeginOverlap::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_BeginOverlap, bFromSweep) == 0x00001C, "Member 'BP_PointOfInterestComponent_C_BeginOverlap::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_BeginOverlap, SweepResult) == 0x000020, "Member 'BP_PointOfInterestComponent_C_BeginOverlap::SweepResult' has a wrong offset!");

// Function BP_PointOfInterestComponent.BP_PointOfInterestComponent_C.Check Spatial Conditions
// 0x0070 (0x0070 - 0x0000)
struct BP_PointOfInterestComponent_C_Check_Spatial_Conditions final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACASpatialManager*                      CallFunc_GetSpatialManager_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLocationZoneID_ReturnValue;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLocationZoneID_ReturnValue_1;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetZoneTags_ReturnValue;                  // 0x0048(0x0020)(ConstParm)
	bool                                          CallFunc_HasAllTags_ReturnValue;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PointOfInterestComponent_C_Check_Spatial_Conditions) == 0x000008, "Wrong alignment on BP_PointOfInterestComponent_C_Check_Spatial_Conditions");
static_assert(sizeof(BP_PointOfInterestComponent_C_Check_Spatial_Conditions) == 0x000070, "Wrong size on BP_PointOfInterestComponent_C_Check_Spatial_Conditions");
static_assert(offsetof(BP_PointOfInterestComponent_C_Check_Spatial_Conditions, OtherActor) == 0x000000, "Member 'BP_PointOfInterestComponent_C_Check_Spatial_Conditions::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_Check_Spatial_Conditions, Result) == 0x000008, "Member 'BP_PointOfInterestComponent_C_Check_Spatial_Conditions::Result' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_Check_Spatial_Conditions, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00000C, "Member 'BP_PointOfInterestComponent_C_Check_Spatial_Conditions::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_Check_Spatial_Conditions, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_PointOfInterestComponent_C_Check_Spatial_Conditions::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_Check_Spatial_Conditions, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000020, "Member 'BP_PointOfInterestComponent_C_Check_Spatial_Conditions::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_Check_Spatial_Conditions, CallFunc_GetSpatialManager_ReturnValue) == 0x000030, "Member 'BP_PointOfInterestComponent_C_Check_Spatial_Conditions::CallFunc_GetSpatialManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_Check_Spatial_Conditions, CallFunc_GetLocationZoneID_ReturnValue) == 0x000038, "Member 'BP_PointOfInterestComponent_C_Check_Spatial_Conditions::CallFunc_GetLocationZoneID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_Check_Spatial_Conditions, CallFunc_GetLocationZoneID_ReturnValue_1) == 0x00003C, "Member 'BP_PointOfInterestComponent_C_Check_Spatial_Conditions::CallFunc_GetLocationZoneID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_Check_Spatial_Conditions, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000040, "Member 'BP_PointOfInterestComponent_C_Check_Spatial_Conditions::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_Check_Spatial_Conditions, CallFunc_GetZoneTags_ReturnValue) == 0x000048, "Member 'BP_PointOfInterestComponent_C_Check_Spatial_Conditions::CallFunc_GetZoneTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_Check_Spatial_Conditions, CallFunc_HasAllTags_ReturnValue) == 0x000068, "Member 'BP_PointOfInterestComponent_C_Check_Spatial_Conditions::CallFunc_HasAllTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_Check_Spatial_Conditions, CallFunc_HasAnyTags_ReturnValue) == 0x000069, "Member 'BP_PointOfInterestComponent_C_Check_Spatial_Conditions::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_Check_Spatial_Conditions, CallFunc_Not_PreBool_ReturnValue) == 0x00006A, "Member 'BP_PointOfInterestComponent_C_Check_Spatial_Conditions::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_Check_Spatial_Conditions, CallFunc_BooleanAND_ReturnValue) == 0x00006B, "Member 'BP_PointOfInterestComponent_C_Check_Spatial_Conditions::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_Check_Spatial_Conditions, CallFunc_BooleanAND_ReturnValue_1) == 0x00006C, "Member 'BP_PointOfInterestComponent_C_Check_Spatial_Conditions::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_Check_Spatial_Conditions, CallFunc_BooleanAND_ReturnValue_2) == 0x00006D, "Member 'BP_PointOfInterestComponent_C_Check_Spatial_Conditions::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function BP_PointOfInterestComponent.BP_PointOfInterestComponent_C.SetInformationLevel
// 0x0030 (0x0030 - 0x0000)
struct BP_PointOfInterestComponent_C_SetInformationLevel final
{
public:
	struct FCATeamID                              _0_;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FCATeamID                              Team_id;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_Spatial_Conditions_Result;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCATeamID>                      K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	ECAInformationControlLevel                    CallFunc_GetInformationLevelForEntity_Server_ReturnValue; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_ByteByte_ReturnValue;                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PointOfInterestComponent_C_SetInformationLevel) == 0x000008, "Wrong alignment on BP_PointOfInterestComponent_C_SetInformationLevel");
static_assert(sizeof(BP_PointOfInterestComponent_C_SetInformationLevel) == 0x000030, "Wrong size on BP_PointOfInterestComponent_C_SetInformationLevel");
static_assert(offsetof(BP_PointOfInterestComponent_C_SetInformationLevel, _0_) == 0x000000, "Member 'BP_PointOfInterestComponent_C_SetInformationLevel::_0_' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_SetInformationLevel, Team_id) == 0x000004, "Member 'BP_PointOfInterestComponent_C_SetInformationLevel::Team_id' has a wrong offset!");
static_assert(offsetof(BP_PointOfInterestComponent_C_SetInformationLevel, OtherActor) == 0x000008, "Member 'BP_PointOfInterestComponent_C_SetInformationLevel::OtherActor' has a wrong offset!");
