#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PostProcess_Teleport

#include "Basic.hpp"

#include "CAAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_PostProcess_Teleport.BP_PostProcess_Teleport_C.ExecuteUbergraph_BP_PostProcess_Teleport
// 0x06B0 (0x06B0 - 0x0000)
struct BP_PostProcess_Teleport_C_ExecuteUbergraph_BP_PostProcess_Teleport final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0004(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	struct FWeightedBlendable                     K2Node_MakeStruct_WeightedBlendable;               // 0x0018(0x0010)(NoDestructor)
	TArray<struct FWeightedBlendable>             K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
	struct FWeightedBlendables                    K2Node_MakeStruct_WeightedBlendables;              // 0x0038(0x0010)()
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings;             // 0x0050(0x0640)()
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayerCharacter_ReturnValue;      // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0698(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x06A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PostProcess_Teleport_C_ExecuteUbergraph_BP_PostProcess_Teleport) == 0x000010, "Wrong alignment on BP_PostProcess_Teleport_C_ExecuteUbergraph_BP_PostProcess_Teleport");
static_assert(sizeof(BP_PostProcess_Teleport_C_ExecuteUbergraph_BP_PostProcess_Teleport) == 0x0006B0, "Wrong size on BP_PostProcess_Teleport_C_ExecuteUbergraph_BP_PostProcess_Teleport");
static_assert(offsetof(BP_PostProcess_Teleport_C_ExecuteUbergraph_BP_PostProcess_Teleport, EntryPoint) == 0x000000, "Member 'BP_PostProcess_Teleport_C_ExecuteUbergraph_BP_PostProcess_Teleport::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Teleport_C_ExecuteUbergraph_BP_PostProcess_Teleport, Temp_delegate_Variable) == 0x000004, "Member 'BP_PostProcess_Teleport_C_ExecuteUbergraph_BP_PostProcess_Teleport::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Teleport_C_ExecuteUbergraph_BP_PostProcess_Teleport, K2Node_MakeStruct_WeightedBlendable) == 0x000018, "Member 'BP_PostProcess_Teleport_C_ExecuteUbergraph_BP_PostProcess_Teleport::K2Node_MakeStruct_WeightedBlendable' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Teleport_C_ExecuteUbergraph_BP_PostProcess_Teleport, K2Node_MakeArray_Array) == 0x000028, "Member 'BP_PostProcess_Teleport_C_ExecuteUbergraph_BP_PostProcess_Teleport::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Teleport_C_ExecuteUbergraph_BP_PostProcess_Teleport, K2Node_MakeStruct_WeightedBlendables) == 0x000038, "Member 'BP_PostProcess_Teleport_C_ExecuteUbergraph_BP_PostProcess_Teleport::K2Node_MakeStruct_WeightedBlendables' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Teleport_C_ExecuteUbergraph_BP_PostProcess_Teleport, K2Node_MakeStruct_PostProcessSettings) == 0x000050, "Member 'BP_PostProcess_Teleport_C_ExecuteUbergraph_BP_PostProcess_Teleport::K2Node_MakeStruct_PostProcessSettings' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Teleport_C_ExecuteUbergraph_BP_PostProcess_Teleport, CallFunc_GetLocalPlayerCharacter_ReturnValue) == 0x000690, "Member 'BP_PostProcess_Teleport_C_ExecuteUbergraph_BP_PostProcess_Teleport::CallFunc_GetLocalPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Teleport_C_ExecuteUbergraph_BP_PostProcess_Teleport, CallFunc_PlayEvent_playback_instance) == 0x000698, "Member 'BP_PostProcess_Teleport_C_ExecuteUbergraph_BP_PostProcess_Teleport::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Teleport_C_ExecuteUbergraph_BP_PostProcess_Teleport, CallFunc_PlayEvent_play_success) == 0x0006A8, "Member 'BP_PostProcess_Teleport_C_ExecuteUbergraph_BP_PostProcess_Teleport::CallFunc_PlayEvent_play_success' has a wrong offset!");

}

