#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PostProcess_Downed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PostProcess_Downed.BP_PostProcess_Downed_C
// 0x0060 (0x02F0 - 0x0290)
class ABP_PostProcess_Downed_C final : public ACAPostProcessEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_3_Transition_2A755B5C4E7D303A1837C8B551ABC38B; // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_3__Direction_2A755B5C4E7D303A1837C8B551ABC38B; // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_3;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_Transition_AA1530D94D0A02BC63A17FA7B05867EB; // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_2__Direction_AA1530D94D0A02BC63A17FA7B05867EB; // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_2;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_HeartBeat_ADD4DF2B415ABB6062EB1C8419A98EBB; // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_ADD4DF2B415ABB6062EB1C8419A98EBB; // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Transition_83A058F746C66FB8AB9007BE179B67DE; // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_83A058F746C66FB8AB9007BE179B67DE; // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PPMaterial;                                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                LocalPlayer;                                       // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PostProcess_Downed(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnStop();
	void OnPlay();
	void Timeline_3__UpdateFunc();
	void Timeline_3__FinishedFunc();
	void Timeline_2__UpdateFunc();
	void Timeline_2__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	bool IsVisible();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PostProcess_Downed_C">();
	}
	static class ABP_PostProcess_Downed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PostProcess_Downed_C>();
	}
};
static_assert(alignof(ABP_PostProcess_Downed_C) == 0x000008, "Wrong alignment on ABP_PostProcess_Downed_C");
static_assert(sizeof(ABP_PostProcess_Downed_C) == 0x0002F0, "Wrong size on ABP_PostProcess_Downed_C");
static_assert(offsetof(ABP_PostProcess_Downed_C, UberGraphFrame) == 0x000290, "Member 'ABP_PostProcess_Downed_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Downed_C, DefaultSceneRoot) == 0x000298, "Member 'ABP_PostProcess_Downed_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Downed_C, Timeline_3_Transition_2A755B5C4E7D303A1837C8B551ABC38B) == 0x0002A0, "Member 'ABP_PostProcess_Downed_C::Timeline_3_Transition_2A755B5C4E7D303A1837C8B551ABC38B' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Downed_C, Timeline_3__Direction_2A755B5C4E7D303A1837C8B551ABC38B) == 0x0002A4, "Member 'ABP_PostProcess_Downed_C::Timeline_3__Direction_2A755B5C4E7D303A1837C8B551ABC38B' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Downed_C, Timeline_3) == 0x0002A8, "Member 'ABP_PostProcess_Downed_C::Timeline_3' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Downed_C, Timeline_2_Transition_AA1530D94D0A02BC63A17FA7B05867EB) == 0x0002B0, "Member 'ABP_PostProcess_Downed_C::Timeline_2_Transition_AA1530D94D0A02BC63A17FA7B05867EB' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Downed_C, Timeline_2__Direction_AA1530D94D0A02BC63A17FA7B05867EB) == 0x0002B4, "Member 'ABP_PostProcess_Downed_C::Timeline_2__Direction_AA1530D94D0A02BC63A17FA7B05867EB' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Downed_C, Timeline_2) == 0x0002B8, "Member 'ABP_PostProcess_Downed_C::Timeline_2' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Downed_C, Timeline_1_HeartBeat_ADD4DF2B415ABB6062EB1C8419A98EBB) == 0x0002C0, "Member 'ABP_PostProcess_Downed_C::Timeline_1_HeartBeat_ADD4DF2B415ABB6062EB1C8419A98EBB' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Downed_C, Timeline_1__Direction_ADD4DF2B415ABB6062EB1C8419A98EBB) == 0x0002C4, "Member 'ABP_PostProcess_Downed_C::Timeline_1__Direction_ADD4DF2B415ABB6062EB1C8419A98EBB' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Downed_C, Timeline_1) == 0x0002C8, "Member 'ABP_PostProcess_Downed_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Downed_C, Timeline_0_Transition_83A058F746C66FB8AB9007BE179B67DE) == 0x0002D0, "Member 'ABP_PostProcess_Downed_C::Timeline_0_Transition_83A058F746C66FB8AB9007BE179B67DE' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Downed_C, Timeline_0__Direction_83A058F746C66FB8AB9007BE179B67DE) == 0x0002D4, "Member 'ABP_PostProcess_Downed_C::Timeline_0__Direction_83A058F746C66FB8AB9007BE179B67DE' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Downed_C, Timeline_0) == 0x0002D8, "Member 'ABP_PostProcess_Downed_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Downed_C, PPMaterial) == 0x0002E0, "Member 'ABP_PostProcess_Downed_C::PPMaterial' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Downed_C, LocalPlayer) == 0x0002E8, "Member 'ABP_PostProcess_Downed_C::LocalPlayer' has a wrong offset!");

}

