#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PhysicsProp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CAGameDatabase_structs.hpp"


namespace SDK::Params
{

// Function BP_PhysicsProp.BP_PhysicsProp_C.ExecuteUbergraph_BP_PhysicsProp
// 0x0120 (0x0120 - 0x0000)
struct BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        K2Node_ComponentBoundEvent_OtherComp;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0028(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter*                           K2Node_DynamicCast_AsCACharacter;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAGameDatabaseRowHandle               K2Node_Event_config;                               // 0x00E0(0x0018)(ConstParm, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_impulse;                              // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp) == 0x000008, "Wrong alignment on BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp");
static_assert(sizeof(BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp) == 0x000120, "Wrong size on BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp");
static_assert(offsetof(BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp, EntryPoint) == 0x000000, "Member 'BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000008, "Member 'BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp, K2Node_ComponentBoundEvent_OtherActor) == 0x000010, "Member 'BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp, K2Node_ComponentBoundEvent_OtherComp) == 0x000018, "Member 'BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000020, "Member 'BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp, K2Node_ComponentBoundEvent_bFromSweep) == 0x000024, "Member 'BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp, K2Node_ComponentBoundEvent_SweepResult) == 0x000028, "Member 'BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000B8, "Member 'BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp, K2Node_DynamicCast_AsCACharacter) == 0x0000C8, "Member 'BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp::K2Node_DynamicCast_AsCACharacter' has a wrong offset!");
static_assert(offsetof(BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0000D4, "Member 'BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp, K2Node_Event_config) == 0x0000E0, "Member 'BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp::K2Node_Event_config' has a wrong offset!");
static_assert(offsetof(BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000F8, "Member 'BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000104, "Member 'BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp, K2Node_Event_impulse) == 0x000110, "Member 'BP_PhysicsProp_C_ExecuteUbergraph_BP_PhysicsProp::K2Node_Event_impulse' has a wrong offset!");

// Function BP_PhysicsProp.BP_PhysicsProp_C.AddImpulseToPhysicObject
// 0x000C (0x000C - 0x0000)
struct BP_PhysicsProp_C_AddImpulseToPhysicObject final
{
public:
	struct FVector                                Impulse;                                           // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PhysicsProp_C_AddImpulseToPhysicObject) == 0x000004, "Wrong alignment on BP_PhysicsProp_C_AddImpulseToPhysicObject");
static_assert(sizeof(BP_PhysicsProp_C_AddImpulseToPhysicObject) == 0x00000C, "Wrong size on BP_PhysicsProp_C_AddImpulseToPhysicObject");
static_assert(offsetof(BP_PhysicsProp_C_AddImpulseToPhysicObject, Impulse) == 0x000000, "Member 'BP_PhysicsProp_C_AddImpulseToPhysicObject::Impulse' has a wrong offset!");

// Function BP_PhysicsProp.BP_PhysicsProp_C.SetPhysicsObjectConfig
// 0x0018 (0x0018 - 0x0000)
struct BP_PhysicsProp_C_SetPhysicsObjectConfig final
{
public:
	struct FCAGameDatabaseRowHandle               Config;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_PhysicsProp_C_SetPhysicsObjectConfig) == 0x000004, "Wrong alignment on BP_PhysicsProp_C_SetPhysicsObjectConfig");
static_assert(sizeof(BP_PhysicsProp_C_SetPhysicsObjectConfig) == 0x000018, "Wrong size on BP_PhysicsProp_C_SetPhysicsObjectConfig");
static_assert(offsetof(BP_PhysicsProp_C_SetPhysicsObjectConfig, Config) == 0x000000, "Member 'BP_PhysicsProp_C_SetPhysicsObjectConfig::Config' has a wrong offset!");

// Function BP_PhysicsProp.BP_PhysicsProp_C.BndEvt__CACollision_K2Node_ComponentBoundEvent_0_SceneComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct BP_PhysicsProp_C_BndEvt__CACollision_K2Node_ComponentBoundEvent_0_SceneComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class USceneComponent*                        OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_PhysicsProp_C_BndEvt__CACollision_K2Node_ComponentBoundEvent_0_SceneComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_PhysicsProp_C_BndEvt__CACollision_K2Node_ComponentBoundEvent_0_SceneComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_PhysicsProp_C_BndEvt__CACollision_K2Node_ComponentBoundEvent_0_SceneComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on BP_PhysicsProp_C_BndEvt__CACollision_K2Node_ComponentBoundEvent_0_SceneComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_PhysicsProp_C_BndEvt__CACollision_K2Node_ComponentBoundEvent_0_SceneComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_PhysicsProp_C_BndEvt__CACollision_K2Node_ComponentBoundEvent_0_SceneComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_PhysicsProp_C_BndEvt__CACollision_K2Node_ComponentBoundEvent_0_SceneComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_PhysicsProp_C_BndEvt__CACollision_K2Node_ComponentBoundEvent_0_SceneComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_PhysicsProp_C_BndEvt__CACollision_K2Node_ComponentBoundEvent_0_SceneComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_PhysicsProp_C_BndEvt__CACollision_K2Node_ComponentBoundEvent_0_SceneComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_PhysicsProp_C_BndEvt__CACollision_K2Node_ComponentBoundEvent_0_SceneComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_PhysicsProp_C_BndEvt__CACollision_K2Node_ComponentBoundEvent_0_SceneComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_PhysicsProp_C_BndEvt__CACollision_K2Node_ComponentBoundEvent_0_SceneComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_PhysicsProp_C_BndEvt__CACollision_K2Node_ComponentBoundEvent_0_SceneComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_PhysicsProp_C_BndEvt__CACollision_K2Node_ComponentBoundEvent_0_SceneComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_PhysicsProp_C_BndEvt__CACollision_K2Node_ComponentBoundEvent_0_SceneComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

}

