#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_Tactical

#include "Basic.hpp"

#include "CAAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_Projectile_Tactical.BP_Projectile_Tactical_C.ExecuteUbergraph_BP_Projectile_Tactical
// 0x0018 (0x0018 - 0x0000)
struct BP_Projectile_Tactical_C_ExecuteUbergraph_BP_Projectile_Tactical final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAProjectileAoeComponent*              CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Projectile_Tactical_C_ExecuteUbergraph_BP_Projectile_Tactical) == 0x000008, "Wrong alignment on BP_Projectile_Tactical_C_ExecuteUbergraph_BP_Projectile_Tactical");
static_assert(sizeof(BP_Projectile_Tactical_C_ExecuteUbergraph_BP_Projectile_Tactical) == 0x000018, "Wrong size on BP_Projectile_Tactical_C_ExecuteUbergraph_BP_Projectile_Tactical");
static_assert(offsetof(BP_Projectile_Tactical_C_ExecuteUbergraph_BP_Projectile_Tactical, EntryPoint) == 0x000000, "Member 'BP_Projectile_Tactical_C_ExecuteUbergraph_BP_Projectile_Tactical::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Tactical_C_ExecuteUbergraph_BP_Projectile_Tactical, CallFunc_GetComponentByClass_ReturnValue) == 0x000008, "Member 'BP_Projectile_Tactical_C_ExecuteUbergraph_BP_Projectile_Tactical::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Tactical_C_ExecuteUbergraph_BP_Projectile_Tactical, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_Projectile_Tactical_C_ExecuteUbergraph_BP_Projectile_Tactical::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Projectile_Tactical.BP_Projectile_Tactical_C.SFX Projectile Travel Audio Start
// 0x000C (0x000C - 0x0000)
struct BP_Projectile_Tactical_C_SFX_Projectile_Travel_Audio_Start final
{
public:
	struct FCAAudioSwitchNameType                 Switch_Group;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FCAAudioSwitchValueType                Switch_Value;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FCAAudioEventType                      In_Flight_Audio_Event;                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_Projectile_Tactical_C_SFX_Projectile_Travel_Audio_Start) == 0x000004, "Wrong alignment on BP_Projectile_Tactical_C_SFX_Projectile_Travel_Audio_Start");
static_assert(sizeof(BP_Projectile_Tactical_C_SFX_Projectile_Travel_Audio_Start) == 0x00000C, "Wrong size on BP_Projectile_Tactical_C_SFX_Projectile_Travel_Audio_Start");
static_assert(offsetof(BP_Projectile_Tactical_C_SFX_Projectile_Travel_Audio_Start, Switch_Group) == 0x000000, "Member 'BP_Projectile_Tactical_C_SFX_Projectile_Travel_Audio_Start::Switch_Group' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Tactical_C_SFX_Projectile_Travel_Audio_Start, Switch_Value) == 0x000004, "Member 'BP_Projectile_Tactical_C_SFX_Projectile_Travel_Audio_Start::Switch_Value' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Tactical_C_SFX_Projectile_Travel_Audio_Start, In_Flight_Audio_Event) == 0x000008, "Member 'BP_Projectile_Tactical_C_SFX_Projectile_Travel_Audio_Start::In_Flight_Audio_Event' has a wrong offset!");

// Function BP_Projectile_Tactical.BP_Projectile_Tactical_C.SFX Projectile Travel Audio Stop
// 0x0004 (0x0004 - 0x0000)
struct BP_Projectile_Tactical_C_SFX_Projectile_Travel_Audio_Stop final
{
public:
	struct FCAAudioEventType                      Stop_In_Flight_Audio_Event;                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_Projectile_Tactical_C_SFX_Projectile_Travel_Audio_Stop) == 0x000004, "Wrong alignment on BP_Projectile_Tactical_C_SFX_Projectile_Travel_Audio_Stop");
static_assert(sizeof(BP_Projectile_Tactical_C_SFX_Projectile_Travel_Audio_Stop) == 0x000004, "Wrong size on BP_Projectile_Tactical_C_SFX_Projectile_Travel_Audio_Stop");
static_assert(offsetof(BP_Projectile_Tactical_C_SFX_Projectile_Travel_Audio_Stop, Stop_In_Flight_Audio_Event) == 0x000000, "Member 'BP_Projectile_Tactical_C_SFX_Projectile_Travel_Audio_Stop::Stop_In_Flight_Audio_Event' has a wrong offset!");

// Function BP_Projectile_Tactical.BP_Projectile_Tactical_C.UpgradeGadgetToCurrentLevel
// 0x0008 (0x0008 - 0x0000)
struct BP_Projectile_Tactical_C_UpgradeGadgetToCurrentLevel final
{
public:
	class AActor*                                 ActorOwner;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Projectile_Tactical_C_UpgradeGadgetToCurrentLevel) == 0x000008, "Wrong alignment on BP_Projectile_Tactical_C_UpgradeGadgetToCurrentLevel");
static_assert(sizeof(BP_Projectile_Tactical_C_UpgradeGadgetToCurrentLevel) == 0x000008, "Wrong size on BP_Projectile_Tactical_C_UpgradeGadgetToCurrentLevel");
static_assert(offsetof(BP_Projectile_Tactical_C_UpgradeGadgetToCurrentLevel, ActorOwner) == 0x000000, "Member 'BP_Projectile_Tactical_C_UpgradeGadgetToCurrentLevel::ActorOwner' has a wrong offset!");

}

