#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PostProcess_Armour_Pickup

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_PostProcess_Armour_Pickup.BP_PostProcess_Armour_Pickup_C.ExecuteUbergraph_BP_PostProcess_Armour_Pickup
// 0x0680 (0x0680 - 0x0000)
struct BP_PostProcess_Armour_Pickup_C_ExecuteUbergraph_BP_PostProcess_Armour_Pickup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWeightedBlendable                     K2Node_MakeStruct_WeightedBlendable;               // 0x0010(0x0010)(NoDestructor)
	TArray<struct FWeightedBlendable>             K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
	struct FWeightedBlendables                    K2Node_MakeStruct_WeightedBlendables;              // 0x0030(0x0010)()
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings;             // 0x0040(0x0640)()
};
static_assert(alignof(BP_PostProcess_Armour_Pickup_C_ExecuteUbergraph_BP_PostProcess_Armour_Pickup) == 0x000010, "Wrong alignment on BP_PostProcess_Armour_Pickup_C_ExecuteUbergraph_BP_PostProcess_Armour_Pickup");
static_assert(sizeof(BP_PostProcess_Armour_Pickup_C_ExecuteUbergraph_BP_PostProcess_Armour_Pickup) == 0x000680, "Wrong size on BP_PostProcess_Armour_Pickup_C_ExecuteUbergraph_BP_PostProcess_Armour_Pickup");
static_assert(offsetof(BP_PostProcess_Armour_Pickup_C_ExecuteUbergraph_BP_PostProcess_Armour_Pickup, EntryPoint) == 0x000000, "Member 'BP_PostProcess_Armour_Pickup_C_ExecuteUbergraph_BP_PostProcess_Armour_Pickup::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Armour_Pickup_C_ExecuteUbergraph_BP_PostProcess_Armour_Pickup, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_PostProcess_Armour_Pickup_C_ExecuteUbergraph_BP_PostProcess_Armour_Pickup::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Armour_Pickup_C_ExecuteUbergraph_BP_PostProcess_Armour_Pickup, K2Node_MakeStruct_WeightedBlendable) == 0x000010, "Member 'BP_PostProcess_Armour_Pickup_C_ExecuteUbergraph_BP_PostProcess_Armour_Pickup::K2Node_MakeStruct_WeightedBlendable' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Armour_Pickup_C_ExecuteUbergraph_BP_PostProcess_Armour_Pickup, K2Node_MakeArray_Array) == 0x000020, "Member 'BP_PostProcess_Armour_Pickup_C_ExecuteUbergraph_BP_PostProcess_Armour_Pickup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Armour_Pickup_C_ExecuteUbergraph_BP_PostProcess_Armour_Pickup, K2Node_MakeStruct_WeightedBlendables) == 0x000030, "Member 'BP_PostProcess_Armour_Pickup_C_ExecuteUbergraph_BP_PostProcess_Armour_Pickup::K2Node_MakeStruct_WeightedBlendables' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Armour_Pickup_C_ExecuteUbergraph_BP_PostProcess_Armour_Pickup, K2Node_MakeStruct_PostProcessSettings) == 0x000040, "Member 'BP_PostProcess_Armour_Pickup_C_ExecuteUbergraph_BP_PostProcess_Armour_Pickup::K2Node_MakeStruct_PostProcessSettings' has a wrong offset!");

}

