#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PostProcess_Heal_OneShot_Small_0

#include "Basic.hpp"

#include "CAAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_PostProcess_Heal_OneShot_Small.BP_PostProcess_Heal_OneShot_Small_C.ExecuteUbergraph_BP_PostProcess_Heal_OneShot_Small
// 0x0040 (0x0040 - 0x0000)
struct BP_PostProcess_Heal_OneShot_Small_C_ExecuteUbergraph_BP_PostProcess_Heal_OneShot_Small final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0004(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayerCharacter_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0020(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetMaterialInstance_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PostProcess_Heal_OneShot_Small_C_ExecuteUbergraph_BP_PostProcess_Heal_OneShot_Small) == 0x000008, "Wrong alignment on BP_PostProcess_Heal_OneShot_Small_C_ExecuteUbergraph_BP_PostProcess_Heal_OneShot_Small");
static_assert(sizeof(BP_PostProcess_Heal_OneShot_Small_C_ExecuteUbergraph_BP_PostProcess_Heal_OneShot_Small) == 0x000040, "Wrong size on BP_PostProcess_Heal_OneShot_Small_C_ExecuteUbergraph_BP_PostProcess_Heal_OneShot_Small");
static_assert(offsetof(BP_PostProcess_Heal_OneShot_Small_C_ExecuteUbergraph_BP_PostProcess_Heal_OneShot_Small, EntryPoint) == 0x000000, "Member 'BP_PostProcess_Heal_OneShot_Small_C_ExecuteUbergraph_BP_PostProcess_Heal_OneShot_Small::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Heal_OneShot_Small_C_ExecuteUbergraph_BP_PostProcess_Heal_OneShot_Small, Temp_delegate_Variable) == 0x000004, "Member 'BP_PostProcess_Heal_OneShot_Small_C_ExecuteUbergraph_BP_PostProcess_Heal_OneShot_Small::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Heal_OneShot_Small_C_ExecuteUbergraph_BP_PostProcess_Heal_OneShot_Small, CallFunc_GetLocalPlayerCharacter_ReturnValue) == 0x000018, "Member 'BP_PostProcess_Heal_OneShot_Small_C_ExecuteUbergraph_BP_PostProcess_Heal_OneShot_Small::CallFunc_GetLocalPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Heal_OneShot_Small_C_ExecuteUbergraph_BP_PostProcess_Heal_OneShot_Small, CallFunc_PlayEvent_playback_instance) == 0x000020, "Member 'BP_PostProcess_Heal_OneShot_Small_C_ExecuteUbergraph_BP_PostProcess_Heal_OneShot_Small::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Heal_OneShot_Small_C_ExecuteUbergraph_BP_PostProcess_Heal_OneShot_Small, CallFunc_PlayEvent_play_success) == 0x000030, "Member 'BP_PostProcess_Heal_OneShot_Small_C_ExecuteUbergraph_BP_PostProcess_Heal_OneShot_Small::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Heal_OneShot_Small_C_ExecuteUbergraph_BP_PostProcess_Heal_OneShot_Small, CallFunc_GetMaterialInstance_ReturnValue) == 0x000038, "Member 'BP_PostProcess_Heal_OneShot_Small_C_ExecuteUbergraph_BP_PostProcess_Heal_OneShot_Small::CallFunc_GetMaterialInstance_ReturnValue' has a wrong offset!");

}

