#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerCombatFXComponent

#include "Basic.hpp"

#include "Keaton_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CAAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerCombatFXComponent.BP_PlayerCombatFXComponent_C.ExecuteUbergraph_BP_PlayerCombatFXComponent
// 0x0098 (0x0098 - 0x0000)
struct BP_PlayerCombatFXComponent_C_ExecuteUbergraph_BP_PlayerCombatFXComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_CanBeDialogueSpokesperson_ReturnValue; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFeatureActive_ReturnValue;              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAPlayerHitUIData                     K2Node_Event_hit_data;                             // 0x0028(0x0068)(ConstParm)
	bool                                          CallFunc_BP_CanBeDialogueSpokesperson_ReturnValue_1; // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerCombatFXComponent_C_ExecuteUbergraph_BP_PlayerCombatFXComponent) == 0x000008, "Wrong alignment on BP_PlayerCombatFXComponent_C_ExecuteUbergraph_BP_PlayerCombatFXComponent");
static_assert(sizeof(BP_PlayerCombatFXComponent_C_ExecuteUbergraph_BP_PlayerCombatFXComponent) == 0x000098, "Wrong size on BP_PlayerCombatFXComponent_C_ExecuteUbergraph_BP_PlayerCombatFXComponent");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_ExecuteUbergraph_BP_PlayerCombatFXComponent, EntryPoint) == 0x000000, "Member 'BP_PlayerCombatFXComponent_C_ExecuteUbergraph_BP_PlayerCombatFXComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_ExecuteUbergraph_BP_PlayerCombatFXComponent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_PlayerCombatFXComponent_C_ExecuteUbergraph_BP_PlayerCombatFXComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_ExecuteUbergraph_BP_PlayerCombatFXComponent, CallFunc_BP_CanBeDialogueSpokesperson_ReturnValue) == 0x000010, "Member 'BP_PlayerCombatFXComponent_C_ExecuteUbergraph_BP_PlayerCombatFXComponent::CallFunc_BP_CanBeDialogueSpokesperson_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_ExecuteUbergraph_BP_PlayerCombatFXComponent, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x000018, "Member 'BP_PlayerCombatFXComponent_C_ExecuteUbergraph_BP_PlayerCombatFXComponent::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_ExecuteUbergraph_BP_PlayerCombatFXComponent, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_PlayerCombatFXComponent_C_ExecuteUbergraph_BP_PlayerCombatFXComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_ExecuteUbergraph_BP_PlayerCombatFXComponent, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'BP_PlayerCombatFXComponent_C_ExecuteUbergraph_BP_PlayerCombatFXComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_ExecuteUbergraph_BP_PlayerCombatFXComponent, CallFunc_IsFeatureActive_ReturnValue) == 0x000022, "Member 'BP_PlayerCombatFXComponent_C_ExecuteUbergraph_BP_PlayerCombatFXComponent::CallFunc_IsFeatureActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_ExecuteUbergraph_BP_PlayerCombatFXComponent, K2Node_Event_hit_data) == 0x000028, "Member 'BP_PlayerCombatFXComponent_C_ExecuteUbergraph_BP_PlayerCombatFXComponent::K2Node_Event_hit_data' has a wrong offset!");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_ExecuteUbergraph_BP_PlayerCombatFXComponent, CallFunc_BP_CanBeDialogueSpokesperson_ReturnValue_1) == 0x000090, "Member 'BP_PlayerCombatFXComponent_C_ExecuteUbergraph_BP_PlayerCombatFXComponent::CallFunc_BP_CanBeDialogueSpokesperson_ReturnValue_1' has a wrong offset!");

// Function BP_PlayerCombatFXComponent.BP_PlayerCombatFXComponent_C.OnHitTargetPlayFX
// 0x0068 (0x0068 - 0x0000)
struct BP_PlayerCombatFXComponent_C_OnHitTargetPlayFX final
{
public:
	struct FCAPlayerHitUIData                     Hit_data;                                          // 0x0000(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_PlayerCombatFXComponent_C_OnHitTargetPlayFX) == 0x000008, "Wrong alignment on BP_PlayerCombatFXComponent_C_OnHitTargetPlayFX");
static_assert(sizeof(BP_PlayerCombatFXComponent_C_OnHitTargetPlayFX) == 0x000068, "Wrong size on BP_PlayerCombatFXComponent_C_OnHitTargetPlayFX");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_OnHitTargetPlayFX, Hit_data) == 0x000000, "Member 'BP_PlayerCombatFXComponent_C_OnHitTargetPlayFX::Hit_data' has a wrong offset!");

// Function BP_PlayerCombatFXComponent.BP_PlayerCombatFXComponent_C.ProcessOnHitTarget
// 0x0088 (0x0088 - 0x0000)
struct BP_PlayerCombatFXComponent_C_ProcessOnHitTarget final
{
public:
	struct FCAPlayerHitUIData                     Player_Hit_UI_Data;                                // 0x0000(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm)
	class ACACharacter*                           K2Node_DynamicCast_AsCACharacter;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetIdentifierTag_ReturnValue;             // 0x0078(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerCombatFXComponent_C_ProcessOnHitTarget) == 0x000008, "Wrong alignment on BP_PlayerCombatFXComponent_C_ProcessOnHitTarget");
static_assert(sizeof(BP_PlayerCombatFXComponent_C_ProcessOnHitTarget) == 0x000088, "Wrong size on BP_PlayerCombatFXComponent_C_ProcessOnHitTarget");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_ProcessOnHitTarget, Player_Hit_UI_Data) == 0x000000, "Member 'BP_PlayerCombatFXComponent_C_ProcessOnHitTarget::Player_Hit_UI_Data' has a wrong offset!");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_ProcessOnHitTarget, K2Node_DynamicCast_AsCACharacter) == 0x000068, "Member 'BP_PlayerCombatFXComponent_C_ProcessOnHitTarget::K2Node_DynamicCast_AsCACharacter' has a wrong offset!");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_ProcessOnHitTarget, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'BP_PlayerCombatFXComponent_C_ProcessOnHitTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_ProcessOnHitTarget, CallFunc_Add_FloatFloat_ReturnValue) == 0x000074, "Member 'BP_PlayerCombatFXComponent_C_ProcessOnHitTarget::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_ProcessOnHitTarget, CallFunc_GetIdentifierTag_ReturnValue) == 0x000078, "Member 'BP_PlayerCombatFXComponent_C_ProcessOnHitTarget::CallFunc_GetIdentifierTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_ProcessOnHitTarget, CallFunc_IsValid_ReturnValue) == 0x000084, "Member 'BP_PlayerCombatFXComponent_C_ProcessOnHitTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_PlayerCombatFXComponent.BP_PlayerCombatFXComponent_C.TriggerKilledTargetMusicStinger
// 0x0070 (0x0070 - 0x0000)
struct BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0004(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayer_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0028(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_MusicConductor_EmptyBase_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0040(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MusicConductor_EmptyBase_C*         CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInVaultHackingOrBreachedState_result;   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger) == 0x000008, "Wrong alignment on BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger");
static_assert(sizeof(BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger) == 0x000070, "Wrong size on BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger, Temp_delegate_Variable) == 0x000004, "Member 'BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger, CallFunc_GetLocalPlayer_ReturnValue) == 0x000018, "Member 'BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger::CallFunc_GetLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000020, "Member 'BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger, CallFunc_PlayEvent_playback_instance) == 0x000028, "Member 'BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger, CallFunc_PlayEvent_play_success) == 0x000038, "Member 'BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger, CallFunc_GetAllActorsOfClass_OutActors) == 0x000040, "Member 'BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger, CallFunc_IsInVaultHackingOrBreachedState_result) == 0x000060, "Member 'BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger::CallFunc_IsInVaultHackingOrBreachedState_result' has a wrong offset!");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'BP_PlayerCombatFXComponent_C_TriggerKilledTargetMusicStinger::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_PlayerCombatFXComponent.BP_PlayerCombatFXComponent_C.Create Downed AR
// 0x0070 (0x0070 - 0x0000)
struct BP_PlayerCombatFXComponent_C_Create_Downed_AR final
{
public:
	struct FNetworkedHit                          NewLocalVar_0;                                     // 0x0000(0x0068)(Edit, BlueprintVisible, NoDestructor)
	bool                                          CallFunc_TryActivateAbilityByClass_ReturnValue;    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerCombatFXComponent_C_Create_Downed_AR) == 0x000008, "Wrong alignment on BP_PlayerCombatFXComponent_C_Create_Downed_AR");
static_assert(sizeof(BP_PlayerCombatFXComponent_C_Create_Downed_AR) == 0x000070, "Wrong size on BP_PlayerCombatFXComponent_C_Create_Downed_AR");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_Create_Downed_AR, NewLocalVar_0) == 0x000000, "Member 'BP_PlayerCombatFXComponent_C_Create_Downed_AR::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_Create_Downed_AR, CallFunc_TryActivateAbilityByClass_ReturnValue) == 0x000068, "Member 'BP_PlayerCombatFXComponent_C_Create_Downed_AR::CallFunc_TryActivateAbilityByClass_ReturnValue' has a wrong offset!");

// Function BP_PlayerCombatFXComponent.BP_PlayerCombatFXComponent_C.Get Downed Hit Information
// 0x0068 (0x0068 - 0x0000)
struct BP_PlayerCombatFXComponent_C_Get_Downed_Hit_Information final
{
public:
	struct FNetworkedHit                          Recent_Downed_Hit;                                 // 0x0000(0x0068)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BP_PlayerCombatFXComponent_C_Get_Downed_Hit_Information) == 0x000008, "Wrong alignment on BP_PlayerCombatFXComponent_C_Get_Downed_Hit_Information");
static_assert(sizeof(BP_PlayerCombatFXComponent_C_Get_Downed_Hit_Information) == 0x000068, "Wrong size on BP_PlayerCombatFXComponent_C_Get_Downed_Hit_Information");
static_assert(offsetof(BP_PlayerCombatFXComponent_C_Get_Downed_Hit_Information, Recent_Downed_Hit) == 0x000000, "Member 'BP_PlayerCombatFXComponent_C_Get_Downed_Hit_Information::Recent_Downed_Hit' has a wrong offset!");

}

