#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerCard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Keaton_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_PlayerCard.BP_PlayerCard_C
// 0x0170 (0x0458 - 0x02E8)
class UBP_PlayerCard_C final : public UCABaseScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Expand_6;                                          // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Expand_5;                                          // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Expand_4;                                          // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Expand_3;                                          // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Expand_0;                                          // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Expand;                                            // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AnimCover;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_3;                                            // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PlayerCard_hc_base_C*               BP_PlayerCard_hc_base_C_359;                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               buttonOverlay;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommon_ActionButton_C*                 Controller_hint;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Hard_currency;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCurrencyTextBlock_C*                   Hc;                                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           Level_Progression;                                 // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LevelNameText;                                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MainOverlay;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             OutlineXPText;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerNameText;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Profile_button;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCATextBlock*                           Profile_label;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Rank_icon;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCurrencyTextBlock_C*                   Sc;                                                // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sc_ico_1;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sc_ico_2;                                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Soft_currency;                                     // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UserAvatar;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             XPText;                                            // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnProfileClicked;                                  // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UUMGSequencePlayer*                     NewVar_0;                                          // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            DefaultWhiteColor;                                 // 0x03F0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            DefaultBlueColor;                                  // 0x0418(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          HeaderExpanded;                                    // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     Result;                                            // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Player_card_Contracted;                            // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OnProfileClicked__DelegateSignature();
	void ExecuteUbergraph_BP_PlayerCard(int32 EntryPoint);
	void OnHideTitleBar();
	void OnShowTItleBar();
	void OnLocalisationCultureChange();
	void OnHeaderContracted();
	void OnHeaderExpanded();
	void BndEvt__BP_PlayerCard_profile_button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__BP_PlayerCard_profile_button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void BndEvt__profile_button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ShowServicesUserID(bool Show);
	void SetPlayerCardData(const struct FCAPlayerCardUIData& Player_card_data);
	void SetUserID(const class FText& User_id);
	void SetLevelProgress(float Preogress);
	void SetHardCurrency(const TMap<class FName, struct FCACurrencyAssetData>& Currencies);
	void SetCurrency(const TMap<class FName, struct FCACurrencyAssetData>& Currencys, class FName Currency_name, class UWidget* Container, class UCACurrencyTextBlock* Currency);
	void SetSoftCurrency(const TMap<class FName, struct FCACurrencyAssetData>& Currencies);
	void SetRankValue(int64 Rank);
	void SetRankIcon(TSoftObjectPtr<class UTexture2D> Texture);
	void SetRankName(const class FText& Name_0);
	void SetPlayerName(const class FText& Name_0);
	void Finished_37250D124447F7F4A3A2A0B68BBCC389();
	void Finished_851F566545F7EB2CB056568AF0E50F6C();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayerCard_C">();
	}
	static class UBP_PlayerCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PlayerCard_C>();
	}
};
static_assert(alignof(UBP_PlayerCard_C) == 0x000008, "Wrong alignment on UBP_PlayerCard_C");
static_assert(sizeof(UBP_PlayerCard_C) == 0x000458, "Wrong size on UBP_PlayerCard_C");
static_assert(offsetof(UBP_PlayerCard_C, UberGraphFrame) == 0x0002E8, "Member 'UBP_PlayerCard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, Expand_6) == 0x0002F0, "Member 'UBP_PlayerCard_C::Expand_6' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, Expand_5) == 0x0002F8, "Member 'UBP_PlayerCard_C::Expand_5' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, Expand_4) == 0x000300, "Member 'UBP_PlayerCard_C::Expand_4' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, Expand_3) == 0x000308, "Member 'UBP_PlayerCard_C::Expand_3' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, Expand_0) == 0x000310, "Member 'UBP_PlayerCard_C::Expand_0' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, Expand) == 0x000318, "Member 'UBP_PlayerCard_C::Expand' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, AnimCover) == 0x000320, "Member 'UBP_PlayerCard_C::AnimCover' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, Arrow) == 0x000328, "Member 'UBP_PlayerCard_C::Arrow' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, Base_3) == 0x000330, "Member 'UBP_PlayerCard_C::Base_3' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, BP_PlayerCard_hc_base_C_359) == 0x000338, "Member 'UBP_PlayerCard_C::BP_PlayerCard_hc_base_C_359' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, buttonOverlay) == 0x000340, "Member 'UBP_PlayerCard_C::buttonOverlay' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, Controller_hint) == 0x000348, "Member 'UBP_PlayerCard_C::Controller_hint' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, Hard_currency) == 0x000350, "Member 'UBP_PlayerCard_C::Hard_currency' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, Hc) == 0x000358, "Member 'UBP_PlayerCard_C::Hc' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, Level_Progression) == 0x000360, "Member 'UBP_PlayerCard_C::Level_Progression' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, LevelNameText) == 0x000368, "Member 'UBP_PlayerCard_C::LevelNameText' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, MainOverlay) == 0x000370, "Member 'UBP_PlayerCard_C::MainOverlay' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, OutlineXPText) == 0x000378, "Member 'UBP_PlayerCard_C::OutlineXPText' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, PlayerNameText) == 0x000380, "Member 'UBP_PlayerCard_C::PlayerNameText' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, Profile_button) == 0x000388, "Member 'UBP_PlayerCard_C::Profile_button' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, Profile_label) == 0x000390, "Member 'UBP_PlayerCard_C::Profile_label' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, Rank_icon) == 0x000398, "Member 'UBP_PlayerCard_C::Rank_icon' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, RetainerBox_0) == 0x0003A0, "Member 'UBP_PlayerCard_C::RetainerBox_0' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, Sc) == 0x0003A8, "Member 'UBP_PlayerCard_C::Sc' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, Sc_ico_1) == 0x0003B0, "Member 'UBP_PlayerCard_C::Sc_ico_1' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, Sc_ico_2) == 0x0003B8, "Member 'UBP_PlayerCard_C::Sc_ico_2' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, Soft_currency) == 0x0003C0, "Member 'UBP_PlayerCard_C::Soft_currency' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, UserAvatar) == 0x0003C8, "Member 'UBP_PlayerCard_C::UserAvatar' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, XPText) == 0x0003D0, "Member 'UBP_PlayerCard_C::XPText' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, OnProfileClicked) == 0x0003D8, "Member 'UBP_PlayerCard_C::OnProfileClicked' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, NewVar_0) == 0x0003E8, "Member 'UBP_PlayerCard_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, DefaultWhiteColor) == 0x0003F0, "Member 'UBP_PlayerCard_C::DefaultWhiteColor' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, DefaultBlueColor) == 0x000418, "Member 'UBP_PlayerCard_C::DefaultBlueColor' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, HeaderExpanded) == 0x000440, "Member 'UBP_PlayerCard_C::HeaderExpanded' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, Result) == 0x000448, "Member 'UBP_PlayerCard_C::Result' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCard_C, Player_card_Contracted) == 0x000450, "Member 'UBP_PlayerCard_C::Player_card_Contracted' has a wrong offset!");

}

