#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_Tactical_CosplayerFlash

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Projectile_Tactical_CosplayerFlash.BP_Projectile_Tactical_CosplayerFlash_C
// 0x0050 (0x0680 - 0x0630)
class ABP_Projectile_Tactical_CosplayerFlash_C final : public ACAProjectile_Flashbang
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0630(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_ArcLensInspectable_Projectile_C*    BP_ArcLensInspectable_Projectile;                  // 0x0638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ProjectileAoE_C*                   BPC_ProjectileAoE;                                 // 0x0640(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_GravityStatusComponent_C*           BP_GravityStatusComponent;                         // 0x0648(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0650(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          HasDetonated;                                      // 0x0658(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_659[0x3];                                      // 0x0659(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ExplosionCounter;                                  // 0x065C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BouncePitchAlarmAmount;                            // 0x0660(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BounceSpeed;                                       // 0x0664(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   OnPerkActive;                                      // 0x0668(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanTriggerDialogueLine;                            // 0x0674(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Projectile_Tactical_CosplayerFlash(int32 EntryPoint);
	void BndEvt__BP_Projectile_Tactical_CosplayerFlash_BPC_ProjectileAoE_K2Node_ComponentBoundEvent_7_CAProjectileAOEDetonationFinishedServerEvent__DelegateSignature(TArray<struct FHitResult>& Hit_results);
	void BndEvt__BP_Projectile_Tactical_Flash_Nativised_m_movement_component_K2Node_ComponentBoundEvent_1_OnProjectileBounceDelegate__DelegateSignature(const struct FHitResult& ImpactResult, const struct FVector& ImpactVelocity);
	void BndEvt__BP_Projectile_Tactical_Flash_Nativised_BPC_ProjectileAoE_K2Node_ComponentBoundEvent_0_CAProjectileAOEDetonationFinishedClientEvent__DelegateSignature(const struct FHitResult& Hit);
	void BP_UpgradeToTacticalLevel();
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void TriggerPerkNotification();

	float BP_GetProjectileGravityScale(int32 Upgrade_level) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Projectile_Tactical_CosplayerFlash_C">();
	}
	static class ABP_Projectile_Tactical_CosplayerFlash_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Projectile_Tactical_CosplayerFlash_C>();
	}
};
static_assert(alignof(ABP_Projectile_Tactical_CosplayerFlash_C) == 0x000010, "Wrong alignment on ABP_Projectile_Tactical_CosplayerFlash_C");
static_assert(sizeof(ABP_Projectile_Tactical_CosplayerFlash_C) == 0x000680, "Wrong size on ABP_Projectile_Tactical_CosplayerFlash_C");
static_assert(offsetof(ABP_Projectile_Tactical_CosplayerFlash_C, UberGraphFrame) == 0x000630, "Member 'ABP_Projectile_Tactical_CosplayerFlash_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Tactical_CosplayerFlash_C, BP_ArcLensInspectable_Projectile) == 0x000638, "Member 'ABP_Projectile_Tactical_CosplayerFlash_C::BP_ArcLensInspectable_Projectile' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Tactical_CosplayerFlash_C, BPC_ProjectileAoE) == 0x000640, "Member 'ABP_Projectile_Tactical_CosplayerFlash_C::BPC_ProjectileAoE' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Tactical_CosplayerFlash_C, BP_GravityStatusComponent) == 0x000648, "Member 'ABP_Projectile_Tactical_CosplayerFlash_C::BP_GravityStatusComponent' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Tactical_CosplayerFlash_C, SkeletalMesh) == 0x000650, "Member 'ABP_Projectile_Tactical_CosplayerFlash_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Tactical_CosplayerFlash_C, HasDetonated) == 0x000658, "Member 'ABP_Projectile_Tactical_CosplayerFlash_C::HasDetonated' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Tactical_CosplayerFlash_C, ExplosionCounter) == 0x00065C, "Member 'ABP_Projectile_Tactical_CosplayerFlash_C::ExplosionCounter' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Tactical_CosplayerFlash_C, BouncePitchAlarmAmount) == 0x000660, "Member 'ABP_Projectile_Tactical_CosplayerFlash_C::BouncePitchAlarmAmount' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Tactical_CosplayerFlash_C, BounceSpeed) == 0x000664, "Member 'ABP_Projectile_Tactical_CosplayerFlash_C::BounceSpeed' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Tactical_CosplayerFlash_C, OnPerkActive) == 0x000668, "Member 'ABP_Projectile_Tactical_CosplayerFlash_C::OnPerkActive' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Tactical_CosplayerFlash_C, CanTriggerDialogueLine) == 0x000674, "Member 'ABP_Projectile_Tactical_CosplayerFlash_C::CanTriggerDialogueLine' has a wrong offset!");

}

