#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerStateMachine

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PlayerStateMachine.BP_PlayerStateMachine_C.ExecuteUbergraph_BP_PlayerStateMachine
// 0x0070 (0x0070 - 0x0000)
struct BP_PlayerStateMachine_C_ExecuteUbergraph_BP_PlayerStateMachine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* User)>           K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0014)(ZeroConstructor, NoDestructor)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_1;             // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_User_1;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAUsableState*                         CallFunc_GetUsableStateByName_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_2;             // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_User;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerStateMachine_C_ExecuteUbergraph_BP_PlayerStateMachine) == 0x000008, "Wrong alignment on BP_PlayerStateMachine_C_ExecuteUbergraph_BP_PlayerStateMachine");
static_assert(sizeof(BP_PlayerStateMachine_C_ExecuteUbergraph_BP_PlayerStateMachine) == 0x000070, "Wrong size on BP_PlayerStateMachine_C_ExecuteUbergraph_BP_PlayerStateMachine");
static_assert(offsetof(BP_PlayerStateMachine_C_ExecuteUbergraph_BP_PlayerStateMachine, EntryPoint) == 0x000000, "Member 'BP_PlayerStateMachine_C_ExecuteUbergraph_BP_PlayerStateMachine::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerStateMachine_C_ExecuteUbergraph_BP_PlayerStateMachine, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_PlayerStateMachine_C_ExecuteUbergraph_BP_PlayerStateMachine::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PlayerStateMachine_C_ExecuteUbergraph_BP_PlayerStateMachine, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'BP_PlayerStateMachine_C_ExecuteUbergraph_BP_PlayerStateMachine::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerStateMachine_C_ExecuteUbergraph_BP_PlayerStateMachine, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'BP_PlayerStateMachine_C_ExecuteUbergraph_BP_PlayerStateMachine::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerStateMachine_C_ExecuteUbergraph_BP_PlayerStateMachine, CallFunc_GetStateByName_ReturnValue) == 0x000040, "Member 'BP_PlayerStateMachine_C_ExecuteUbergraph_BP_PlayerStateMachine::CallFunc_GetStateByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerStateMachine_C_ExecuteUbergraph_BP_PlayerStateMachine, CallFunc_GetStateByName_ReturnValue_1) == 0x000048, "Member 'BP_PlayerStateMachine_C_ExecuteUbergraph_BP_PlayerStateMachine::CallFunc_GetStateByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerStateMachine_C_ExecuteUbergraph_BP_PlayerStateMachine, K2Node_CustomEvent_User_1) == 0x000050, "Member 'BP_PlayerStateMachine_C_ExecuteUbergraph_BP_PlayerStateMachine::K2Node_CustomEvent_User_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerStateMachine_C_ExecuteUbergraph_BP_PlayerStateMachine, CallFunc_GetUsableStateByName_ReturnValue) == 0x000058, "Member 'BP_PlayerStateMachine_C_ExecuteUbergraph_BP_PlayerStateMachine::CallFunc_GetUsableStateByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerStateMachine_C_ExecuteUbergraph_BP_PlayerStateMachine, CallFunc_GetStateByName_ReturnValue_2) == 0x000060, "Member 'BP_PlayerStateMachine_C_ExecuteUbergraph_BP_PlayerStateMachine::CallFunc_GetStateByName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerStateMachine_C_ExecuteUbergraph_BP_PlayerStateMachine, K2Node_CustomEvent_User) == 0x000068, "Member 'BP_PlayerStateMachine_C_ExecuteUbergraph_BP_PlayerStateMachine::K2Node_CustomEvent_User' has a wrong offset!");

// Function BP_PlayerStateMachine.BP_PlayerStateMachine_C.Execute
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerStateMachine_C_Execute final
{
public:
	class AActor*                                 User;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerStateMachine_C_Execute) == 0x000008, "Wrong alignment on BP_PlayerStateMachine_C_Execute");
static_assert(sizeof(BP_PlayerStateMachine_C_Execute) == 0x000008, "Wrong size on BP_PlayerStateMachine_C_Execute");
static_assert(offsetof(BP_PlayerStateMachine_C_Execute, User) == 0x000000, "Member 'BP_PlayerStateMachine_C_Execute::User' has a wrong offset!");

// Function BP_PlayerStateMachine.BP_PlayerStateMachine_C.Revive
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerStateMachine_C_Revive final
{
public:
	class AActor*                                 User;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerStateMachine_C_Revive) == 0x000008, "Wrong alignment on BP_PlayerStateMachine_C_Revive");
static_assert(sizeof(BP_PlayerStateMachine_C_Revive) == 0x000008, "Wrong size on BP_PlayerStateMachine_C_Revive");
static_assert(offsetof(BP_PlayerStateMachine_C_Revive, User) == 0x000000, "Member 'BP_PlayerStateMachine_C_Revive::User' has a wrong offset!");

}

