#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PartyPlayerCard

#include "Basic.hpp"

#include "CAAudio_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Keaton_structs.hpp"


namespace SDK::Params
{

// Function BP_PartyPlayerCard.BP_PartyPlayerCard_C.OnCardActivated__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_PartyPlayerCard_C_OnCardActivated__DelegateSignature final
{
public:
	class UBP_PartyPlayerCard_C*                  Card;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PartyPlayerCard_C_OnCardActivated__DelegateSignature) == 0x000008, "Wrong alignment on BP_PartyPlayerCard_C_OnCardActivated__DelegateSignature");
static_assert(sizeof(BP_PartyPlayerCard_C_OnCardActivated__DelegateSignature) == 0x000008, "Wrong size on BP_PartyPlayerCard_C_OnCardActivated__DelegateSignature");
static_assert(offsetof(BP_PartyPlayerCard_C_OnCardActivated__DelegateSignature, Card) == 0x000000, "Member 'BP_PartyPlayerCard_C_OnCardActivated__DelegateSignature::Card' has a wrong offset!");

// Function BP_PartyPlayerCard.BP_PartyPlayerCard_C.OnPartyPlayerCardStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_PartyPlayerCard_C_OnPartyPlayerCardStateChanged__DelegateSignature final
{
public:
	class UBP_PartyPlayerCard_C*                  PartyPlayerCard;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAPartyPlayerCardState                       PartyCardState;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PartyPlayerCard_C_OnPartyPlayerCardStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on BP_PartyPlayerCard_C_OnPartyPlayerCardStateChanged__DelegateSignature");
static_assert(sizeof(BP_PartyPlayerCard_C_OnPartyPlayerCardStateChanged__DelegateSignature) == 0x000010, "Wrong size on BP_PartyPlayerCard_C_OnPartyPlayerCardStateChanged__DelegateSignature");
static_assert(offsetof(BP_PartyPlayerCard_C_OnPartyPlayerCardStateChanged__DelegateSignature, PartyPlayerCard) == 0x000000, "Member 'BP_PartyPlayerCard_C_OnPartyPlayerCardStateChanged__DelegateSignature::PartyPlayerCard' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_OnPartyPlayerCardStateChanged__DelegateSignature, PartyCardState) == 0x000008, "Member 'BP_PartyPlayerCard_C_OnPartyPlayerCardStateChanged__DelegateSignature::PartyCardState' has a wrong offset!");

// Function BP_PartyPlayerCard.BP_PartyPlayerCard_C.ExecuteUbergraph_BP_PartyPlayerCard
// 0x0808 (0x0808 - 0x0000)
struct BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0008(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAPartyMemberUIData                   K2Node_CustomEvent_member_data;                    // 0x0038(0x0068)(ConstParm)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x00A0(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_2;                          // 0x00B4(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_19;              // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_18;              // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_17;              // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_16;              // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsLocalUserPartyLeader_ReturnValue;    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_12;                             // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EB[0x5];                                       // 0x00EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseSymbolElement*                   CallFunc_Array_Get_Item;                           // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_15;              // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_14;              // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_13;              // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_12;              // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayer_ReturnValue;               // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0128(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayer_ReturnValue_1;             // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x0148(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15A[0x2];                                      // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x015C(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0198(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0210(0x0078)(ConstParm)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_11;              // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_10;              // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayer_ReturnValue_2;             // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_2;            // 0x02A0(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_2;                 // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_7;                              // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B2[0x6];                                      // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCASpecialistUIItem                    CallFunc_GetSpecialistItem_item;                   // 0x02B8(0x02F8)()
	bool                                          CallFunc_IsCATextValid_ReturnValue;                // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B1[0x7];                                      // 0x05B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x05B8(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1[0x7];                                      // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x05D8(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_13;                             // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F1[0x3];                                      // 0x05F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAUIEventData& Event_data)> K2Node_CreateDelegate_OutputDelegate;              // 0x05F4(0x0014)(ZeroConstructor, NoDestructor)
	struct FCAUIEventData                         K2Node_CustomEvent_event_data;                     // 0x0608(0x0080)()
	TDelegate<void(const struct FCAUIEventData& Event_data)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0688(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAUIEventData& Event_data)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x069C(0x0014)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x06B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x06B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x06B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x06B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x06B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x06B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x06B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_14;                             // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x06B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x06BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BB[0x5];                                      // 0x06BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAPartyMemberUIData                   K2Node_MakeStruct_CAPartyMemberUIData;             // 0x06C0(0x0068)()
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x0729(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x072A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x072B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x072C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72D[0x3];                                      // 0x072D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_9;               // 0x0730(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_8;               // 0x0738(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_7;               // 0x0740(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_6;               // 0x0748(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UCABaseSymbolElement*>           K2Node_MakeArray_Array;                            // 0x0750(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UCABaseSymbolElement*>           K2Node_MakeArray_Array_1;                          // 0x0760(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UCABaseSymbolElement*>           K2Node_Select_Default_6;                           // 0x0770(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_5;               // 0x0780(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_4;               // 0x0788(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_3;               // 0x0790(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_2;               // 0x0798(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_1;               // 0x07A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button;                 // 0x07A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCASocialScreenProxy*                   CallFunc_GetSocialScreenProxy_ReturnValue;         // 0x07B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x07B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B9[0x3];                                      // 0x07B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x07BC(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x07D0(0x0014)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_15;                             // 0x07E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_7;                           // 0x07E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsUserMuted_ReturnValue;               // 0x07E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_8;                           // 0x07E7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x07E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x07EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7ED[0x3];                                      // 0x07ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x07F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x07F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F5[0x3];                                      // 0x07F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCASocialScreenProxy*                   CallFunc_GetSocialScreenProxy_ReturnValue_1;       // 0x07F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0800(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCurrentContext_ReturnValue;             // 0x0801(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard) == 0x000008, "Wrong alignment on BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard");
static_assert(sizeof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard) == 0x000808, "Wrong size on BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, EntryPoint) == 0x000000, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_byte_Variable) == 0x000004, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_byte_Variable_1) == 0x000005, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_byte_Variable_2) == 0x000006, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_delegate_Variable) == 0x000008, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_bool_Variable) == 0x00001C, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_byte_Variable_3) == 0x00001D, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_byte_Variable_4) == 0x00001E, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_bool_Variable_1) == 0x00001F, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_byte_Variable_5) == 0x000020, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_byte_Variable_6) == 0x000021, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_bool_Variable_2) == 0x000022, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_byte_Variable_7) == 0x000023, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_byte_Variable_8) == 0x000024, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_bool_Variable_3) == 0x000025, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_bool_Variable_4) == 0x000026, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_byte_Variable_9) == 0x000027, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_byte_Variable_10) == 0x000028, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_bool_True_if_break_was_hit_Variable) == 0x000029, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_Not_PreBool_ReturnValue) == 0x000030, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_bool_Variable_5) == 0x000031, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_bool_Variable_6) == 0x000032, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_CustomEvent_member_data) == 0x000038, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_CustomEvent_member_data' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_delegate_Variable_1) == 0x0000A0, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_delegate_Variable_2) == 0x0000B4, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_ComponentBoundEvent_button_19) == 0x0000C8, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_ComponentBoundEvent_button_19' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_ComponentBoundEvent_button_18) == 0x0000D0, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_ComponentBoundEvent_button_18' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_ComponentBoundEvent_button_17) == 0x0000D8, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_ComponentBoundEvent_button_17' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_ComponentBoundEvent_button_16) == 0x0000E0, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_ComponentBoundEvent_button_16' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_GetIsLocalUserPartyLeader_ReturnValue) == 0x0000E8, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_GetIsLocalUserPartyLeader_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_byte_Variable_11) == 0x0000E9, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_byte_Variable_12) == 0x0000EA, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_Array_Length_ReturnValue) == 0x0000F8, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_GetVisibility_ReturnValue) == 0x0000FC, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000FD, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_ComponentBoundEvent_button_15) == 0x000100, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_ComponentBoundEvent_button_15' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_ComponentBoundEvent_button_14) == 0x000108, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_ComponentBoundEvent_button_14' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_ComponentBoundEvent_button_13) == 0x000110, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_ComponentBoundEvent_button_13' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_ComponentBoundEvent_button_12) == 0x000118, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_ComponentBoundEvent_button_12' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_GetLocalPlayer_ReturnValue) == 0x000120, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_GetLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_PlayEvent_playback_instance) == 0x000128, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_PlayEvent_play_success) == 0x000138, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_GetLocalPlayer_ReturnValue_1) == 0x000140, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_GetLocalPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_PlayEvent_playback_instance_1) == 0x000148, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_PlayEvent_play_success_1) == 0x000158, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_PlayEvent_play_success_1' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_IsEmpty_ReturnValue) == 0x000159, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_Event_MyGeometry) == 0x00015C, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_Event_MouseEvent_1) == 0x000198, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_Event_MouseEvent) == 0x000210, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_ComponentBoundEvent_button_11) == 0x000288, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_ComponentBoundEvent_button_11' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_ComponentBoundEvent_button_10) == 0x000290, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_ComponentBoundEvent_button_10' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_GetLocalPlayer_ReturnValue_2) == 0x000298, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_GetLocalPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_PlayEvent_playback_instance_2) == 0x0002A0, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_PlayEvent_playback_instance_2' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_PlayEvent_play_success_2) == 0x0002B0, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_PlayEvent_play_success_2' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_bool_Variable_7) == 0x0002B1, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_GetSpecialistItem_item) == 0x0002B8, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_GetSpecialistItem_item' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_IsCATextValid_ReturnValue) == 0x0005B0, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_IsCATextValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_Conv_IntToText_ReturnValue) == 0x0005B8, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_Select_Default) == 0x0005D0, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_Conv_StringToText_ReturnValue) == 0x0005D8, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_byte_Variable_13) == 0x0005F0, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_CreateDelegate_OutputDelegate) == 0x0005F4, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_CustomEvent_event_data) == 0x000608, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_CustomEvent_event_data' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_CreateDelegate_OutputDelegate_1) == 0x000688, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_CreateDelegate_OutputDelegate_2) == 0x00069C, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_Select_Default_1) == 0x0006B0, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_Select_Default_2) == 0x0006B1, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_BooleanAND_ReturnValue) == 0x0006B2, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_Select_Default_3) == 0x0006B3, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_Not_PreBool_ReturnValue_1) == 0x0006B4, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_Not_PreBool_ReturnValue_2) == 0x0006B5, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_Not_PreBool_ReturnValue_3) == 0x0006B6, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_BooleanOR_ReturnValue) == 0x0006B7, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_byte_Variable_14) == 0x0006B8, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_bool_Variable_8) == 0x0006B9, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_Select_Default_4) == 0x0006BA, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_MakeStruct_CAPartyMemberUIData) == 0x0006C0, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_MakeStruct_CAPartyMemberUIData' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_BooleanAND_ReturnValue_1) == 0x000728, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_Select_Default_5) == 0x000729, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_Not_PreBool_ReturnValue_4) == 0x00072A, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_Not_PreBool_ReturnValue_5) == 0x00072B, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_Not_PreBool_ReturnValue_6) == 0x00072C, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_ComponentBoundEvent_button_9) == 0x000730, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_ComponentBoundEvent_button_9' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_ComponentBoundEvent_button_8) == 0x000738, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_ComponentBoundEvent_button_8' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_ComponentBoundEvent_button_7) == 0x000740, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_ComponentBoundEvent_button_7' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_ComponentBoundEvent_button_6) == 0x000748, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_ComponentBoundEvent_button_6' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_MakeArray_Array) == 0x000750, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_MakeArray_Array_1) == 0x000760, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_Select_Default_6) == 0x000770, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_ComponentBoundEvent_button_5) == 0x000780, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_ComponentBoundEvent_button_5' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_ComponentBoundEvent_button_4) == 0x000788, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_ComponentBoundEvent_button_4' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_ComponentBoundEvent_button_3) == 0x000790, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_ComponentBoundEvent_button_3' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_ComponentBoundEvent_button_2) == 0x000798, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_ComponentBoundEvent_button_2' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_ComponentBoundEvent_button_1) == 0x0007A0, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_ComponentBoundEvent_button_1' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_ComponentBoundEvent_button) == 0x0007A8, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_ComponentBoundEvent_button' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_GetSocialScreenProxy_ReturnValue) == 0x0007B0, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_GetSocialScreenProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_IsValid_ReturnValue) == 0x0007B8, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_CreateDelegate_OutputDelegate_3) == 0x0007BC, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_CreateDelegate_OutputDelegate_4) == 0x0007D0, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_byte_Variable_15) == 0x0007E4, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_byte_Variable_15' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_Select_Default_7) == 0x0007E5, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_GetIsUserMuted_ReturnValue) == 0x0007E6, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_GetIsUserMuted_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, K2Node_Select_Default_8) == 0x0007E7, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, Temp_int_Loop_Counter_Variable) == 0x0007E8, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_Less_IntInt_ReturnValue) == 0x0007EC, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_Add_IntInt_ReturnValue) == 0x0007F0, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_BooleanAND_ReturnValue_2) == 0x0007F4, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_GetSocialScreenProxy_ReturnValue_1) == 0x0007F8, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_GetSocialScreenProxy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_IsValid_ReturnValue_1) == 0x000800, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard, CallFunc_IsCurrentContext_ReturnValue) == 0x000801, "Member 'BP_PartyPlayerCard_C_ExecuteUbergraph_BP_PartyPlayerCard::CallFunc_IsCurrentContext_ReturnValue' has a wrong offset!");

// Function BP_PartyPlayerCard.BP_PartyPlayerCard_C.BndEvt__BP_PartyPlayerCard_hud_back_btn_K2Node_ComponentBoundEvent_19_UIElementSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_back_btn_K2Node_ComponentBoundEvent_19_UIElementSelected__DelegateSignature final
{
public:
	class UCABaseUIElement*                       button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_back_btn_K2Node_ComponentBoundEvent_19_UIElementSelected__DelegateSignature) == 0x000008, "Wrong alignment on BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_back_btn_K2Node_ComponentBoundEvent_19_UIElementSelected__DelegateSignature");
static_assert(sizeof(BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_back_btn_K2Node_ComponentBoundEvent_19_UIElementSelected__DelegateSignature) == 0x000008, "Wrong size on BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_back_btn_K2Node_ComponentBoundEvent_19_UIElementSelected__DelegateSignature");
static_assert(offsetof(BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_back_btn_K2Node_ComponentBoundEvent_19_UIElementSelected__DelegateSignature, button) == 0x000000, "Member 'BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_back_btn_K2Node_ComponentBoundEvent_19_UIElementSelected__DelegateSignature::button' has a wrong offset!");

// Function BP_PartyPlayerCard.BP_PartyPlayerCard_C.BndEvt__BP_PartyPlayerCard_hud_back_btn_K2Node_ComponentBoundEvent_18_UIElementInternalClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_back_btn_K2Node_ComponentBoundEvent_18_UIElementInternalClick__DelegateSignature final
{
public:
	class UCABaseUIElement*                       button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_back_btn_K2Node_ComponentBoundEvent_18_UIElementInternalClick__DelegateSignature) == 0x000008, "Wrong alignment on BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_back_btn_K2Node_ComponentBoundEvent_18_UIElementInternalClick__DelegateSignature");
static_assert(sizeof(BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_back_btn_K2Node_ComponentBoundEvent_18_UIElementInternalClick__DelegateSignature) == 0x000008, "Wrong size on BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_back_btn_K2Node_ComponentBoundEvent_18_UIElementInternalClick__DelegateSignature");
static_assert(offsetof(BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_back_btn_K2Node_ComponentBoundEvent_18_UIElementInternalClick__DelegateSignature, button) == 0x000000, "Member 'BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_back_btn_K2Node_ComponentBoundEvent_18_UIElementInternalClick__DelegateSignature::button' has a wrong offset!");

// Function BP_PartyPlayerCard.BP_PartyPlayerCard_C.BndEvt__BP_PartyPlayerCard_hud_unmute_btn_K2Node_ComponentBoundEvent_17_UIElementSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_unmute_btn_K2Node_ComponentBoundEvent_17_UIElementSelected__DelegateSignature final
{
public:
	class UCABaseUIElement*                       button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_unmute_btn_K2Node_ComponentBoundEvent_17_UIElementSelected__DelegateSignature) == 0x000008, "Wrong alignment on BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_unmute_btn_K2Node_ComponentBoundEvent_17_UIElementSelected__DelegateSignature");
static_assert(sizeof(BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_unmute_btn_K2Node_ComponentBoundEvent_17_UIElementSelected__DelegateSignature) == 0x000008, "Wrong size on BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_unmute_btn_K2Node_ComponentBoundEvent_17_UIElementSelected__DelegateSignature");
static_assert(offsetof(BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_unmute_btn_K2Node_ComponentBoundEvent_17_UIElementSelected__DelegateSignature, button) == 0x000000, "Member 'BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_unmute_btn_K2Node_ComponentBoundEvent_17_UIElementSelected__DelegateSignature::button' has a wrong offset!");

// Function BP_PartyPlayerCard.BP_PartyPlayerCard_C.BndEvt__BP_PartyPlayerCard_hud_unmute_btn_K2Node_ComponentBoundEvent_16_UIElementInternalClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_unmute_btn_K2Node_ComponentBoundEvent_16_UIElementInternalClick__DelegateSignature final
{
public:
	class UCABaseUIElement*                       button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_unmute_btn_K2Node_ComponentBoundEvent_16_UIElementInternalClick__DelegateSignature) == 0x000008, "Wrong alignment on BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_unmute_btn_K2Node_ComponentBoundEvent_16_UIElementInternalClick__DelegateSignature");
static_assert(sizeof(BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_unmute_btn_K2Node_ComponentBoundEvent_16_UIElementInternalClick__DelegateSignature) == 0x000008, "Wrong size on BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_unmute_btn_K2Node_ComponentBoundEvent_16_UIElementInternalClick__DelegateSignature");
static_assert(offsetof(BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_unmute_btn_K2Node_ComponentBoundEvent_16_UIElementInternalClick__DelegateSignature, button) == 0x000000, "Member 'BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_unmute_btn_K2Node_ComponentBoundEvent_16_UIElementInternalClick__DelegateSignature::button' has a wrong offset!");

// Function BP_PartyPlayerCard.BP_PartyPlayerCard_C.BndEvt__BP_PartyPlayerCard_hud_mute_btn_K2Node_ComponentBoundEvent_15_UIElementInternalClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_PartyPlayerCard_C_BndEvt__BP_PartyPlayerCard_hud_mute_btn_K2Node_ComponentBoundEvent_15_UIElementInternalClick__DelegateSignature final
{
public:
