#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PostProcess_Untochable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PostProcess_Untochable.BP_PostProcess_Untochable_C
// 0x0020 (0x02B0 - 0x0290)
class BP_PostProcess_Untochable::ABP_PostProcess_Untochable_C final : public ACAPostProcessEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_FadeOut_D33B2AA6456E4FFB096D718BF2C5B4B6; // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_D33B2AA6456E4FFB096D718BF2C5B4B6; // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PostProcess_Untochable(int32 EntryPoint);
	void OnPlay();
	void OnStop();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	bool IsVisible();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlueprintGeneratedClass BP_PostProcess_Untochable.BP_PostProcess_Untochable_C", true, "BP_PostProcess_Untochable_C">();
	}
	static class BP_PostProcess_Untochable::ABP_PostProcess_Untochable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<BP_PostProcess_Untochable::ABP_PostProcess_Untochable_C>();
	}
};
static_assert(alignof(BP_PostProcess_Untochable::ABP_PostProcess_Untochable_C) == 0x000008, "Wrong alignment on BP_PostProcess_Untochable::ABP_PostProcess_Untochable_C");
static_assert(sizeof(BP_PostProcess_Untochable::ABP_PostProcess_Untochable_C) == 0x0002B0, "Wrong size on BP_PostProcess_Untochable::ABP_PostProcess_Untochable_C");
static_assert(offsetof(BP_PostProcess_Untochable::ABP_PostProcess_Untochable_C, UberGraphFrame) == 0x000290, "Member 'BP_PostProcess_Untochable::ABP_PostProcess_Untochable_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Untochable::ABP_PostProcess_Untochable_C, DefaultSceneRoot) == 0x000298, "Member 'BP_PostProcess_Untochable::ABP_PostProcess_Untochable_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Untochable::ABP_PostProcess_Untochable_C, Timeline_0_FadeOut_D33B2AA6456E4FFB096D718BF2C5B4B6) == 0x0002A0, "Member 'BP_PostProcess_Untochable::ABP_PostProcess_Untochable_C::Timeline_0_FadeOut_D33B2AA6456E4FFB096D718BF2C5B4B6' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Untochable::ABP_PostProcess_Untochable_C, Timeline_0__Direction_D33B2AA6456E4FFB096D718BF2C5B4B6) == 0x0002A4, "Member 'BP_PostProcess_Untochable::ABP_PostProcess_Untochable_C::Timeline_0__Direction_D33B2AA6456E4FFB096D718BF2C5B4B6' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Untochable::ABP_PostProcess_Untochable_C, Timeline_0) == 0x0002A8, "Member 'BP_PostProcess_Untochable::ABP_PostProcess_Untochable_C::Timeline_0' has a wrong offset!");

}

