#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerStateMachine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerStateMachine.BP_PlayerStateMachine_C
// 0x0048 (0x0DA8 - 0x0D60)
class UBP_PlayerStateMachine_C final : public UCAStateMachineComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	FMulticastInlineDelegateProperty_             EventIdle;                                         // 0x0D68(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EventDowned;                                       // 0x0D78(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EventRevive;                                       // 0x0D88(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EventExecute;                                      // 0x0D98(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void EventIdle__DelegateSignature();
	void EventDowned__DelegateSignature();
	void EventRevive__DelegateSignature();
	void EventExecute__DelegateSignature();
	void ExecuteUbergraph_BP_PlayerStateMachine(int32 EntryPoint);
	void BindDelegates();
	void Execute(class AActor* User);
	void Revive(class AActor* User);
	void Downed();
	void Idle();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayerStateMachine_C">();
	}
	static class UBP_PlayerStateMachine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PlayerStateMachine_C>();
	}
};
static_assert(alignof(UBP_PlayerStateMachine_C) == 0x000008, "Wrong alignment on UBP_PlayerStateMachine_C");
static_assert(sizeof(UBP_PlayerStateMachine_C) == 0x000DA8, "Wrong size on UBP_PlayerStateMachine_C");
static_assert(offsetof(UBP_PlayerStateMachine_C, UberGraphFrame) == 0x000D60, "Member 'UBP_PlayerStateMachine_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_PlayerStateMachine_C, EventIdle) == 0x000D68, "Member 'UBP_PlayerStateMachine_C::EventIdle' has a wrong offset!");
static_assert(offsetof(UBP_PlayerStateMachine_C, EventDowned) == 0x000D78, "Member 'UBP_PlayerStateMachine_C::EventDowned' has a wrong offset!");
static_assert(offsetof(UBP_PlayerStateMachine_C, EventRevive) == 0x000D88, "Member 'UBP_PlayerStateMachine_C::EventRevive' has a wrong offset!");
static_assert(offsetof(UBP_PlayerStateMachine_C, EventExecute) == 0x000D98, "Member 'UBP_PlayerStateMachine_C::EventExecute' has a wrong offset!");

}

