#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PostProcess_HealthChange

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PostProcess_HealthChange.BP_PostProcess_HealthChange_C
// 0x0020 (0x02B0 - 0x0290)
class BP_PostProcess_HealthChange::ABP_PostProcess_HealthChange_C final : public ACAPostProcessEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            Curve;                                             // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            CurveHUD2;                                         // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PostProcess_HealthChange(int32 EntryPoint);
	void OnPlay();
	bool IsVisible();
	float CalcBlendAmount();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlueprintGeneratedClass BP_PostProcess_HealthChange.BP_PostProcess_HealthChange_C", true, "BP_PostProcess_HealthChange_C">();
	}
	static class BP_PostProcess_HealthChange::ABP_PostProcess_HealthChange_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<BP_PostProcess_HealthChange::ABP_PostProcess_HealthChange_C>();
	}
};
static_assert(alignof(BP_PostProcess_HealthChange::ABP_PostProcess_HealthChange_C) == 0x000008, "Wrong alignment on BP_PostProcess_HealthChange::ABP_PostProcess_HealthChange_C");
static_assert(sizeof(BP_PostProcess_HealthChange::ABP_PostProcess_HealthChange_C) == 0x0002B0, "Wrong size on BP_PostProcess_HealthChange::ABP_PostProcess_HealthChange_C");
static_assert(offsetof(BP_PostProcess_HealthChange::ABP_PostProcess_HealthChange_C, UberGraphFrame) == 0x000290, "Member 'BP_PostProcess_HealthChange::ABP_PostProcess_HealthChange_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_HealthChange::ABP_PostProcess_HealthChange_C, DefaultSceneRoot) == 0x000298, "Member 'BP_PostProcess_HealthChange::ABP_PostProcess_HealthChange_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_HealthChange::ABP_PostProcess_HealthChange_C, Curve) == 0x0002A0, "Member 'BP_PostProcess_HealthChange::ABP_PostProcess_HealthChange_C::Curve' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_HealthChange::ABP_PostProcess_HealthChange_C, CurveHUD2) == 0x0002A8, "Member 'BP_PostProcess_HealthChange::ABP_PostProcess_HealthChange_C::CurveHUD2' has a wrong offset!");

}

