#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PostProcess_Hit

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PostProcess_Hit.BP_PostProcess_Hit_C
// 0x00A0 (0x0330 - 0x0290)
class ABP_PostProcess_Hit_C final : public ACAPostProcessEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_CABlend_1B88DAEF4F1CDBB74C63B4A7A659ED15; // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_1B88DAEF4F1CDBB74C63B4A7A659ED15; // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PostProcessTimeline_CABlend_8770EBDE48B5694A156029B34EE2C4E1; // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            PostProcessTimeline__Direction_8770EBDE48B5694A156029B34EE2C4E1; // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     PostProcessTimeline;                               // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ScreenUVPosition;                                  // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, struct FLinearColor>              ScreenPositionMap;                                 // 0x02D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNiagaraSystem*                         FirstPersonVFX;                                    // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FirstPersonVFXReference;                           // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PostProcess_Hit(int32 EntryPoint);
	void OnPlay();
	void ReceiveBeginPlay();
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void PostProcessTimeline__UpdateFunc();
	void PostProcessTimeline__FinishedFunc();
	void GetRemappedDamage(float Damage, float* DamageScalePostProcess, float* DamageScaleCameraShake);
	void HitVisualsNiagara();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PostProcess_Hit_C">();
	}
	static class ABP_PostProcess_Hit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PostProcess_Hit_C>();
	}
};
static_assert(alignof(ABP_PostProcess_Hit_C) == 0x000008, "Wrong alignment on ABP_PostProcess_Hit_C");
static_assert(sizeof(ABP_PostProcess_Hit_C) == 0x000330, "Wrong size on ABP_PostProcess_Hit_C");
static_assert(offsetof(ABP_PostProcess_Hit_C, UberGraphFrame) == 0x000290, "Member 'ABP_PostProcess_Hit_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Hit_C, DefaultSceneRoot) == 0x000298, "Member 'ABP_PostProcess_Hit_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Hit_C, Timeline_1_CABlend_1B88DAEF4F1CDBB74C63B4A7A659ED15) == 0x0002A0, "Member 'ABP_PostProcess_Hit_C::Timeline_1_CABlend_1B88DAEF4F1CDBB74C63B4A7A659ED15' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Hit_C, Timeline_1__Direction_1B88DAEF4F1CDBB74C63B4A7A659ED15) == 0x0002A4, "Member 'ABP_PostProcess_Hit_C::Timeline_1__Direction_1B88DAEF4F1CDBB74C63B4A7A659ED15' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Hit_C, Timeline_1) == 0x0002A8, "Member 'ABP_PostProcess_Hit_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Hit_C, PostProcessTimeline_CABlend_8770EBDE48B5694A156029B34EE2C4E1) == 0x0002B0, "Member 'ABP_PostProcess_Hit_C::PostProcessTimeline_CABlend_8770EBDE48B5694A156029B34EE2C4E1' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Hit_C, PostProcessTimeline__Direction_8770EBDE48B5694A156029B34EE2C4E1) == 0x0002B4, "Member 'ABP_PostProcess_Hit_C::PostProcessTimeline__Direction_8770EBDE48B5694A156029B34EE2C4E1' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Hit_C, PostProcessTimeline) == 0x0002B8, "Member 'ABP_PostProcess_Hit_C::PostProcessTimeline' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Hit_C, ScreenUVPosition) == 0x0002C0, "Member 'ABP_PostProcess_Hit_C::ScreenUVPosition' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Hit_C, ScreenPositionMap) == 0x0002D0, "Member 'ABP_PostProcess_Hit_C::ScreenPositionMap' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Hit_C, FirstPersonVFX) == 0x000320, "Member 'ABP_PostProcess_Hit_C::FirstPersonVFX' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Hit_C, FirstPersonVFXReference) == 0x000328, "Member 'ABP_PostProcess_Hit_C::FirstPersonVFXReference' has a wrong offset!");

}

