#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_EliteTankSpecial

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Projectile_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Projectile_EliteTankSpecial.BP_Projectile_EliteTankSpecial_C
// 0x0010 (0x0550 - 0x0540)
class ABP_Projectile_EliteTankSpecial_C final : public ABP_Projectile_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Projectile_EliteTankSpecial_C;   // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPC_Explosion_EliteTankSpecial_C*      BPC_Explosion_EliteTankSpecial;                    // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCustomiseSkeletalMeshComponent*        VisibleSkeletalMesh;                               // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_Projectile_EliteTankSpecial(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Projectile_EliteTankSpecial_C">();
	}
	static class ABP_Projectile_EliteTankSpecial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Projectile_EliteTankSpecial_C>();
	}
};
static_assert(alignof(ABP_Projectile_EliteTankSpecial_C) == 0x000010, "Wrong alignment on ABP_Projectile_EliteTankSpecial_C");
static_assert(sizeof(ABP_Projectile_EliteTankSpecial_C) == 0x000550, "Wrong size on ABP_Projectile_EliteTankSpecial_C");
static_assert(offsetof(ABP_Projectile_EliteTankSpecial_C, UberGraphFrame_BP_Projectile_EliteTankSpecial_C) == 0x000538, "Member 'ABP_Projectile_EliteTankSpecial_C::UberGraphFrame_BP_Projectile_EliteTankSpecial_C' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_EliteTankSpecial_C, BPC_Explosion_EliteTankSpecial) == 0x000540, "Member 'ABP_Projectile_EliteTankSpecial_C::BPC_Explosion_EliteTankSpecial' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_EliteTankSpecial_C, VisibleSkeletalMesh) == 0x000548, "Member 'ABP_Projectile_EliteTankSpecial_C::VisibleSkeletalMesh' has a wrong offset!");

}

