#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerDown_AR

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerDown_AR.BP_PlayerDown_AR_C
// 0x0028 (0x0280 - 0x0258)
class ABP_PlayerDown_AR_C final : public ACAAttachedEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0268(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitDirection;                                      // 0x0274(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PlayerDown_AR(int32 EntryPoint);
	void Activate();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayerDown_AR_C">();
	}
	static class ABP_PlayerDown_AR_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PlayerDown_AR_C>();
	}
};
static_assert(alignof(ABP_PlayerDown_AR_C) == 0x000008, "Wrong alignment on ABP_PlayerDown_AR_C");
static_assert(sizeof(ABP_PlayerDown_AR_C) == 0x000280, "Wrong size on ABP_PlayerDown_AR_C");
static_assert(offsetof(ABP_PlayerDown_AR_C, UberGraphFrame) == 0x000258, "Member 'ABP_PlayerDown_AR_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDown_AR_C, DefaultSceneRoot) == 0x000260, "Member 'ABP_PlayerDown_AR_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDown_AR_C, HitLocation) == 0x000268, "Member 'ABP_PlayerDown_AR_C::HitLocation' has a wrong offset!");
static_assert(offsetof(ABP_PlayerDown_AR_C, HitDirection) == 0x000274, "Member 'ABP_PlayerDown_AR_C::HitDirection' has a wrong offset!");

}

