#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PostProcess_Heal_OneShot_Medium

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PostProcess_Heal_OneShot_Medium.BP_PostProcess_Heal_OneShot_Medium_C
// 0x0028 (0x02B8 - 0x0290)
class BP_PostProcess_Heal_OneShot_Medium::ABP_PostProcess_Heal_OneShot_Medium_C final : public ACAPostProcessEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Intensity_571E5D8D4B3591059591C9AA94BB17D9; // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_FadeOut_571E5D8D4B3591059591C9AA94BB17D9; // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_571E5D8D4B3591059591C9AA94BB17D9; // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PostProcess_Heal_OneShot_Medium(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnPlay();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlueprintGeneratedClass BP_PostProcess_Heal_OneShot_Medium.BP_PostProcess_Heal_OneShot_Medium_C", true, "BP_PostProcess_Heal_OneShot_Medium_C">();
	}
	static class BP_PostProcess_Heal_OneShot_Medium::ABP_PostProcess_Heal_OneShot_Medium_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<BP_PostProcess_Heal_OneShot_Medium::ABP_PostProcess_Heal_OneShot_Medium_C>();
	}
};
static_assert(alignof(BP_PostProcess_Heal_OneShot_Medium::ABP_PostProcess_Heal_OneShot_Medium_C) == 0x000008, "Wrong alignment on BP_PostProcess_Heal_OneShot_Medium::ABP_PostProcess_Heal_OneShot_Medium_C");
static_assert(sizeof(BP_PostProcess_Heal_OneShot_Medium::ABP_PostProcess_Heal_OneShot_Medium_C) == 0x0002B8, "Wrong size on BP_PostProcess_Heal_OneShot_Medium::ABP_PostProcess_Heal_OneShot_Medium_C");
static_assert(offsetof(BP_PostProcess_Heal_OneShot_Medium::ABP_PostProcess_Heal_OneShot_Medium_C, UberGraphFrame) == 0x000290, "Member 'BP_PostProcess_Heal_OneShot_Medium::ABP_PostProcess_Heal_OneShot_Medium_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Heal_OneShot_Medium::ABP_PostProcess_Heal_OneShot_Medium_C, DefaultSceneRoot) == 0x000298, "Member 'BP_PostProcess_Heal_OneShot_Medium::ABP_PostProcess_Heal_OneShot_Medium_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Heal_OneShot_Medium::ABP_PostProcess_Heal_OneShot_Medium_C, Timeline_0_Intensity_571E5D8D4B3591059591C9AA94BB17D9) == 0x0002A0, "Member 'BP_PostProcess_Heal_OneShot_Medium::ABP_PostProcess_Heal_OneShot_Medium_C::Timeline_0_Intensity_571E5D8D4B3591059591C9AA94BB17D9' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Heal_OneShot_Medium::ABP_PostProcess_Heal_OneShot_Medium_C, Timeline_0_FadeOut_571E5D8D4B3591059591C9AA94BB17D9) == 0x0002A4, "Member 'BP_PostProcess_Heal_OneShot_Medium::ABP_PostProcess_Heal_OneShot_Medium_C::Timeline_0_FadeOut_571E5D8D4B3591059591C9AA94BB17D9' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Heal_OneShot_Medium::ABP_PostProcess_Heal_OneShot_Medium_C, Timeline_0__Direction_571E5D8D4B3591059591C9AA94BB17D9) == 0x0002A8, "Member 'BP_PostProcess_Heal_OneShot_Medium::ABP_PostProcess_Heal_OneShot_Medium_C::Timeline_0__Direction_571E5D8D4B3591059591C9AA94BB17D9' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Heal_OneShot_Medium::ABP_PostProcess_Heal_OneShot_Medium_C, Timeline_0) == 0x0002B0, "Member 'BP_PostProcess_Heal_OneShot_Medium::ABP_PostProcess_Heal_OneShot_Medium_C::Timeline_0' has a wrong offset!");

}

