#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PostProcess_Revived

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PostProcess_Revived.BP_PostProcess_Revived_C.ExecuteUbergraph_BP_PostProcess_Revived
// 0x0670 (0x0670 - 0x0000)
struct BP_PostProcess_Revived_C_ExecuteUbergraph_BP_PostProcess_Revived final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               K2Node_MakeStruct_Vector4;                         // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               K2Node_MakeStruct_Vector4_1;                       // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings;             // 0x0030(0x0640)()
};
static_assert(alignof(BP_PostProcess_Revived_C_ExecuteUbergraph_BP_PostProcess_Revived) == 0x000010, "Wrong alignment on BP_PostProcess_Revived_C_ExecuteUbergraph_BP_PostProcess_Revived");
static_assert(sizeof(BP_PostProcess_Revived_C_ExecuteUbergraph_BP_PostProcess_Revived) == 0x000670, "Wrong size on BP_PostProcess_Revived_C_ExecuteUbergraph_BP_PostProcess_Revived");
static_assert(offsetof(BP_PostProcess_Revived_C_ExecuteUbergraph_BP_PostProcess_Revived, EntryPoint) == 0x000000, "Member 'BP_PostProcess_Revived_C_ExecuteUbergraph_BP_PostProcess_Revived::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Revived_C_ExecuteUbergraph_BP_PostProcess_Revived, K2Node_MakeStruct_Vector4) == 0x000010, "Member 'BP_PostProcess_Revived_C_ExecuteUbergraph_BP_PostProcess_Revived::K2Node_MakeStruct_Vector4' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Revived_C_ExecuteUbergraph_BP_PostProcess_Revived, K2Node_MakeStruct_Vector4_1) == 0x000020, "Member 'BP_PostProcess_Revived_C_ExecuteUbergraph_BP_PostProcess_Revived::K2Node_MakeStruct_Vector4_1' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Revived_C_ExecuteUbergraph_BP_PostProcess_Revived, K2Node_MakeStruct_PostProcessSettings) == 0x000030, "Member 'BP_PostProcess_Revived_C_ExecuteUbergraph_BP_PostProcess_Revived::K2Node_MakeStruct_PostProcessSettings' has a wrong offset!");

}

