#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Player

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Keaton_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CAAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EOutlineColours_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function BP_Player.BP_Player_C.OnTeleport__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Player_C_OnTeleport__DelegateSignature final
{
public:
	float                                         TeleportDuration;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          In;                                                // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Player_C_OnTeleport__DelegateSignature) == 0x000004, "Wrong alignment on BP_Player_C_OnTeleport__DelegateSignature");
static_assert(sizeof(BP_Player_C_OnTeleport__DelegateSignature) == 0x000008, "Wrong size on BP_Player_C_OnTeleport__DelegateSignature");
static_assert(offsetof(BP_Player_C_OnTeleport__DelegateSignature, TeleportDuration) == 0x000000, "Member 'BP_Player_C_OnTeleport__DelegateSignature::TeleportDuration' has a wrong offset!");
static_assert(offsetof(BP_Player_C_OnTeleport__DelegateSignature, In) == 0x000004, "Member 'BP_Player_C_OnTeleport__DelegateSignature::In' has a wrong offset!");

// Function BP_Player.BP_Player_C.ExecuteUbergraph_BP_Player
// 0x1018 (0x1018 - 0x0000)
struct BP_Player_C_ExecuteUbergraph_BP_Player final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0004(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	struct FCATeamID                              CallFunc_GetTeamID_ReturnValue;                    // 0x0018(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0020(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_Event_PC;                                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_NewController;                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAPlayerController*                    K2Node_DynamicCast_AsCAPlayer_Controller;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCATeamID                              CallFunc_GetTeamID_ReturnValue_1;                  // 0x0054(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x0058(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_2;                          // 0x0070(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Int;                            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_CustomEvent_SecurityPlayer;                 // 0x0090(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(float Percentage)>             K2Node_CreateDelegate_OutputDelegate;              // 0x00A0(0x0014)(ZeroConstructor, NoDestructor)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x00B4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UClass*                           K2Node_CustomEvent_item;                           // 0x00C0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_WeaponTimeBetweenShots;         // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter*                           K2Node_CustomEvent_character_1;                    // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpec                    K2Node_CustomEvent_death_gameplay_effect_spec;     // 0x00D8(0x0298)(ConstParm)
	float                                         K2Node_CustomEvent_damage_magnitude;               // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkedHit                          K2Node_CustomEvent_networked_hit;                  // 0x0378(0x0068)(ConstParm, NoDestructor)
	const class AActor*                           K2Node_CustomEvent_killer;                         // 0x03E0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestAndReportDebugHeal_ReturnValue;    // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x3];                                      // 0x03E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCATeamID                              CallFunc_GetTeamID_ReturnValue_2;                  // 0x03EC(0x0004)(NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECAPlayerAbilityMode                          K2Node_CustomEvent_ability;                        // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_starting;                       // 0x03FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FB[0x1];                                      // 0x03FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_3;                          // 0x03FC(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x0410(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0422(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFirstPerson_ReturnValue;                // 0x0423(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFirstPerson_ReturnValue_1;              // 0x0424(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0425(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0426(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_427[0x1];                                      // 0x0427(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_percentage;                     // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkedHit                          K2Node_ComponentBoundEvent_hit;                    // 0x0430(0x0068)(ConstParm, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x049C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x049D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49E[0x2];                                      // 0x049E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_2;            // 0x04A0(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_2;                 // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_3;            // 0x04B8(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_3;                 // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C9[0x3];                                      // 0x04C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_teleport_duration_1;                  // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_teleport_duration;                    // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_ComponentBoundEvent_Tag_1;                  // 0x04DC(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_ComponentBoundEvent_Tag;                    // 0x04E8(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x04F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F5[0x3];                                      // 0x04F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_4;                          // 0x04F8(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_50C[0x4];                                      // 0x050C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_4;            // 0x0510(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_4;                 // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_521[0x7];                                      // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkedHit                          K2Node_Event_networked_hit;                        // 0x0528(0x0068)(ConstParm, NoDestructor)
	const class ACAEquipmentBase*                 K2Node_Event_hit_instigator;                       // 0x0590(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICADamageDealerInterface> CallFunc_GetWeaponClass_self_CastInput;            // 0x0598(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECAWeaponClass                                CallFunc_GetWeaponClass_ReturnValue;               // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A9[0x7];                                      // 0x05A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICADamageDealerInterface> CallFunc_GetWeaponClass_self_CastInput_1;          // 0x05B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECAWeaponClass                                CallFunc_GetWeaponClass_ReturnValue_1;             // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x05C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x05C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C3[0x1];                                      // 0x05C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x05C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Remove_ReturnValue;                   // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C9[0x3];                                      // 0x05C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x05CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAGravHookStateChange                        K2Node_CustomEvent_state_change;                   // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x05D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Player_Taken_Damage_SFX_Has_an_impact_SFX_event_fired; // 0x05D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x05D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x05D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x05D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x05D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasGameplayTag_ReturnValue;               // 0x05D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(ECAPlayerAbilityMode Ability, bool Starting)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x05D8(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x05EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x05ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_2;        // 0x05EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EF[0x1];                                      // 0x05EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECAGravHookStateChange State_change)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x05F0(0x0014)(ZeroConstructor, NoDestructor)
	EHealthState                                  K2Node_CustomEvent_health_state;                   // 0x0604(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_605[0x3];                                      // 0x0605(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_ComponentBoundEvent_Character_1;            // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAPlayerMovementMetaMode                     K2Node_ComponentBoundEvent_PrevMovementMetaMode;   // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAPlayerMovementMetaMode                     K2Node_ComponentBoundEvent_MovementMetaMode;       // 0x0611(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_612[0x6];                                      // 0x0612(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_ComponentBoundEvent_Character;              // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAPlayerMovementMode                         K2Node_ComponentBoundEvent_PrevMovementMode;       // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAPlayerMovementMode                         K2Node_ComponentBoundEvent_MovementMode;           // 0x0621(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0622(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0623(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetCurrentRemainingHealthSegments_ReturnValue; // 0x0624(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentRemainingHealthSegments_ReturnValue_1; // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x062C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x062D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x062E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62F[0x1];                                      // 0x062F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0630(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0634(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0638(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x063C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x0641(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_642[0x6];                                      // 0x0642(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpec                    K2Node_ComponentBoundEvent_killing_effect_spec;    // 0x0648(0x0298)(ConstParm)
	float                                         K2Node_ComponentBoundEvent_delta_value;            // 0x08E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_3;        // 0x08E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E5[0x3];                                      // 0x08E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x08E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F4[0x4];                                      // 0x08F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAPlayerController*                    CallFunc_GetAssociatedPlayerController_ReturnValue; // 0x08F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0900(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_901[0x3];                                      // 0x0901(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ACACharacter* Character, struct FGameplayEffectSpec& Death_gameplay_effect_spec, float Damage_magnitude, struct FNetworkedHit& Networked_hit, class AActor* Killer)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0904(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable_1;                              // 0x0918(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0924(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0930(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_new_state;                      // 0x0931(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_932[0x6];                                      // 0x0932(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContext_ReturnValue;            // 0x0938(0x0018)()
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0950(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_951[0x3];                                      // 0x0951(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1; // 0x0954(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x095C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_4;                              // 0x0968(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_5;                              // 0x0974(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingViewed_ReturnValue;                // 0x0980(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeingViewed_ReturnValue_1;              // 0x0981(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeingViewed_ReturnValue_2;              // 0x0982(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeingViewed_ReturnValue_3;              // 0x0983(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   Temp_name_Variable_6;                              // 0x0984(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCADamageEffectInfo                    K2Node_ComponentBoundEvent_damage_effect_info;     // 0x0990(0x02F8)(ConstParm)
	class FName                                   Temp_name_Variable_7;                              // 0x0C88(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0C94(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0C95(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C96[0x2];                                      // 0x0C96(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetInstigatorFromEffectSpec_ReturnValue;  // 0x0C98(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Player_RivalHitReceived_Dialogue_Cooldown; // 0x0CA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_8;                              // 0x0CA4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class ACACharacter*                     K2Node_CustomEvent_character;                      // 0x0CB0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasGameplayTag_ReturnValue_1;             // 0x0CB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB9[0x3];                                      // 0x0CB9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCATeamID                              CallFunc_GetTeamID_ReturnValue_3;                  // 0x0CBC(0x0004)(NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player_1;    // 0x0CC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0CC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0CC9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CCA[0x6];                                      // 0x0CCA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_NPC*                       K2Node_DynamicCast_AsCACharacter_NPC;              // 0x0CD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0CD8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD9[0x3];                                      // 0x0CD9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_9;                              // 0x0CDC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECANPCType                                    CallFunc_GetNPCType_ReturnValue;                   // 0x0CE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE9[0x3];                                      // 0x0CE9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ACACharacter* Character)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0CEC(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable_10;                             // 0x0D00(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_11;                             // 0x0D0C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECASecurityAreaState                          K2Node_CustomEvent_new_area_state;                 // 0x0D18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_3;               // 0x0D19(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_value;                          // 0x0D1A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1B[0x5];                                      // 0x0D1B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0D20(0x0020)(HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_12;                             // 0x0D40(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4C[0x4];                                      // 0x0D4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAGameState*                           CallFunc_GetGameState_ReturnValue;                 // 0x0D50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCATeamID>                      CallFunc_GetAllTeams_teams;                        // 0x0D58(0x0010)(ReferenceParm)
	struct FCATeamID                              CallFunc_Array_Get_Item;                           // 0x0D68(0x0004)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0D6C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0D70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0D71(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0D72(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECANPCType                                    Temp_byte_Variable;                                // 0x0D73(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0D74(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAGameState*                           CallFunc_GetGameState_ReturnValue_1;               // 0x0D80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAGameState*                           CallFunc_GetGameState_ReturnValue_2;               // 0x0D88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTeamStateData                         CallFunc_GetTeamData_ReturnValue;                  // 0x0D90(0x0028)(ConstParm)
	struct FTeamStateData                         CallFunc_GetTeamData_ReturnValue_1;                // 0x0DB8(0x0028)(ConstParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0DE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0DE1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DE2[0x2];                                      // 0x0DE2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0DE4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0DE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DE9[0x3];                                      // 0x0DE9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0DEC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0DF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0DF1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0DF2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DF3[0x1];                                      // 0x0DF3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0DF4(0x0014)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0E08(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0E10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0E14(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_3;                     // 0x0E15(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E16[0x2];                                      // 0x0E16(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECASecurityAreaState New_area_state)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0E18(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0E2C(0x0014)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0E40(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item_1;                         // 0x0E48(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0E54(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x0E58(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0E64(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0E65(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0E66(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0E67(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0E68(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_5;                          // 0x0E7C(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0E90(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_5;            // 0x0E98(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_5;                 // 0x0EA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA9[0x3];                                      // 0x0EA9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool New_state)>               K2Node_CreateDelegate_OutputDelegate_9;            // 0x0EAC(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_Select_Default_1;                           // 0x0EC0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0ECC(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x0EE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EE1[0x3];                                      // 0x0EE1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetSpecialistName_ReturnValue;            // 0x0EE4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0EF0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCATeamID                              CallFunc_GetTeamID_ReturnValue_4;                  // 0x0EF4(0x0004)(ConstParm, NoDestructor, HasGetValueTypeHash)
	TArray<class ACAPlayerController*>            CallFunc_GetPlayerControllersOnTeam_ReturnValue;   // 0x0EF8(0x0010)(ReferenceParm)
	class ACAPlayerController*                    CallFunc_Array_Get_Item_2;                         // 0x0F08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0F10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0F14(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F15[0x3];                                      // 0x0F15(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAPlayerState*                         K2Node_DynamicCast_AsCAPlayer_State;               // 0x0F18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0F20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F21[0x3];                                      // 0x0F21(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetSpecialistName_ReturnValue_1;          // 0x0F24(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0F30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F31[0x3];                                      // 0x0F31(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0F34(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0F38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F39[0x7];                                      // 0x0F39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAGameState*                           CallFunc_GetGameState_ReturnValue_3;               // 0x0F40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCATeamID                              CallFunc_GetTeamID_ReturnValue_5;                  // 0x0F48(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTeamWiped_ReturnValue;                 // 0x0F4C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F4D[0x3];                                      // 0x0F4D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCATeamID                              CallFunc_GetTeamID_ReturnValue_6;                  // 0x0F50(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_6;                          // 0x0F54(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_6;            // 0x0F68(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_6;                 // 0x0F78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F79[0x3];                                      // 0x0F79(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EHealthState Health_state)>    K2Node_CreateDelegate_OutputDelegate_11;           // 0x0F7C(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_Select_Default_2;                           // 0x0F90(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0F9C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0FA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA1[0x3];                                      // 0x0FA1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetDialogueName_ReturnValue;              // 0x0FA4(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0FB0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0FC0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ACAGameState*                           CallFunc_GetGameState_ReturnValue_4;               // 0x0FD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCATeamID                              CallFunc_GetTeamID_ReturnValue_7;                  // 0x0FD8(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTeamWiped_ReturnValue_1;               // 0x0FDC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FDD[0x3];                                      // 0x0FDD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACAPlayerController*>            CallFunc_GetPlayerControllersOnTeam_ReturnValue_1; // 0x0FE0(0x0010)(ReferenceParm)
	class ACAPlayerController*                    CallFunc_Array_Get_Item_3;                         // 0x0FF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0FF8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0FFC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FFD[0x3];                                      // 0x0FFD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAPlayerState*                         K2Node_DynamicCast_AsCAPlayer_State_1;             // 0x1000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x1008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1009[0x3];                                     // 0x1009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetKillerTeamID_ReturnValue;              // 0x100C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_2;            // 0x1010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Player_C_ExecuteUbergraph_BP_Player) == 0x000008, "Wrong alignment on BP_Player_C_ExecuteUbergraph_BP_Player");
static_assert(sizeof(BP_Player_C_ExecuteUbergraph_BP_Player) == 0x001018, "Wrong size on BP_Player_C_ExecuteUbergraph_BP_Player");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, EntryPoint) == 0x000000, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, Temp_delegate_Variable) == 0x000004, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, CallFunc_GetTeamID_ReturnValue) == 0x000018, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, CallFunc_PlayEvent_playback_instance) == 0x000020, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, CallFunc_PlayEvent_play_success) == 0x000030, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, Temp_bool_IsClosed_Variable) == 0x000031, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, Temp_bool_Has_Been_Initd_Variable) == 0x000032, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, K2Node_Event_DeltaSeconds) == 0x000034, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, K2Node_Event_PC) == 0x000038, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::K2Node_Event_PC' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, K2Node_Event_NewController) == 0x000040, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::K2Node_Event_NewController' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, K2Node_DynamicCast_AsCAPlayer_Controller) == 0x000048, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::K2Node_DynamicCast_AsCAPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, CallFunc_IsLocallyControlled_ReturnValue) == 0x000051, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, CallFunc_GetTeamID_ReturnValue_1) == 0x000054, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::CallFunc_GetTeamID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, Temp_delegate_Variable_1) == 0x000058, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, Temp_int_Loop_Counter_Variable) == 0x00006C, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, Temp_delegate_Variable_2) == 0x000070, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, CallFunc_Add_IntInt_ReturnValue) == 0x000084, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, K2Node_CustomEvent_Int) == 0x000088, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::K2Node_CustomEvent_Int' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, K2Node_CustomEvent_SecurityPlayer) == 0x000090, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::K2Node_CustomEvent_SecurityPlayer' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, K2Node_CreateDelegate_OutputDelegate) == 0x0000A0, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x0000B4, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, K2Node_CustomEvent_item) == 0x0000C0, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::K2Node_CustomEvent_item' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, Temp_int_Array_Index_Variable) == 0x0000C8, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, K2Node_CustomEvent_WeaponTimeBetweenShots) == 0x0000CC, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::K2Node_CustomEvent_WeaponTimeBetweenShots' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, K2Node_CustomEvent_character_1) == 0x0000D0, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::K2Node_CustomEvent_character_1' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, K2Node_CustomEvent_death_gameplay_effect_spec) == 0x0000D8, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::K2Node_CustomEvent_death_gameplay_effect_spec' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, K2Node_CustomEvent_damage_magnitude) == 0x000370, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::K2Node_CustomEvent_damage_magnitude' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, K2Node_CustomEvent_networked_hit) == 0x000378, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::K2Node_CustomEvent_networked_hit' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, K2Node_CustomEvent_killer) == 0x0003E0, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::K2Node_CustomEvent_killer' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, CallFunc_RequestAndReportDebugHeal_ReturnValue) == 0x0003E8, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::CallFunc_RequestAndReportDebugHeal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, CallFunc_GetTeamID_ReturnValue_2) == 0x0003EC, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::CallFunc_GetTeamID_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x0003F0, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, K2Node_DynamicCast_bSuccess_1) == 0x0003F8, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, K2Node_CustomEvent_ability) == 0x0003F9, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::K2Node_CustomEvent_ability' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, K2Node_CustomEvent_starting) == 0x0003FA, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::K2Node_CustomEvent_starting' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, Temp_delegate_Variable_3) == 0x0003FC, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, CallFunc_PlayEvent_playback_instance_1) == 0x000410, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, CallFunc_PlayEvent_play_success_1) == 0x000420, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::CallFunc_PlayEvent_play_success_1' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000421, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, Temp_bool_Has_Been_Initd_Variable_1) == 0x000422, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, CallFunc_IsFirstPerson_ReturnValue) == 0x000423, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::CallFunc_IsFirstPerson_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, CallFunc_IsFirstPerson_ReturnValue_1) == 0x000424, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::CallFunc_IsFirstPerson_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Player_C_ExecuteUbergraph_BP_Player, CallFunc_IsDedicatedServer_ReturnValue) == 0x000425, "Member 'BP_Player_C_ExecuteUbergraph_BP_Player::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
