#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_Grunt_GrenadeSpline

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CAAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Projectile_Grunt_GrenadeSpline.BP_Projectile_Grunt_GrenadeSpline_C.SetBalancingVariables
// 0x0038 (0x0038 - 0x0000)
struct BP_Projectile_Grunt_GrenadeSpline_C_SetBalancingVariables final
{
public:
	struct FCAGameplayEffectTableValueRow         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0000(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAGameplayEffectTableValueRow         CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0018(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Projectile_Grunt_GrenadeSpline_C_SetBalancingVariables) == 0x000008, "Wrong alignment on BP_Projectile_Grunt_GrenadeSpline_C_SetBalancingVariables");
static_assert(sizeof(BP_Projectile_Grunt_GrenadeSpline_C_SetBalancingVariables) == 0x000038, "Wrong size on BP_Projectile_Grunt_GrenadeSpline_C_SetBalancingVariables");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_SetBalancingVariables, CallFunc_GetDataTableRowFromName_OutRow) == 0x000000, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_SetBalancingVariables::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_SetBalancingVariables, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000010, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_SetBalancingVariables::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_SetBalancingVariables, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000018, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_SetBalancingVariables::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_SetBalancingVariables, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000028, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_SetBalancingVariables::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_SetBalancingVariables, CallFunc_FTrunc_ReturnValue) == 0x00002C, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_SetBalancingVariables::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_SetBalancingVariables, CallFunc_FTrunc_ReturnValue_1) == 0x000030, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_SetBalancingVariables::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");

// Function BP_Projectile_Grunt_GrenadeSpline.BP_Projectile_Grunt_GrenadeSpline_C.BndEvt__BP_Projectile_Grunt_GrenadeSpline_BPC_ProjectileAoE_K2Node_ComponentBoundEvent_0_CAProjectileAOEDetonationEvent__DelegateSignature
// 0x0090 (0x0090 - 0x0000)
struct BP_Projectile_Grunt_GrenadeSpline_C_BndEvt__BP_Projectile_Grunt_GrenadeSpline_BPC_ProjectileAoE_K2Node_ComponentBoundEvent_0_CAProjectileAOEDetonationEvent__DelegateSignature final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0090)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Projectile_Grunt_GrenadeSpline_C_BndEvt__BP_Projectile_Grunt_GrenadeSpline_BPC_ProjectileAoE_K2Node_ComponentBoundEvent_0_CAProjectileAOEDetonationEvent__DelegateSignature) == 0x000004, "Wrong alignment on BP_Projectile_Grunt_GrenadeSpline_C_BndEvt__BP_Projectile_Grunt_GrenadeSpline_BPC_ProjectileAoE_K2Node_ComponentBoundEvent_0_CAProjectileAOEDetonationEvent__DelegateSignature");
static_assert(sizeof(BP_Projectile_Grunt_GrenadeSpline_C_BndEvt__BP_Projectile_Grunt_GrenadeSpline_BPC_ProjectileAoE_K2Node_ComponentBoundEvent_0_CAProjectileAOEDetonationEvent__DelegateSignature) == 0x000090, "Wrong size on BP_Projectile_Grunt_GrenadeSpline_C_BndEvt__BP_Projectile_Grunt_GrenadeSpline_BPC_ProjectileAoE_K2Node_ComponentBoundEvent_0_CAProjectileAOEDetonationEvent__DelegateSignature");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_BndEvt__BP_Projectile_Grunt_GrenadeSpline_BPC_ProjectileAoE_K2Node_ComponentBoundEvent_0_CAProjectileAOEDetonationEvent__DelegateSignature, Hit) == 0x000000, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_BndEvt__BP_Projectile_Grunt_GrenadeSpline_BPC_ProjectileAoE_K2Node_ComponentBoundEvent_0_CAProjectileAOEDetonationEvent__DelegateSignature::Hit' has a wrong offset!");

// Function BP_Projectile_Grunt_GrenadeSpline.BP_Projectile_Grunt_GrenadeSpline_C.ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline
// 0x0178 (0x0178 - 0x0000)
struct BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0004(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x001C(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0048(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_hit;                    // 0x005C(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x00F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x00F8(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x010C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_2;                          // 0x0120(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_2;            // 0x0138(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_2;                 // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_3;                          // 0x014C(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_3;            // 0x0160(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_3;                 // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline) == 0x000008, "Wrong alignment on BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline");
static_assert(sizeof(BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline) == 0x000178, "Wrong size on BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline, EntryPoint) == 0x000000, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline, Temp_delegate_Variable) == 0x000004, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline, Temp_bool_Has_Been_Initd_Variable) == 0x000018, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline, Temp_delegate_Variable_1) == 0x00001C, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline, Temp_bool_IsClosed_Variable) == 0x000030, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue) == 0x000038, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000040, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline, CallFunc_PlayEvent_playback_instance) == 0x000048, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline, CallFunc_PlayEvent_play_success) == 0x000058, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline, K2Node_ComponentBoundEvent_hit) == 0x00005C, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline::K2Node_ComponentBoundEvent_hit' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline, CallFunc_K2_SetTimer_ReturnValue) == 0x0000F0, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline, CallFunc_PlayEvent_playback_instance_1) == 0x0000F8, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline, CallFunc_PlayEvent_play_success_1) == 0x000108, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline::CallFunc_PlayEvent_play_success_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline, K2Node_CreateDelegate_OutputDelegate) == 0x00010C, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline, Temp_delegate_Variable_2) == 0x000120, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline, CallFunc_PlayEvent_playback_instance_2) == 0x000138, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline::CallFunc_PlayEvent_playback_instance_2' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline, CallFunc_PlayEvent_play_success_2) == 0x000148, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline::CallFunc_PlayEvent_play_success_2' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline, Temp_delegate_Variable_3) == 0x00014C, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline, CallFunc_PlayEvent_playback_instance_3) == 0x000160, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline::CallFunc_PlayEvent_playback_instance_3' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline, CallFunc_PlayEvent_play_success_3) == 0x000170, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_ExecuteUbergraph_BP_Projectile_Grunt_GrenadeSpline::CallFunc_PlayEvent_play_success_3' has a wrong offset!");

// Function BP_Projectile_Grunt_GrenadeSpline.BP_Projectile_Grunt_GrenadeSpline_C.IsPlayerInFutureDamageArea
// 0x001C (0x001C - 0x0000)
struct BP_Projectile_Grunt_GrenadeSpline_C_IsPlayerInFutureDamageArea final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZeroGravity_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerInFutureDamageAreaHelper_Success; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Projectile_Grunt_GrenadeSpline_C_IsPlayerInFutureDamageArea) == 0x000004, "Wrong alignment on BP_Projectile_Grunt_GrenadeSpline_C_IsPlayerInFutureDamageArea");
static_assert(sizeof(BP_Projectile_Grunt_GrenadeSpline_C_IsPlayerInFutureDamageArea) == 0x00001C, "Wrong size on BP_Projectile_Grunt_GrenadeSpline_C_IsPlayerInFutureDamageArea");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_IsPlayerInFutureDamageArea, ReturnValue) == 0x000000, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_IsPlayerInFutureDamageArea::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_IsPlayerInFutureDamageArea, Temp_bool_Variable) == 0x000001, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_IsPlayerInFutureDamageArea::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_IsPlayerInFutureDamageArea, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_IsPlayerInFutureDamageArea::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_IsPlayerInFutureDamageArea, CallFunc_IsInZeroGravity_ReturnValue) == 0x000010, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_IsPlayerInFutureDamageArea::CallFunc_IsInZeroGravity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_IsPlayerInFutureDamageArea, K2Node_Select_Default) == 0x000014, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_IsPlayerInFutureDamageArea::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Grunt_GrenadeSpline_C_IsPlayerInFutureDamageArea, CallFunc_IsPlayerInFutureDamageAreaHelper_Success) == 0x000018, "Member 'BP_Projectile_Grunt_GrenadeSpline_C_IsPlayerInFutureDamageArea::CallFunc_IsPlayerInFutureDamageAreaHelper_Success' has a wrong offset!");

}

