#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PostProcess_Frost_MatchStart

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PostProcess_Frost_MatchStart.BP_PostProcess_Frost_MatchStart_C
// 0x0020 (0x02B0 - 0x0290)
class ABP_PostProcess_Frost_MatchStart_C final : public ACAPostProcessEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FadeoutTimeline_Transition_44D0542B484210AEC4F3FFB25A48355C; // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeoutTimeline__Direction_44D0542B484210AEC4F3FFB25A48355C; // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadeoutTimeline;                                   // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PostProcess_Frost_MatchStart(int32 EntryPoint);
	void OnPlay();
	void FadeoutTimeline__UpdateFunc();
	void FadeoutTimeline__FinishedFunc();
	bool IsVisible();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PostProcess_Frost_MatchStart_C">();
	}
	static class ABP_PostProcess_Frost_MatchStart_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PostProcess_Frost_MatchStart_C>();
	}
};
static_assert(alignof(ABP_PostProcess_Frost_MatchStart_C) == 0x000008, "Wrong alignment on ABP_PostProcess_Frost_MatchStart_C");
static_assert(sizeof(ABP_PostProcess_Frost_MatchStart_C) == 0x0002B0, "Wrong size on ABP_PostProcess_Frost_MatchStart_C");
static_assert(offsetof(ABP_PostProcess_Frost_MatchStart_C, UberGraphFrame) == 0x000290, "Member 'ABP_PostProcess_Frost_MatchStart_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Frost_MatchStart_C, DefaultSceneRoot) == 0x000298, "Member 'ABP_PostProcess_Frost_MatchStart_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Frost_MatchStart_C, FadeoutTimeline_Transition_44D0542B484210AEC4F3FFB25A48355C) == 0x0002A0, "Member 'ABP_PostProcess_Frost_MatchStart_C::FadeoutTimeline_Transition_44D0542B484210AEC4F3FFB25A48355C' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Frost_MatchStart_C, FadeoutTimeline__Direction_44D0542B484210AEC4F3FFB25A48355C) == 0x0002A4, "Member 'ABP_PostProcess_Frost_MatchStart_C::FadeoutTimeline__Direction_44D0542B484210AEC4F3FFB25A48355C' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Frost_MatchStart_C, FadeoutTimeline) == 0x0002A8, "Member 'ABP_PostProcess_Frost_MatchStart_C::FadeoutTimeline' has a wrong offset!");

}

