#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PostProcess_Armour_Pickup_0

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PostProcess_Armour_Pickup.BP_PostProcess_Armour_Pickup_C
// 0x0038 (0x02C8 - 0x0290)
class BP_PostProcess_Armour_Pickup_0::ABP_PostProcess_Armour_Pickup_C final : public ACAPostProcessEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_transition_328600664487B9F57D82ED80B4839D63; // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_FadeOut_328600664487B9F57D82ED80B4839D63; // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_328600664487B9F57D82ED80B4839D63; // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEvoArmour;                                       // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_PostProcess_Armour_Pickup(int32 EntryPoint);
	void OnPlay();
	void OnPlayOnce();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlueprintGeneratedClass BP_PostProcess_Armour_Pickup.BP_PostProcess_Armour_Pickup_C", true, "BP_PostProcess_Armour_Pickup_C">();
	}
	static class BP_PostProcess_Armour_Pickup_0::ABP_PostProcess_Armour_Pickup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<BP_PostProcess_Armour_Pickup_0::ABP_PostProcess_Armour_Pickup_C>();
	}
};
static_assert(alignof(BP_PostProcess_Armour_Pickup_0::ABP_PostProcess_Armour_Pickup_C) == 0x000008, "Wrong alignment on BP_PostProcess_Armour_Pickup_0::ABP_PostProcess_Armour_Pickup_C");
static_assert(sizeof(BP_PostProcess_Armour_Pickup_0::ABP_PostProcess_Armour_Pickup_C) == 0x0002C8, "Wrong size on BP_PostProcess_Armour_Pickup_0::ABP_PostProcess_Armour_Pickup_C");
static_assert(offsetof(BP_PostProcess_Armour_Pickup_0::ABP_PostProcess_Armour_Pickup_C, UberGraphFrame) == 0x000290, "Member 'BP_PostProcess_Armour_Pickup_0::ABP_PostProcess_Armour_Pickup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Armour_Pickup_0::ABP_PostProcess_Armour_Pickup_C, PostProcess) == 0x000298, "Member 'BP_PostProcess_Armour_Pickup_0::ABP_PostProcess_Armour_Pickup_C::PostProcess' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Armour_Pickup_0::ABP_PostProcess_Armour_Pickup_C, DefaultSceneRoot) == 0x0002A0, "Member 'BP_PostProcess_Armour_Pickup_0::ABP_PostProcess_Armour_Pickup_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Armour_Pickup_0::ABP_PostProcess_Armour_Pickup_C, Timeline_0_transition_328600664487B9F57D82ED80B4839D63) == 0x0002A8, "Member 'BP_PostProcess_Armour_Pickup_0::ABP_PostProcess_Armour_Pickup_C::Timeline_0_transition_328600664487B9F57D82ED80B4839D63' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Armour_Pickup_0::ABP_PostProcess_Armour_Pickup_C, Timeline_0_FadeOut_328600664487B9F57D82ED80B4839D63) == 0x0002AC, "Member 'BP_PostProcess_Armour_Pickup_0::ABP_PostProcess_Armour_Pickup_C::Timeline_0_FadeOut_328600664487B9F57D82ED80B4839D63' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Armour_Pickup_0::ABP_PostProcess_Armour_Pickup_C, Timeline_0__Direction_328600664487B9F57D82ED80B4839D63) == 0x0002B0, "Member 'BP_PostProcess_Armour_Pickup_0::ABP_PostProcess_Armour_Pickup_C::Timeline_0__Direction_328600664487B9F57D82ED80B4839D63' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Armour_Pickup_0::ABP_PostProcess_Armour_Pickup_C, Timeline_0) == 0x0002B8, "Member 'BP_PostProcess_Armour_Pickup_0::ABP_PostProcess_Armour_Pickup_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_Armour_Pickup_0::ABP_PostProcess_Armour_Pickup_C, IsEvoArmour) == 0x0002C0, "Member 'BP_PostProcess_Armour_Pickup_0::ABP_PostProcess_Armour_Pickup_C::IsEvoArmour' has a wrong offset!");

}

