#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerCombatFXComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CAAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Keaton_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerCombatFXComponent.BP_PlayerCombatFXComponent_C
// 0x00D8 (0x0260 - 0x0188)
class UBP_PlayerCombatFXComponent_C final : public UCACombatFXComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0188(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           HitNPCActorIdentifierTag;                          // 0x0190(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor_Hit;                                         // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAPlayerHitUIData                     HitData;                                           // 0x01A8(0x0068)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ACACharacter*                           CACharacter_Hit;                                   // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FCAAudioSwitchValueType                OnDieVoxType;                                      // 0x0218(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                LocalPlayerActor;                                  // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Downed_Hit_Location;                               // 0x0228(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Downed_Hit_Direction;                              // 0x0234(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Downed_Damage_Type;                                // 0x0240(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         HighDamageHitThreshold;                            // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HighDamageCritThreshold;                           // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HighDamageKillShotThreshold;                       // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitDamage;                                         // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PlayerCombatFXComponent(int32 EntryPoint);
	void OnDowningHitReceivedEvent();
	void OnImpenetrableHit_NPC();
	void OnImpenetrableHit();
	void OnHitTargetHeadShot_NPC();
	void OnHitTargetHeadShot();
	void OnHeapsOfDamageDone_NPC();
	void OnHeapsOfDamageDone();
	void OnWeakPointBroken_NPC();
	void OnHitTargetKilled_NPC();
	void OnHitTargetCriticalHit_NPC();
	void OnHitTargetArmourBroken_NPC();
	void ReceiveBeginPlay();
	void OnHitTargetDowned();
	void OnHitTargetKilled();
	void OnHitTargetArmourBroken();
	void OnHitTargetCriticalHit();
	void OnHitTargetPlayFX(const struct FCAPlayerHitUIData& Hit_data);
	void ProcessOnHitTarget(const struct FCAPlayerHitUIData& Player_Hit_UI_Data);
	void TriggerKilledTargetMusicStinger();
	void SpawnPlayerKilledAR();
	void Create_Downed_AR();
	void Get_Downed_Hit_Information(struct FNetworkedHit* Recent_Downed_Hit);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayerCombatFXComponent_C">();
	}
	static class UBP_PlayerCombatFXComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PlayerCombatFXComponent_C>();
	}
};
static_assert(alignof(UBP_PlayerCombatFXComponent_C) == 0x000008, "Wrong alignment on UBP_PlayerCombatFXComponent_C");
static_assert(sizeof(UBP_PlayerCombatFXComponent_C) == 0x000260, "Wrong size on UBP_PlayerCombatFXComponent_C");
static_assert(offsetof(UBP_PlayerCombatFXComponent_C, UberGraphFrame) == 0x000188, "Member 'UBP_PlayerCombatFXComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCombatFXComponent_C, HitNPCActorIdentifierTag) == 0x000190, "Member 'UBP_PlayerCombatFXComponent_C::HitNPCActorIdentifierTag' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCombatFXComponent_C, Actor_Hit) == 0x0001A0, "Member 'UBP_PlayerCombatFXComponent_C::Actor_Hit' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCombatFXComponent_C, HitData) == 0x0001A8, "Member 'UBP_PlayerCombatFXComponent_C::HitData' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCombatFXComponent_C, CACharacter_Hit) == 0x000210, "Member 'UBP_PlayerCombatFXComponent_C::CACharacter_Hit' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCombatFXComponent_C, OnDieVoxType) == 0x000218, "Member 'UBP_PlayerCombatFXComponent_C::OnDieVoxType' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCombatFXComponent_C, LocalPlayerActor) == 0x000220, "Member 'UBP_PlayerCombatFXComponent_C::LocalPlayerActor' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCombatFXComponent_C, Downed_Hit_Location) == 0x000228, "Member 'UBP_PlayerCombatFXComponent_C::Downed_Hit_Location' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCombatFXComponent_C, Downed_Hit_Direction) == 0x000234, "Member 'UBP_PlayerCombatFXComponent_C::Downed_Hit_Direction' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCombatFXComponent_C, Downed_Damage_Type) == 0x000240, "Member 'UBP_PlayerCombatFXComponent_C::Downed_Damage_Type' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCombatFXComponent_C, HighDamageHitThreshold) == 0x00024C, "Member 'UBP_PlayerCombatFXComponent_C::HighDamageHitThreshold' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCombatFXComponent_C, HighDamageCritThreshold) == 0x000250, "Member 'UBP_PlayerCombatFXComponent_C::HighDamageCritThreshold' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCombatFXComponent_C, HighDamageKillShotThreshold) == 0x000254, "Member 'UBP_PlayerCombatFXComponent_C::HighDamageKillShotThreshold' has a wrong offset!");
static_assert(offsetof(UBP_PlayerCombatFXComponent_C, HitDamage) == 0x000258, "Member 'UBP_PlayerCombatFXComponent_C::HitDamage' has a wrong offset!");

}

