#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PostProcess_HealthChange_0

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_PostProcess_HealthChange.BP_PostProcess_HealthChange_C.ExecuteUbergraph_BP_PostProcess_HealthChange
// 0x06B0 (0x06B0 - 0x0000)
struct BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayer_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDownedThreshold_ReturnValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocalPlayerHealth_ReturnValue;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocalPlayerMaxHealth_ReturnValue;      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeightedBlendable                     K2Node_MakeStruct_WeightedBlendable;               // 0x0040(0x0010)(NoDestructor)
	TArray<struct FWeightedBlendable>             K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
	struct FWeightedBlendables                    K2Node_MakeStruct_WeightedBlendables;              // 0x0060(0x0010)()
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings;             // 0x0070(0x0640)()
};
static_assert(alignof(BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange) == 0x000010, "Wrong alignment on BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange");
static_assert(sizeof(BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange) == 0x0006B0, "Wrong size on BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange");
static_assert(offsetof(BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange, EntryPoint) == 0x000000, "Member 'BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange, CallFunc_GetLocalPlayer_ReturnValue) == 0x000008, "Member 'BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange::CallFunc_GetLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange, CallFunc_GetDownedThreshold_ReturnValue) == 0x000010, "Member 'BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange::CallFunc_GetDownedThreshold_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange, CallFunc_GetLocalPlayerHealth_ReturnValue) == 0x000014, "Member 'BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange::CallFunc_GetLocalPlayerHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange, CallFunc_GetLocalPlayerMaxHealth_ReturnValue) == 0x000018, "Member 'BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange::CallFunc_GetLocalPlayerMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00001C, "Member 'BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000020, "Member 'BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000024, "Member 'BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000028, "Member 'BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange, CallFunc_FClamp_ReturnValue) == 0x000030, "Member 'BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange, CallFunc_GetFloatValue_ReturnValue) == 0x000034, "Member 'BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000038, "Member 'BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange, K2Node_MakeStruct_WeightedBlendable) == 0x000040, "Member 'BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange::K2Node_MakeStruct_WeightedBlendable' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange, K2Node_MakeArray_Array) == 0x000050, "Member 'BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange, K2Node_MakeStruct_WeightedBlendables) == 0x000060, "Member 'BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange::K2Node_MakeStruct_WeightedBlendables' has a wrong offset!");
static_assert(offsetof(BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange, K2Node_MakeStruct_PostProcessSettings) == 0x000070, "Member 'BP_PostProcess_HealthChange_C_ExecuteUbergraph_BP_PostProcess_HealthChange::K2Node_MakeStruct_PostProcessSettings' has a wrong offset!");

}

