#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PostProcess_Revived

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PostProcess_Revived.BP_PostProcess_Revived_C
// 0x0028 (0x02B8 - 0x0290)
class ABP_PostProcess_Revived_C final : public ACAPostProcessEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_HealBlendTime_598855A6437F73776779C19404304D7D; // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_598855A6437F73776779C19404304D7D; // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PostProcess_Revived(int32 EntryPoint);
	void OnStop();
	void OnPlay();
	void OnPlayOnce();
	void ReceiveBeginPlay();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PostProcess_Revived_C">();
	}
	static class ABP_PostProcess_Revived_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PostProcess_Revived_C>();
	}
};
static_assert(alignof(ABP_PostProcess_Revived_C) == 0x000008, "Wrong alignment on ABP_PostProcess_Revived_C");
static_assert(sizeof(ABP_PostProcess_Revived_C) == 0x0002B8, "Wrong size on ABP_PostProcess_Revived_C");
static_assert(offsetof(ABP_PostProcess_Revived_C, UberGraphFrame) == 0x000290, "Member 'ABP_PostProcess_Revived_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Revived_C, PostProcess) == 0x000298, "Member 'ABP_PostProcess_Revived_C::PostProcess' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Revived_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_PostProcess_Revived_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Revived_C, Timeline_0_HealBlendTime_598855A6437F73776779C19404304D7D) == 0x0002A8, "Member 'ABP_PostProcess_Revived_C::Timeline_0_HealBlendTime_598855A6437F73776779C19404304D7D' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Revived_C, Timeline_0__Direction_598855A6437F73776779C19404304D7D) == 0x0002AC, "Member 'ABP_PostProcess_Revived_C::Timeline_0__Direction_598855A6437F73776779C19404304D7D' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_Revived_C, Timeline_0) == 0x0002B0, "Member 'ABP_PostProcess_Revived_C::Timeline_0' has a wrong offset!");

}

