#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PostProcess_EMP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PostProcess_EMP.BP_PostProcess_EMP_C
// 0x0038 (0x02C8 - 0x0290)
class ABP_PostProcess_EMP_C final : public ACAPostProcessEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_FadeOut_C38246D34AFC761C3A35298C59CDC078; // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_C38246D34AFC761C3A35298C59CDC078; // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_FadeIn_93B8A96947245DA6DEF493925134B0FC; // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_93B8A96947245DA6DEF493925134B0FC; // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEvoArmour;                                       // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_PostProcess_EMP(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnStop();
	void OnPlay();
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	bool IsVisible();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PostProcess_EMP_C">();
	}
	static class ABP_PostProcess_EMP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PostProcess_EMP_C>();
	}
};
static_assert(alignof(ABP_PostProcess_EMP_C) == 0x000008, "Wrong alignment on ABP_PostProcess_EMP_C");
static_assert(sizeof(ABP_PostProcess_EMP_C) == 0x0002C8, "Wrong size on ABP_PostProcess_EMP_C");
static_assert(offsetof(ABP_PostProcess_EMP_C, UberGraphFrame) == 0x000290, "Member 'ABP_PostProcess_EMP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_EMP_C, DefaultSceneRoot) == 0x000298, "Member 'ABP_PostProcess_EMP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_EMP_C, Timeline_1_FadeOut_C38246D34AFC761C3A35298C59CDC078) == 0x0002A0, "Member 'ABP_PostProcess_EMP_C::Timeline_1_FadeOut_C38246D34AFC761C3A35298C59CDC078' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_EMP_C, Timeline_1__Direction_C38246D34AFC761C3A35298C59CDC078) == 0x0002A4, "Member 'ABP_PostProcess_EMP_C::Timeline_1__Direction_C38246D34AFC761C3A35298C59CDC078' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_EMP_C, Timeline_1) == 0x0002A8, "Member 'ABP_PostProcess_EMP_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_EMP_C, Timeline_0_FadeIn_93B8A96947245DA6DEF493925134B0FC) == 0x0002B0, "Member 'ABP_PostProcess_EMP_C::Timeline_0_FadeIn_93B8A96947245DA6DEF493925134B0FC' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_EMP_C, Timeline_0__Direction_93B8A96947245DA6DEF493925134B0FC) == 0x0002B4, "Member 'ABP_PostProcess_EMP_C::Timeline_0__Direction_93B8A96947245DA6DEF493925134B0FC' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_EMP_C, Timeline_0) == 0x0002B8, "Member 'ABP_PostProcess_EMP_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_PostProcess_EMP_C, IsEvoArmour) == 0x0002C0, "Member 'ABP_PostProcess_EMP_C::IsEvoArmour' has a wrong offset!");

}

