#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SupplyCrateStateComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_SupplyCrateStateComponent.BP_SupplyCrateStateComponent_C.ExecuteUbergraph_BP_SupplyCrateStateComponent
// 0x00B0 (0x00B0 - 0x0000)
struct BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0040(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0054(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0068(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue;               // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_1;             // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_2;             // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_3;             // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_4;             // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_5;             // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent) == 0x000008, "Wrong alignment on BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent");
static_assert(sizeof(BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent) == 0x0000B0, "Wrong size on BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent");
static_assert(offsetof(BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent, EntryPoint) == 0x000000, "Member 'BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent, K2Node_CreateDelegate_OutputDelegate_3) == 0x000040, "Member 'BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent, K2Node_CreateDelegate_OutputDelegate_4) == 0x000054, "Member 'BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent, K2Node_CreateDelegate_OutputDelegate_5) == 0x000068, "Member 'BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent, CallFunc_GetStateByName_ReturnValue) == 0x000080, "Member 'BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent::CallFunc_GetStateByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent, CallFunc_GetStateByName_ReturnValue_1) == 0x000088, "Member 'BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent::CallFunc_GetStateByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent, CallFunc_GetStateByName_ReturnValue_2) == 0x000090, "Member 'BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent::CallFunc_GetStateByName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent, CallFunc_GetStateByName_ReturnValue_3) == 0x000098, "Member 'BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent::CallFunc_GetStateByName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent, CallFunc_GetStateByName_ReturnValue_4) == 0x0000A0, "Member 'BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent::CallFunc_GetStateByName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent, CallFunc_GetStateByName_ReturnValue_5) == 0x0000A8, "Member 'BP_SupplyCrateStateComponent_C_ExecuteUbergraph_BP_SupplyCrateStateComponent::CallFunc_GetStateByName_ReturnValue_5' has a wrong offset!");

}

