#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Specialist_AudioComponent

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Keaton_structs.hpp"


namespace SDK::Params
{

// Function BP_Specialist_AudioComponent.BP_Specialist_AudioComponent_C.ExecuteUbergraph_BP_Specialist_AudioComponent
// 0x0338 (0x0338 - 0x0000)
struct BP_Specialist_AudioComponent_C_ExecuteUbergraph_BP_Specialist_AudioComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter*                           K2Node_CustomEvent_character;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpec                    K2Node_CustomEvent_death_gameplay_effect_spec;     // 0x0010(0x0298)(ConstParm)
	float                                         K2Node_CustomEvent_damage_magnitude;               // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkedHit                          K2Node_CustomEvent_networked_hit;                  // 0x02B0(0x0068)(ConstParm, NoDestructor)
	const class AActor*                           K2Node_CustomEvent_killer;                         // 0x0318(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAAwarenessState                             K2Node_CustomEvent_NewAwarenessState;              // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECAAwarenessState Awareness_state)> K2Node_CreateDelegate_OutputDelegate;              // 0x0324(0x0014)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_Specialist_AudioComponent_C_ExecuteUbergraph_BP_Specialist_AudioComponent) == 0x000008, "Wrong alignment on BP_Specialist_AudioComponent_C_ExecuteUbergraph_BP_Specialist_AudioComponent");
static_assert(sizeof(BP_Specialist_AudioComponent_C_ExecuteUbergraph_BP_Specialist_AudioComponent) == 0x000338, "Wrong size on BP_Specialist_AudioComponent_C_ExecuteUbergraph_BP_Specialist_AudioComponent");
static_assert(offsetof(BP_Specialist_AudioComponent_C_ExecuteUbergraph_BP_Specialist_AudioComponent, EntryPoint) == 0x000000, "Member 'BP_Specialist_AudioComponent_C_ExecuteUbergraph_BP_Specialist_AudioComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Specialist_AudioComponent_C_ExecuteUbergraph_BP_Specialist_AudioComponent, K2Node_CustomEvent_character) == 0x000008, "Member 'BP_Specialist_AudioComponent_C_ExecuteUbergraph_BP_Specialist_AudioComponent::K2Node_CustomEvent_character' has a wrong offset!");
static_assert(offsetof(BP_Specialist_AudioComponent_C_ExecuteUbergraph_BP_Specialist_AudioComponent, K2Node_CustomEvent_death_gameplay_effect_spec) == 0x000010, "Member 'BP_Specialist_AudioComponent_C_ExecuteUbergraph_BP_Specialist_AudioComponent::K2Node_CustomEvent_death_gameplay_effect_spec' has a wrong offset!");
static_assert(offsetof(BP_Specialist_AudioComponent_C_ExecuteUbergraph_BP_Specialist_AudioComponent, K2Node_CustomEvent_damage_magnitude) == 0x0002A8, "Member 'BP_Specialist_AudioComponent_C_ExecuteUbergraph_BP_Specialist_AudioComponent::K2Node_CustomEvent_damage_magnitude' has a wrong offset!");
static_assert(offsetof(BP_Specialist_AudioComponent_C_ExecuteUbergraph_BP_Specialist_AudioComponent, K2Node_CustomEvent_networked_hit) == 0x0002B0, "Member 'BP_Specialist_AudioComponent_C_ExecuteUbergraph_BP_Specialist_AudioComponent::K2Node_CustomEvent_networked_hit' has a wrong offset!");
static_assert(offsetof(BP_Specialist_AudioComponent_C_ExecuteUbergraph_BP_Specialist_AudioComponent, K2Node_CustomEvent_killer) == 0x000318, "Member 'BP_Specialist_AudioComponent_C_ExecuteUbergraph_BP_Specialist_AudioComponent::K2Node_CustomEvent_killer' has a wrong offset!");
static_assert(offsetof(BP_Specialist_AudioComponent_C_ExecuteUbergraph_BP_Specialist_AudioComponent, K2Node_CustomEvent_NewAwarenessState) == 0x000320, "Member 'BP_Specialist_AudioComponent_C_ExecuteUbergraph_BP_Specialist_AudioComponent::K2Node_CustomEvent_NewAwarenessState' has a wrong offset!");
static_assert(offsetof(BP_Specialist_AudioComponent_C_ExecuteUbergraph_BP_Specialist_AudioComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000324, "Member 'BP_Specialist_AudioComponent_C_ExecuteUbergraph_BP_Specialist_AudioComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_Specialist_AudioComponent.BP_Specialist_AudioComponent_C.OnDeath_New
// 0x0318 (0x0318 - 0x0000)
struct BP_Specialist_AudioComponent_C_OnDeath_New final
{
public:
	class ACACharacter*                           Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpec                    Death_gameplay_effect_spec;                        // 0x0008(0x0298)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         Damage_magnitude;                                  // 0x02A0(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetworkedHit                          Networked_hit;                                     // 0x02A8(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	const class AActor*                           Killer;                                            // 0x0310(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Specialist_AudioComponent_C_OnDeath_New) == 0x000008, "Wrong alignment on BP_Specialist_AudioComponent_C_OnDeath_New");
static_assert(sizeof(BP_Specialist_AudioComponent_C_OnDeath_New) == 0x000318, "Wrong size on BP_Specialist_AudioComponent_C_OnDeath_New");
static_assert(offsetof(BP_Specialist_AudioComponent_C_OnDeath_New, Character) == 0x000000, "Member 'BP_Specialist_AudioComponent_C_OnDeath_New::Character' has a wrong offset!");
static_assert(offsetof(BP_Specialist_AudioComponent_C_OnDeath_New, Death_gameplay_effect_spec) == 0x000008, "Member 'BP_Specialist_AudioComponent_C_OnDeath_New::Death_gameplay_effect_spec' has a wrong offset!");
static_assert(offsetof(BP_Specialist_AudioComponent_C_OnDeath_New, Damage_magnitude) == 0x0002A0, "Member 'BP_Specialist_AudioComponent_C_OnDeath_New::Damage_magnitude' has a wrong offset!");
static_assert(offsetof(BP_Specialist_AudioComponent_C_OnDeath_New, Networked_hit) == 0x0002A8, "Member 'BP_Specialist_AudioComponent_C_OnDeath_New::Networked_hit' has a wrong offset!");
static_assert(offsetof(BP_Specialist_AudioComponent_C_OnDeath_New, Killer) == 0x000310, "Member 'BP_Specialist_AudioComponent_C_OnDeath_New::Killer' has a wrong offset!");

// Function BP_Specialist_AudioComponent.BP_Specialist_AudioComponent_C.OnAwarenessStateChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_Specialist_AudioComponent_C_OnAwarenessStateChanged final
{
public:
	ECAAwarenessState                             NewAwarenessState;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Specialist_AudioComponent_C_OnAwarenessStateChanged) == 0x000001, "Wrong alignment on BP_Specialist_AudioComponent_C_OnAwarenessStateChanged");
static_assert(sizeof(BP_Specialist_AudioComponent_C_OnAwarenessStateChanged) == 0x000001, "Wrong size on BP_Specialist_AudioComponent_C_OnAwarenessStateChanged");
static_assert(offsetof(BP_Specialist_AudioComponent_C_OnAwarenessStateChanged, NewAwarenessState) == 0x000000, "Member 'BP_Specialist_AudioComponent_C_OnAwarenessStateChanged::NewAwarenessState' has a wrong offset!");

}

