#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SubHeaderMenu

#include "Basic.hpp"

#include "CAAudio_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_SubHeaderMenu.BP_SubHeaderMenu_C.ExecuteUbergraph_BP_SubHeaderMenu
// 0x00B8 (0x00B8 - 0x0000)
struct BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0008(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_show;                                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_6;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_5;               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_4;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_3;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_2;               // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_1;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0098(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu) == 0x000008, "Wrong alignment on BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu");
static_assert(sizeof(BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu) == 0x0000B8, "Wrong size on BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu");
static_assert(offsetof(BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu, EntryPoint) == 0x000000, "Member 'BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu, Temp_bool_Variable) == 0x000004, "Member 'BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu, Temp_byte_Variable) == 0x000005, "Member 'BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu, Temp_byte_Variable_1) == 0x000006, "Member 'BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu, Temp_delegate_Variable) == 0x000008, "Member 'BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu, K2Node_Event_show) == 0x000030, "Member 'BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu::K2Node_Event_show' has a wrong offset!");
static_assert(offsetof(BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu, K2Node_ComponentBoundEvent_button_6) == 0x000038, "Member 'BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu::K2Node_ComponentBoundEvent_button_6' has a wrong offset!");
static_assert(offsetof(BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu, K2Node_Select_Default) == 0x000040, "Member 'BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu, K2Node_ComponentBoundEvent_button_5) == 0x000048, "Member 'BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu::K2Node_ComponentBoundEvent_button_5' has a wrong offset!");
static_assert(offsetof(BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu, K2Node_ComponentBoundEvent_button_4) == 0x000050, "Member 'BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu::K2Node_ComponentBoundEvent_button_4' has a wrong offset!");
static_assert(offsetof(BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu, K2Node_ComponentBoundEvent_button_3) == 0x000058, "Member 'BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu::K2Node_ComponentBoundEvent_button_3' has a wrong offset!");
static_assert(offsetof(BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu, K2Node_ComponentBoundEvent_button_2) == 0x000060, "Member 'BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu::K2Node_ComponentBoundEvent_button_2' has a wrong offset!");
static_assert(offsetof(BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu, K2Node_ComponentBoundEvent_button_1) == 0x000068, "Member 'BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu::K2Node_ComponentBoundEvent_button_1' has a wrong offset!");
static_assert(offsetof(BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu, K2Node_ComponentBoundEvent_button) == 0x000070, "Member 'BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu::K2Node_ComponentBoundEvent_button' has a wrong offset!");
static_assert(offsetof(BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu, K2Node_CustomEvent_InVisibility) == 0x000078, "Member 'BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000079, "Member 'BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu, CallFunc_PlayAnimation_ReturnValue) == 0x000080, "Member 'BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu, CallFunc_GetOwningPlayer_ReturnValue) == 0x000088, "Member 'BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu, CallFunc_PlayAnimation_ReturnValue_1) == 0x000090, "Member 'BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu, CallFunc_PlayEvent_playback_instance) == 0x000098, "Member 'BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu, CallFunc_PlayEvent_play_success) == 0x0000A8, "Member 'BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000B0, "Member 'BP_SubHeaderMenu_C_ExecuteUbergraph_BP_SubHeaderMenu::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

// Function BP_SubHeaderMenu.BP_SubHeaderMenu_C.OnVisibilityChanged_Event_0
// 0x0001 (0x0001 - 0x0000)
struct BP_SubHeaderMenu_C_OnVisibilityChanged_Event_0 final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SubHeaderMenu_C_OnVisibilityChanged_Event_0) == 0x000001, "Wrong alignment on BP_SubHeaderMenu_C_OnVisibilityChanged_Event_0");
static_assert(sizeof(BP_SubHeaderMenu_C_OnVisibilityChanged_Event_0) == 0x000001, "Wrong size on BP_SubHeaderMenu_C_OnVisibilityChanged_Event_0");
static_assert(offsetof(BP_SubHeaderMenu_C_OnVisibilityChanged_Event_0, InVisibility) == 0x000000, "Member 'BP_SubHeaderMenu_C_OnVisibilityChanged_Event_0::InVisibility' has a wrong offset!");

// Function BP_SubHeaderMenu.BP_SubHeaderMenu_C.BndEvt__BP_SubHeaderMenu_m_button_6_K2Node_ComponentBoundEvent_12_UIElementSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_6_K2Node_ComponentBoundEvent_12_UIElementSelected__DelegateSignature final
{
public:
	class UCABaseUIElement*                       button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_6_K2Node_ComponentBoundEvent_12_UIElementSelected__DelegateSignature) == 0x000008, "Wrong alignment on BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_6_K2Node_ComponentBoundEvent_12_UIElementSelected__DelegateSignature");
static_assert(sizeof(BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_6_K2Node_ComponentBoundEvent_12_UIElementSelected__DelegateSignature) == 0x000008, "Wrong size on BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_6_K2Node_ComponentBoundEvent_12_UIElementSelected__DelegateSignature");
static_assert(offsetof(BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_6_K2Node_ComponentBoundEvent_12_UIElementSelected__DelegateSignature, button) == 0x000000, "Member 'BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_6_K2Node_ComponentBoundEvent_12_UIElementSelected__DelegateSignature::button' has a wrong offset!");

// Function BP_SubHeaderMenu.BP_SubHeaderMenu_C.BndEvt__BP_SubHeaderMenu_m_button_5_K2Node_ComponentBoundEvent_11_UIElementSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_5_K2Node_ComponentBoundEvent_11_UIElementSelected__DelegateSignature final
{
public:
	class UCABaseUIElement*                       button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_5_K2Node_ComponentBoundEvent_11_UIElementSelected__DelegateSignature) == 0x000008, "Wrong alignment on BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_5_K2Node_ComponentBoundEvent_11_UIElementSelected__DelegateSignature");
static_assert(sizeof(BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_5_K2Node_ComponentBoundEvent_11_UIElementSelected__DelegateSignature) == 0x000008, "Wrong size on BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_5_K2Node_ComponentBoundEvent_11_UIElementSelected__DelegateSignature");
static_assert(offsetof(BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_5_K2Node_ComponentBoundEvent_11_UIElementSelected__DelegateSignature, button) == 0x000000, "Member 'BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_5_K2Node_ComponentBoundEvent_11_UIElementSelected__DelegateSignature::button' has a wrong offset!");

// Function BP_SubHeaderMenu.BP_SubHeaderMenu_C.BndEvt__BP_SubHeaderMenu_m_button_4_K2Node_ComponentBoundEvent_10_UIElementSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_4_K2Node_ComponentBoundEvent_10_UIElementSelected__DelegateSignature final
{
public:
	class UCABaseUIElement*                       button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_4_K2Node_ComponentBoundEvent_10_UIElementSelected__DelegateSignature) == 0x000008, "Wrong alignment on BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_4_K2Node_ComponentBoundEvent_10_UIElementSelected__DelegateSignature");
static_assert(sizeof(BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_4_K2Node_ComponentBoundEvent_10_UIElementSelected__DelegateSignature) == 0x000008, "Wrong size on BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_4_K2Node_ComponentBoundEvent_10_UIElementSelected__DelegateSignature");
static_assert(offsetof(BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_4_K2Node_ComponentBoundEvent_10_UIElementSelected__DelegateSignature, button) == 0x000000, "Member 'BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_4_K2Node_ComponentBoundEvent_10_UIElementSelected__DelegateSignature::button' has a wrong offset!");

// Function BP_SubHeaderMenu.BP_SubHeaderMenu_C.BndEvt__BP_SubHeaderMenu_m_button_3_K2Node_ComponentBoundEvent_9_UIElementSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_3_K2Node_ComponentBoundEvent_9_UIElementSelected__DelegateSignature final
{
public:
	class UCABaseUIElement*                       button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_3_K2Node_ComponentBoundEvent_9_UIElementSelected__DelegateSignature) == 0x000008, "Wrong alignment on BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_3_K2Node_ComponentBoundEvent_9_UIElementSelected__DelegateSignature");
static_assert(sizeof(BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_3_K2Node_ComponentBoundEvent_9_UIElementSelected__DelegateSignature) == 0x000008, "Wrong size on BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_3_K2Node_ComponentBoundEvent_9_UIElementSelected__DelegateSignature");
static_assert(offsetof(BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_3_K2Node_ComponentBoundEvent_9_UIElementSelected__DelegateSignature, button) == 0x000000, "Member 'BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_3_K2Node_ComponentBoundEvent_9_UIElementSelected__DelegateSignature::button' has a wrong offset!");

// Function BP_SubHeaderMenu.BP_SubHeaderMenu_C.BndEvt__BP_SubHeaderMenu_m_button_2_K2Node_ComponentBoundEvent_8_UIElementSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_2_K2Node_ComponentBoundEvent_8_UIElementSelected__DelegateSignature final
{
public:
	class UCABaseUIElement*                       button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_2_K2Node_ComponentBoundEvent_8_UIElementSelected__DelegateSignature) == 0x000008, "Wrong alignment on BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_2_K2Node_ComponentBoundEvent_8_UIElementSelected__DelegateSignature");
static_assert(sizeof(BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_2_K2Node_ComponentBoundEvent_8_UIElementSelected__DelegateSignature) == 0x000008, "Wrong size on BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_2_K2Node_ComponentBoundEvent_8_UIElementSelected__DelegateSignature");
static_assert(offsetof(BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_2_K2Node_ComponentBoundEvent_8_UIElementSelected__DelegateSignature, button) == 0x000000, "Member 'BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_2_K2Node_ComponentBoundEvent_8_UIElementSelected__DelegateSignature::button' has a wrong offset!");

// Function BP_SubHeaderMenu.BP_SubHeaderMenu_C.BndEvt__BP_SubHeaderMenu_m_button_1_K2Node_ComponentBoundEvent_7_UIElementSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_1_K2Node_ComponentBoundEvent_7_UIElementSelected__DelegateSignature final
{
public:
	class UCABaseUIElement*                       button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_1_K2Node_ComponentBoundEvent_7_UIElementSelected__DelegateSignature) == 0x000008, "Wrong alignment on BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_1_K2Node_ComponentBoundEvent_7_UIElementSelected__DelegateSignature");
static_assert(sizeof(BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_1_K2Node_ComponentBoundEvent_7_UIElementSelected__DelegateSignature) == 0x000008, "Wrong size on BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_1_K2Node_ComponentBoundEvent_7_UIElementSelected__DelegateSignature");
static_assert(offsetof(BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_1_K2Node_ComponentBoundEvent_7_UIElementSelected__DelegateSignature, button) == 0x000000, "Member 'BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_1_K2Node_ComponentBoundEvent_7_UIElementSelected__DelegateSignature::button' has a wrong offset!");

// Function BP_SubHeaderMenu.BP_SubHeaderMenu_C.BndEvt__BP_SubHeaderMenu_m_button_0_K2Node_ComponentBoundEvent_6_UIElementSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_0_K2Node_ComponentBoundEvent_6_UIElementSelected__DelegateSignature final
{
public:
	class UCABaseUIElement*                       button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_0_K2Node_ComponentBoundEvent_6_UIElementSelected__DelegateSignature) == 0x000008, "Wrong alignment on BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_0_K2Node_ComponentBoundEvent_6_UIElementSelected__DelegateSignature");
static_assert(sizeof(BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_0_K2Node_ComponentBoundEvent_6_UIElementSelected__DelegateSignature) == 0x000008, "Wrong size on BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_0_K2Node_ComponentBoundEvent_6_UIElementSelected__DelegateSignature");
static_assert(offsetof(BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_0_K2Node_ComponentBoundEvent_6_UIElementSelected__DelegateSignature, button) == 0x000000, "Member 'BP_SubHeaderMenu_C_BndEvt__BP_SubHeaderMenu_m_button_0_K2Node_ComponentBoundEvent_6_UIElementSelected__DelegateSignature::button' has a wrong offset!");

// Function BP_SubHeaderMenu.BP_SubHeaderMenu_C.ShowActionHints
// 0x0001 (0x0001 - 0x0000)
struct BP_SubHeaderMenu_C_ShowActionHints final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SubHeaderMenu_C_ShowActionHints) == 0x000001, "Wrong alignment on BP_SubHeaderMenu_C_ShowActionHints");
static_assert(sizeof(BP_SubHeaderMenu_C_ShowActionHints) == 0x000001, "Wrong size on BP_SubHeaderMenu_C_ShowActionHints");
static_assert(offsetof(BP_SubHeaderMenu_C_ShowActionHints, Show) == 0x000000, "Member 'BP_SubHeaderMenu_C_ShowActionHints::Show' has a wrong offset!");

}

