#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StreamerEffect_Sticky_Grenade_DAOT

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_StreamerEffect_Sticky_Grenade_DAOT.BP_StreamerEffect_Sticky_Grenade_DAOT_C.ExecuteUbergraph_BP_StreamerEffect_Sticky_Grenade_DAOT
// 0x0008 (0x0008 - 0x0000)
struct BP_StreamerEffect_Sticky_Grenade_DAOT_C_ExecuteUbergraph_BP_StreamerEffect_Sticky_Grenade_DAOT final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StreamerEffect_Sticky_Grenade_DAOT_C_ExecuteUbergraph_BP_StreamerEffect_Sticky_Grenade_DAOT) == 0x000004, "Wrong alignment on BP_StreamerEffect_Sticky_Grenade_DAOT_C_ExecuteUbergraph_BP_StreamerEffect_Sticky_Grenade_DAOT");
static_assert(sizeof(BP_StreamerEffect_Sticky_Grenade_DAOT_C_ExecuteUbergraph_BP_StreamerEffect_Sticky_Grenade_DAOT) == 0x000008, "Wrong size on BP_StreamerEffect_Sticky_Grenade_DAOT_C_ExecuteUbergraph_BP_StreamerEffect_Sticky_Grenade_DAOT");
static_assert(offsetof(BP_StreamerEffect_Sticky_Grenade_DAOT_C_ExecuteUbergraph_BP_StreamerEffect_Sticky_Grenade_DAOT, EntryPoint) == 0x000000, "Member 'BP_StreamerEffect_Sticky_Grenade_DAOT_C_ExecuteUbergraph_BP_StreamerEffect_Sticky_Grenade_DAOT::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_StreamerEffect_Sticky_Grenade_DAOT_C_ExecuteUbergraph_BP_StreamerEffect_Sticky_Grenade_DAOT, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_StreamerEffect_Sticky_Grenade_DAOT_C_ExecuteUbergraph_BP_StreamerEffect_Sticky_Grenade_DAOT::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_StreamerEffect_Sticky_Grenade_DAOT.BP_StreamerEffect_Sticky_Grenade_DAOT_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_StreamerEffect_Sticky_Grenade_DAOT_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StreamerEffect_Sticky_Grenade_DAOT_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_StreamerEffect_Sticky_Grenade_DAOT_C_ReceiveTick");
static_assert(sizeof(BP_StreamerEffect_Sticky_Grenade_DAOT_C_ReceiveTick) == 0x000004, "Wrong size on BP_StreamerEffect_Sticky_Grenade_DAOT_C_ReceiveTick");
static_assert(offsetof(BP_StreamerEffect_Sticky_Grenade_DAOT_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_StreamerEffect_Sticky_Grenade_DAOT_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

