#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Shield_invis

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Shield_invis.BP_Shield_Invis_C
// 0x0020 (0x0278 - 0x0258)
class ABP_Shield_Invis_C final : public AActor
{
public:
	class UBoxComponent*                          Collision2;                                        // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Collision1;                                        // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_EliteTank_Shield;                               // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Shield_Invis_C">();
	}
	static class ABP_Shield_Invis_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Shield_Invis_C>();
	}
};
static_assert(alignof(ABP_Shield_Invis_C) == 0x000008, "Wrong alignment on ABP_Shield_Invis_C");
static_assert(sizeof(ABP_Shield_Invis_C) == 0x000278, "Wrong size on ABP_Shield_Invis_C");
static_assert(offsetof(ABP_Shield_Invis_C, Collision2) == 0x000258, "Member 'ABP_Shield_Invis_C::Collision2' has a wrong offset!");
static_assert(offsetof(ABP_Shield_Invis_C, Collision1) == 0x000260, "Member 'ABP_Shield_Invis_C::Collision1' has a wrong offset!");
static_assert(offsetof(ABP_Shield_Invis_C, SM_EliteTank_Shield) == 0x000268, "Member 'ABP_Shield_Invis_C::SM_EliteTank_Shield' has a wrong offset!");
static_assert(offsetof(ABP_Shield_Invis_C, DefaultSceneRoot) == 0x000270, "Member 'ABP_Shield_Invis_C::DefaultSceneRoot' has a wrong offset!");

}

