#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShipsVoiceController

#include "Basic.hpp"

#include "Keaton_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ShipsVoiceController.BP_ShipsVoiceController_C.ExecuteUbergraph_BP_ShipsVoiceController
// 0x0290 (0x0290 - 0x0000)
struct BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0014)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ExtractionProgress_5;           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECAThresholdState                             K2Node_CustomEvent_ThresholdState;                 // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_ExtractionProgress_4;           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_ExtractionProgress_3;           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ExtractionProgress_2;           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_ExtractionProgress_1;           // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_isMyTeam_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsMyTeam;                       // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_VaultName;                      // 0x0068(0x0018)()
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0084(0x0014)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00A4(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00B8(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_ExtractionProgress;             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x00D4(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x00E8(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_3;        // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_4;        // 0x0108(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0114(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0128(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13E[0x2];                                      // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x014E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14F[0x1];                                      // 0x014F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_5;        // 0x0150(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayerCharacter_ReturnValue;      // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_9;                // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayerCharacter_ReturnValue_1;    // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayerCharacter_ReturnValue_2;    // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayerCharacter_ReturnValue_3;    // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0188(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x019C(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_10;               // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_1;                           // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_2;                           // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x01CC(0x0014)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_6;        // 0x01E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Trigger_name;                   // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_3;                           // 0x0230(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_TriggerName;                    // 0x023C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_11;               // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_4;                           // 0x0284(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController) == 0x000008, "Wrong alignment on BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController");
static_assert(sizeof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController) == 0x000290, "Wrong size on BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, EntryPoint) == 0x000000, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000038, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_CustomEvent_ExtractionProgress_5) == 0x000040, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_CustomEvent_ExtractionProgress_5' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_Not_PreBool_ReturnValue_1) == 0x000044, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_CustomEvent_ThresholdState) == 0x000045, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_CustomEvent_ThresholdState' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_CustomEvent_ExtractionProgress_4) == 0x000048, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_CustomEvent_ExtractionProgress_4' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_Not_PreBool_ReturnValue_2) == 0x00004C, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_SwitchEnum_CmpSuccess) == 0x00004D, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_CustomEvent_ExtractionProgress_3) == 0x000050, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_CustomEvent_ExtractionProgress_3' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_CustomEvent_ExtractionProgress_2) == 0x000054, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_CustomEvent_ExtractionProgress_2' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_Not_PreBool_ReturnValue_3) == 0x000058, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_Not_PreBool_ReturnValue_4) == 0x000059, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_CustomEvent_ExtractionProgress_1) == 0x00005C, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_CustomEvent_ExtractionProgress_1' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_CustomEvent_isMyTeam_1) == 0x000060, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_CustomEvent_isMyTeam_1' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_CustomEvent_IsMyTeam) == 0x000061, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_CustomEvent_IsMyTeam' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_CustomEvent_VaultName) == 0x000068, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_CustomEvent_VaultName' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, Temp_bool_IsClosed_Variable) == 0x000080, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_Not_PreBool_ReturnValue_5) == 0x000081, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_CreateDelegate_OutputDelegate_2) == 0x000084, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000098, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, Temp_bool_Has_Been_Initd_Variable) == 0x0000A0, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, Temp_bool_Variable) == 0x0000A1, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000A4, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000B8, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000CC, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_CustomEvent_ExtractionProgress) == 0x0000D0, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_CustomEvent_ExtractionProgress' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000D4, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000E8, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_K2_SetTimerDelegate_ReturnValue_3) == 0x000100, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_K2_SetTimerDelegate_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_K2_SetTimerDelegate_ReturnValue_4) == 0x000108, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_K2_SetTimerDelegate_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000110, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_BooleanAND_ReturnValue) == 0x000111, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_CreateDelegate_OutputDelegate_7) == 0x000114, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_CreateDelegate_OutputDelegate_8) == 0x000128, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, Temp_bool_Variable_1) == 0x00013C, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_Not_PreBool_ReturnValue_6) == 0x00013D, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_Select_Default) == 0x000140, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_BooleanAND_ReturnValue_1) == 0x00014C, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_BooleanAND_ReturnValue_2) == 0x00014D, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_Not_PreBool_ReturnValue_7) == 0x00014E, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_Not_PreBool_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_K2_SetTimerDelegate_ReturnValue_5) == 0x000150, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_K2_SetTimerDelegate_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_Not_PreBool_ReturnValue_8) == 0x000158, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_Not_PreBool_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, Temp_bool_Variable_2) == 0x000159, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_GetLocalPlayerCharacter_ReturnValue) == 0x000160, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_GetLocalPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_Not_PreBool_ReturnValue_9) == 0x000168, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_Not_PreBool_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_GetLocalPlayerCharacter_ReturnValue_1) == 0x000170, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_GetLocalPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_GetLocalPlayerCharacter_ReturnValue_2) == 0x000178, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_GetLocalPlayerCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_GetLocalPlayerCharacter_ReturnValue_3) == 0x000180, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_GetLocalPlayerCharacter_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_CreateDelegate_OutputDelegate_9) == 0x000188, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_CreateDelegate_OutputDelegate_10) == 0x00019C, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_Not_PreBool_ReturnValue_10) == 0x0001B0, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_Not_PreBool_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_Select_Default_1) == 0x0001B4, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_Select_Default_2) == 0x0001C0, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_CreateDelegate_OutputDelegate_11) == 0x0001CC, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_K2_SetTimerDelegate_ReturnValue_6) == 0x0001E0, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_K2_SetTimerDelegate_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_CustomEvent_Trigger_name) == 0x0001E8, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_CustomEvent_Trigger_name' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_Conv_NameToString_ReturnValue) == 0x0001F8, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, Temp_bool_Variable_3) == 0x000208, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_Concat_StrStr_ReturnValue) == 0x000210, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000220, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_Select_Default_3) == 0x000230, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_CustomEvent_TriggerName) == 0x00023C, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_CustomEvent_TriggerName' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_Not_PreBool_ReturnValue_11) == 0x000248, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_Not_PreBool_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000250, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000260, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000270, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, Temp_bool_Variable_4) == 0x000280, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController, K2Node_Select_Default_4) == 0x000284, "Member 'BP_ShipsVoiceController_C_ExecuteUbergraph_BP_ShipsVoiceController::K2Node_Select_Default_4' has a wrong offset!");

// Function BP_ShipsVoiceController.BP_ShipsVoiceController_C.PrintDialogueDebugBespoke
// 0x000C (0x000C - 0x0000)
struct BP_ShipsVoiceController_C_PrintDialogueDebugBespoke final
{
public:
	class FName                                   TriggerName;                                       // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShipsVoiceController_C_PrintDialogueDebugBespoke) == 0x000004, "Wrong alignment on BP_ShipsVoiceController_C_PrintDialogueDebugBespoke");
static_assert(sizeof(BP_ShipsVoiceController_C_PrintDialogueDebugBespoke) == 0x00000C, "Wrong size on BP_ShipsVoiceController_C_PrintDialogueDebugBespoke");
static_assert(offsetof(BP_ShipsVoiceController_C_PrintDialogueDebugBespoke, TriggerName) == 0x000000, "Member 'BP_ShipsVoiceController_C_PrintDialogueDebugBespoke::TriggerName' has a wrong offset!");

// Function BP_ShipsVoiceController.BP_ShipsVoiceController_C.PrintDialogueDebugCooldown
// 0x000C (0x000C - 0x0000)
struct BP_ShipsVoiceController_C_PrintDialogueDebugCooldown final
{
public:
	class FName                                   Trigger_name;                                      // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShipsVoiceController_C_PrintDialogueDebugCooldown) == 0x000004, "Wrong alignment on BP_ShipsVoiceController_C_PrintDialogueDebugCooldown");
static_assert(sizeof(BP_ShipsVoiceController_C_PrintDialogueDebugCooldown) == 0x00000C, "Wrong size on BP_ShipsVoiceController_C_PrintDialogueDebugCooldown");
static_assert(offsetof(BP_ShipsVoiceController_C_PrintDialogueDebugCooldown, Trigger_name) == 0x000000, "Member 'BP_ShipsVoiceController_C_PrintDialogueDebugCooldown::Trigger_name' has a wrong offset!");

// Function BP_ShipsVoiceController.BP_ShipsVoiceController_C.ShipsVoice_UpdateExtractionProgress
// 0x0004 (0x0004 - 0x0000)
struct BP_ShipsVoiceController_C_ShipsVoice_UpdateExtractionProgress final
{
public:
	float                                         ExtractionProgress;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShipsVoiceController_C_ShipsVoice_UpdateExtractionProgress) == 0x000004, "Wrong alignment on BP_ShipsVoiceController_C_ShipsVoice_UpdateExtractionProgress");
static_assert(sizeof(BP_ShipsVoiceController_C_ShipsVoice_UpdateExtractionProgress) == 0x000004, "Wrong size on BP_ShipsVoiceController_C_ShipsVoice_UpdateExtractionProgress");
static_assert(offsetof(BP_ShipsVoiceController_C_ShipsVoice_UpdateExtractionProgress, ExtractionProgress) == 0x000000, "Member 'BP_ShipsVoiceController_C_ShipsVoice_UpdateExtractionProgress::ExtractionProgress' has a wrong offset!");

// Function BP_ShipsVoiceController.BP_ShipsVoiceController_C.OnGlobalCampLockdown
// 0x0018 (0x0018 - 0x0000)
struct BP_ShipsVoiceController_C_OnGlobalCampLockdown final
{
public:
	class FText                                   VaultName;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_ShipsVoiceController_C_OnGlobalCampLockdown) == 0x000008, "Wrong alignment on BP_ShipsVoiceController_C_OnGlobalCampLockdown");
static_assert(sizeof(BP_ShipsVoiceController_C_OnGlobalCampLockdown) == 0x000018, "Wrong size on BP_ShipsVoiceController_C_OnGlobalCampLockdown");
static_assert(offsetof(BP_ShipsVoiceController_C_OnGlobalCampLockdown, VaultName) == 0x000000, "Member 'BP_ShipsVoiceController_C_OnGlobalCampLockdown::VaultName' has a wrong offset!");

// Function BP_ShipsVoiceController.BP_ShipsVoiceController_C.OnAnyThresholdLost
// 0x0001 (0x0001 - 0x0000)
struct BP_ShipsVoiceController_C_OnAnyThresholdLost final
{
public:
	bool                                          IsMyTeam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ShipsVoiceController_C_OnAnyThresholdLost) == 0x000001, "Wrong alignment on BP_ShipsVoiceController_C_OnAnyThresholdLost");
static_assert(sizeof(BP_ShipsVoiceController_C_OnAnyThresholdLost) == 0x000001, "Wrong size on BP_ShipsVoiceController_C_OnAnyThresholdLost");
static_assert(offsetof(BP_ShipsVoiceController_C_OnAnyThresholdLost, IsMyTeam) == 0x000000, "Member 'BP_ShipsVoiceController_C_OnAnyThresholdLost::IsMyTeam' has a wrong offset!");

// Function BP_ShipsVoiceController.BP_ShipsVoiceController_C.OnAnyThresholdReached
// 0x0001 (0x0001 - 0x0000)
struct BP_ShipsVoiceController_C_OnAnyThresholdReached final
{
public:
	bool                                          IsMyTeam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ShipsVoiceController_C_OnAnyThresholdReached) == 0x000001, "Wrong alignment on BP_ShipsVoiceController_C_OnAnyThresholdReached");
static_assert(sizeof(BP_ShipsVoiceController_C_OnAnyThresholdReached) == 0x000001, "Wrong size on BP_ShipsVoiceController_C_OnAnyThresholdReached");
static_assert(offsetof(BP_ShipsVoiceController_C_OnAnyThresholdReached, IsMyTeam) == 0x000000, "Member 'BP_ShipsVoiceController_C_OnAnyThresholdReached::IsMyTeam' has a wrong offset!");

// Function BP_ShipsVoiceController.BP_ShipsVoiceController_C.OnEnemyExtractionProgress
// 0x0004 (0x0004 - 0x0000)
struct BP_ShipsVoiceController_C_OnEnemyExtractionProgress final
{
public:
	float                                         ExtractionProgress;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShipsVoiceController_C_OnEnemyExtractionProgress) == 0x000004, "Wrong alignment on BP_ShipsVoiceController_C_OnEnemyExtractionProgress");
static_assert(sizeof(BP_ShipsVoiceController_C_OnEnemyExtractionProgress) == 0x000004, "Wrong size on BP_ShipsVoiceController_C_OnEnemyExtractionProgress");
static_assert(offsetof(BP_ShipsVoiceController_C_OnEnemyExtractionProgress, ExtractionProgress) == 0x000000, "Member 'BP_ShipsVoiceController_C_OnEnemyExtractionProgress::ExtractionProgress' has a wrong offset!");

// Function BP_ShipsVoiceController.BP_ShipsVoiceController_C.OnEnemyExtractionAvailable
// 0x0004 (0x0004 - 0x0000)
struct BP_ShipsVoiceController_C_OnEnemyExtractionAvailable final
{
public:
	float                                         ExtractionProgress;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShipsVoiceController_C_OnEnemyExtractionAvailable) == 0x000004, "Wrong alignment on BP_ShipsVoiceController_C_OnEnemyExtractionAvailable");
static_assert(sizeof(BP_ShipsVoiceController_C_OnEnemyExtractionAvailable) == 0x000004, "Wrong size on BP_ShipsVoiceController_C_OnEnemyExtractionAvailable");
static_assert(offsetof(BP_ShipsVoiceController_C_OnEnemyExtractionAvailable, ExtractionProgress) == 0x000000, "Member 'BP_ShipsVoiceController_C_OnEnemyExtractionAvailable::ExtractionProgress' has a wrong offset!");

// Function BP_ShipsVoiceController.BP_ShipsVoiceController_C.OnTeamExtractionProgress
// 0x0004 (0x0004 - 0x0000)
struct BP_ShipsVoiceController_C_OnTeamExtractionProgress final
{
public:
	float                                         ExtractionProgress;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShipsVoiceController_C_OnTeamExtractionProgress) == 0x000004, "Wrong alignment on BP_ShipsVoiceController_C_OnTeamExtractionProgress");
static_assert(sizeof(BP_ShipsVoiceController_C_OnTeamExtractionProgress) == 0x000004, "Wrong size on BP_ShipsVoiceController_C_OnTeamExtractionProgress");
static_assert(offsetof(BP_ShipsVoiceController_C_OnTeamExtractionProgress, ExtractionProgress) == 0x000000, "Member 'BP_ShipsVoiceController_C_OnTeamExtractionProgress::ExtractionProgress' has a wrong offset!");

// Function BP_ShipsVoiceController.BP_ShipsVoiceController_C.ShipsVoiceController_OnThresholdStateChanged
// 0x0008 (0x0008 - 0x0000)
struct BP_ShipsVoiceController_C_ShipsVoiceController_OnThresholdStateChanged final
{
public:
	ECAThresholdState                             ThresholdState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ExtractionProgress;                                // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShipsVoiceController_C_ShipsVoiceController_OnThresholdStateChanged) == 0x000004, "Wrong alignment on BP_ShipsVoiceController_C_ShipsVoiceController_OnThresholdStateChanged");
static_assert(sizeof(BP_ShipsVoiceController_C_ShipsVoiceController_OnThresholdStateChanged) == 0x000008, "Wrong size on BP_ShipsVoiceController_C_ShipsVoiceController_OnThresholdStateChanged");
static_assert(offsetof(BP_ShipsVoiceController_C_ShipsVoiceController_OnThresholdStateChanged, ThresholdState) == 0x000000, "Member 'BP_ShipsVoiceController_C_ShipsVoiceController_OnThresholdStateChanged::ThresholdState' has a wrong offset!");
static_assert(offsetof(BP_ShipsVoiceController_C_ShipsVoiceController_OnThresholdStateChanged, ExtractionProgress) == 0x000004, "Member 'BP_ShipsVoiceController_C_ShipsVoiceController_OnThresholdStateChanged::ExtractionProgress' has a wrong offset!");

// Function BP_ShipsVoiceController.BP_ShipsVoiceController_C.OnTeamExtractionAvailable
// 0x0004 (0x0004 - 0x0000)
struct BP_ShipsVoiceController_C_OnTeamExtractionAvailable final
{
public:
	float                                         ExtractionProgress;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShipsVoiceController_C_OnTeamExtractionAvailable) == 0x000004, "Wrong alignment on BP_ShipsVoiceController_C_OnTeamExtractionAvailable");
static_assert(sizeof(BP_ShipsVoiceController_C_OnTeamExtractionAvailable) == 0x000004, "Wrong size on BP_ShipsVoiceController_C_OnTeamExtractionAvailable");
static_assert(offsetof(BP_ShipsVoiceController_C_OnTeamExtractionAvailable, ExtractionProgress) == 0x000000, "Member 'BP_ShipsVoiceController_C_OnTeamExtractionAvailable::ExtractionProgress' has a wrong offset!");

}

