#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SupplyCrateStateComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SupplyCrateStateComponent.BP_SupplyCrateStateComponent_C
// 0x0070 (0x0DD0 - 0x0D60)
class UBP_SupplyCrateStateComponent_C final : public UCAStateMachineComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	FMulticastInlineDelegateProperty_             EventClosed;                                       // 0x0D68(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EventOpen;                                         // 0x0D78(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EventOpening;                                      // 0x0D88(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EventClosing;                                      // 0x0D98(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EventDamaged;                                      // 0x0DA8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          ShouldBind;                                        // 0x0DB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DB9[0x7];                                      // 0x0DB9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             EventClosedDeactivated;                            // 0x0DC0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void EventClosed__DelegateSignature();
	void EventOpen__DelegateSignature();
	void EventOpening__DelegateSignature();
	void EventClosing__DelegateSignature();
	void EventDamaged__DelegateSignature();
	void EventClosedDeactivated__DelegateSignature();
	void ExecuteUbergraph_BP_SupplyCrateStateComponent(int32 EntryPoint);
	void ClosedStateDeactivated();
	void Damaged();
	void Closing();
	void Opening();
	void Open();
	void Closed();
	void BindDelegates();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SupplyCrateStateComponent_C">();
	}
	static class UBP_SupplyCrateStateComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SupplyCrateStateComponent_C>();
	}
};
static_assert(alignof(UBP_SupplyCrateStateComponent_C) == 0x000008, "Wrong alignment on UBP_SupplyCrateStateComponent_C");
static_assert(sizeof(UBP_SupplyCrateStateComponent_C) == 0x000DD0, "Wrong size on UBP_SupplyCrateStateComponent_C");
static_assert(offsetof(UBP_SupplyCrateStateComponent_C, UberGraphFrame) == 0x000D60, "Member 'UBP_SupplyCrateStateComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SupplyCrateStateComponent_C, EventClosed) == 0x000D68, "Member 'UBP_SupplyCrateStateComponent_C::EventClosed' has a wrong offset!");
static_assert(offsetof(UBP_SupplyCrateStateComponent_C, EventOpen) == 0x000D78, "Member 'UBP_SupplyCrateStateComponent_C::EventOpen' has a wrong offset!");
static_assert(offsetof(UBP_SupplyCrateStateComponent_C, EventOpening) == 0x000D88, "Member 'UBP_SupplyCrateStateComponent_C::EventOpening' has a wrong offset!");
static_assert(offsetof(UBP_SupplyCrateStateComponent_C, EventClosing) == 0x000D98, "Member 'UBP_SupplyCrateStateComponent_C::EventClosing' has a wrong offset!");
static_assert(offsetof(UBP_SupplyCrateStateComponent_C, EventDamaged) == 0x000DA8, "Member 'UBP_SupplyCrateStateComponent_C::EventDamaged' has a wrong offset!");
static_assert(offsetof(UBP_SupplyCrateStateComponent_C, ShouldBind) == 0x000DB8, "Member 'UBP_SupplyCrateStateComponent_C::ShouldBind' has a wrong offset!");
static_assert(offsetof(UBP_SupplyCrateStateComponent_C, EventClosedDeactivated) == 0x000DC0, "Member 'UBP_SupplyCrateStateComponent_C::EventClosedDeactivated' has a wrong offset!");

}

