#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpecialistTurret_AudioComponent

#include "Basic.hpp"

#include "Keaton_structs.hpp"


namespace SDK::Params
{

// Function BP_SpecialistTurret_AudioComponent.BP_SpecialistTurret_AudioComponent_C.ExecuteUbergraph_BP_SpecialistTurret_AudioComponent
// 0x001C (0x001C - 0x0000)
struct BP_SpecialistTurret_AudioComponent_C_ExecuteUbergraph_BP_SpecialistTurret_AudioComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECAAwarenessState Awareness_state)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	ECAAwarenessState                             K2Node_CustomEvent_NewAwarenessState;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SpecialistTurret_AudioComponent_C_ExecuteUbergraph_BP_SpecialistTurret_AudioComponent) == 0x000004, "Wrong alignment on BP_SpecialistTurret_AudioComponent_C_ExecuteUbergraph_BP_SpecialistTurret_AudioComponent");
static_assert(sizeof(BP_SpecialistTurret_AudioComponent_C_ExecuteUbergraph_BP_SpecialistTurret_AudioComponent) == 0x00001C, "Wrong size on BP_SpecialistTurret_AudioComponent_C_ExecuteUbergraph_BP_SpecialistTurret_AudioComponent");
static_assert(offsetof(BP_SpecialistTurret_AudioComponent_C_ExecuteUbergraph_BP_SpecialistTurret_AudioComponent, EntryPoint) == 0x000000, "Member 'BP_SpecialistTurret_AudioComponent_C_ExecuteUbergraph_BP_SpecialistTurret_AudioComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SpecialistTurret_AudioComponent_C_ExecuteUbergraph_BP_SpecialistTurret_AudioComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_SpecialistTurret_AudioComponent_C_ExecuteUbergraph_BP_SpecialistTurret_AudioComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SpecialistTurret_AudioComponent_C_ExecuteUbergraph_BP_SpecialistTurret_AudioComponent, K2Node_CustomEvent_NewAwarenessState) == 0x000018, "Member 'BP_SpecialistTurret_AudioComponent_C_ExecuteUbergraph_BP_SpecialistTurret_AudioComponent::K2Node_CustomEvent_NewAwarenessState' has a wrong offset!");
static_assert(offsetof(BP_SpecialistTurret_AudioComponent_C_ExecuteUbergraph_BP_SpecialistTurret_AudioComponent, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'BP_SpecialistTurret_AudioComponent_C_ExecuteUbergraph_BP_SpecialistTurret_AudioComponent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_SpecialistTurret_AudioComponent.BP_SpecialistTurret_AudioComponent_C.OnAwarenessStateChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_SpecialistTurret_AudioComponent_C_OnAwarenessStateChanged final
{
public:
	ECAAwarenessState                             NewAwarenessState;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpecialistTurret_AudioComponent_C_OnAwarenessStateChanged) == 0x000001, "Wrong alignment on BP_SpecialistTurret_AudioComponent_C_OnAwarenessStateChanged");
static_assert(sizeof(BP_SpecialistTurret_AudioComponent_C_OnAwarenessStateChanged) == 0x000001, "Wrong size on BP_SpecialistTurret_AudioComponent_C_OnAwarenessStateChanged");
static_assert(offsetof(BP_SpecialistTurret_AudioComponent_C_OnAwarenessStateChanged, NewAwarenessState) == 0x000000, "Member 'BP_SpecialistTurret_AudioComponent_C_OnAwarenessStateChanged::NewAwarenessState' has a wrong offset!");

}

