#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SecurityStateComponent

#include "Basic.hpp"

#include "Keaton_structs.hpp"


namespace SDK::Params
{

// Function BP_SecurityStateComponent.BP_SecurityStateComponent_C.EventAlertTime__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_SecurityStateComponent_C_EventAlertTime__DelegateSignature final
{
public:
	float                                         AlertTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SecurityStateComponent_C_EventAlertTime__DelegateSignature) == 0x000004, "Wrong alignment on BP_SecurityStateComponent_C_EventAlertTime__DelegateSignature");
static_assert(sizeof(BP_SecurityStateComponent_C_EventAlertTime__DelegateSignature) == 0x000004, "Wrong size on BP_SecurityStateComponent_C_EventAlertTime__DelegateSignature");
static_assert(offsetof(BP_SecurityStateComponent_C_EventAlertTime__DelegateSignature, AlertTime) == 0x000000, "Member 'BP_SecurityStateComponent_C_EventAlertTime__DelegateSignature::AlertTime' has a wrong offset!");

// Function BP_SecurityStateComponent.BP_SecurityStateComponent_C.ExecuteUbergraph_BP_SecurityStateComponent
// 0x00F8 (0x00F8 - 0x0000)
struct BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0040(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0054(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0068(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x007C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0090(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x00A4(0x0014)(ZeroConstructor, NoDestructor)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue;               // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_1;             // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_2;             // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_3;             // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_4;             // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_5;             // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_6;             // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_7;             // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent) == 0x000008, "Wrong alignment on BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent");
static_assert(sizeof(BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent) == 0x0000F8, "Wrong size on BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent");
static_assert(offsetof(BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent, EntryPoint) == 0x000000, "Member 'BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent, K2Node_CreateDelegate_OutputDelegate_3) == 0x000040, "Member 'BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent, K2Node_CreateDelegate_OutputDelegate_4) == 0x000054, "Member 'BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent, K2Node_CreateDelegate_OutputDelegate_5) == 0x000068, "Member 'BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent, K2Node_CreateDelegate_OutputDelegate_6) == 0x00007C, "Member 'BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent, K2Node_CreateDelegate_OutputDelegate_7) == 0x000090, "Member 'BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000A4, "Member 'BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent, CallFunc_GetStateByName_ReturnValue) == 0x0000B8, "Member 'BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent::CallFunc_GetStateByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent, CallFunc_GetStateByName_ReturnValue_1) == 0x0000C0, "Member 'BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent::CallFunc_GetStateByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent, CallFunc_GetStateByName_ReturnValue_2) == 0x0000C8, "Member 'BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent::CallFunc_GetStateByName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent, CallFunc_GetStateByName_ReturnValue_3) == 0x0000D0, "Member 'BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent::CallFunc_GetStateByName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent, CallFunc_GetStateByName_ReturnValue_4) == 0x0000D8, "Member 'BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent::CallFunc_GetStateByName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent, CallFunc_GetStateByName_ReturnValue_5) == 0x0000E0, "Member 'BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent::CallFunc_GetStateByName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent, CallFunc_GetStateByName_ReturnValue_6) == 0x0000E8, "Member 'BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent::CallFunc_GetStateByName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent, CallFunc_GetStateByName_ReturnValue_7) == 0x0000F0, "Member 'BP_SecurityStateComponent_C_ExecuteUbergraph_BP_SecurityStateComponent::CallFunc_GetStateByName_ReturnValue_7' has a wrong offset!");

// Function BP_SecurityStateComponent.BP_SecurityStateComponent_C.TriggerRecovery
// 0x0004 (0x0004 - 0x0000)
struct BP_SecurityStateComponent_C_TriggerRecovery final
{
public:
	float                                         CallFunc_GetTransitionTime_ReturnValue;            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SecurityStateComponent_C_TriggerRecovery) == 0x000004, "Wrong alignment on BP_SecurityStateComponent_C_TriggerRecovery");
static_assert(sizeof(BP_SecurityStateComponent_C_TriggerRecovery) == 0x000004, "Wrong size on BP_SecurityStateComponent_C_TriggerRecovery");
static_assert(offsetof(BP_SecurityStateComponent_C_TriggerRecovery, CallFunc_GetTransitionTime_ReturnValue) == 0x000000, "Member 'BP_SecurityStateComponent_C_TriggerRecovery::CallFunc_GetTransitionTime_ReturnValue' has a wrong offset!");

// Function BP_SecurityStateComponent.BP_SecurityStateComponent_C.CollectDebugInfo
// 0x00A0 (0x00A0 - 0x0000)
struct BP_SecurityStateComponent_C_CollectDebugInfo final
{
public:
	struct FCADebugTextCollector                  InCollector;                                       // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FCADebugTextCollector                  OutCollector;                                      // 0x0018(0x0018)(Parm, OutParm)
	struct FCADebugTextCollector                  DebugCollector;                                    // 0x0030(0x0018)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UCAStateMachineDefinitionDataAsset> CallFunc_DetermineAssetToUse_ReturnValue;          // 0x0048(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_SoftObjectReferenceToString_ReturnValue; // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCAFiniteState*                         CallFunc_GetCurrentState_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SecurityStateComponent_C_CollectDebugInfo) == 0x000008, "Wrong alignment on BP_SecurityStateComponent_C_CollectDebugInfo");
static_assert(sizeof(BP_SecurityStateComponent_C_CollectDebugInfo) == 0x0000A0, "Wrong size on BP_SecurityStateComponent_C_CollectDebugInfo");
static_assert(offsetof(BP_SecurityStateComponent_C_CollectDebugInfo, InCollector) == 0x000000, "Member 'BP_SecurityStateComponent_C_CollectDebugInfo::InCollector' has a wrong offset!");
static_assert(offsetof(BP_SecurityStateComponent_C_CollectDebugInfo, OutCollector) == 0x000018, "Member 'BP_SecurityStateComponent_C_CollectDebugInfo::OutCollector' has a wrong offset!");
static_assert(offsetof(BP_SecurityStateComponent_C_CollectDebugInfo, DebugCollector) == 0x000030, "Member 'BP_SecurityStateComponent_C_CollectDebugInfo::DebugCollector' has a wrong offset!");
static_assert(offsetof(BP_SecurityStateComponent_C_CollectDebugInfo, CallFunc_DetermineAssetToUse_ReturnValue) == 0x000048, "Member 'BP_SecurityStateComponent_C_CollectDebugInfo::CallFunc_DetermineAssetToUse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SecurityStateComponent_C_CollectDebugInfo, CallFunc_Conv_SoftObjectReferenceToString_ReturnValue) == 0x000078, "Member 'BP_SecurityStateComponent_C_CollectDebugInfo::CallFunc_Conv_SoftObjectReferenceToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SecurityStateComponent_C_CollectDebugInfo, CallFunc_GetCurrentState_ReturnValue) == 0x000088, "Member 'BP_SecurityStateComponent_C_CollectDebugInfo::CallFunc_GetCurrentState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SecurityStateComponent_C_CollectDebugInfo, CallFunc_GetDisplayName_ReturnValue) == 0x000090, "Member 'BP_SecurityStateComponent_C_CollectDebugInfo::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");

}

