#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpinningSonic

#include "Basic.hpp"

#include "MovieScene_structs.hpp"


namespace SDK::Params
{

// Function BP_SpinningSonic.BP_SpinningSonic_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SpinningSonic_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpinningSonic_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SpinningSonic_C_ReceiveTick");
static_assert(sizeof(BP_SpinningSonic_C_ReceiveTick) == 0x000004, "Wrong size on BP_SpinningSonic_C_ReceiveTick");
static_assert(offsetof(BP_SpinningSonic_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SpinningSonic_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_SpinningSonic.BP_SpinningSonic_C.ExecuteUbergraph_BP_SpinningSonic
// 0x0030 (0x0030 - 0x0000)
struct BP_SpinningSonic_C_ExecuteUbergraph_BP_SpinningSonic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMovieSceneSequencePlaybackSettings    K2Node_MakeStruct_MovieSceneSequencePlaybackSettings; // 0x0004(0x0014)(NoDestructor)
	class ALevelSequenceActor*                    CallFunc_CreateLevelSequencePlayer_OutActor;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_CreateLevelSequencePlayer_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpinningSonic_C_ExecuteUbergraph_BP_SpinningSonic) == 0x000008, "Wrong alignment on BP_SpinningSonic_C_ExecuteUbergraph_BP_SpinningSonic");
static_assert(sizeof(BP_SpinningSonic_C_ExecuteUbergraph_BP_SpinningSonic) == 0x000030, "Wrong size on BP_SpinningSonic_C_ExecuteUbergraph_BP_SpinningSonic");
static_assert(offsetof(BP_SpinningSonic_C_ExecuteUbergraph_BP_SpinningSonic, EntryPoint) == 0x000000, "Member 'BP_SpinningSonic_C_ExecuteUbergraph_BP_SpinningSonic::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SpinningSonic_C_ExecuteUbergraph_BP_SpinningSonic, K2Node_MakeStruct_MovieSceneSequencePlaybackSettings) == 0x000004, "Member 'BP_SpinningSonic_C_ExecuteUbergraph_BP_SpinningSonic::K2Node_MakeStruct_MovieSceneSequencePlaybackSettings' has a wrong offset!");
static_assert(offsetof(BP_SpinningSonic_C_ExecuteUbergraph_BP_SpinningSonic, CallFunc_CreateLevelSequencePlayer_OutActor) == 0x000018, "Member 'BP_SpinningSonic_C_ExecuteUbergraph_BP_SpinningSonic::CallFunc_CreateLevelSequencePlayer_OutActor' has a wrong offset!");
static_assert(offsetof(BP_SpinningSonic_C_ExecuteUbergraph_BP_SpinningSonic, CallFunc_CreateLevelSequencePlayer_ReturnValue) == 0x000020, "Member 'BP_SpinningSonic_C_ExecuteUbergraph_BP_SpinningSonic::CallFunc_CreateLevelSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpinningSonic_C_ExecuteUbergraph_BP_SpinningSonic, K2Node_Event_DeltaSeconds) == 0x000028, "Member 'BP_SpinningSonic_C_ExecuteUbergraph_BP_SpinningSonic::K2Node_Event_DeltaSeconds' has a wrong offset!");

}

