#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SocialPartyScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_SocialPartyScreen.BP_SocialPartyScreen_C
// 0x0040 (0x0328 - 0x02E8)
class UBP_SocialPartyScreen_C final : public UCABaseScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFE_screenTitle_C*                      FE_screenTitle;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PartyPlayerCard_C*                  Local_player_party_card;                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PartyPlayerCard_C*                  Party_member_01;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PartyPlayerCard_C*                  Party_member_02;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UBP_PartyPlayerCard_C*>          Party_member_cards;                                // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         Team_member_index;                                 // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFrontend;                                        // 0x0324(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_SocialPartyScreen(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Destruct();
	void Construct();
	void OnCardActivated(class UBP_PartyPlayerCard_C* Card);
	void ResetMemberCards();
	void SetDataForParty(const TArray<struct FCAPartyMemberUIData>& Members_data);
	void SetDataForLocalPlayer(const struct FCAPartyMemberUIData& Member_data);
	void DeactivateCards();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SocialPartyScreen_C">();
	}
	static class UBP_SocialPartyScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SocialPartyScreen_C>();
	}
};
static_assert(alignof(UBP_SocialPartyScreen_C) == 0x000008, "Wrong alignment on UBP_SocialPartyScreen_C");
static_assert(sizeof(UBP_SocialPartyScreen_C) == 0x000328, "Wrong size on UBP_SocialPartyScreen_C");
static_assert(offsetof(UBP_SocialPartyScreen_C, UberGraphFrame) == 0x0002E8, "Member 'UBP_SocialPartyScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SocialPartyScreen_C, FE_screenTitle) == 0x0002F0, "Member 'UBP_SocialPartyScreen_C::FE_screenTitle' has a wrong offset!");
static_assert(offsetof(UBP_SocialPartyScreen_C, Local_player_party_card) == 0x0002F8, "Member 'UBP_SocialPartyScreen_C::Local_player_party_card' has a wrong offset!");
static_assert(offsetof(UBP_SocialPartyScreen_C, Party_member_01) == 0x000300, "Member 'UBP_SocialPartyScreen_C::Party_member_01' has a wrong offset!");
static_assert(offsetof(UBP_SocialPartyScreen_C, Party_member_02) == 0x000308, "Member 'UBP_SocialPartyScreen_C::Party_member_02' has a wrong offset!");
static_assert(offsetof(UBP_SocialPartyScreen_C, Party_member_cards) == 0x000310, "Member 'UBP_SocialPartyScreen_C::Party_member_cards' has a wrong offset!");
static_assert(offsetof(UBP_SocialPartyScreen_C, Team_member_index) == 0x000320, "Member 'UBP_SocialPartyScreen_C::Team_member_index' has a wrong offset!");
static_assert(offsetof(UBP_SocialPartyScreen_C, IsFrontend) == 0x000324, "Member 'UBP_SocialPartyScreen_C::IsFrontend' has a wrong offset!");

}

