#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StreamerEffect_DismemberedLimb

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_StreamerEffect_DismemberedLimb.BP_StreamerEffect_DismemberedLimb_C.ExecuteUbergraph_BP_StreamerEffect_DismemberedLimb
// 0x0030 (0x0030 - 0x0000)
struct BP_StreamerEffect_DismemberedLimb_C_ExecuteUbergraph_BP_StreamerEffect_DismemberedLimb final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        CallFunc_ZeroGCascadeSwitch_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         CallFunc_ZeroGNiagaraSwitch_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnCACascadeSystemAttached_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StreamerEffect_DismemberedLimb_C_ExecuteUbergraph_BP_StreamerEffect_DismemberedLimb) == 0x000008, "Wrong alignment on BP_StreamerEffect_DismemberedLimb_C_ExecuteUbergraph_BP_StreamerEffect_DismemberedLimb");
static_assert(sizeof(BP_StreamerEffect_DismemberedLimb_C_ExecuteUbergraph_BP_StreamerEffect_DismemberedLimb) == 0x000030, "Wrong size on BP_StreamerEffect_DismemberedLimb_C_ExecuteUbergraph_BP_StreamerEffect_DismemberedLimb");
static_assert(offsetof(BP_StreamerEffect_DismemberedLimb_C_ExecuteUbergraph_BP_StreamerEffect_DismemberedLimb, EntryPoint) == 0x000000, "Member 'BP_StreamerEffect_DismemberedLimb_C_ExecuteUbergraph_BP_StreamerEffect_DismemberedLimb::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_StreamerEffect_DismemberedLimb_C_ExecuteUbergraph_BP_StreamerEffect_DismemberedLimb, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000004, "Member 'BP_StreamerEffect_DismemberedLimb_C_ExecuteUbergraph_BP_StreamerEffect_DismemberedLimb::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StreamerEffect_DismemberedLimb_C_ExecuteUbergraph_BP_StreamerEffect_DismemberedLimb, CallFunc_ZeroGCascadeSwitch_ReturnValue) == 0x000010, "Member 'BP_StreamerEffect_DismemberedLimb_C_ExecuteUbergraph_BP_StreamerEffect_DismemberedLimb::CallFunc_ZeroGCascadeSwitch_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StreamerEffect_DismemberedLimb_C_ExecuteUbergraph_BP_StreamerEffect_DismemberedLimb, CallFunc_ZeroGNiagaraSwitch_ReturnValue) == 0x000018, "Member 'BP_StreamerEffect_DismemberedLimb_C_ExecuteUbergraph_BP_StreamerEffect_DismemberedLimb::CallFunc_ZeroGNiagaraSwitch_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StreamerEffect_DismemberedLimb_C_ExecuteUbergraph_BP_StreamerEffect_DismemberedLimb, CallFunc_SpawnCACascadeSystemAttached_ReturnValue) == 0x000020, "Member 'BP_StreamerEffect_DismemberedLimb_C_ExecuteUbergraph_BP_StreamerEffect_DismemberedLimb::CallFunc_SpawnCACascadeSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StreamerEffect_DismemberedLimb_C_ExecuteUbergraph_BP_StreamerEffect_DismemberedLimb, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue) == 0x000028, "Member 'BP_StreamerEffect_DismemberedLimb_C_ExecuteUbergraph_BP_StreamerEffect_DismemberedLimb::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue' has a wrong offset!");

}

