#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SecurityArea

#include "Basic.hpp"

#include "Keaton_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CAAudio_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SecurityArea.BP_SecurityArea_C.ExecuteUbergraph_BP_SecurityArea
// 0x03D8 (0x03D8 - 0x0000)
struct BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFeatureActive_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x000C(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	float                                         K2Node_ComponentBoundEvent_AlertTime;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x0024(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	struct FCAAudioPlaybackInstance               CallFunc_PlayOnMultiObject_playback_instance;      // 0x0038(0x0010)()
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_2;                          // 0x0048(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayOnMultiObject_playback_instance_1;    // 0x0060(0x0010)()
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_3;                          // 0x0074(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_ComponentBoundEvent_tag;                    // 0x008C(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_count;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_4;                          // 0x009C(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_2;     // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_NPC*                       K2Node_ComponentBoundEvent_npc;                    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_player_1;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x00C8(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNPCTurret_ReturnValue;                  // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_detector;               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_player;                 // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_1;     // 0x00E8(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_3;                     // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_2;     // 0x00F8(0x000C)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_5;                          // 0x0104(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_ComponentBoundEvent_mission_trigger;        // 0x011C(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_1; // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetVaultDoor_ReturnValue;                 // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_4;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_VaultBase_C*                        K2Node_DynamicCast_AsBP_Vault_Base;                // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_6;                          // 0x014C(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_7;                          // 0x0160(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAGameMode*                            CallFunc_GetGameMode_ReturnValue;                  // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasThresholdMet_ReturnValue;              // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_183[0x5];                                      // 0x0183(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCAAudioEventType>              K2Node_MakeArray_Array;                            // 0x0188(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Play_Audio_on_Security_State_Change_TriggeredAudio; // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCAAudioEventType>              K2Node_MakeArray_Array_1;                          // 0x01A0(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Play_Audio_on_Security_State_Change_TriggeredAudio_1; // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCATeamID                              CallFunc_GetTeamID_ReturnValue;                    // 0x01DC(0x0004)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCATeamID                              CallFunc_GetTeamID_ReturnValue_1;                  // 0x01E4(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_CanBeDialogueSpokesperson_ReturnValue; // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_8;                          // 0x01EC(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	class ACADialogueNPCManager*                  CallFunc_GetDialogueNPCManager_ReturnValue;        // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_5;          // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayOnMultiObject_playback_instance_2;    // 0x0210(0x0010)()
	struct FCAAudioPlaybackInstance               CallFunc_PlayOnMultiObject_playback_instance_3;    // 0x0220(0x0010)()
	TArray<struct FCAAudioEventType>              K2Node_MakeArray_Array_2;                          // 0x0230(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Play_Audio_on_Security_State_Change_TriggeredAudio_2; // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCAAudioEventType>              K2Node_MakeArray_Array_3;                          // 0x0248(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Play_Audio_on_Security_State_Change_TriggeredAudio_3; // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayOnMultiObject_playback_instance_4;    // 0x0260(0x0010)()
	TDelegate<void(class UCAFiniteState* State)>  K2Node_CreateDelegate_OutputDelegate;              // 0x0270(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FGameplayTag& Tag, int32 Count)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0284(0x0014)(ZeroConstructor, NoDestructor)
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayerCharacter_ReturnValue;      // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACASecurityArea*                        CallFunc_GetCurrentSecurityArea_ReturnValue;       // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_3;               // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x02B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_4;               // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayerCharacter_ReturnValue_1;    // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayerCharacter_ReturnValue_2;    // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x02C8(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x02E0(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayerCharacter_ReturnValue_3;    // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayerCharacter_ReturnValue_4;    // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_2;            // 0x0308(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_2;                 // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_3;            // 0x0320(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_3;                 // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayerCharacter_ReturnValue_5;    // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayerCharacter_ReturnValue_6;    // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_4;            // 0x0348(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_4;                 // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_5;            // 0x0360(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_5;                 // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayerCharacter_ReturnValue_7;    // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayerCharacter_ReturnValue_8;    // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_6;            // 0x0388(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_6;                 // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_7;            // 0x03A0(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_7;                 // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayerCharacter_ReturnValue_9;    // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_8;            // 0x03C0(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_8;                 // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShowDetectedMessage_ReturnValue;          // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea) == 0x000008, "Wrong alignment on BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea");
static_assert(sizeof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea) == 0x0003D8, "Wrong size on BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, EntryPoint) == 0x000000, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_IsFeatureActive_ReturnValue) == 0x000004, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_IsFeatureActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, Temp_bool_IsClosed_Variable) == 0x000006, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, Temp_bool_Has_Been_Initd_Variable_1) == 0x000007, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, Temp_bool_IsClosed_Variable_1) == 0x000008, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, Temp_bool_IsClosed_Variable_2) == 0x000009, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, Temp_delegate_Variable) == 0x00000C, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, K2Node_ComponentBoundEvent_AlertTime) == 0x000020, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::K2Node_ComponentBoundEvent_AlertTime' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, Temp_delegate_Variable_1) == 0x000024, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_PlayOnMultiObject_playback_instance) == 0x000038, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_PlayOnMultiObject_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, Temp_delegate_Variable_2) == 0x000048, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_PlayOnMultiObject_playback_instance_1) == 0x000060, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_PlayOnMultiObject_playback_instance_1' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_IsDedicatedServer_ReturnValue) == 0x000070, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, Temp_delegate_Variable_3) == 0x000074, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000088, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, Temp_bool_Has_Been_Initd_Variable_2) == 0x000089, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, K2Node_ComponentBoundEvent_tag) == 0x00008C, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::K2Node_ComponentBoundEvent_tag' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, K2Node_ComponentBoundEvent_count) == 0x000098, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::K2Node_ComponentBoundEvent_count' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, Temp_delegate_Variable_4) == 0x00009C, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::Temp_delegate_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_Greater_IntInt_ReturnValue) == 0x0000B0, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x0000B1, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_EqualEqual_GameplayTag_ReturnValue_1) == 0x0000B2, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_EqualEqual_GameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_EqualEqual_GameplayTag_ReturnValue_2) == 0x0000B3, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_EqualEqual_GameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x0000B4, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, K2Node_ComponentBoundEvent_npc) == 0x0000B8, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::K2Node_ComponentBoundEvent_npc' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, K2Node_ComponentBoundEvent_player_1) == 0x0000C0, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::K2Node_ComponentBoundEvent_player_1' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x0000C8, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_IsNPCTurret_ReturnValue) == 0x0000D4, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_IsNPCTurret_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, K2Node_ComponentBoundEvent_detector) == 0x0000D8, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::K2Node_ComponentBoundEvent_detector' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, K2Node_ComponentBoundEvent_player) == 0x0000E0, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::K2Node_ComponentBoundEvent_player' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_MakeLiteralGameplayTag_ReturnValue_1) == 0x0000E8, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_MakeLiteralGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, Temp_bool_IsClosed_Variable_3) == 0x0000F4, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::Temp_bool_IsClosed_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_MakeLiteralGameplayTag_ReturnValue_2) == 0x0000F8, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_MakeLiteralGameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, Temp_delegate_Variable_5) == 0x000104, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::Temp_delegate_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000118, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, K2Node_ComponentBoundEvent_mission_trigger) == 0x00011C, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::K2Node_ComponentBoundEvent_mission_trigger' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_1) == 0x000128, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_GetVaultDoor_ReturnValue) == 0x000130, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_GetVaultDoor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, Temp_bool_IsClosed_Variable_4) == 0x000138, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::Temp_bool_IsClosed_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, K2Node_DynamicCast_AsBP_Vault_Base) == 0x000140, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::K2Node_DynamicCast_AsBP_Vault_Base' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, K2Node_DynamicCast_bSuccess) == 0x000148, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, Temp_delegate_Variable_6) == 0x00014C, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::Temp_delegate_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, Temp_delegate_Variable_7) == 0x000160, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::Temp_delegate_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_GetGameMode_ReturnValue) == 0x000178, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_IsValid_ReturnValue) == 0x000180, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_WasThresholdMet_ReturnValue) == 0x000181, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_WasThresholdMet_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x000182, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, K2Node_MakeArray_Array) == 0x000188, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_Play_Audio_on_Security_State_Change_TriggeredAudio) == 0x000198, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_Play_Audio_on_Security_State_Change_TriggeredAudio' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, K2Node_MakeArray_Array_1) == 0x0001A0, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_Play_Audio_on_Security_State_Change_TriggeredAudio_1) == 0x0001B0, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_Play_Audio_on_Security_State_Change_TriggeredAudio_1' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_IsDedicatedServer_ReturnValue_4) == 0x0001B1, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_IsDedicatedServer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x0001B8, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, K2Node_DynamicCast_bSuccess_1) == 0x0001C0, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0001C8, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0001D8, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_GetTeamID_ReturnValue) == 0x0001DC, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_GetTeamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_Array_Add_ReturnValue) == 0x0001E0, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_GetTeamID_ReturnValue_1) == 0x0001E4, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_GetTeamID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_BP_CanBeDialogueSpokesperson_ReturnValue) == 0x0001E8, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_BP_CanBeDialogueSpokesperson_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, Temp_delegate_Variable_8) == 0x0001EC, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::Temp_delegate_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_GetDialogueNPCManager_ReturnValue) == 0x000200, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_GetDialogueNPCManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_IsDedicatedServer_ReturnValue_5) == 0x000208, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_IsDedicatedServer_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_PlayOnMultiObject_playback_instance_2) == 0x000210, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_PlayOnMultiObject_playback_instance_2' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_PlayOnMultiObject_playback_instance_3) == 0x000220, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_PlayOnMultiObject_playback_instance_3' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, K2Node_MakeArray_Array_2) == 0x000230, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_Play_Audio_on_Security_State_Change_TriggeredAudio_2) == 0x000240, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_Play_Audio_on_Security_State_Change_TriggeredAudio_2' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, K2Node_MakeArray_Array_3) == 0x000248, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_Play_Audio_on_Security_State_Change_TriggeredAudio_3) == 0x000258, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_Play_Audio_on_Security_State_Change_TriggeredAudio_3' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_PlayOnMultiObject_playback_instance_4) == 0x000260, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_PlayOnMultiObject_playback_instance_4' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, K2Node_CreateDelegate_OutputDelegate) == 0x000270, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, K2Node_CreateDelegate_OutputDelegate_1) == 0x000284, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_GetLocalPlayerCharacter_ReturnValue) == 0x000298, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_GetLocalPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_IsValid_ReturnValue_1) == 0x0002A0, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_GetCurrentSecurityArea_ReturnValue) == 0x0002A8, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_GetCurrentSecurityArea_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_IsValid_ReturnValue_2) == 0x0002B0, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_EqualEqual_TextText_ReturnValue) == 0x0002B1, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, Temp_bool_Has_Been_Initd_Variable_3) == 0x0002B2, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::Temp_bool_Has_Been_Initd_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_Array_Contains_ReturnValue) == 0x0002B3, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, Temp_bool_Has_Been_Initd_Variable_4) == 0x0002B4, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::Temp_bool_Has_Been_Initd_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_GetLocalPlayerCharacter_ReturnValue_1) == 0x0002B8, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_GetLocalPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_GetLocalPlayerCharacter_ReturnValue_2) == 0x0002C0, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_GetLocalPlayerCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_PlayEvent_playback_instance) == 0x0002C8, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_PlayEvent_play_success) == 0x0002D8, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_PlayEvent_playback_instance_1) == 0x0002E0, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_PlayEvent_play_success_1) == 0x0002F0, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_PlayEvent_play_success_1' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_GetLocalPlayerCharacter_ReturnValue_3) == 0x0002F8, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_GetLocalPlayerCharacter_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_GetLocalPlayerCharacter_ReturnValue_4) == 0x000300, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_GetLocalPlayerCharacter_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_PlayEvent_playback_instance_2) == 0x000308, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_PlayEvent_playback_instance_2' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_PlayEvent_play_success_2) == 0x000318, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_PlayEvent_play_success_2' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_PlayEvent_playback_instance_3) == 0x000320, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_PlayEvent_playback_instance_3' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_PlayEvent_play_success_3) == 0x000330, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_PlayEvent_play_success_3' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_GetLocalPlayerCharacter_ReturnValue_5) == 0x000338, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_GetLocalPlayerCharacter_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_GetLocalPlayerCharacter_ReturnValue_6) == 0x000340, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_GetLocalPlayerCharacter_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_PlayEvent_playback_instance_4) == 0x000348, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_PlayEvent_playback_instance_4' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_PlayEvent_play_success_4) == 0x000358, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_PlayEvent_play_success_4' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_PlayEvent_playback_instance_5) == 0x000360, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_PlayEvent_playback_instance_5' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_PlayEvent_play_success_5) == 0x000370, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_PlayEvent_play_success_5' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_GetLocalPlayerCharacter_ReturnValue_7) == 0x000378, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_GetLocalPlayerCharacter_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_GetLocalPlayerCharacter_ReturnValue_8) == 0x000380, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_GetLocalPlayerCharacter_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_PlayEvent_playback_instance_6) == 0x000388, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_PlayEvent_playback_instance_6' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_PlayEvent_play_success_6) == 0x000398, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_PlayEvent_play_success_6' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_PlayEvent_playback_instance_7) == 0x0003A0, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_PlayEvent_playback_instance_7' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_PlayEvent_play_success_7) == 0x0003B0, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_PlayEvent_play_success_7' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_GetLocalPlayerCharacter_ReturnValue_9) == 0x0003B8, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_GetLocalPlayerCharacter_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_PlayEvent_playback_instance_8) == 0x0003C0, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_PlayEvent_playback_instance_8' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_PlayEvent_play_success_8) == 0x0003D0, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_PlayEvent_play_success_8' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea, CallFunc_ShowDetectedMessage_ReturnValue) == 0x0003D1, "Member 'BP_SecurityArea_C_ExecuteUbergraph_BP_SecurityArea::CallFunc_ShowDetectedMessage_ReturnValue' has a wrong offset!");

// Function BP_SecurityArea.BP_SecurityArea_C.BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_8_OnMissionTriggerActivated__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct BP_SecurityArea_C_BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_8_OnMissionTriggerActivated__DelegateSignature final
{
public:
	struct FGameplayTag                           Mission_trigger;                                   // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SecurityArea_C_BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_8_OnMissionTriggerActivated__DelegateSignature) == 0x000004, "Wrong alignment on BP_SecurityArea_C_BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_8_OnMissionTriggerActivated__DelegateSignature");
static_assert(sizeof(BP_SecurityArea_C_BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_8_OnMissionTriggerActivated__DelegateSignature) == 0x00000C, "Wrong size on BP_SecurityArea_C_BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_8_OnMissionTriggerActivated__DelegateSignature");
static_assert(offsetof(BP_SecurityArea_C_BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_8_OnMissionTriggerActivated__DelegateSignature, Mission_trigger) == 0x000000, "Member 'BP_SecurityArea_C_BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_8_OnMissionTriggerActivated__DelegateSignature::Mission_trigger' has a wrong offset!");

// Function BP_SecurityArea.BP_SecurityArea_C.BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_7_OnDetectorDetectedPlayer__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_SecurityArea_C_BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_7_OnDetectorDetectedPlayer__DelegateSignature final
{
public:
	class AActor*                                 Detector;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Player;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SecurityArea_C_BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_7_OnDetectorDetectedPlayer__DelegateSignature) == 0x000008, "Wrong alignment on BP_SecurityArea_C_BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_7_OnDetectorDetectedPlayer__DelegateSignature");
static_assert(sizeof(BP_SecurityArea_C_BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_7_OnDetectorDetectedPlayer__DelegateSignature) == 0x000010, "Wrong size on BP_SecurityArea_C_BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_7_OnDetectorDetectedPlayer__DelegateSignature");
static_assert(offsetof(BP_SecurityArea_C_BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_7_OnDetectorDetectedPlayer__DelegateSignature, Detector) == 0x000000, "Member 'BP_SecurityArea_C_BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_7_OnDetectorDetectedPlayer__DelegateSignature::Detector' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_7_OnDetectorDetectedPlayer__DelegateSignature, Player) == 0x000008, "Member 'BP_SecurityArea_C_BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_7_OnDetectorDetectedPlayer__DelegateSignature::Player' has a wrong offset!");

// Function BP_SecurityArea.BP_SecurityArea_C.BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_6_OnNPCSensedPlayer__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_SecurityArea_C_BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_6_OnNPCSensedPlayer__DelegateSignature final
{
public:
	class ACACharacter_NPC*                       Npc_0;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Player;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SecurityArea_C_BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_6_OnNPCSensedPlayer__DelegateSignature) == 0x000008, "Wrong alignment on BP_SecurityArea_C_BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_6_OnNPCSensedPlayer__DelegateSignature");
static_assert(sizeof(BP_SecurityArea_C_BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_6_OnNPCSensedPlayer__DelegateSignature) == 0x000010, "Wrong size on BP_SecurityArea_C_BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_6_OnNPCSensedPlayer__DelegateSignature");
static_assert(offsetof(BP_SecurityArea_C_BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_6_OnNPCSensedPlayer__DelegateSignature, Npc_0) == 0x000000, "Member 'BP_SecurityArea_C_BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_6_OnNPCSensedPlayer__DelegateSignature::Npc_0' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_6_OnNPCSensedPlayer__DelegateSignature, Player) == 0x000008, "Member 'BP_SecurityArea_C_BndEvt__BP_SecurityArea_m_ship_ai_mission_manager_K2Node_ComponentBoundEvent_6_OnNPCSensedPlayer__DelegateSignature::Player' has a wrong offset!");

// Function BP_SecurityArea.BP_SecurityArea_C.BndEvt__m_ability_system_component_K2Node_ComponentBoundEvent_5_OnTrackedTagChange__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_SecurityArea_C_BndEvt__m_ability_system_component_K2Node_ComponentBoundEvent_5_OnTrackedTagChange__DelegateSignature final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SecurityArea_C_BndEvt__m_ability_system_component_K2Node_ComponentBoundEvent_5_OnTrackedTagChange__DelegateSignature) == 0x000004, "Wrong alignment on BP_SecurityArea_C_BndEvt__m_ability_system_component_K2Node_ComponentBoundEvent_5_OnTrackedTagChange__DelegateSignature");
static_assert(sizeof(BP_SecurityArea_C_BndEvt__m_ability_system_component_K2Node_ComponentBoundEvent_5_OnTrackedTagChange__DelegateSignature) == 0x000010, "Wrong size on BP_SecurityArea_C_BndEvt__m_ability_system_component_K2Node_ComponentBoundEvent_5_OnTrackedTagChange__DelegateSignature");
static_assert(offsetof(BP_SecurityArea_C_BndEvt__m_ability_system_component_K2Node_ComponentBoundEvent_5_OnTrackedTagChange__DelegateSignature, Tag) == 0x000000, "Member 'BP_SecurityArea_C_BndEvt__m_ability_system_component_K2Node_ComponentBoundEvent_5_OnTrackedTagChange__DelegateSignature::Tag' has a wrong offset!");
static_assert(offsetof(BP_SecurityArea_C_BndEvt__m_ability_system_component_K2Node_ComponentBoundEvent_5_OnTrackedTagChange__DelegateSignature, Count) == 0x00000C, "Member 'BP_SecurityArea_C_BndEvt__m_ability_system_component_K2Node_ComponentBoundEvent_5_OnTrackedTagChange__DelegateSignature::Count' has a wrong offset!");

// Function BP_SecurityArea.BP_SecurityArea_C.BndEvt__BP_SecurityStateComponent_K2Node_ComponentBoundEvent_2_EventAlertTime__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_SecurityArea_C_BndEvt__BP_SecurityStateComponent_K2Node_ComponentBoundEvent_2_EventAlertTime__DelegateSignature final
{
public:
	float                                         AlertTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SecurityArea_C_BndEvt__BP_SecurityStateComponent_K2Node_ComponentBoundEvent_2_EventAlertTime__DelegateSignature) == 0x000004, "Wrong alignment on BP_SecurityArea_C_BndEvt__BP_SecurityStateComponent_K2Node_ComponentBoundEvent_2_EventAlertTime__DelegateSignature");
static_assert(sizeof(BP_SecurityArea_C_BndEvt__BP_SecurityStateComponent_K2Node_ComponentBoundEvent_2_EventAlertTime__DelegateSignature) == 0x000004, "Wrong size on BP_SecurityArea_C_BndEvt__BP_SecurityStateComponent_K2Node_ComponentBoundEvent_2_EventAlertTime__DelegateSignature");
