#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SupplyCrateBase

#include "Basic.hpp"

#include "F_SuppyCrateMaterialMap_structs.hpp"
#include "Engine_structs.hpp"
#include "CAAudio_structs.hpp"
#include "Keaton_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SupplyCrateBase.BP_SupplyCrateBase_C
// 0x00D0 (0x0568 - 0x0498)
class ABP_SupplyCrateBase_C final : public ACASupplyCrate
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0498(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCACollisionComponent*                  ResupplyCollision;                                 // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCANavModifierComponent*                CANavModifier;                                     // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        UpFoamAlignment;                                   // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        LeftFoamAlignment;                                 // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        RightFoamAlignment;                                // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DownFoamAlignment;                                 // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCAFoamAlignmentComponent*              CAFoamAlignment;                                   // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      ShotOpen_VFX;                                      // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCAAudioComponent*                      CAAudio;                                           // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCACollisionComponent*                  ObjectiveLoop_Collision;                           // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SupplyCrateStateComponent_C*        BP_SupplyCrateStateComponent;                      // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      ShipAR;                                            // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HitSpotMesh;                                       // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   LootSpot3;                                         // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   LootSpot2;                                         // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   LootSpot1;                                         // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      HyenaAR;                                           // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ACACharacter*>                   CharactersOnTopOfCrate;                            // 0x0528(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          IsBlocked;                                         // 0x0538(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_539[0x3];                                      // 0x0539(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioEventType                      AttractLoop;                                       // 0x053C(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FCAAudioPlaybackInstance               Playback_Instance;                                 // 0x0540(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FF_SuppyCrateMaterialMap>       SupplyCrateMaterialOverrides;                      // 0x0550(0x0010)(Edit, BlueprintVisible)
	bool                                          UseMaterialOverrides;                              // 0x0560(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_SupplyCrateBase(int32 EntryPoint);
	void BndEvt__BP_SupplyCrateBase_ResupplyCollision_K2Node_ComponentBoundEvent_1_SceneComponentBeginOverlapSignature__DelegateSignature(class USceneComponent* OverlappedComponent, class AActor* OtherActor, class USceneComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_SupplyCrateBase_ResupplyCollision_K2Node_ComponentBoundEvent_8_SceneComponentEndOverlapSignature__DelegateSignature(class USceneComponent* OverlappedComponent, class AActor* OtherActor, class USceneComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__BP_SupplyCrateBase_BP_SupplyCrateStateComponent_K2Node_ComponentBoundEvent_2_EventClosed__DelegateSignature();
	void BndEvt__BP_SupplyCrateBase_BP_SupplyCrateStateComponent_K2Node_ComponentBoundEvent_3_EventOpening__DelegateSignature();
	void BndEvt__BP_SupplyCrateBase_BP_SupplyCrateStateComponent_K2Node_ComponentBoundEvent_4_EventDamaged__DelegateSignature();
	void BndEvt__BP_SupplyCrateBase_BP_SupplyCrateStateComponent_K2Node_ComponentBoundEvent_5_EventClosing__DelegateSignature();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void BndEvt__BP_SupplyCrateBase_BP_SupplyCrateStateComponent_K2Node_ComponentBoundEvent_0_EventOpen__DelegateSignature();
	void OnProjectileAttached();
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void DestroyFoam();
	void CrateVFX(bool Open);
	void StopAudioPlaybackInstance();
	void Get_Material_Override_by_Tag(const struct FGameplayTag& Area_Type_Tag, class UMaterialInstance** Material_Instance);
	void SetMaterialOverride(class UMaterialInstance* Material_Instance_Override);

	bool IsOpen() const;
	bool IsClosed() const;
	ECAUI_ReticuleTargettingMode GetCurrentTargetMode(const struct FCATeamID& UserTeamID, const class UActorComponent* TargetComponent) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SupplyCrateBase_C">();
	}
	static class ABP_SupplyCrateBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SupplyCrateBase_C>();
	}
};
static_assert(alignof(ABP_SupplyCrateBase_C) == 0x000008, "Wrong alignment on ABP_SupplyCrateBase_C");
static_assert(sizeof(ABP_SupplyCrateBase_C) == 0x000568, "Wrong size on ABP_SupplyCrateBase_C");
static_assert(offsetof(ABP_SupplyCrateBase_C, UberGraphFrame) == 0x000498, "Member 'ABP_SupplyCrateBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SupplyCrateBase_C, ResupplyCollision) == 0x0004A0, "Member 'ABP_SupplyCrateBase_C::ResupplyCollision' has a wrong offset!");
static_assert(offsetof(ABP_SupplyCrateBase_C, CANavModifier) == 0x0004A8, "Member 'ABP_SupplyCrateBase_C::CANavModifier' has a wrong offset!");
static_assert(offsetof(ABP_SupplyCrateBase_C, UpFoamAlignment) == 0x0004B0, "Member 'ABP_SupplyCrateBase_C::UpFoamAlignment' has a wrong offset!");
static_assert(offsetof(ABP_SupplyCrateBase_C, LeftFoamAlignment) == 0x0004B8, "Member 'ABP_SupplyCrateBase_C::LeftFoamAlignment' has a wrong offset!");
static_assert(offsetof(ABP_SupplyCrateBase_C, RightFoamAlignment) == 0x0004C0, "Member 'ABP_SupplyCrateBase_C::RightFoamAlignment' has a wrong offset!");
static_assert(offsetof(ABP_SupplyCrateBase_C, DownFoamAlignment) == 0x0004C8, "Member 'ABP_SupplyCrateBase_C::DownFoamAlignment' has a wrong offset!");
static_assert(offsetof(ABP_SupplyCrateBase_C, CAFoamAlignment) == 0x0004D0, "Member 'ABP_SupplyCrateBase_C::CAFoamAlignment' has a wrong offset!");
static_assert(offsetof(ABP_SupplyCrateBase_C, ShotOpen_VFX) == 0x0004D8, "Member 'ABP_SupplyCrateBase_C::ShotOpen_VFX' has a wrong offset!");
static_assert(offsetof(ABP_SupplyCrateBase_C, CAAudio) == 0x0004E0, "Member 'ABP_SupplyCrateBase_C::CAAudio' has a wrong offset!");
static_assert(offsetof(ABP_SupplyCrateBase_C, ObjectiveLoop_Collision) == 0x0004E8, "Member 'ABP_SupplyCrateBase_C::ObjectiveLoop_Collision' has a wrong offset!");
static_assert(offsetof(ABP_SupplyCrateBase_C, BP_SupplyCrateStateComponent) == 0x0004F0, "Member 'ABP_SupplyCrateBase_C::BP_SupplyCrateStateComponent' has a wrong offset!");
static_assert(offsetof(ABP_SupplyCrateBase_C, ShipAR) == 0x0004F8, "Member 'ABP_SupplyCrateBase_C::ShipAR' has a wrong offset!");
static_assert(offsetof(ABP_SupplyCrateBase_C, HitSpotMesh) == 0x000500, "Member 'ABP_SupplyCrateBase_C::HitSpotMesh' has a wrong offset!");
static_assert(offsetof(ABP_SupplyCrateBase_C, LootSpot3) == 0x000508, "Member 'ABP_SupplyCrateBase_C::LootSpot3' has a wrong offset!");
static_assert(offsetof(ABP_SupplyCrateBase_C, LootSpot2) == 0x000510, "Member 'ABP_SupplyCrateBase_C::LootSpot2' has a wrong offset!");
static_assert(offsetof(ABP_SupplyCrateBase_C, LootSpot1) == 0x000518, "Member 'ABP_SupplyCrateBase_C::LootSpot1' has a wrong offset!");
static_assert(offsetof(ABP_SupplyCrateBase_C, HyenaAR) == 0x000520, "Member 'ABP_SupplyCrateBase_C::HyenaAR' has a wrong offset!");
static_assert(offsetof(ABP_SupplyCrateBase_C, CharactersOnTopOfCrate) == 0x000528, "Member 'ABP_SupplyCrateBase_C::CharactersOnTopOfCrate' has a wrong offset!");
static_assert(offsetof(ABP_SupplyCrateBase_C, IsBlocked) == 0x000538, "Member 'ABP_SupplyCrateBase_C::IsBlocked' has a wrong offset!");
static_assert(offsetof(ABP_SupplyCrateBase_C, AttractLoop) == 0x00053C, "Member 'ABP_SupplyCrateBase_C::AttractLoop' has a wrong offset!");
static_assert(offsetof(ABP_SupplyCrateBase_C, Playback_Instance) == 0x000540, "Member 'ABP_SupplyCrateBase_C::Playback_Instance' has a wrong offset!");
static_assert(offsetof(ABP_SupplyCrateBase_C, SupplyCrateMaterialOverrides) == 0x000550, "Member 'ABP_SupplyCrateBase_C::SupplyCrateMaterialOverrides' has a wrong offset!");
static_assert(offsetof(ABP_SupplyCrateBase_C, UseMaterialOverrides) == 0x000560, "Member 'ABP_SupplyCrateBase_C::UseMaterialOverrides' has a wrong offset!");

}

