#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpinningSonic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SpinningSonic.BP_SpinningSonic_C
// 0x0020 (0x0278 - 0x0258)
class ABP_SpinningSonic_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartZpos;                                         // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    LevelSequence;                                     // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_BP_SpinningSonic(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SpinningSonic_C">();
	}
	static class ABP_SpinningSonic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SpinningSonic_C>();
	}
};
static_assert(alignof(ABP_SpinningSonic_C) == 0x000008, "Wrong alignment on ABP_SpinningSonic_C");
static_assert(sizeof(ABP_SpinningSonic_C) == 0x000278, "Wrong size on ABP_SpinningSonic_C");
static_assert(offsetof(ABP_SpinningSonic_C, UberGraphFrame) == 0x000258, "Member 'ABP_SpinningSonic_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SpinningSonic_C, DefaultSceneRoot) == 0x000260, "Member 'ABP_SpinningSonic_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_SpinningSonic_C, Time) == 0x000268, "Member 'ABP_SpinningSonic_C::Time' has a wrong offset!");
static_assert(offsetof(ABP_SpinningSonic_C, StartZpos) == 0x00026C, "Member 'ABP_SpinningSonic_C::StartZpos' has a wrong offset!");
static_assert(offsetof(ABP_SpinningSonic_C, LevelSequence) == 0x000270, "Member 'ABP_SpinningSonic_C::LevelSequence' has a wrong offset!");

}

