#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SocialPartyScreen

#include "Basic.hpp"

#include "Keaton_structs.hpp"


namespace SDK::Params
{

// Function BP_SocialPartyScreen.BP_SocialPartyScreen_C.ExecuteUbergraph_BP_SocialPartyScreen
// 0x01D0 (0x01D0 - 0x0000)
struct BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentContext_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAPartyMemberUIData                   K2Node_CustomEvent_member_data;                    // 0x0030(0x0068)()
	TArray<struct FCAPartyMemberUIData>           K2Node_CustomEvent_members_data;                   // 0x0098(0x0010)(ConstParm, ReferenceParm)
	struct FCAPartyMemberUIData                   CallFunc_Array_Get_Item;                           // 0x00A8(0x0068)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PartyPlayerCard_C*                  CallFunc_Array_Get_Item_1;                         // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_PartyPlayerCard_C*                  CallFunc_Array_Get_Item_2;                         // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PartyPlayerCard_C*                  K2Node_CustomEvent_Card;                           // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_PartyPlayerCard_C*                  CallFunc_Array_Get_Item_3;                         // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15E[0x2];                                      // 0x015E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PartyPlayerCard_C*                  CallFunc_Array_Get_Item_4;                         // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_176[0x2];                                      // 0x0176(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBP_PartyPlayerCard_C* Card)> K2Node_CreateDelegate_OutputDelegate;              // 0x017C(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_PartyPlayerCard_C*                  CallFunc_Array_Get_Item_5;                         // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A6[0x2];                                      // 0x01A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UBP_PartyPlayerCard_C* Card)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x01A8(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_PartyPlayerCard_C*>          K2Node_MakeArray_Array;                            // 0x01C0(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen) == 0x000008, "Wrong alignment on BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen");
static_assert(sizeof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen) == 0x0001D0, "Wrong size on BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, EntryPoint) == 0x000000, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_IsCurrentContext_ReturnValue) == 0x000004, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_IsCurrentContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, Temp_int_Array_Index_Variable_2) == 0x00001C, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, Temp_int_Loop_Counter_Variable_2) == 0x000024, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_Add_IntInt_ReturnValue_2) == 0x000028, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, Temp_int_Array_Index_Variable_3) == 0x00002C, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, K2Node_CustomEvent_member_data) == 0x000030, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::K2Node_CustomEvent_member_data' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, K2Node_CustomEvent_members_data) == 0x000098, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::K2Node_CustomEvent_members_data' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_Array_Length_ReturnValue) == 0x000110, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_Less_IntInt_ReturnValue) == 0x000114, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, Temp_int_Loop_Counter_Variable_3) == 0x000118, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_Add_IntInt_ReturnValue_3) == 0x00011C, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000120, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_Array_Get_Item_1) == 0x000128, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, Temp_int_Array_Index_Variable_4) == 0x000130, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_Add_IntInt_ReturnValue_4) == 0x000134, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_Array_Get_Item_2) == 0x000138, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_Array_Length_ReturnValue_1) == 0x000140, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_Less_IntInt_ReturnValue_1) == 0x000144, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, K2Node_CustomEvent_Card) == 0x000148, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::K2Node_CustomEvent_Card' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_Array_Get_Item_3) == 0x000150, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_Array_Length_ReturnValue_2) == 0x000158, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_IsValid_ReturnValue) == 0x00015C, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00015D, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, Temp_int_Variable) == 0x000160, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_Array_Get_Item_4) == 0x000168, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_Array_Length_ReturnValue_3) == 0x000170, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_IsValid_ReturnValue_1) == 0x000174, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_Less_IntInt_ReturnValue_2) == 0x000175, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, Temp_int_Loop_Counter_Variable_4) == 0x000178, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, K2Node_CreateDelegate_OutputDelegate) == 0x00017C, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_Less_IntInt_ReturnValue_3) == 0x000190, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_Add_IntInt_ReturnValue_5) == 0x000194, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_Array_Get_Item_5) == 0x000198, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_Array_Length_ReturnValue_4) == 0x0001A0, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_IsValid_ReturnValue_2) == 0x0001A4, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, CallFunc_Less_IntInt_ReturnValue_4) == 0x0001A5, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001A8, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, K2Node_Event_IsDesignTime) == 0x0001BC, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen, K2Node_MakeArray_Array) == 0x0001C0, "Member 'BP_SocialPartyScreen_C_ExecuteUbergraph_BP_SocialPartyScreen::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_SocialPartyScreen.BP_SocialPartyScreen_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_SocialPartyScreen_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SocialPartyScreen_C_PreConstruct) == 0x000001, "Wrong alignment on BP_SocialPartyScreen_C_PreConstruct");
static_assert(sizeof(BP_SocialPartyScreen_C_PreConstruct) == 0x000001, "Wrong size on BP_SocialPartyScreen_C_PreConstruct");
static_assert(offsetof(BP_SocialPartyScreen_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_SocialPartyScreen_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_SocialPartyScreen.BP_SocialPartyScreen_C.OnCardActivated
// 0x0008 (0x0008 - 0x0000)
struct BP_SocialPartyScreen_C_OnCardActivated final
{
public:
	class UBP_PartyPlayerCard_C*                  Card;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SocialPartyScreen_C_OnCardActivated) == 0x000008, "Wrong alignment on BP_SocialPartyScreen_C_OnCardActivated");
static_assert(sizeof(BP_SocialPartyScreen_C_OnCardActivated) == 0x000008, "Wrong size on BP_SocialPartyScreen_C_OnCardActivated");
static_assert(offsetof(BP_SocialPartyScreen_C_OnCardActivated, Card) == 0x000000, "Member 'BP_SocialPartyScreen_C_OnCardActivated::Card' has a wrong offset!");

// Function BP_SocialPartyScreen.BP_SocialPartyScreen_C.SetDataForParty
// 0x0010 (0x0010 - 0x0000)
struct BP_SocialPartyScreen_C_SetDataForParty final
{
public:
	TArray<struct FCAPartyMemberUIData>           Members_data;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_SocialPartyScreen_C_SetDataForParty) == 0x000008, "Wrong alignment on BP_SocialPartyScreen_C_SetDataForParty");
static_assert(sizeof(BP_SocialPartyScreen_C_SetDataForParty) == 0x000010, "Wrong size on BP_SocialPartyScreen_C_SetDataForParty");
static_assert(offsetof(BP_SocialPartyScreen_C_SetDataForParty, Members_data) == 0x000000, "Member 'BP_SocialPartyScreen_C_SetDataForParty::Members_data' has a wrong offset!");

// Function BP_SocialPartyScreen.BP_SocialPartyScreen_C.SetDataForLocalPlayer
// 0x0068 (0x0068 - 0x0000)
struct BP_SocialPartyScreen_C_SetDataForLocalPlayer final
{
public:
	struct FCAPartyMemberUIData                   Member_data;                                       // 0x0000(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_SocialPartyScreen_C_SetDataForLocalPlayer) == 0x000008, "Wrong alignment on BP_SocialPartyScreen_C_SetDataForLocalPlayer");
static_assert(sizeof(BP_SocialPartyScreen_C_SetDataForLocalPlayer) == 0x000068, "Wrong size on BP_SocialPartyScreen_C_SetDataForLocalPlayer");
static_assert(offsetof(BP_SocialPartyScreen_C_SetDataForLocalPlayer, Member_data) == 0x000000, "Member 'BP_SocialPartyScreen_C_SetDataForLocalPlayer::Member_data' has a wrong offset!");

// Function BP_SocialPartyScreen.BP_SocialPartyScreen_C.DeactivateCards
// 0x0028 (0x0028 - 0x0000)
struct BP_SocialPartyScreen_C_DeactivateCards final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PartyPlayerCard_C*                  CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SocialPartyScreen_C_DeactivateCards) == 0x000008, "Wrong alignment on BP_SocialPartyScreen_C_DeactivateCards");
static_assert(sizeof(BP_SocialPartyScreen_C_DeactivateCards) == 0x000028, "Wrong size on BP_SocialPartyScreen_C_DeactivateCards");
static_assert(offsetof(BP_SocialPartyScreen_C_DeactivateCards, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_SocialPartyScreen_C_DeactivateCards::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_DeactivateCards, CallFunc_Array_Get_Item) == 0x000008, "Member 'BP_SocialPartyScreen_C_DeactivateCards::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_DeactivateCards, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_SocialPartyScreen_C_DeactivateCards::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_DeactivateCards, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'BP_SocialPartyScreen_C_DeactivateCards::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_DeactivateCards, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_SocialPartyScreen_C_DeactivateCards::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_DeactivateCards, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_SocialPartyScreen_C_DeactivateCards::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SocialPartyScreen_C_DeactivateCards, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_SocialPartyScreen_C_DeactivateCards::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

