#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ThresholdPlayerManagerData_BaseTemplate

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ThresholdPlayerManagerData_BaseTemplate.BP_ThresholdPlayerManagerData_BaseTemplate_C
// 0x0008 (0x0040 - 0x0038)
class UBP_ThresholdPlayerManagerData_BaseTemplate_C : public UPrimaryDataAsset
{
public:
	bool                                          CanPlayerLoseThresholdCondition;                   // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsWorldPlayerRevealEnabled;                        // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsVisualGameplayEffectEnabled;                     // 0x003A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ThresholdPlayerManagerData_BaseTemplate_C">();
	}
	static class UBP_ThresholdPlayerManagerData_BaseTemplate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ThresholdPlayerManagerData_BaseTemplate_C>();
	}
};
static_assert(alignof(UBP_ThresholdPlayerManagerData_BaseTemplate_C) == 0x000008, "Wrong alignment on UBP_ThresholdPlayerManagerData_BaseTemplate_C");
static_assert(sizeof(UBP_ThresholdPlayerManagerData_BaseTemplate_C) == 0x000040, "Wrong size on UBP_ThresholdPlayerManagerData_BaseTemplate_C");
static_assert(offsetof(UBP_ThresholdPlayerManagerData_BaseTemplate_C, CanPlayerLoseThresholdCondition) == 0x000038, "Member 'UBP_ThresholdPlayerManagerData_BaseTemplate_C::CanPlayerLoseThresholdCondition' has a wrong offset!");
static_assert(offsetof(UBP_ThresholdPlayerManagerData_BaseTemplate_C, IsWorldPlayerRevealEnabled) == 0x000039, "Member 'UBP_ThresholdPlayerManagerData_BaseTemplate_C::IsWorldPlayerRevealEnabled' has a wrong offset!");
static_assert(offsetof(UBP_ThresholdPlayerManagerData_BaseTemplate_C, IsVisualGameplayEffectEnabled) == 0x00003A, "Member 'UBP_ThresholdPlayerManagerData_BaseTemplate_C::IsVisualGameplayEffectEnabled' has a wrong offset!");

}

