#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ThresholdPlayerManagerComponent

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ThresholdPlayerManagerComponent.BP_ThresholdPlayerManagerComponent_C
// 0x0128 (0x0218 - 0x00F0)
class UBP_ThresholdPlayerManagerComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class ACACharacter*>                   PlayersWithThresholdArray;                         // 0x00F8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TSubclassOf<class UGameplayAbility>           HighlightAbility;                                  // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TMap<class APawn*, struct FGameplayAbilitySpecHandle> PawnWorldRevealAbilitySpecMap;                     // 0x0110(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<class APawn*, struct FActiveGameplayEffectHandle> PawnVisualGameplayEffectSpecMap;                   // 0x0160(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TSubclassOf<class UGameplayEffect>            VisualGameplayEffectClass;                         // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 ThresholdPlayerDataClass;                          // 0x01B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         VIPNiagaraEffectToSpawn;                           // 0x01C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class APawn*, class UNiagaraComponent*>  PlayerNiagaraVFXMap;                               // 0x01C8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_BP_ThresholdPlayerManagerComponent(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void Tick();
	void OnPlayerReachesThreshold(class APawn* Pawn);
	void OnPlayerLosesThreshold(class APawn* Pawn);
	void UpdatePlayerPerks(class ACACharacter* PlayerCharacter, bool IsPlayerTeamAboveThreshold);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ThresholdPlayerManagerComponent_C">();
	}
	static class UBP_ThresholdPlayerManagerComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ThresholdPlayerManagerComponent_C>();
	}
};
static_assert(alignof(UBP_ThresholdPlayerManagerComponent_C) == 0x000008, "Wrong alignment on UBP_ThresholdPlayerManagerComponent_C");
static_assert(sizeof(UBP_ThresholdPlayerManagerComponent_C) == 0x000218, "Wrong size on UBP_ThresholdPlayerManagerComponent_C");
static_assert(offsetof(UBP_ThresholdPlayerManagerComponent_C, UberGraphFrame) == 0x0000F0, "Member 'UBP_ThresholdPlayerManagerComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ThresholdPlayerManagerComponent_C, PlayersWithThresholdArray) == 0x0000F8, "Member 'UBP_ThresholdPlayerManagerComponent_C::PlayersWithThresholdArray' has a wrong offset!");
static_assert(offsetof(UBP_ThresholdPlayerManagerComponent_C, HighlightAbility) == 0x000108, "Member 'UBP_ThresholdPlayerManagerComponent_C::HighlightAbility' has a wrong offset!");
static_assert(offsetof(UBP_ThresholdPlayerManagerComponent_C, PawnWorldRevealAbilitySpecMap) == 0x000110, "Member 'UBP_ThresholdPlayerManagerComponent_C::PawnWorldRevealAbilitySpecMap' has a wrong offset!");
static_assert(offsetof(UBP_ThresholdPlayerManagerComponent_C, PawnVisualGameplayEffectSpecMap) == 0x000160, "Member 'UBP_ThresholdPlayerManagerComponent_C::PawnVisualGameplayEffectSpecMap' has a wrong offset!");
static_assert(offsetof(UBP_ThresholdPlayerManagerComponent_C, VisualGameplayEffectClass) == 0x0001B0, "Member 'UBP_ThresholdPlayerManagerComponent_C::VisualGameplayEffectClass' has a wrong offset!");
static_assert(offsetof(UBP_ThresholdPlayerManagerComponent_C, ThresholdPlayerDataClass) == 0x0001B8, "Member 'UBP_ThresholdPlayerManagerComponent_C::ThresholdPlayerDataClass' has a wrong offset!");
static_assert(offsetof(UBP_ThresholdPlayerManagerComponent_C, VIPNiagaraEffectToSpawn) == 0x0001C0, "Member 'UBP_ThresholdPlayerManagerComponent_C::VIPNiagaraEffectToSpawn' has a wrong offset!");
static_assert(offsetof(UBP_ThresholdPlayerManagerComponent_C, PlayerNiagaraVFXMap) == 0x0001C8, "Member 'UBP_ThresholdPlayerManagerComponent_C::PlayerNiagaraVFXMap' has a wrong offset!");

}

