#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weapon_Robot_SH

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Weapon_Robot_SH.BP_Weapon_Robot_SH_C.ExecuteUbergraph_BP_Weapon_Robot_SH
// 0x0058 (0x0058 - 0x0000)
struct BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetChargeProportion_ReturnValue;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetChargeProportion_ReturnValue_1;        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH) == 0x000008, "Wrong alignment on BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH");
static_assert(sizeof(BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH) == 0x000058, "Wrong size on BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH");
static_assert(offsetof(BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH, EntryPoint) == 0x000000, "Member 'BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH, CallFunc_IsDedicatedServer_ReturnValue) == 0x00003C, "Member 'BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH, CallFunc_GetChargeProportion_ReturnValue) == 0x000040, "Member 'BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH::CallFunc_GetChargeProportion_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000044, "Member 'BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH, CallFunc_IsValid_ReturnValue_1) == 0x000045, "Member 'BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue) == 0x000048, "Member 'BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH, CallFunc_GetChargeProportion_ReturnValue_1) == 0x000050, "Member 'BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH::CallFunc_GetChargeProportion_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH, CallFunc_IsValid_ReturnValue_2) == 0x000054, "Member 'BP_Weapon_Robot_SH_C_ExecuteUbergraph_BP_Weapon_Robot_SH::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

}

