#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weapon_TurretSemiAuto

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CAAudio_structs.hpp"
#include "BP_Weapon_Instant_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Weapon_TurretSemiAuto.BP_Weapon_TurretSemiAuto_C
// 0x0028 (0x1228 - 0x1200)
class ABP_Weapon_TurretSemiAuto_C final : public ABP_Weapon_Instant_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Weapon_TurretSemiAuto_C;         // 0x1200(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USniperTurretLaserSightComponent_C*     SniperTurretLaserSightComponent1;                  // 0x1208(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          WasFiring;                                         // 0x1210(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1211[0x7];                                     // 0x1211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               Playback_Instance;                                 // 0x1218(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_Weapon_TurretSemiAuto(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void GetLaserSightComponent(class USniperTurretLaserSightComponent_C** LaserSightComoponent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Weapon_TurretSemiAuto_C">();
	}
	static class ABP_Weapon_TurretSemiAuto_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Weapon_TurretSemiAuto_C>();
	}
};
static_assert(alignof(ABP_Weapon_TurretSemiAuto_C) == 0x000008, "Wrong alignment on ABP_Weapon_TurretSemiAuto_C");
static_assert(sizeof(ABP_Weapon_TurretSemiAuto_C) == 0x001228, "Wrong size on ABP_Weapon_TurretSemiAuto_C");
static_assert(offsetof(ABP_Weapon_TurretSemiAuto_C, UberGraphFrame_BP_Weapon_TurretSemiAuto_C) == 0x001200, "Member 'ABP_Weapon_TurretSemiAuto_C::UberGraphFrame_BP_Weapon_TurretSemiAuto_C' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_TurretSemiAuto_C, SniperTurretLaserSightComponent1) == 0x001208, "Member 'ABP_Weapon_TurretSemiAuto_C::SniperTurretLaserSightComponent1' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_TurretSemiAuto_C, WasFiring) == 0x001210, "Member 'ABP_Weapon_TurretSemiAuto_C::WasFiring' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_TurretSemiAuto_C, Playback_Instance) == 0x001218, "Member 'ABP_Weapon_TurretSemiAuto_C::Playback_Instance' has a wrong offset!");

}

