#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weapon_Laser

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Weapon_Laser.BP_Weapon_Laser_C.GetLaserBeam
// 0x0008 (0x0008 - 0x0000)
struct BP_Weapon_Laser_C_GetLaserBeam final
{
public:
	class UNiagaraComponent*                      LaserBeam;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_Laser_C_GetLaserBeam) == 0x000008, "Wrong alignment on BP_Weapon_Laser_C_GetLaserBeam");
static_assert(sizeof(BP_Weapon_Laser_C_GetLaserBeam) == 0x000008, "Wrong size on BP_Weapon_Laser_C_GetLaserBeam");
static_assert(offsetof(BP_Weapon_Laser_C_GetLaserBeam, LaserBeam) == 0x000000, "Member 'BP_Weapon_Laser_C_GetLaserBeam::LaserBeam' has a wrong offset!");

// Function BP_Weapon_Laser.BP_Weapon_Laser_C.GetBallBeam
// 0x0008 (0x0008 - 0x0000)
struct BP_Weapon_Laser_C_GetBallBeam final
{
public:
	class UNiagaraComponent*                      Beam;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_Laser_C_GetBallBeam) == 0x000008, "Wrong alignment on BP_Weapon_Laser_C_GetBallBeam");
static_assert(sizeof(BP_Weapon_Laser_C_GetBallBeam) == 0x000008, "Wrong size on BP_Weapon_Laser_C_GetBallBeam");
static_assert(offsetof(BP_Weapon_Laser_C_GetBallBeam, Beam) == 0x000000, "Member 'BP_Weapon_Laser_C_GetBallBeam::Beam' has a wrong offset!");

// Function BP_Weapon_Laser.BP_Weapon_Laser_C.GetChargeVFX
// 0x0008 (0x0008 - 0x0000)
struct BP_Weapon_Laser_C_GetChargeVFX final
{
public:
	class UNiagaraComponent*                      ChargeVFX;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_Laser_C_GetChargeVFX) == 0x000008, "Wrong alignment on BP_Weapon_Laser_C_GetChargeVFX");
static_assert(sizeof(BP_Weapon_Laser_C_GetChargeVFX) == 0x000008, "Wrong size on BP_Weapon_Laser_C_GetChargeVFX");
static_assert(offsetof(BP_Weapon_Laser_C_GetChargeVFX, ChargeVFX) == 0x000000, "Member 'BP_Weapon_Laser_C_GetChargeVFX::ChargeVFX' has a wrong offset!");

}

