#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weapon_Laser

#include "Basic.hpp"

#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Weapon_Laser.BP_Weapon_Laser_C
// 0x0018 (0x08D8 - 0x08C0)
class ABP_Weapon_Laser_C final : public ACAExoticWeapon_Laser
{
public:
	class UNiagaraComponent*                      ChargeUpVFX;                                       // 0x08C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      MuzzleVFX;                                         // 0x08C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      M_beam;                                            // 0x08D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void GetLaserBeam(class UNiagaraComponent** LaserBeam);
	void GetBallBeam(class UNiagaraComponent** Beam);
	void GetChargeVFX(class UNiagaraComponent** ChargeVFX);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Weapon_Laser_C">();
	}
	static class ABP_Weapon_Laser_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Weapon_Laser_C>();
	}
};
static_assert(alignof(ABP_Weapon_Laser_C) == 0x000008, "Wrong alignment on ABP_Weapon_Laser_C");
static_assert(sizeof(ABP_Weapon_Laser_C) == 0x0008D8, "Wrong size on ABP_Weapon_Laser_C");
static_assert(offsetof(ABP_Weapon_Laser_C, ChargeUpVFX) == 0x0008C0, "Member 'ABP_Weapon_Laser_C::ChargeUpVFX' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_Laser_C, MuzzleVFX) == 0x0008C8, "Member 'ABP_Weapon_Laser_C::MuzzleVFX' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_Laser_C, M_beam) == 0x0008D0, "Member 'ABP_Weapon_Laser_C::M_beam' has a wrong offset!");

}

