#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weapon_BankRobber_TurretGun

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Weapon_BankRobber_TurretGun.BP_Weapon_BankRobber_TurretGun_C.ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun
// 0x0178 (0x0178 - 0x0000)
struct BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0050(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0070(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0090(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x00B0(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00DC(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00FC(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x011C(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x013C(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable_1;                              // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun) == 0x000008, "Wrong alignment on BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun");
static_assert(sizeof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun) == 0x000178, "Wrong size on BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, EntryPoint) == 0x000000, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, K2Node_CustomEvent_NotifyName_9) == 0x000004, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, K2Node_CustomEvent_NotifyName_8) == 0x000024, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, K2Node_CustomEvent_NotifyName_7) == 0x000044, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, K2Node_CreateDelegate_OutputDelegate_2) == 0x000050, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, K2Node_CustomEvent_NotifyName_6) == 0x000064, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, K2Node_CreateDelegate_OutputDelegate_3) == 0x000070, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, K2Node_CustomEvent_NotifyName_5) == 0x000084, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, K2Node_CreateDelegate_OutputDelegate_4) == 0x000090, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, Temp_name_Variable) == 0x0000A4, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000B0, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, K2Node_CustomEvent_NotifyName_4) == 0x0000C4, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, K2Node_CustomEvent_NotifyName_3) == 0x0000D0, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000DC, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, K2Node_CustomEvent_NotifyName_2) == 0x0000F0, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000FC, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, K2Node_CustomEvent_NotifyName_1) == 0x000110, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, K2Node_CreateDelegate_OutputDelegate_8) == 0x00011C, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, K2Node_CustomEvent_NotifyName) == 0x000130, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, K2Node_CreateDelegate_OutputDelegate_9) == 0x00013C, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, Temp_name_Variable_1) == 0x000150, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000160, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1) == 0x000168, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, CallFunc_IsValid_ReturnValue) == 0x000170, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun, CallFunc_IsValid_ReturnValue_1) == 0x000171, "Member 'BP_Weapon_BankRobber_TurretGun_C_ExecuteUbergraph_BP_Weapon_BankRobber_TurretGun::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_Weapon_BankRobber_TurretGun.BP_Weapon_BankRobber_TurretGun_C.OnCompleted_424CCC3345C7FF2E8B5AA8A676EF0B09
// 0x000C (0x000C - 0x0000)
struct BP_Weapon_BankRobber_TurretGun_C_OnCompleted_424CCC3345C7FF2E8B5AA8A676EF0B09 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_BankRobber_TurretGun_C_OnCompleted_424CCC3345C7FF2E8B5AA8A676EF0B09) == 0x000004, "Wrong alignment on BP_Weapon_BankRobber_TurretGun_C_OnCompleted_424CCC3345C7FF2E8B5AA8A676EF0B09");
static_assert(sizeof(BP_Weapon_BankRobber_TurretGun_C_OnCompleted_424CCC3345C7FF2E8B5AA8A676EF0B09) == 0x00000C, "Wrong size on BP_Weapon_BankRobber_TurretGun_C_OnCompleted_424CCC3345C7FF2E8B5AA8A676EF0B09");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_OnCompleted_424CCC3345C7FF2E8B5AA8A676EF0B09, NotifyName) == 0x000000, "Member 'BP_Weapon_BankRobber_TurretGun_C_OnCompleted_424CCC3345C7FF2E8B5AA8A676EF0B09::NotifyName' has a wrong offset!");

// Function BP_Weapon_BankRobber_TurretGun.BP_Weapon_BankRobber_TurretGun_C.OnBlendOut_424CCC3345C7FF2E8B5AA8A676EF0B09
// 0x000C (0x000C - 0x0000)
struct BP_Weapon_BankRobber_TurretGun_C_OnBlendOut_424CCC3345C7FF2E8B5AA8A676EF0B09 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_BankRobber_TurretGun_C_OnBlendOut_424CCC3345C7FF2E8B5AA8A676EF0B09) == 0x000004, "Wrong alignment on BP_Weapon_BankRobber_TurretGun_C_OnBlendOut_424CCC3345C7FF2E8B5AA8A676EF0B09");
static_assert(sizeof(BP_Weapon_BankRobber_TurretGun_C_OnBlendOut_424CCC3345C7FF2E8B5AA8A676EF0B09) == 0x00000C, "Wrong size on BP_Weapon_BankRobber_TurretGun_C_OnBlendOut_424CCC3345C7FF2E8B5AA8A676EF0B09");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_OnBlendOut_424CCC3345C7FF2E8B5AA8A676EF0B09, NotifyName) == 0x000000, "Member 'BP_Weapon_BankRobber_TurretGun_C_OnBlendOut_424CCC3345C7FF2E8B5AA8A676EF0B09::NotifyName' has a wrong offset!");

// Function BP_Weapon_BankRobber_TurretGun.BP_Weapon_BankRobber_TurretGun_C.OnInterrupted_424CCC3345C7FF2E8B5AA8A676EF0B09
// 0x000C (0x000C - 0x0000)
struct BP_Weapon_BankRobber_TurretGun_C_OnInterrupted_424CCC3345C7FF2E8B5AA8A676EF0B09 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_BankRobber_TurretGun_C_OnInterrupted_424CCC3345C7FF2E8B5AA8A676EF0B09) == 0x000004, "Wrong alignment on BP_Weapon_BankRobber_TurretGun_C_OnInterrupted_424CCC3345C7FF2E8B5AA8A676EF0B09");
static_assert(sizeof(BP_Weapon_BankRobber_TurretGun_C_OnInterrupted_424CCC3345C7FF2E8B5AA8A676EF0B09) == 0x00000C, "Wrong size on BP_Weapon_BankRobber_TurretGun_C_OnInterrupted_424CCC3345C7FF2E8B5AA8A676EF0B09");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_OnInterrupted_424CCC3345C7FF2E8B5AA8A676EF0B09, NotifyName) == 0x000000, "Member 'BP_Weapon_BankRobber_TurretGun_C_OnInterrupted_424CCC3345C7FF2E8B5AA8A676EF0B09::NotifyName' has a wrong offset!");

// Function BP_Weapon_BankRobber_TurretGun.BP_Weapon_BankRobber_TurretGun_C.OnNotifyBegin_424CCC3345C7FF2E8B5AA8A676EF0B09
// 0x000C (0x000C - 0x0000)
struct BP_Weapon_BankRobber_TurretGun_C_OnNotifyBegin_424CCC3345C7FF2E8B5AA8A676EF0B09 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_BankRobber_TurretGun_C_OnNotifyBegin_424CCC3345C7FF2E8B5AA8A676EF0B09) == 0x000004, "Wrong alignment on BP_Weapon_BankRobber_TurretGun_C_OnNotifyBegin_424CCC3345C7FF2E8B5AA8A676EF0B09");
static_assert(sizeof(BP_Weapon_BankRobber_TurretGun_C_OnNotifyBegin_424CCC3345C7FF2E8B5AA8A676EF0B09) == 0x00000C, "Wrong size on BP_Weapon_BankRobber_TurretGun_C_OnNotifyBegin_424CCC3345C7FF2E8B5AA8A676EF0B09");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_OnNotifyBegin_424CCC3345C7FF2E8B5AA8A676EF0B09, NotifyName) == 0x000000, "Member 'BP_Weapon_BankRobber_TurretGun_C_OnNotifyBegin_424CCC3345C7FF2E8B5AA8A676EF0B09::NotifyName' has a wrong offset!");

// Function BP_Weapon_BankRobber_TurretGun.BP_Weapon_BankRobber_TurretGun_C.OnNotifyEnd_424CCC3345C7FF2E8B5AA8A676EF0B09
// 0x000C (0x000C - 0x0000)
struct BP_Weapon_BankRobber_TurretGun_C_OnNotifyEnd_424CCC3345C7FF2E8B5AA8A676EF0B09 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_BankRobber_TurretGun_C_OnNotifyEnd_424CCC3345C7FF2E8B5AA8A676EF0B09) == 0x000004, "Wrong alignment on BP_Weapon_BankRobber_TurretGun_C_OnNotifyEnd_424CCC3345C7FF2E8B5AA8A676EF0B09");
static_assert(sizeof(BP_Weapon_BankRobber_TurretGun_C_OnNotifyEnd_424CCC3345C7FF2E8B5AA8A676EF0B09) == 0x00000C, "Wrong size on BP_Weapon_BankRobber_TurretGun_C_OnNotifyEnd_424CCC3345C7FF2E8B5AA8A676EF0B09");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_OnNotifyEnd_424CCC3345C7FF2E8B5AA8A676EF0B09, NotifyName) == 0x000000, "Member 'BP_Weapon_BankRobber_TurretGun_C_OnNotifyEnd_424CCC3345C7FF2E8B5AA8A676EF0B09::NotifyName' has a wrong offset!");

// Function BP_Weapon_BankRobber_TurretGun.BP_Weapon_BankRobber_TurretGun_C.OnCompleted_D55A74FF4CD502059906438B64C3F4F4
// 0x000C (0x000C - 0x0000)
struct BP_Weapon_BankRobber_TurretGun_C_OnCompleted_D55A74FF4CD502059906438B64C3F4F4 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_BankRobber_TurretGun_C_OnCompleted_D55A74FF4CD502059906438B64C3F4F4) == 0x000004, "Wrong alignment on BP_Weapon_BankRobber_TurretGun_C_OnCompleted_D55A74FF4CD502059906438B64C3F4F4");
static_assert(sizeof(BP_Weapon_BankRobber_TurretGun_C_OnCompleted_D55A74FF4CD502059906438B64C3F4F4) == 0x00000C, "Wrong size on BP_Weapon_BankRobber_TurretGun_C_OnCompleted_D55A74FF4CD502059906438B64C3F4F4");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_OnCompleted_D55A74FF4CD502059906438B64C3F4F4, NotifyName) == 0x000000, "Member 'BP_Weapon_BankRobber_TurretGun_C_OnCompleted_D55A74FF4CD502059906438B64C3F4F4::NotifyName' has a wrong offset!");

// Function BP_Weapon_BankRobber_TurretGun.BP_Weapon_BankRobber_TurretGun_C.OnBlendOut_D55A74FF4CD502059906438B64C3F4F4
// 0x000C (0x000C - 0x0000)
struct BP_Weapon_BankRobber_TurretGun_C_OnBlendOut_D55A74FF4CD502059906438B64C3F4F4 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_BankRobber_TurretGun_C_OnBlendOut_D55A74FF4CD502059906438B64C3F4F4) == 0x000004, "Wrong alignment on BP_Weapon_BankRobber_TurretGun_C_OnBlendOut_D55A74FF4CD502059906438B64C3F4F4");
static_assert(sizeof(BP_Weapon_BankRobber_TurretGun_C_OnBlendOut_D55A74FF4CD502059906438B64C3F4F4) == 0x00000C, "Wrong size on BP_Weapon_BankRobber_TurretGun_C_OnBlendOut_D55A74FF4CD502059906438B64C3F4F4");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_OnBlendOut_D55A74FF4CD502059906438B64C3F4F4, NotifyName) == 0x000000, "Member 'BP_Weapon_BankRobber_TurretGun_C_OnBlendOut_D55A74FF4CD502059906438B64C3F4F4::NotifyName' has a wrong offset!");

// Function BP_Weapon_BankRobber_TurretGun.BP_Weapon_BankRobber_TurretGun_C.OnInterrupted_D55A74FF4CD502059906438B64C3F4F4
// 0x000C (0x000C - 0x0000)
struct BP_Weapon_BankRobber_TurretGun_C_OnInterrupted_D55A74FF4CD502059906438B64C3F4F4 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_BankRobber_TurretGun_C_OnInterrupted_D55A74FF4CD502059906438B64C3F4F4) == 0x000004, "Wrong alignment on BP_Weapon_BankRobber_TurretGun_C_OnInterrupted_D55A74FF4CD502059906438B64C3F4F4");
static_assert(sizeof(BP_Weapon_BankRobber_TurretGun_C_OnInterrupted_D55A74FF4CD502059906438B64C3F4F4) == 0x00000C, "Wrong size on BP_Weapon_BankRobber_TurretGun_C_OnInterrupted_D55A74FF4CD502059906438B64C3F4F4");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_OnInterrupted_D55A74FF4CD502059906438B64C3F4F4, NotifyName) == 0x000000, "Member 'BP_Weapon_BankRobber_TurretGun_C_OnInterrupted_D55A74FF4CD502059906438B64C3F4F4::NotifyName' has a wrong offset!");

// Function BP_Weapon_BankRobber_TurretGun.BP_Weapon_BankRobber_TurretGun_C.OnNotifyBegin_D55A74FF4CD502059906438B64C3F4F4
// 0x000C (0x000C - 0x0000)
struct BP_Weapon_BankRobber_TurretGun_C_OnNotifyBegin_D55A74FF4CD502059906438B64C3F4F4 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_BankRobber_TurretGun_C_OnNotifyBegin_D55A74FF4CD502059906438B64C3F4F4) == 0x000004, "Wrong alignment on BP_Weapon_BankRobber_TurretGun_C_OnNotifyBegin_D55A74FF4CD502059906438B64C3F4F4");
static_assert(sizeof(BP_Weapon_BankRobber_TurretGun_C_OnNotifyBegin_D55A74FF4CD502059906438B64C3F4F4) == 0x00000C, "Wrong size on BP_Weapon_BankRobber_TurretGun_C_OnNotifyBegin_D55A74FF4CD502059906438B64C3F4F4");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_OnNotifyBegin_D55A74FF4CD502059906438B64C3F4F4, NotifyName) == 0x000000, "Member 'BP_Weapon_BankRobber_TurretGun_C_OnNotifyBegin_D55A74FF4CD502059906438B64C3F4F4::NotifyName' has a wrong offset!");

// Function BP_Weapon_BankRobber_TurretGun.BP_Weapon_BankRobber_TurretGun_C.OnNotifyEnd_D55A74FF4CD502059906438B64C3F4F4
// 0x000C (0x000C - 0x0000)
struct BP_Weapon_BankRobber_TurretGun_C_OnNotifyEnd_D55A74FF4CD502059906438B64C3F4F4 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_BankRobber_TurretGun_C_OnNotifyEnd_D55A74FF4CD502059906438B64C3F4F4) == 0x000004, "Wrong alignment on BP_Weapon_BankRobber_TurretGun_C_OnNotifyEnd_D55A74FF4CD502059906438B64C3F4F4");
static_assert(sizeof(BP_Weapon_BankRobber_TurretGun_C_OnNotifyEnd_D55A74FF4CD502059906438B64C3F4F4) == 0x00000C, "Wrong size on BP_Weapon_BankRobber_TurretGun_C_OnNotifyEnd_D55A74FF4CD502059906438B64C3F4F4");
static_assert(offsetof(BP_Weapon_BankRobber_TurretGun_C_OnNotifyEnd_D55A74FF4CD502059906438B64C3F4F4, NotifyName) == 0x000000, "Member 'BP_Weapon_BankRobber_TurretGun_C_OnNotifyEnd_D55A74FF4CD502059906438B64C3F4F4::NotifyName' has a wrong offset!");

}

