#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Widget_DebugUI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Keaton_structs.hpp"


namespace SDK::Params
{

// Function BP_Widget_DebugUI.BP_Widget_DebugUI_C.GetPercent_0
// 0x000C (0x000C - 0x0000)
struct BP_Widget_DebugUI_C_GetPercent_0 final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSightGaugeLevel_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Widget_DebugUI_C_GetPercent_0) == 0x000004, "Wrong alignment on BP_Widget_DebugUI_C_GetPercent_0");
static_assert(sizeof(BP_Widget_DebugUI_C_GetPercent_0) == 0x00000C, "Wrong size on BP_Widget_DebugUI_C_GetPercent_0");
static_assert(offsetof(BP_Widget_DebugUI_C_GetPercent_0, ReturnValue) == 0x000000, "Member 'BP_Widget_DebugUI_C_GetPercent_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetPercent_0, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_Widget_DebugUI_C_GetPercent_0::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetPercent_0, CallFunc_GetSightGaugeLevel_ReturnValue) == 0x000008, "Member 'BP_Widget_DebugUI_C_GetPercent_0::CallFunc_GetSightGaugeLevel_ReturnValue' has a wrong offset!");

// Function BP_Widget_DebugUI.BP_Widget_DebugUI_C.GetPercent_1
// 0x000C (0x000C - 0x0000)
struct BP_Widget_DebugUI_C_GetPercent_1 final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHearingGaugeLevel_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Widget_DebugUI_C_GetPercent_1) == 0x000004, "Wrong alignment on BP_Widget_DebugUI_C_GetPercent_1");
static_assert(sizeof(BP_Widget_DebugUI_C_GetPercent_1) == 0x00000C, "Wrong size on BP_Widget_DebugUI_C_GetPercent_1");
static_assert(offsetof(BP_Widget_DebugUI_C_GetPercent_1, ReturnValue) == 0x000000, "Member 'BP_Widget_DebugUI_C_GetPercent_1::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetPercent_1, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_Widget_DebugUI_C_GetPercent_1::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetPercent_1, CallFunc_GetHearingGaugeLevel_ReturnValue) == 0x000008, "Member 'BP_Widget_DebugUI_C_GetPercent_1::CallFunc_GetHearingGaugeLevel_ReturnValue' has a wrong offset!");

// Function BP_Widget_DebugUI.BP_Widget_DebugUI_C.GetFillColorAndOpacity_0
// 0x0014 (0x0014 - 0x0000)
struct BP_Widget_DebugUI_C_GetFillColorAndOpacity_0 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECASenseThresholds                            CallFunc_GetSightGaugeThreshold_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_0) == 0x000004, "Wrong alignment on BP_Widget_DebugUI_C_GetFillColorAndOpacity_0");
static_assert(sizeof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_0) == 0x000014, "Wrong size on BP_Widget_DebugUI_C_GetFillColorAndOpacity_0");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_0, ReturnValue) == 0x000000, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_0, CallFunc_GetSightGaugeThreshold_ReturnValue) == 0x000010, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_0::CallFunc_GetSightGaugeThreshold_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_0, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_0::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_0, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_0::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_0, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000013, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_0::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function BP_Widget_DebugUI.BP_Widget_DebugUI_C.GetFillColorAndOpacity_1
// 0x0014 (0x0014 - 0x0000)
struct BP_Widget_DebugUI_C_GetFillColorAndOpacity_1 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECASenseThresholds                            CallFunc_GetHearingGaugeThreshold_ReturnValue;     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_1) == 0x000004, "Wrong alignment on BP_Widget_DebugUI_C_GetFillColorAndOpacity_1");
static_assert(sizeof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_1) == 0x000014, "Wrong size on BP_Widget_DebugUI_C_GetFillColorAndOpacity_1");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_1, ReturnValue) == 0x000000, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_1::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_1, CallFunc_GetHearingGaugeThreshold_ReturnValue) == 0x000010, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_1::CallFunc_GetHearingGaugeThreshold_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_1, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_1::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_1, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_1::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_1, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000013, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_1::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function BP_Widget_DebugUI.BP_Widget_DebugUI_C.GetPercent_2
// 0x000C (0x000C - 0x0000)
struct BP_Widget_DebugUI_C_GetPercent_2 final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDamageGaugeLevel_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Widget_DebugUI_C_GetPercent_2) == 0x000004, "Wrong alignment on BP_Widget_DebugUI_C_GetPercent_2");
static_assert(sizeof(BP_Widget_DebugUI_C_GetPercent_2) == 0x00000C, "Wrong size on BP_Widget_DebugUI_C_GetPercent_2");
static_assert(offsetof(BP_Widget_DebugUI_C_GetPercent_2, ReturnValue) == 0x000000, "Member 'BP_Widget_DebugUI_C_GetPercent_2::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetPercent_2, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_Widget_DebugUI_C_GetPercent_2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetPercent_2, CallFunc_GetDamageGaugeLevel_ReturnValue) == 0x000008, "Member 'BP_Widget_DebugUI_C_GetPercent_2::CallFunc_GetDamageGaugeLevel_ReturnValue' has a wrong offset!");

// Function BP_Widget_DebugUI.BP_Widget_DebugUI_C.GetFillColorAndOpacity_2
// 0x0014 (0x0014 - 0x0000)
struct BP_Widget_DebugUI_C_GetFillColorAndOpacity_2 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECASenseThresholds                            CallFunc_GetDamageGaugeThreshold_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_2) == 0x000004, "Wrong alignment on BP_Widget_DebugUI_C_GetFillColorAndOpacity_2");
static_assert(sizeof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_2) == 0x000014, "Wrong size on BP_Widget_DebugUI_C_GetFillColorAndOpacity_2");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_2, ReturnValue) == 0x000000, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_2::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_2, CallFunc_GetDamageGaugeThreshold_ReturnValue) == 0x000010, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_2::CallFunc_GetDamageGaugeThreshold_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_2, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_2, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_2::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_2, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000013, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_2::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function BP_Widget_DebugUI.BP_Widget_DebugUI_C.GetPercent_3
// 0x000C (0x000C - 0x0000)
struct BP_Widget_DebugUI_C_GetPercent_3 final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAwarenessGaugeLevel_ReturnValue;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Widget_DebugUI_C_GetPercent_3) == 0x000004, "Wrong alignment on BP_Widget_DebugUI_C_GetPercent_3");
static_assert(sizeof(BP_Widget_DebugUI_C_GetPercent_3) == 0x00000C, "Wrong size on BP_Widget_DebugUI_C_GetPercent_3");
static_assert(offsetof(BP_Widget_DebugUI_C_GetPercent_3, ReturnValue) == 0x000000, "Member 'BP_Widget_DebugUI_C_GetPercent_3::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetPercent_3, CallFunc_GetAwarenessGaugeLevel_ReturnValue) == 0x000004, "Member 'BP_Widget_DebugUI_C_GetPercent_3::CallFunc_GetAwarenessGaugeLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetPercent_3, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_Widget_DebugUI_C_GetPercent_3::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Widget_DebugUI.BP_Widget_DebugUI_C.GetFillColorAndOpacity_3
// 0x0014 (0x0014 - 0x0000)
struct BP_Widget_DebugUI_C_GetFillColorAndOpacity_3 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAAwarenessState                             CallFunc_GetAwarenessGaugeState_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_3) == 0x000004, "Wrong alignment on BP_Widget_DebugUI_C_GetFillColorAndOpacity_3");
static_assert(sizeof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_3) == 0x000014, "Wrong size on BP_Widget_DebugUI_C_GetFillColorAndOpacity_3");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_3, ReturnValue) == 0x000000, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_3::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_3, CallFunc_GetAwarenessGaugeState_ReturnValue) == 0x000010, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_3::CallFunc_GetAwarenessGaugeState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_3, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_3::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_3, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_3::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_3, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000013, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_3::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function BP_Widget_DebugUI.BP_Widget_DebugUI_C.GetText_0
// 0x0020 (0x0020 - 0x0000)
struct BP_Widget_DebugUI_C_GetText_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	ECAAwarenessState                             CallFunc_GetAwarenessGaugeState_ReturnValue;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Widget_DebugUI_C_GetText_0) == 0x000008, "Wrong alignment on BP_Widget_DebugUI_C_GetText_0");
static_assert(sizeof(BP_Widget_DebugUI_C_GetText_0) == 0x000020, "Wrong size on BP_Widget_DebugUI_C_GetText_0");
static_assert(offsetof(BP_Widget_DebugUI_C_GetText_0, ReturnValue) == 0x000000, "Member 'BP_Widget_DebugUI_C_GetText_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetText_0, CallFunc_GetAwarenessGaugeState_ReturnValue) == 0x000018, "Member 'BP_Widget_DebugUI_C_GetText_0::CallFunc_GetAwarenessGaugeState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetText_0, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BP_Widget_DebugUI_C_GetText_0::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetText_0, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001A, "Member 'BP_Widget_DebugUI_C_GetText_0::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetText_0, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00001B, "Member 'BP_Widget_DebugUI_C_GetText_0::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function BP_Widget_DebugUI.BP_Widget_DebugUI_C.GetPercent_4
// 0x000C (0x000C - 0x0000)
struct BP_Widget_DebugUI_C_GetPercent_4 final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTouchGaugeLevel_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Widget_DebugUI_C_GetPercent_4) == 0x000004, "Wrong alignment on BP_Widget_DebugUI_C_GetPercent_4");
static_assert(sizeof(BP_Widget_DebugUI_C_GetPercent_4) == 0x00000C, "Wrong size on BP_Widget_DebugUI_C_GetPercent_4");
static_assert(offsetof(BP_Widget_DebugUI_C_GetPercent_4, ReturnValue) == 0x000000, "Member 'BP_Widget_DebugUI_C_GetPercent_4::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetPercent_4, CallFunc_GetTouchGaugeLevel_ReturnValue) == 0x000004, "Member 'BP_Widget_DebugUI_C_GetPercent_4::CallFunc_GetTouchGaugeLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetPercent_4, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_Widget_DebugUI_C_GetPercent_4::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Widget_DebugUI.BP_Widget_DebugUI_C.GetFillColorAndOpacity_4
// 0x0014 (0x0014 - 0x0000)
struct BP_Widget_DebugUI_C_GetFillColorAndOpacity_4 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECASenseThresholds                            CallFunc_GetTouchGaugeThreshold_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_4) == 0x000004, "Wrong alignment on BP_Widget_DebugUI_C_GetFillColorAndOpacity_4");
static_assert(sizeof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_4) == 0x000014, "Wrong size on BP_Widget_DebugUI_C_GetFillColorAndOpacity_4");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_4, ReturnValue) == 0x000000, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_4::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_4, CallFunc_GetTouchGaugeThreshold_ReturnValue) == 0x000010, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_4::CallFunc_GetTouchGaugeThreshold_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_4, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_4::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_4, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_4::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_4, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000013, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_4::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function BP_Widget_DebugUI.BP_Widget_DebugUI_C.GetPercent_5
// 0x000C (0x000C - 0x0000)
struct BP_Widget_DebugUI_C_GetPercent_5 final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWeaponSenseGaugeLevel_ReturnValue;     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Widget_DebugUI_C_GetPercent_5) == 0x000004, "Wrong alignment on BP_Widget_DebugUI_C_GetPercent_5");
static_assert(sizeof(BP_Widget_DebugUI_C_GetPercent_5) == 0x00000C, "Wrong size on BP_Widget_DebugUI_C_GetPercent_5");
static_assert(offsetof(BP_Widget_DebugUI_C_GetPercent_5, ReturnValue) == 0x000000, "Member 'BP_Widget_DebugUI_C_GetPercent_5::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetPercent_5, CallFunc_GetWeaponSenseGaugeLevel_ReturnValue) == 0x000004, "Member 'BP_Widget_DebugUI_C_GetPercent_5::CallFunc_GetWeaponSenseGaugeLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetPercent_5, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_Widget_DebugUI_C_GetPercent_5::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Widget_DebugUI.BP_Widget_DebugUI_C.GetFillColorAndOpacity_5
// 0x0014 (0x0014 - 0x0000)
struct BP_Widget_DebugUI_C_GetFillColorAndOpacity_5 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECASenseThresholds                            CallFunc_GetWeaponSenseGaugeThreshold_ReturnValue; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_5) == 0x000004, "Wrong alignment on BP_Widget_DebugUI_C_GetFillColorAndOpacity_5");
static_assert(sizeof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_5) == 0x000014, "Wrong size on BP_Widget_DebugUI_C_GetFillColorAndOpacity_5");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_5, ReturnValue) == 0x000000, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_5::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_5, CallFunc_GetWeaponSenseGaugeThreshold_ReturnValue) == 0x000010, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_5::CallFunc_GetWeaponSenseGaugeThreshold_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_5, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_5::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_5, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_5::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Widget_DebugUI_C_GetFillColorAndOpacity_5, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000013, "Member 'BP_Widget_DebugUI_C_GetFillColorAndOpacity_5::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

}

