#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ZeroGComponent

#include "Basic.hpp"

#include "CAAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Keaton_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ZeroGComponent.BP_ZeroGComponent_C.ExecuteUbergraph_BP_ZeroGComponent
// 0x03A0 (0x03A0 - 0x0000)
struct BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ACharacter* Character, ECAPlayerMovementMetaMode PrevMovementMetaMode, ECAPlayerMovementMetaMode MovementMetaMode)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_is_in_zerog;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue_1;                // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_CustomEvent_Character;                      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAPlayerMovementMode                         K2Node_CustomEvent_PrevMovementMode;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAPlayerMovementMode                         K2Node_CustomEvent_MovementMode;                   // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_CustomEvent_Character_1;                    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAPlayerMovementMetaMode                     K2Node_CustomEvent_PrevMovementMetaMode;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAPlayerMovementMetaMode                     K2Node_CustomEvent_MovementMetaMode;               // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_WeaponTimeBetweenShots;         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetZeroGDirectionalIndicatorData_scale;   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FZeroGDirectionalIndicatorData         CallFunc_GetZeroGDirectionalIndicatorData_indicator_data; // 0x0080(0x0058)(NoDestructor)
	struct FCAMovementData_ZeroG                  CallFunc_GetDataTableRowFromName_OutRow;           // 0x00D8(0x00D8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAMovementData_ZeroGTakeOff           CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x01B8(0x00A0)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25A[0x2];                                      // 0x025A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Successful, float New_speed, float Speed_delta, float Yaw_delta, float Pitch_delta, int32 boosts_remaining)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x025C(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsBeingSpectated_ReturnValue;             // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue;                 // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeingSpectated_ReturnValue_1;           // 0x0273(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0275(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0276(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_277[0x1];                                      // 0x0277(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0278(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool Is_in_zerog)>             K2Node_CreateDelegate_OutputDelegate_3;            // 0x028C(0x0014)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Successful;                     // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AA[0x2];                                      // 0x02AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_new_speed;                      // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_speed_delta;                    // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_yaw_delta;                      // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_pitch_delta;                    // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_boosts_remaining;               // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x02C0(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAMovementData_ZeroGTakeOff           CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x02D8(0x00A0)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0380(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ACharacter* Character, ECAPlayerMovementMode PrevMovementMode, ECAPlayerMovementMode MovementMode)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0388(0x0014)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent) == 0x000008, "Wrong alignment on BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent");
static_assert(sizeof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent) == 0x0003A0, "Wrong size on BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, EntryPoint) == 0x000000, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_GetVelocity_ReturnValue) == 0x000018, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000028, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue) == 0x000030, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, K2Node_Event_DeltaSeconds) == 0x00003C, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, Temp_bool_IsClosed_Variable) == 0x000040, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, K2Node_CustomEvent_is_in_zerog) == 0x000041, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::K2Node_CustomEvent_is_in_zerog' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_IsValid_ReturnValue_1) == 0x000042, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_GetVelocity_ReturnValue_1) == 0x000044, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_GetVelocity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_VSize_ReturnValue) == 0x000050, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000054, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, K2Node_CustomEvent_Character) == 0x000058, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, K2Node_CustomEvent_PrevMovementMode) == 0x000060, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::K2Node_CustomEvent_PrevMovementMode' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, K2Node_CustomEvent_MovementMode) == 0x000061, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::K2Node_CustomEvent_MovementMode' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, K2Node_CustomEvent_Character_1) == 0x000068, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::K2Node_CustomEvent_Character_1' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, K2Node_CustomEvent_PrevMovementMetaMode) == 0x000070, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::K2Node_CustomEvent_PrevMovementMetaMode' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, K2Node_CustomEvent_MovementMetaMode) == 0x000071, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::K2Node_CustomEvent_MovementMetaMode' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, Temp_bool_Has_Been_Initd_Variable) == 0x000072, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, Temp_bool_Has_Been_Initd_Variable_1) == 0x000073, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000074, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000075, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, K2Node_CustomEvent_WeaponTimeBetweenShots) == 0x000078, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::K2Node_CustomEvent_WeaponTimeBetweenShots' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_GetZeroGDirectionalIndicatorData_scale) == 0x00007C, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_GetZeroGDirectionalIndicatorData_scale' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_GetZeroGDirectionalIndicatorData_indicator_data) == 0x000080, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_GetZeroGDirectionalIndicatorData_indicator_data' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000D8, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0001B0, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0001B8, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000258, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, Temp_bool_IsClosed_Variable_1) == 0x000259, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x00025C, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_IsBeingSpectated_ReturnValue) == 0x000270, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_IsBeingSpectated_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_GetLocalRole_ReturnValue) == 0x000271, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_GetLocalRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000272, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_IsBeingSpectated_ReturnValue_1) == 0x000273, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_IsBeingSpectated_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_BooleanOR_ReturnValue) == 0x000274, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_IsLocallyControlled_ReturnValue) == 0x000275, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_BooleanOR_ReturnValue_1) == 0x000276, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000278, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, K2Node_CreateDelegate_OutputDelegate_3) == 0x00028C, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002A0, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, K2Node_Event_EndPlayReason) == 0x0002A8, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, K2Node_CustomEvent_Successful) == 0x0002A9, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::K2Node_CustomEvent_Successful' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, K2Node_CustomEvent_new_speed) == 0x0002AC, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::K2Node_CustomEvent_new_speed' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, K2Node_CustomEvent_speed_delta) == 0x0002B0, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::K2Node_CustomEvent_speed_delta' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, K2Node_CustomEvent_yaw_delta) == 0x0002B4, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::K2Node_CustomEvent_yaw_delta' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, K2Node_CustomEvent_pitch_delta) == 0x0002B8, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::K2Node_CustomEvent_pitch_delta' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, K2Node_CustomEvent_boosts_remaining) == 0x0002BC, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::K2Node_CustomEvent_boosts_remaining' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, K2Node_CreateDelegate_OutputDelegate_4) == 0x0002C0, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_GetDataTableRowFromName_OutRow_2) == 0x0002D8, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_GetDataTableRowFromName_OutRow_2' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_GetDataTableRowFromName_ReturnValue_2) == 0x000378, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_GetDataTableRowFromName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000380, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent, K2Node_CreateDelegate_OutputDelegate_5) == 0x000388, "Member 'BP_ZeroGComponent_C_ExecuteUbergraph_BP_ZeroGComponent::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");

// Function BP_ZeroGComponent.BP_ZeroGComponent_C.OnZeroGBoost
// 0x0018 (0x0018 - 0x0000)
struct BP_ZeroGComponent_C_OnZeroGBoost final
{
public:
	bool                                          Successful;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         New_speed;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed_delta;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Yaw_delta;                                         // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pitch_delta;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         boosts_remaining;                                  // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZeroGComponent_C_OnZeroGBoost) == 0x000004, "Wrong alignment on BP_ZeroGComponent_C_OnZeroGBoost");
static_assert(sizeof(BP_ZeroGComponent_C_OnZeroGBoost) == 0x000018, "Wrong size on BP_ZeroGComponent_C_OnZeroGBoost");
static_assert(offsetof(BP_ZeroGComponent_C_OnZeroGBoost, Successful) == 0x000000, "Member 'BP_ZeroGComponent_C_OnZeroGBoost::Successful' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_OnZeroGBoost, New_speed) == 0x000004, "Member 'BP_ZeroGComponent_C_OnZeroGBoost::New_speed' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_OnZeroGBoost, Speed_delta) == 0x000008, "Member 'BP_ZeroGComponent_C_OnZeroGBoost::Speed_delta' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_OnZeroGBoost, Yaw_delta) == 0x00000C, "Member 'BP_ZeroGComponent_C_OnZeroGBoost::Yaw_delta' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_OnZeroGBoost, Pitch_delta) == 0x000010, "Member 'BP_ZeroGComponent_C_OnZeroGBoost::Pitch_delta' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_OnZeroGBoost, boosts_remaining) == 0x000014, "Member 'BP_ZeroGComponent_C_OnZeroGBoost::boosts_remaining' has a wrong offset!");

// Function BP_ZeroGComponent.BP_ZeroGComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_ZeroGComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZeroGComponent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_ZeroGComponent_C_ReceiveEndPlay");
static_assert(sizeof(BP_ZeroGComponent_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_ZeroGComponent_C_ReceiveEndPlay");
static_assert(offsetof(BP_ZeroGComponent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_ZeroGComponent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_ZeroGComponent.BP_ZeroGComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ZeroGComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZeroGComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ZeroGComponent_C_ReceiveTick");
static_assert(sizeof(BP_ZeroGComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_ZeroGComponent_C_ReceiveTick");
static_assert(offsetof(BP_ZeroGComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ZeroGComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ZeroGComponent.BP_ZeroGComponent_C.ZeroGStateChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_ZeroGComponent_C_ZeroGStateChanged final
{
public:
	bool                                          Is_in_zerog;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ZeroGComponent_C_ZeroGStateChanged) == 0x000001, "Wrong alignment on BP_ZeroGComponent_C_ZeroGStateChanged");
static_assert(sizeof(BP_ZeroGComponent_C_ZeroGStateChanged) == 0x000001, "Wrong size on BP_ZeroGComponent_C_ZeroGStateChanged");
static_assert(offsetof(BP_ZeroGComponent_C_ZeroGStateChanged, Is_in_zerog) == 0x000000, "Member 'BP_ZeroGComponent_C_ZeroGStateChanged::Is_in_zerog' has a wrong offset!");

// Function BP_ZeroGComponent.BP_ZeroGComponent_C.OnMovementModeChange
// 0x0010 (0x0010 - 0x0000)
struct BP_ZeroGComponent_C_OnMovementModeChange final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAPlayerMovementMode                         PrevMovementMode;                                  // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAPlayerMovementMode                         MovementMode;                                      // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZeroGComponent_C_OnMovementModeChange) == 0x000008, "Wrong alignment on BP_ZeroGComponent_C_OnMovementModeChange");
static_assert(sizeof(BP_ZeroGComponent_C_OnMovementModeChange) == 0x000010, "Wrong size on BP_ZeroGComponent_C_OnMovementModeChange");
static_assert(offsetof(BP_ZeroGComponent_C_OnMovementModeChange, Character) == 0x000000, "Member 'BP_ZeroGComponent_C_OnMovementModeChange::Character' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_OnMovementModeChange, PrevMovementMode) == 0x000008, "Member 'BP_ZeroGComponent_C_OnMovementModeChange::PrevMovementMode' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_OnMovementModeChange, MovementMode) == 0x000009, "Member 'BP_ZeroGComponent_C_OnMovementModeChange::MovementMode' has a wrong offset!");

// Function BP_ZeroGComponent.BP_ZeroGComponent_C.OnMovementMetaModeChanged
// 0x0010 (0x0010 - 0x0000)
struct BP_ZeroGComponent_C_OnMovementMetaModeChanged final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAPlayerMovementMetaMode                     PrevMovementMetaMode;                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAPlayerMovementMetaMode                     MovementMetaMode;                                  // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZeroGComponent_C_OnMovementMetaModeChanged) == 0x000008, "Wrong alignment on BP_ZeroGComponent_C_OnMovementMetaModeChanged");
static_assert(sizeof(BP_ZeroGComponent_C_OnMovementMetaModeChanged) == 0x000010, "Wrong size on BP_ZeroGComponent_C_OnMovementMetaModeChanged");
static_assert(offsetof(BP_ZeroGComponent_C_OnMovementMetaModeChanged, Character) == 0x000000, "Member 'BP_ZeroGComponent_C_OnMovementMetaModeChanged::Character' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_OnMovementMetaModeChanged, PrevMovementMetaMode) == 0x000008, "Member 'BP_ZeroGComponent_C_OnMovementMetaModeChanged::PrevMovementMetaMode' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_OnMovementMetaModeChanged, MovementMetaMode) == 0x000009, "Member 'BP_ZeroGComponent_C_OnMovementMetaModeChanged::MovementMetaMode' has a wrong offset!");

// Function BP_ZeroGComponent.BP_ZeroGComponent_C.ProcessWeaponMovementPushback
// 0x0004 (0x0004 - 0x0000)
struct BP_ZeroGComponent_C_ProcessWeaponMovementPushback final
{
public:
	float                                         WeaponTimeBetweenShots;                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZeroGComponent_C_ProcessWeaponMovementPushback) == 0x000004, "Wrong alignment on BP_ZeroGComponent_C_ProcessWeaponMovementPushback");
static_assert(sizeof(BP_ZeroGComponent_C_ProcessWeaponMovementPushback) == 0x000004, "Wrong size on BP_ZeroGComponent_C_ProcessWeaponMovementPushback");
static_assert(offsetof(BP_ZeroGComponent_C_ProcessWeaponMovementPushback, WeaponTimeBetweenShots) == 0x000000, "Member 'BP_ZeroGComponent_C_ProcessWeaponMovementPushback::WeaponTimeBetweenShots' has a wrong offset!");

// Function BP_ZeroGComponent.BP_ZeroGComponent_C.ZeroG Activated
// 0x0010 (0x0010 - 0x0000)
struct BP_ZeroGComponent_C_ZeroG_Activated final
{
public:
	struct FCAAudioEventType                      Audio_Event;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Shake;                                             // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZeroGComponent_C_ZeroG_Activated) == 0x000008, "Wrong alignment on BP_ZeroGComponent_C_ZeroG_Activated");
static_assert(sizeof(BP_ZeroGComponent_C_ZeroG_Activated) == 0x000010, "Wrong size on BP_ZeroGComponent_C_ZeroG_Activated");
static_assert(offsetof(BP_ZeroGComponent_C_ZeroG_Activated, Audio_Event) == 0x000000, "Member 'BP_ZeroGComponent_C_ZeroG_Activated::Audio_Event' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ZeroG_Activated, Shake) == 0x000008, "Member 'BP_ZeroGComponent_C_ZeroG_Activated::Shake' has a wrong offset!");

// Function BP_ZeroGComponent.BP_ZeroGComponent_C.ZeroG Deactivated
// 0x0008 (0x0008 - 0x0000)
struct BP_ZeroGComponent_C_ZeroG_Deactivated final
{
public:
	struct FCAAudioEventType                      Audio_Event;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ZeroGComponent_C_ZeroG_Deactivated) == 0x000004, "Wrong alignment on BP_ZeroGComponent_C_ZeroG_Deactivated");
static_assert(sizeof(BP_ZeroGComponent_C_ZeroG_Deactivated) == 0x000008, "Wrong size on BP_ZeroGComponent_C_ZeroG_Deactivated");
static_assert(offsetof(BP_ZeroGComponent_C_ZeroG_Deactivated, Audio_Event) == 0x000000, "Member 'BP_ZeroGComponent_C_ZeroG_Deactivated::Audio_Event' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ZeroG_Deactivated, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_ZeroGComponent_C_ZeroG_Deactivated::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_ZeroG_Deactivated, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'BP_ZeroGComponent_C_ZeroG_Deactivated::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_ZeroGComponent.BP_ZeroGComponent_C.Initialise ZeroG Particles
// 0x01D8 (0x01D8 - 0x0000)
struct BP_ZeroGComponent_C_Initialise_ZeroG_Particles final
{
public:
	struct FCAMovementData_ZeroG                  CallFunc_GetDataTableRowFromName_OutRow;           // 0x0000(0x00D8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAMovementData_ZeroG                  CallFunc_ZeroGFlyingAbilityData_ReturnValue;       // 0x00E0(0x00D8)(ConstParm)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue_1; // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZeroGComponent_C_Initialise_ZeroG_Particles) == 0x000008, "Wrong alignment on BP_ZeroGComponent_C_Initialise_ZeroG_Particles");
static_assert(sizeof(BP_ZeroGComponent_C_Initialise_ZeroG_Particles) == 0x0001D8, "Wrong size on BP_ZeroGComponent_C_Initialise_ZeroG_Particles");
static_assert(offsetof(BP_ZeroGComponent_C_Initialise_ZeroG_Particles, CallFunc_GetDataTableRowFromName_OutRow) == 0x000000, "Member 'BP_ZeroGComponent_C_Initialise_ZeroG_Particles::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_Initialise_ZeroG_Particles, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000D8, "Member 'BP_ZeroGComponent_C_Initialise_ZeroG_Particles::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_Initialise_ZeroG_Particles, CallFunc_IsValid_ReturnValue) == 0x0000D9, "Member 'BP_ZeroGComponent_C_Initialise_ZeroG_Particles::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_Initialise_ZeroG_Particles, CallFunc_ZeroGFlyingAbilityData_ReturnValue) == 0x0000E0, "Member 'BP_ZeroGComponent_C_Initialise_ZeroG_Particles::CallFunc_ZeroGFlyingAbilityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_Initialise_ZeroG_Particles, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0001B8, "Member 'BP_ZeroGComponent_C_Initialise_ZeroG_Particles::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_Initialise_ZeroG_Particles, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue) == 0x0001C0, "Member 'BP_ZeroGComponent_C_Initialise_ZeroG_Particles::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_Initialise_ZeroG_Particles, CallFunc_IsValid_ReturnValue_1) == 0x0001C8, "Member 'BP_ZeroGComponent_C_Initialise_ZeroG_Particles::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_Initialise_ZeroG_Particles, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue_1) == 0x0001D0, "Member 'BP_ZeroGComponent_C_Initialise_ZeroG_Particles::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue_1' has a wrong offset!");

// Function BP_ZeroGComponent.BP_ZeroGComponent_C.Deactivate Zerog Particles
// 0x0004 (0x0004 - 0x0000)
struct BP_ZeroGComponent_C_Deactivate_Zerog_Particles final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ZeroGComponent_C_Deactivate_Zerog_Particles) == 0x000001, "Wrong alignment on BP_ZeroGComponent_C_Deactivate_Zerog_Particles");
static_assert(sizeof(BP_ZeroGComponent_C_Deactivate_Zerog_Particles) == 0x000004, "Wrong size on BP_ZeroGComponent_C_Deactivate_Zerog_Particles");
static_assert(offsetof(BP_ZeroGComponent_C_Deactivate_Zerog_Particles, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_ZeroGComponent_C_Deactivate_Zerog_Particles::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_Deactivate_Zerog_Particles, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'BP_ZeroGComponent_C_Deactivate_Zerog_Particles::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_Deactivate_Zerog_Particles, CallFunc_IsValid_ReturnValue_2) == 0x000002, "Member 'BP_ZeroGComponent_C_Deactivate_Zerog_Particles::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_Deactivate_Zerog_Particles, CallFunc_IsValid_ReturnValue_3) == 0x000003, "Member 'BP_ZeroGComponent_C_Deactivate_Zerog_Particles::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function BP_ZeroGComponent.BP_ZeroGComponent_C.GravHook Screen VFX
// 0x0064 (0x0064 - 0x0000)
struct BP_ZeroGComponent_C_GravHook_Screen_VFX final
{
public:
	ECAPlayerMovementMode                         CallFunc_GetPlayerMovementMode_movement_mode;      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetZeroGDirectionalIndicatorData_scale;   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FZeroGDirectionalIndicatorData         CallFunc_GetZeroGDirectionalIndicatorData_indicator_data; // 0x0008(0x0058)(NoDestructor)
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ZeroGComponent_C_GravHook_Screen_VFX) == 0x000004, "Wrong alignment on BP_ZeroGComponent_C_GravHook_Screen_VFX");
static_assert(sizeof(BP_ZeroGComponent_C_GravHook_Screen_VFX) == 0x000064, "Wrong size on BP_ZeroGComponent_C_GravHook_Screen_VFX");
static_assert(offsetof(BP_ZeroGComponent_C_GravHook_Screen_VFX, CallFunc_GetPlayerMovementMode_movement_mode) == 0x000000, "Member 'BP_ZeroGComponent_C_GravHook_Screen_VFX::CallFunc_GetPlayerMovementMode_movement_mode' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_GravHook_Screen_VFX, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_ZeroGComponent_C_GravHook_Screen_VFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_GravHook_Screen_VFX, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'BP_ZeroGComponent_C_GravHook_Screen_VFX::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_GravHook_Screen_VFX, CallFunc_GetZeroGDirectionalIndicatorData_scale) == 0x000004, "Member 'BP_ZeroGComponent_C_GravHook_Screen_VFX::CallFunc_GetZeroGDirectionalIndicatorData_scale' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_GravHook_Screen_VFX, CallFunc_GetZeroGDirectionalIndicatorData_indicator_data) == 0x000008, "Member 'BP_ZeroGComponent_C_GravHook_Screen_VFX::CallFunc_GetZeroGDirectionalIndicatorData_indicator_data' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_GravHook_Screen_VFX, CallFunc_GetLocalRole_ReturnValue) == 0x000060, "Member 'BP_ZeroGComponent_C_GravHook_Screen_VFX::CallFunc_GetLocalRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_GravHook_Screen_VFX, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000061, "Member 'BP_ZeroGComponent_C_GravHook_Screen_VFX::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_GravHook_Screen_VFX, CallFunc_IsLocallyControlled_ReturnValue) == 0x000062, "Member 'BP_ZeroGComponent_C_GravHook_Screen_VFX::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_GravHook_Screen_VFX, CallFunc_BooleanOR_ReturnValue) == 0x000063, "Member 'BP_ZeroGComponent_C_GravHook_Screen_VFX::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_ZeroGComponent.BP_ZeroGComponent_C.Movement Meta Mode Changed
// 0x0005 (0x0005 - 0x0000)
struct BP_ZeroGComponent_C_Movement_Meta_Mode_Changed final
{
public:
	ECAPlayerMovementMetaMode                     PrevMovementMetaMode;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAPlayerMovementMetaMode                     MovementMetaMode;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ZeroGComponent_C_Movement_Meta_Mode_Changed) == 0x000001, "Wrong alignment on BP_ZeroGComponent_C_Movement_Meta_Mode_Changed");
static_assert(sizeof(BP_ZeroGComponent_C_Movement_Meta_Mode_Changed) == 0x000005, "Wrong size on BP_ZeroGComponent_C_Movement_Meta_Mode_Changed");
static_assert(offsetof(BP_ZeroGComponent_C_Movement_Meta_Mode_Changed, PrevMovementMetaMode) == 0x000000, "Member 'BP_ZeroGComponent_C_Movement_Meta_Mode_Changed::PrevMovementMetaMode' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_Movement_Meta_Mode_Changed, MovementMetaMode) == 0x000001, "Member 'BP_ZeroGComponent_C_Movement_Meta_Mode_Changed::MovementMetaMode' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_Movement_Meta_Mode_Changed, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'BP_ZeroGComponent_C_Movement_Meta_Mode_Changed::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_Movement_Meta_Mode_Changed, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000003, "Member 'BP_ZeroGComponent_C_Movement_Meta_Mode_Changed::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZeroGComponent_C_Movement_Meta_Mode_Changed, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'BP_ZeroGComponent_C_Movement_Meta_Mode_Changed::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_ZeroGComponent.BP_ZeroGComponent_C.SFX Movement Mode Changed
// 0x0348 (0x0348 - 0x0000)
struct BP_ZeroGComponent_C_SFX_Movement_Mode_Changed final
{
public:
	ECAPlayerMovementMode                         PrevMovementMode;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAPlayerMovementMode                         MovementMode;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Speed_On_Movement_Mode_Update;                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0008(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x001C(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_2;                          // 0x0030(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeingViewed_ReturnValue;                // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_3;                          // 0x0048(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_4;                          // 0x005C(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_5;                          // 0x0070(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_6;                          // 0x0084(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x00A0(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_9;        // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BF[0x1];                                       // 0x00BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x00C0(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_2;            // 0x00D8(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_2;                 // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetZeroGDirectionalIndicatorData_scale;   // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FZeroGDirectionalIndicatorData         CallFunc_GetZeroGDirectionalIndicatorData_indicator_data; // 0x00F0(0x0058)(NoDestructor)
	struct FCAMovementData_ZeroGGravHook          CallFunc_ZeroGGravHookAbilityData_ReturnValue;     // 0x0148(0x0168)(ConstParm)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_3;            // 0x02B8(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_3;                 // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_7;                          // 0x02CC(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_4;            // 0x02E0(0x0010)()
