#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ZeroGComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Keaton_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ZeroGComponent.BP_ZeroGComponent_C
// 0x0740 (0x0860 - 0x0120)
class UBP_ZeroGComponent_C final : public UCAZeroGComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0120(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   Default_PostProcessSettings;                       // 0x0130(0x0640)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ACACharacter_MainPlayer*                OwningCACharacter;                                 // 0x0770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCACharMoveComp_Player*                 Movement_Component;                                // 0x0778(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      CapsuleComponent;                                  // 0x0780(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Initial_Target_Position;                           // 0x0788(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInZeroG;                                         // 0x0794(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Is_Flying;                                         // 0x0795(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_796[0x2];                                      // 0x0796(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeToImpact;                                      // 0x0798(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceToImpact;                                  // 0x079C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PredictedImpactPoint;                              // 0x07A0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PredictedImpactNormal;                             // 0x07AC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PredictedImpactValid;                              // 0x07B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PredictedFacingWall;                               // 0x07B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7BA[0x6];                                      // 0x07BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      NiagaraZeroGParticles;                             // 0x07C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraTrailTPParticles;                           // 0x07C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsZeroGSFXStingerAllowed;                          // 0x07D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D1[0x7];                                      // 0x07D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      Line_VFX;                                          // 0x07D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Attach_VFX;                                        // 0x07E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GravhookPos;                                       // 0x07E8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F4[0x4];                                      // 0x07F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      MagBootsVFX_L;                                     // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      MagBootsVFX_R;                                     // 0x0800(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MagBootsVFXActive;                                 // 0x0808(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_809[0x3];                                      // 0x0809(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Maximum_Takeoff_Speed;                             // 0x080C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMagbootAudioActive;                              // 0x0810(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_811[0x3];                                      // 0x0811(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Flight_TemporaryBreakingSpeed;                     // 0x0814(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Flight_Target_Speed;                               // 0x0818(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAPlayerMovementMode                         CurrentMovementMode;                               // 0x081C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81D[0x3];                                      // 0x081D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      Niagara_FP_Layer_Effect;                           // 0x0820(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsWallCrawlingAudioActive;                         // 0x0828(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_829[0x7];                                      // 0x0829(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      ZeroGIndicator;                                    // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UsesSpecialZeroGAbility;                           // 0x0838(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_839[0x3];                                      // 0x0839(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GravHookDistanceToImpact;                          // 0x083C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TopSpeedSustainTime;                               // 0x0840(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAPlayerMovementMode                         Prev_Movement_Mode;                                // 0x0844(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_845[0x3];                                      // 0x0845(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      ZeroGIndicator_B;                                  // 0x0848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TransitionBoostAudioThreshold;                     // 0x0850(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ZeroGComponent(int32 EntryPoint);
	void OnZeroGBoost(bool Successful, float New_speed, float Speed_delta, float Yaw_delta, float Pitch_delta, int32 boosts_remaining);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void OnAllowNewFPZeroOffSFX();
	void OnAllowNewFPZeroGOnSFX();
	void AudioOnStartofSpeedDecay();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ZeroGStateChanged(bool Is_in_zerog);
	void OnMovementModeChange(class ACharacter* Character, ECAPlayerMovementMode PrevMovementMode, ECAPlayerMovementMode MovementMode);
	void OnMovementMetaModeChanged(class ACharacter* Character, ECAPlayerMovementMetaMode PrevMovementMetaMode, ECAPlayerMovementMetaMode MovementMetaMode);
	void Multicast_ZeroGWeaponRecoil();
	void ProcessWeaponMovementPushback(float WeaponTimeBetweenShots);
	void ZeroG_Activated();
	void ZeroG_Deactivated();
	void Initialise_ZeroG_Particles();
	void Deactivate_Zerog_Particles();
	void GravHook_Screen_VFX();
	void Movement_Meta_Mode_Changed(ECAPlayerMovementMetaMode PrevMovementMetaMode, ECAPlayerMovementMetaMode MovementMetaMode);
	void SFX_Movement_Mode_Changed(ECAPlayerMovementMode PrevMovementMode, ECAPlayerMovementMode MovementMode, float Speed_On_Movement_Mode_Update);
	void Initial_Variables();
	void FP_SFX_State_Zero_G_On(bool Uses_Zero_G_Ability, class ACACharacter_MainPlayer* OwningCACharacter_0);
	void FP_SFX_State_Zero_G_Off(class ACACharacter_MainPlayer* Owning_CACharacter, bool Uses_Zero_G_Ability);
	void Update_Animation_Support_Variables();
	void TP_SFX_Zero_G_On(class ACACharacter_MainPlayer* OwningCACharacter_0, bool UsesZeroGAbility);
	void TP_SFX_Zero_G_Off(class ACACharacter_MainPlayer* OwningCACharacter_0, bool UsesZeroGAbility);
	void VFXMovement_Mode_Changed(ECAPlayerMovementMode NewMode, ECAPlayerMovementMode OldMode);
	void FP_SFX_Zero_G_Grav_Hook_Wind(ECAPlayerMovementMode Prev_Movement_Mode_0, ECAPlayerMovementMode Movement_Mode);
	void SFX_Zero_G_Flying_Wind(ECAPlayerMovementMode Prev_Movement_Mode_0, ECAPlayerMovementMode Movement_Mode);
	void MagBootsVFXActivate();
	void MagBootsVFXDeactivate();
	void SFX_Wind_Parameter_Values();
	void SFX_Stop_SFX_on_transition();
	void Update_Directional_Indicator_And_Niagara();
	void AttachVFXToPlayer();
	void SFX_On_Grav_Hook_Impact(class AActor* Actor_Hit_by_Grav_Hook, const struct FVector& Grav_Hook_Pos);
	void TP_SFX_Update_Variables(const struct FVector& Grav_Hook_Pos);
	void SFX_Magboot_Falling_Wind(ECAPlayerMovementMode Prev_Movement_Mode_0, ECAPlayerMovementMode Movement_Mode, class ACACharacter_MainPlayer* Character_Main_Player);
	void SFX_Push_Offs(ECAPlayerMovementMode Prev_Movement_Mode_0, ECAPlayerMovementMode Current_Movement_Mode, class ACACharacter_MainPlayer* Character_Ref);
	void Set_State_In_Wwise_on_Attached_True();
	void Set_State_In_Wwise_on_Attached_False();
	void FP_SFX_Grav_Hook_Off_Cooldown();
	void FP_SFX_Zero_G_Enter();
	void FP_SFX_Zero_G_Exit();
	void Stop_Audio_On_End_Play();
	void Zero_G_Boost_SFX(bool Is_Successful, float Speed_Delta, bool Ballerina_Character, float Yaw_Delta, float Pitch_Delta);
	void ZeroGBoostVFX(float SpeedDelta, float YawDelta, float PitchDelta);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ZeroGComponent_C">();
	}
	static class UBP_ZeroGComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ZeroGComponent_C>();
	}
};
static_assert(alignof(UBP_ZeroGComponent_C) == 0x000010, "Wrong alignment on UBP_ZeroGComponent_C");
static_assert(sizeof(UBP_ZeroGComponent_C) == 0x000860, "Wrong size on UBP_ZeroGComponent_C");
static_assert(offsetof(UBP_ZeroGComponent_C, UberGraphFrame) == 0x000120, "Member 'UBP_ZeroGComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, Default_PostProcessSettings) == 0x000130, "Member 'UBP_ZeroGComponent_C::Default_PostProcessSettings' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, OwningCACharacter) == 0x000770, "Member 'UBP_ZeroGComponent_C::OwningCACharacter' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, Movement_Component) == 0x000778, "Member 'UBP_ZeroGComponent_C::Movement_Component' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, CapsuleComponent) == 0x000780, "Member 'UBP_ZeroGComponent_C::CapsuleComponent' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, Initial_Target_Position) == 0x000788, "Member 'UBP_ZeroGComponent_C::Initial_Target_Position' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, IsInZeroG) == 0x000794, "Member 'UBP_ZeroGComponent_C::IsInZeroG' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, Is_Flying) == 0x000795, "Member 'UBP_ZeroGComponent_C::Is_Flying' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, TimeToImpact) == 0x000798, "Member 'UBP_ZeroGComponent_C::TimeToImpact' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, DistanceToImpact) == 0x00079C, "Member 'UBP_ZeroGComponent_C::DistanceToImpact' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, PredictedImpactPoint) == 0x0007A0, "Member 'UBP_ZeroGComponent_C::PredictedImpactPoint' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, PredictedImpactNormal) == 0x0007AC, "Member 'UBP_ZeroGComponent_C::PredictedImpactNormal' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, PredictedImpactValid) == 0x0007B8, "Member 'UBP_ZeroGComponent_C::PredictedImpactValid' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, PredictedFacingWall) == 0x0007B9, "Member 'UBP_ZeroGComponent_C::PredictedFacingWall' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, NiagaraZeroGParticles) == 0x0007C0, "Member 'UBP_ZeroGComponent_C::NiagaraZeroGParticles' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, NiagaraTrailTPParticles) == 0x0007C8, "Member 'UBP_ZeroGComponent_C::NiagaraTrailTPParticles' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, IsZeroGSFXStingerAllowed) == 0x0007D0, "Member 'UBP_ZeroGComponent_C::IsZeroGSFXStingerAllowed' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, Line_VFX) == 0x0007D8, "Member 'UBP_ZeroGComponent_C::Line_VFX' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, Attach_VFX) == 0x0007E0, "Member 'UBP_ZeroGComponent_C::Attach_VFX' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, GravhookPos) == 0x0007E8, "Member 'UBP_ZeroGComponent_C::GravhookPos' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, MagBootsVFX_L) == 0x0007F8, "Member 'UBP_ZeroGComponent_C::MagBootsVFX_L' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, MagBootsVFX_R) == 0x000800, "Member 'UBP_ZeroGComponent_C::MagBootsVFX_R' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, MagBootsVFXActive) == 0x000808, "Member 'UBP_ZeroGComponent_C::MagBootsVFXActive' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, Maximum_Takeoff_Speed) == 0x00080C, "Member 'UBP_ZeroGComponent_C::Maximum_Takeoff_Speed' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, IsMagbootAudioActive) == 0x000810, "Member 'UBP_ZeroGComponent_C::IsMagbootAudioActive' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, Flight_TemporaryBreakingSpeed) == 0x000814, "Member 'UBP_ZeroGComponent_C::Flight_TemporaryBreakingSpeed' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, Flight_Target_Speed) == 0x000818, "Member 'UBP_ZeroGComponent_C::Flight_Target_Speed' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, CurrentMovementMode) == 0x00081C, "Member 'UBP_ZeroGComponent_C::CurrentMovementMode' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, Niagara_FP_Layer_Effect) == 0x000820, "Member 'UBP_ZeroGComponent_C::Niagara_FP_Layer_Effect' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, IsWallCrawlingAudioActive) == 0x000828, "Member 'UBP_ZeroGComponent_C::IsWallCrawlingAudioActive' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, ZeroGIndicator) == 0x000830, "Member 'UBP_ZeroGComponent_C::ZeroGIndicator' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, UsesSpecialZeroGAbility) == 0x000838, "Member 'UBP_ZeroGComponent_C::UsesSpecialZeroGAbility' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, GravHookDistanceToImpact) == 0x00083C, "Member 'UBP_ZeroGComponent_C::GravHookDistanceToImpact' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, TopSpeedSustainTime) == 0x000840, "Member 'UBP_ZeroGComponent_C::TopSpeedSustainTime' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, Prev_Movement_Mode) == 0x000844, "Member 'UBP_ZeroGComponent_C::Prev_Movement_Mode' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, ZeroGIndicator_B) == 0x000848, "Member 'UBP_ZeroGComponent_C::ZeroGIndicator_B' has a wrong offset!");
static_assert(offsetof(UBP_ZeroGComponent_C, TransitionBoostAudioThreshold) == 0x000850, "Member 'UBP_ZeroGComponent_C::TransitionBoostAudioThreshold' has a wrong offset!");

}

