#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_NPCLootSpawner

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Keaton_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPC_NPCLootSpawner.BPC_NPCLootSpawner_C.ExecuteUbergraph_BPC_NPCLootSpawner
// 0x04A0 (0x04A0 - 0x0000)
struct BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayEffectSpec& Killing_effect_spec, float Delta_value)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter*                           K2Node_DynamicCast_AsCACharacter;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpec                    K2Node_CustomEvent_killing_effect_spec;            // 0x0038(0x0298)(ConstParm)
	float                                         K2Node_CustomEvent_delta_value;                    // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetInstigatorFromEffectSpec_ReturnValue;  // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAGameMode*                            CallFunc_GetCAGameMode_ReturnValue;                // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACARewardDistributionSystem*            CallFunc_GetRewardDistributionSystem_ReturnValue;  // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0310(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FCARewardsForBlueprintStruct           K2Node_CustomEvent_rewards;                        // 0x0340(0x0010)()
	TArray<TScriptInterface<class ICARewardInterface>> CallFunc_RewardsToTScriptInterfaces_ReturnValue;   // 0x0350(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0360(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x036C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCARewardsForBlueprintStruct& Rewards)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0378(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemCountPair                         K2Node_MakeStruct_ItemCountPair;                   // 0x0390(0x0010)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICARewardInterface>    CallFunc_Array_Get_Item_1;                         // 0x03A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAInventoryItem*                       K2Node_DynamicCast_AsCAInventory_Item;             // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x3];                                      // 0x03C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAPickUp*                              K2Node_CustomEvent_pickup;                         // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x03E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4[0xC];                                      // 0x03F4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAPickupSpawnData                     K2Node_MakeStruct_CAPickupSpawnData;               // 0x0400(0x0090)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner) == 0x000010, "Wrong alignment on BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner");
static_assert(sizeof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner) == 0x0004A0, "Wrong size on BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, EntryPoint) == 0x000000, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, CallFunc_IsServer_ReturnValue) == 0x000020, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, K2Node_DynamicCast_AsCACharacter) == 0x000028, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::K2Node_DynamicCast_AsCACharacter' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, K2Node_CustomEvent_killing_effect_spec) == 0x000038, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::K2Node_CustomEvent_killing_effect_spec' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, K2Node_CustomEvent_delta_value) == 0x0002D0, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::K2Node_CustomEvent_delta_value' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, CallFunc_GetInstigatorFromEffectSpec_ReturnValue) == 0x0002D8, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::CallFunc_GetInstigatorFromEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, CallFunc_IsValid_ReturnValue) == 0x0002E0, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, Temp_int_Array_Index_Variable) == 0x0002E4, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, CallFunc_IsValid_ReturnValue_1) == 0x0002E8, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, CallFunc_GetCAGameMode_ReturnValue) == 0x0002F0, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::CallFunc_GetCAGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, CallFunc_GetRewardDistributionSystem_ReturnValue) == 0x0002F8, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::CallFunc_GetRewardDistributionSystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000300, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, CallFunc_GetTransform_ReturnValue) == 0x000310, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, K2Node_CustomEvent_rewards) == 0x000340, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::K2Node_CustomEvent_rewards' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, CallFunc_RewardsToTScriptInterfaces_ReturnValue) == 0x000350, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::CallFunc_RewardsToTScriptInterfaces_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, CallFunc_Array_Get_Item) == 0x000360, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00036C, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, K2Node_CreateDelegate_OutputDelegate_1) == 0x000378, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, K2Node_MakeStruct_ItemCountPair) == 0x000390, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::K2Node_MakeStruct_ItemCountPair' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, CallFunc_IsValid_ReturnValue_2) == 0x0003A0, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, CallFunc_Array_Add_ReturnValue) == 0x0003A4, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, CallFunc_Array_Get_Item_1) == 0x0003A8, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, CallFunc_Array_Length_ReturnValue) == 0x0003B8, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, K2Node_DynamicCast_AsCAInventory_Item) == 0x0003C0, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::K2Node_DynamicCast_AsCAInventory_Item' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, K2Node_DynamicCast_bSuccess_1) == 0x0003C8, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, CallFunc_Array_Length_ReturnValue_1) == 0x0003CC, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, K2Node_CustomEvent_pickup) == 0x0003D0, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::K2Node_CustomEvent_pickup' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, Temp_int_Loop_Counter_Variable) == 0x0003D8, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, CallFunc_Array_AddUnique_ReturnValue) == 0x0003DC, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, CallFunc_Less_IntInt_ReturnValue) == 0x0003E0, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, CallFunc_Add_IntInt_ReturnValue) == 0x0003E4, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0003E8, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, K2Node_MakeStruct_CAPickupSpawnData) == 0x000400, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::K2Node_MakeStruct_CAPickupSpawnData' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner, CallFunc_Array_Add_ReturnValue_1) == 0x000490, "Member 'BPC_NPCLootSpawner_C_ExecuteUbergraph_BPC_NPCLootSpawner::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function BPC_NPCLootSpawner.BPC_NPCLootSpawner_C.OnPickupSpawned
// 0x0008 (0x0008 - 0x0000)
struct BPC_NPCLootSpawner_C_OnPickupSpawned final
{
public:
	class ACAPickUp*                              Pickup;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_NPCLootSpawner_C_OnPickupSpawned) == 0x000008, "Wrong alignment on BPC_NPCLootSpawner_C_OnPickupSpawned");
static_assert(sizeof(BPC_NPCLootSpawner_C_OnPickupSpawned) == 0x000008, "Wrong size on BPC_NPCLootSpawner_C_OnPickupSpawned");
static_assert(offsetof(BPC_NPCLootSpawner_C_OnPickupSpawned, Pickup) == 0x000000, "Member 'BPC_NPCLootSpawner_C_OnPickupSpawned::Pickup' has a wrong offset!");

// Function BPC_NPCLootSpawner.BPC_NPCLootSpawner_C.Callback
// 0x0010 (0x0010 - 0x0000)
struct BPC_NPCLootSpawner_C_Callback final
{
public:
	struct FCARewardsForBlueprintStruct           Rewards;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BPC_NPCLootSpawner_C_Callback) == 0x000008, "Wrong alignment on BPC_NPCLootSpawner_C_Callback");
static_assert(sizeof(BPC_NPCLootSpawner_C_Callback) == 0x000010, "Wrong size on BPC_NPCLootSpawner_C_Callback");
static_assert(offsetof(BPC_NPCLootSpawner_C_Callback, Rewards) == 0x000000, "Member 'BPC_NPCLootSpawner_C_Callback::Rewards' has a wrong offset!");

// Function BPC_NPCLootSpawner.BPC_NPCLootSpawner_C.SpawnLoot
// 0x02A0 (0x02A0 - 0x0000)
struct BPC_NPCLootSpawner_C_SpawnLoot final
{
public:
	struct FGameplayEffectSpec                    Killing_effect_spec;                               // 0x0000(0x0298)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         Delta_value;                                       // 0x0298(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_NPCLootSpawner_C_SpawnLoot) == 0x000008, "Wrong alignment on BPC_NPCLootSpawner_C_SpawnLoot");
static_assert(sizeof(BPC_NPCLootSpawner_C_SpawnLoot) == 0x0002A0, "Wrong size on BPC_NPCLootSpawner_C_SpawnLoot");
static_assert(offsetof(BPC_NPCLootSpawner_C_SpawnLoot, Killing_effect_spec) == 0x000000, "Member 'BPC_NPCLootSpawner_C_SpawnLoot::Killing_effect_spec' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_SpawnLoot, Delta_value) == 0x000298, "Member 'BPC_NPCLootSpawner_C_SpawnLoot::Delta_value' has a wrong offset!");

// Function BPC_NPCLootSpawner.BPC_NPCLootSpawner_C.CreateThrowDirectionsForPickups
// 0x0040 (0x0040 - 0x0000)
struct BPC_NPCLootSpawner_C_CreateThrowDirectionsForPickups final
{
public:
	int32                                         PickUpsNumber;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAPickupThrowDirectionCalculationData K2Node_MakeStruct_CAPickupThrowDirectionCalculationData; // 0x0008(0x0028)(NoDestructor)
	TArray<struct FVector>                        CallFunc_GetThrowDirectionsForPickups_ReturnValue; // 0x0030(0x0010)(ReferenceParm)
};
static_assert(alignof(BPC_NPCLootSpawner_C_CreateThrowDirectionsForPickups) == 0x000008, "Wrong alignment on BPC_NPCLootSpawner_C_CreateThrowDirectionsForPickups");
static_assert(sizeof(BPC_NPCLootSpawner_C_CreateThrowDirectionsForPickups) == 0x000040, "Wrong size on BPC_NPCLootSpawner_C_CreateThrowDirectionsForPickups");
static_assert(offsetof(BPC_NPCLootSpawner_C_CreateThrowDirectionsForPickups, PickUpsNumber) == 0x000000, "Member 'BPC_NPCLootSpawner_C_CreateThrowDirectionsForPickups::PickUpsNumber' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_CreateThrowDirectionsForPickups, CallFunc_Add_FloatFloat_ReturnValue) == 0x000004, "Member 'BPC_NPCLootSpawner_C_CreateThrowDirectionsForPickups::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_CreateThrowDirectionsForPickups, K2Node_MakeStruct_CAPickupThrowDirectionCalculationData) == 0x000008, "Member 'BPC_NPCLootSpawner_C_CreateThrowDirectionsForPickups::K2Node_MakeStruct_CAPickupThrowDirectionCalculationData' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_CreateThrowDirectionsForPickups, CallFunc_GetThrowDirectionsForPickups_ReturnValue) == 0x000030, "Member 'BPC_NPCLootSpawner_C_CreateThrowDirectionsForPickups::CallFunc_GetThrowDirectionsForPickups_ReturnValue' has a wrong offset!");

// Function BPC_NPCLootSpawner.BPC_NPCLootSpawner_C.CreateLootDropRequest
// 0x0030 (0x0030 - 0x0000)
struct BPC_NPCLootSpawner_C_CreateLootDropRequest final
{
public:
	TDelegate<void(class ACAPickUp* Pickup)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAGameMode*                            CallFunc_GetGameMode_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACALootDropManager*                     CallFunc_GetLootDropManager_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_NPCLootSpawner_C_CreateLootDropRequest) == 0x000008, "Wrong alignment on BPC_NPCLootSpawner_C_CreateLootDropRequest");
static_assert(sizeof(BPC_NPCLootSpawner_C_CreateLootDropRequest) == 0x000030, "Wrong size on BPC_NPCLootSpawner_C_CreateLootDropRequest");
static_assert(offsetof(BPC_NPCLootSpawner_C_CreateLootDropRequest, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BPC_NPCLootSpawner_C_CreateLootDropRequest::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_CreateLootDropRequest, CallFunc_GetGameMode_ReturnValue) == 0x000018, "Member 'BPC_NPCLootSpawner_C_CreateLootDropRequest::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_CreateLootDropRequest, CallFunc_GetLootDropManager_ReturnValue) == 0x000020, "Member 'BPC_NPCLootSpawner_C_CreateLootDropRequest::CallFunc_GetLootDropManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_CreateLootDropRequest, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BPC_NPCLootSpawner_C_CreateLootDropRequest::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NPCLootSpawner_C_CreateLootDropRequest, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'BPC_NPCLootSpawner_C_CreateLootDropRequest::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

