#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_NPCLootSpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Keaton_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_NPCLootSpawner.BPC_NPCLootSpawner_C
// 0x0070 (0x0160 - 0x00F0)
class UBPC_NPCLootSpawner_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ACACharacter*                           OwningCharacter;                                   // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TScriptInterface<class ICARewardInterface>> RewardsDropped;                                    // 0x0100(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCAInventoryItem*                       CurrentItem;                                       // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        ThrowDirections;                                   // 0x0118(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FCAPickupSpawnData>             SpawnData;                                         // 0x0128(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FItemCountPair>                 RewardsGiven;                                      // 0x0138(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class ACAPickUp*>                      SpawnedPickUps;                                    // 0x0148(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	float                                         Throw_Velocity;                                    // 0x0158(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Throw_Direction_Offset_Distance;                   // 0x015C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPC_NPCLootSpawner(int32 EntryPoint);
	void OnPickupSpawned(class ACAPickUp* Pickup);
	void Callback(const struct FCARewardsForBlueprintStruct& Rewards);
	void SpawnLoot(const struct FGameplayEffectSpec& Killing_effect_spec, float Delta_value);
	void ReceiveBeginPlay();
	void CreateThrowDirectionsForPickups(int32 PickUpsNumber);
	void CreateLootDropRequest();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_NPCLootSpawner_C">();
	}
	static class UBPC_NPCLootSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_NPCLootSpawner_C>();
	}
};
static_assert(alignof(UBPC_NPCLootSpawner_C) == 0x000008, "Wrong alignment on UBPC_NPCLootSpawner_C");
static_assert(sizeof(UBPC_NPCLootSpawner_C) == 0x000160, "Wrong size on UBPC_NPCLootSpawner_C");
static_assert(offsetof(UBPC_NPCLootSpawner_C, UberGraphFrame) == 0x0000F0, "Member 'UBPC_NPCLootSpawner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_NPCLootSpawner_C, OwningCharacter) == 0x0000F8, "Member 'UBPC_NPCLootSpawner_C::OwningCharacter' has a wrong offset!");
static_assert(offsetof(UBPC_NPCLootSpawner_C, RewardsDropped) == 0x000100, "Member 'UBPC_NPCLootSpawner_C::RewardsDropped' has a wrong offset!");
static_assert(offsetof(UBPC_NPCLootSpawner_C, CurrentItem) == 0x000110, "Member 'UBPC_NPCLootSpawner_C::CurrentItem' has a wrong offset!");
static_assert(offsetof(UBPC_NPCLootSpawner_C, ThrowDirections) == 0x000118, "Member 'UBPC_NPCLootSpawner_C::ThrowDirections' has a wrong offset!");
static_assert(offsetof(UBPC_NPCLootSpawner_C, SpawnData) == 0x000128, "Member 'UBPC_NPCLootSpawner_C::SpawnData' has a wrong offset!");
static_assert(offsetof(UBPC_NPCLootSpawner_C, RewardsGiven) == 0x000138, "Member 'UBPC_NPCLootSpawner_C::RewardsGiven' has a wrong offset!");
static_assert(offsetof(UBPC_NPCLootSpawner_C, SpawnedPickUps) == 0x000148, "Member 'UBPC_NPCLootSpawner_C::SpawnedPickUps' has a wrong offset!");
static_assert(offsetof(UBPC_NPCLootSpawner_C, Throw_Velocity) == 0x000158, "Member 'UBPC_NPCLootSpawner_C::Throw_Velocity' has a wrong offset!");
static_assert(offsetof(UBPC_NPCLootSpawner_C, Throw_Direction_Offset_Distance) == 0x00015C, "Member 'UBPC_NPCLootSpawner_C::Throw_Direction_Offset_Distance' has a wrong offset!");

}

