#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_UseableGadgetBox

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPC_UseableGadgetBox.BPC_UseableGadgetBox_C.ExecuteUbergraph_BPC_UseableGadgetBox
// 0x0018 (0x0018 - 0x0000)
struct BPC_UseableGadgetBox_C_ExecuteUbergraph_BPC_UseableGadgetBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_User;                                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_WasCancelled;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_UseableGadgetBox_C_ExecuteUbergraph_BPC_UseableGadgetBox) == 0x000008, "Wrong alignment on BPC_UseableGadgetBox_C_ExecuteUbergraph_BPC_UseableGadgetBox");
static_assert(sizeof(BPC_UseableGadgetBox_C_ExecuteUbergraph_BPC_UseableGadgetBox) == 0x000018, "Wrong size on BPC_UseableGadgetBox_C_ExecuteUbergraph_BPC_UseableGadgetBox");
static_assert(offsetof(BPC_UseableGadgetBox_C_ExecuteUbergraph_BPC_UseableGadgetBox, EntryPoint) == 0x000000, "Member 'BPC_UseableGadgetBox_C_ExecuteUbergraph_BPC_UseableGadgetBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_UseableGadgetBox_C_ExecuteUbergraph_BPC_UseableGadgetBox, CallFunc_IsServer_ReturnValue) == 0x000004, "Member 'BPC_UseableGadgetBox_C_ExecuteUbergraph_BPC_UseableGadgetBox::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_UseableGadgetBox_C_ExecuteUbergraph_BPC_UseableGadgetBox, K2Node_Event_User) == 0x000008, "Member 'BPC_UseableGadgetBox_C_ExecuteUbergraph_BPC_UseableGadgetBox::K2Node_Event_User' has a wrong offset!");
static_assert(offsetof(BPC_UseableGadgetBox_C_ExecuteUbergraph_BPC_UseableGadgetBox, K2Node_Event_WasCancelled) == 0x000010, "Member 'BPC_UseableGadgetBox_C_ExecuteUbergraph_BPC_UseableGadgetBox::K2Node_Event_WasCancelled' has a wrong offset!");

// Function BPC_UseableGadgetBox.BPC_UseableGadgetBox_C.NotifyAbilityEnded
// 0x0010 (0x0010 - 0x0000)
struct BPC_UseableGadgetBox_C_NotifyAbilityEnded final
{
public:
	class AActor*                                 User;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WasCancelled;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_UseableGadgetBox_C_NotifyAbilityEnded) == 0x000008, "Wrong alignment on BPC_UseableGadgetBox_C_NotifyAbilityEnded");
static_assert(sizeof(BPC_UseableGadgetBox_C_NotifyAbilityEnded) == 0x000010, "Wrong size on BPC_UseableGadgetBox_C_NotifyAbilityEnded");
static_assert(offsetof(BPC_UseableGadgetBox_C_NotifyAbilityEnded, User) == 0x000000, "Member 'BPC_UseableGadgetBox_C_NotifyAbilityEnded::User' has a wrong offset!");
static_assert(offsetof(BPC_UseableGadgetBox_C_NotifyAbilityEnded, WasCancelled) == 0x000008, "Member 'BPC_UseableGadgetBox_C_NotifyAbilityEnded::WasCancelled' has a wrong offset!");

// Function BPC_UseableGadgetBox.BPC_UseableGadgetBox_C.CanUseAbility
// 0x0010 (0x0010 - 0x0000)
struct BPC_UseableGadgetBox_C_CanUseAbility final
{
public:
	class AActor*                                 User;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanUseAbility_ReturnValue;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPC_UseableGadgetBox_C_CanUseAbility) == 0x000008, "Wrong alignment on BPC_UseableGadgetBox_C_CanUseAbility");
static_assert(sizeof(BPC_UseableGadgetBox_C_CanUseAbility) == 0x000010, "Wrong size on BPC_UseableGadgetBox_C_CanUseAbility");
static_assert(offsetof(BPC_UseableGadgetBox_C_CanUseAbility, User) == 0x000000, "Member 'BPC_UseableGadgetBox_C_CanUseAbility::User' has a wrong offset!");
static_assert(offsetof(BPC_UseableGadgetBox_C_CanUseAbility, ReturnValue) == 0x000008, "Member 'BPC_UseableGadgetBox_C_CanUseAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_UseableGadgetBox_C_CanUseAbility, CallFunc_CanUseAbility_ReturnValue) == 0x000009, "Member 'BPC_UseableGadgetBox_C_CanUseAbility::CallFunc_CanUseAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_UseableGadgetBox_C_CanUseAbility, CallFunc_Not_PreBool_ReturnValue) == 0x00000A, "Member 'BPC_UseableGadgetBox_C_CanUseAbility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_UseableGadgetBox_C_CanUseAbility, CallFunc_BooleanAND_ReturnValue) == 0x00000B, "Member 'BPC_UseableGadgetBox_C_CanUseAbility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

