#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_AbilityFunctions

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CALocalisationRuntime_structs.hpp"


namespace SDK::Params
{

// Function BPFL_AbilityFunctions.BPFL_AbilityFunctions_C.ShowGenericProgressWidget
// 0x0090 (0x0090 - 0x0000)
struct BPFL_AbilityFunctions_C_ShowGenericProgressWidget final
{
public:
	float                                         TargetTime;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAText                                ProgressLabel;                                     // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FCAText                                FinishedLabel;                                     // 0x0038(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          AutoDestroyOnComplete;                             // 0x0068(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPUI_HUD_GenericProgress_C*            WidgetReference;                                   // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPUI_HUD_GenericProgress_C*            CallFunc_Create_ReturnValue;                       // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_AbilityFunctions_C_ShowGenericProgressWidget) == 0x000008, "Wrong alignment on BPFL_AbilityFunctions_C_ShowGenericProgressWidget");
static_assert(sizeof(BPFL_AbilityFunctions_C_ShowGenericProgressWidget) == 0x000090, "Wrong size on BPFL_AbilityFunctions_C_ShowGenericProgressWidget");
static_assert(offsetof(BPFL_AbilityFunctions_C_ShowGenericProgressWidget, TargetTime) == 0x000000, "Member 'BPFL_AbilityFunctions_C_ShowGenericProgressWidget::TargetTime' has a wrong offset!");
static_assert(offsetof(BPFL_AbilityFunctions_C_ShowGenericProgressWidget, ProgressLabel) == 0x000008, "Member 'BPFL_AbilityFunctions_C_ShowGenericProgressWidget::ProgressLabel' has a wrong offset!");
static_assert(offsetof(BPFL_AbilityFunctions_C_ShowGenericProgressWidget, FinishedLabel) == 0x000038, "Member 'BPFL_AbilityFunctions_C_ShowGenericProgressWidget::FinishedLabel' has a wrong offset!");
static_assert(offsetof(BPFL_AbilityFunctions_C_ShowGenericProgressWidget, AutoDestroyOnComplete) == 0x000068, "Member 'BPFL_AbilityFunctions_C_ShowGenericProgressWidget::AutoDestroyOnComplete' has a wrong offset!");
static_assert(offsetof(BPFL_AbilityFunctions_C_ShowGenericProgressWidget, __WorldContext) == 0x000070, "Member 'BPFL_AbilityFunctions_C_ShowGenericProgressWidget::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_AbilityFunctions_C_ShowGenericProgressWidget, WidgetReference) == 0x000078, "Member 'BPFL_AbilityFunctions_C_ShowGenericProgressWidget::WidgetReference' has a wrong offset!");
static_assert(offsetof(BPFL_AbilityFunctions_C_ShowGenericProgressWidget, CallFunc_Create_ReturnValue) == 0x000080, "Member 'BPFL_AbilityFunctions_C_ShowGenericProgressWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_AbilityFunctions_C_ShowGenericProgressWidget, CallFunc_IsServer_ReturnValue) == 0x000088, "Member 'BPFL_AbilityFunctions_C_ShowGenericProgressWidget::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_AbilityFunctions_C_ShowGenericProgressWidget, CallFunc_IsValid_ReturnValue) == 0x000089, "Member 'BPFL_AbilityFunctions_C_ShowGenericProgressWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BPFL_AbilityFunctions.BPFL_AbilityFunctions_C.HideGenericProgressWidget
// 0x0018 (0x0018 - 0x0000)
struct BPFL_AbilityFunctions_C_HideGenericProgressWidget final
{
public:
	class UBPUI_HUD_GenericProgress_C*            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_AbilityFunctions_C_HideGenericProgressWidget) == 0x000008, "Wrong alignment on BPFL_AbilityFunctions_C_HideGenericProgressWidget");
static_assert(sizeof(BPFL_AbilityFunctions_C_HideGenericProgressWidget) == 0x000018, "Wrong size on BPFL_AbilityFunctions_C_HideGenericProgressWidget");
static_assert(offsetof(BPFL_AbilityFunctions_C_HideGenericProgressWidget, Widget) == 0x000000, "Member 'BPFL_AbilityFunctions_C_HideGenericProgressWidget::Widget' has a wrong offset!");
static_assert(offsetof(BPFL_AbilityFunctions_C_HideGenericProgressWidget, __WorldContext) == 0x000008, "Member 'BPFL_AbilityFunctions_C_HideGenericProgressWidget::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_AbilityFunctions_C_HideGenericProgressWidget, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BPFL_AbilityFunctions_C_HideGenericProgressWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BPFL_AbilityFunctions.BPFL_AbilityFunctions_C.CAPrint
// 0x0078 (0x0078 - 0x0000)
struct BPFL_AbilityFunctions_C_CAPrint final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Print_to_Screen;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Colour;                                            // 0x0014(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Add_LinearColorLinearColor_ReturnValue;   // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_AbilityFunctions_C_CAPrint) == 0x000008, "Wrong alignment on BPFL_AbilityFunctions_C_CAPrint");
static_assert(sizeof(BPFL_AbilityFunctions_C_CAPrint) == 0x000078, "Wrong size on BPFL_AbilityFunctions_C_CAPrint");
static_assert(offsetof(BPFL_AbilityFunctions_C_CAPrint, String) == 0x000000, "Member 'BPFL_AbilityFunctions_C_CAPrint::String' has a wrong offset!");
static_assert(offsetof(BPFL_AbilityFunctions_C_CAPrint, Print_to_Screen) == 0x000010, "Member 'BPFL_AbilityFunctions_C_CAPrint::Print_to_Screen' has a wrong offset!");
static_assert(offsetof(BPFL_AbilityFunctions_C_CAPrint, Colour) == 0x000014, "Member 'BPFL_AbilityFunctions_C_CAPrint::Colour' has a wrong offset!");
static_assert(offsetof(BPFL_AbilityFunctions_C_CAPrint, Duration) == 0x000024, "Member 'BPFL_AbilityFunctions_C_CAPrint::Duration' has a wrong offset!");
static_assert(offsetof(BPFL_AbilityFunctions_C_CAPrint, __WorldContext) == 0x000028, "Member 'BPFL_AbilityFunctions_C_CAPrint::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_AbilityFunctions_C_CAPrint, CallFunc_IsServer_ReturnValue) == 0x000030, "Member 'BPFL_AbilityFunctions_C_CAPrint::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_AbilityFunctions_C_CAPrint, CallFunc_SelectString_ReturnValue) == 0x000038, "Member 'BPFL_AbilityFunctions_C_CAPrint::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_AbilityFunctions_C_CAPrint, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'BPFL_AbilityFunctions_C_CAPrint::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_AbilityFunctions_C_CAPrint, CallFunc_Add_LinearColorLinearColor_ReturnValue) == 0x000058, "Member 'BPFL_AbilityFunctions_C_CAPrint::CallFunc_Add_LinearColorLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_AbilityFunctions_C_CAPrint, CallFunc_SelectColor_ReturnValue) == 0x000068, "Member 'BPFL_AbilityFunctions_C_CAPrint::CallFunc_SelectColor_ReturnValue' has a wrong offset!");

}

