#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_BankRobber_Turret

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_BankRobber_Turret.BPI_BankRobber_Turret_C.GetDestructionDistance
// 0x0004 (0x0004 - 0x0000)
struct BPI_BankRobber_Turret_C_GetDestructionDistance final
{
public:
	int32                                         Distance;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_BankRobber_Turret_C_GetDestructionDistance) == 0x000004, "Wrong alignment on BPI_BankRobber_Turret_C_GetDestructionDistance");
static_assert(sizeof(BPI_BankRobber_Turret_C_GetDestructionDistance) == 0x000004, "Wrong size on BPI_BankRobber_Turret_C_GetDestructionDistance");
static_assert(offsetof(BPI_BankRobber_Turret_C_GetDestructionDistance, Distance) == 0x000000, "Member 'BPI_BankRobber_Turret_C_GetDestructionDistance::Distance' has a wrong offset!");

// Function BPI_BankRobber_Turret.BPI_BankRobber_Turret_C.SetIsBeingDestroyed
// 0x0001 (0x0001 - 0x0000)
struct BPI_BankRobber_Turret_C_SetIsBeingDestroyed final
{
public:
	bool                                          BeingDestroyed;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BankRobber_Turret_C_SetIsBeingDestroyed) == 0x000001, "Wrong alignment on BPI_BankRobber_Turret_C_SetIsBeingDestroyed");
static_assert(sizeof(BPI_BankRobber_Turret_C_SetIsBeingDestroyed) == 0x000001, "Wrong size on BPI_BankRobber_Turret_C_SetIsBeingDestroyed");
static_assert(offsetof(BPI_BankRobber_Turret_C_SetIsBeingDestroyed, BeingDestroyed) == 0x000000, "Member 'BPI_BankRobber_Turret_C_SetIsBeingDestroyed::BeingDestroyed' has a wrong offset!");

// Function BPI_BankRobber_Turret.BPI_BankRobber_Turret_C.GetIsBeingDestroyed
// 0x0001 (0x0001 - 0x0000)
struct BPI_BankRobber_Turret_C_GetIsBeingDestroyed final
{
public:
	bool                                          BeingDestroyed;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPI_BankRobber_Turret_C_GetIsBeingDestroyed) == 0x000001, "Wrong alignment on BPI_BankRobber_Turret_C_GetIsBeingDestroyed");
static_assert(sizeof(BPI_BankRobber_Turret_C_GetIsBeingDestroyed) == 0x000001, "Wrong size on BPI_BankRobber_Turret_C_GetIsBeingDestroyed");
static_assert(offsetof(BPI_BankRobber_Turret_C_GetIsBeingDestroyed, BeingDestroyed) == 0x000000, "Member 'BPI_BankRobber_Turret_C_GetIsBeingDestroyed::BeingDestroyed' has a wrong offset!");

}

