#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS_MapRevealData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Keaton_structs.hpp"


namespace SDK
{

// UserDefinedStruct BPS_MapRevealData.BPS_MapRevealData
// 0x0028 (0x0028 - 0x0000)
struct FBPS_MapRevealData final
{
public:
	class ACAPlayerState*                         PlayerState_9_BC9DF34D4B1AC348CEABEBA671975806;    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MapEntityID_5_C73E545841D72B953EDF428FA8ED7586;    // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              IconOffset_16_1B5735F54AD1F6ADD496899E0ACABEEA;    // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCATeamID>                      TeamsToNotify_20_9549840B44929587998CECA7E1FF49A2; // 0x0018(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FBPS_MapRevealData) == 0x000008, "Wrong alignment on FBPS_MapRevealData");
static_assert(sizeof(FBPS_MapRevealData) == 0x000028, "Wrong size on FBPS_MapRevealData");
static_assert(offsetof(FBPS_MapRevealData, PlayerState_9_BC9DF34D4B1AC348CEABEBA671975806) == 0x000000, "Member 'FBPS_MapRevealData::PlayerState_9_BC9DF34D4B1AC348CEABEBA671975806' has a wrong offset!");
static_assert(offsetof(FBPS_MapRevealData, MapEntityID_5_C73E545841D72B953EDF428FA8ED7586) == 0x000008, "Member 'FBPS_MapRevealData::MapEntityID_5_C73E545841D72B953EDF428FA8ED7586' has a wrong offset!");
static_assert(offsetof(FBPS_MapRevealData, IconOffset_16_1B5735F54AD1F6ADD496899E0ACABEEA) == 0x00000C, "Member 'FBPS_MapRevealData::IconOffset_16_1B5735F54AD1F6ADD496899E0ACABEEA' has a wrong offset!");
static_assert(offsetof(FBPS_MapRevealData, TeamsToNotify_20_9549840B44929587998CECA7E1FF49A2) == 0x000018, "Member 'FBPS_MapRevealData::TeamsToNotify_20_9549840B44929587998CECA7E1FF49A2' has a wrong offset!");

}

