#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_PauseMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_structs.hpp"
#include "Keaton_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_HUD_PauseMenu.BPUI_HUD_PauseMenu_C
// 0x00C8 (0x0638 - 0x0570)
class UBPUI_HUD_PauseMenu_C final : public UCAHUDBasePauseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0570(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHUDActionButton_C*                     back_btn;                                          // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 blackBg;                                           // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_HUD_ControlScheme_C*              BPUI_HUD_ControlScheme;                            // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_HUD_Options_C*                    BPUI_HUD_Options;                                  // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_HUD_SocialPartyContainer_C*       BPUI_HUD_SocialPartyContainer;                     // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_InventoryContainer_C*             BPUI_InventoryContainer_234;                       // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHUDActionButton_C*                     Exit_game_btn;                                     // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Input_overlay;                                     // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_KeybindingInputPanel_C*             Input_panel;                                       // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_HUD_NotificationBox_C*            Notification_box;                                  // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Pause_screen_switcher;                             // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHUDActionButton_C*                     Reset_to_defaults_btn;                             // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHUDActionButton_C*                     Return_to_menu_btn;                                // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHUDActionButton_C*                     Save_options_btn;                                  // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHUDActionButton_C*                     Skip_tutorial;                                     // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Current_widget_index;                              // 0x05F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F4[0x4];                                      // 0x05F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAPlayerController*                    OwningController;                                  // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             PermissionToLeave;                                 // 0x0600(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsShown;                                           // 0x0610(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_611[0x3];                                      // 0x0611(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Current_primary_index;                             // 0x0614(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Current_secondary_index;                           // 0x0618(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Action_in_flight;                                  // 0x061C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Is_match_start_active;                             // 0x061D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61E[0x2];                                      // 0x061E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Inventory_ind;                                     // 0x0620(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Options_ind;                                       // 0x0624(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Keybindings_ind;                                   // 0x0628(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Control_ind;                                       // 0x062C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Social_party_ind;                                  // 0x0630(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Auto_save_on_exit;                                 // 0x0634(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void PermissionToLeave__DelegateSignature(bool Granted);
	void ExecuteUbergraph_BPUI_HUD_PauseMenu(int32 EntryPoint);
	void LeavePauseMenu();
	void ShowLeaveMatchButton(bool Show);
	void OnInputDismissed();
	void ShowReturnToMenuButton(bool Show);
	void ShowSkipTutorialButton(bool Show);
	void BndEvt__BPUI_HUD_PauseMenu_skip_tutorial_K2Node_ComponentBoundEvent_6_UIElementSelected__DelegateSignature(class UCABaseUIElement* button);
	void HideSaveButton();
	void FixMouseCursor();
	void ForceEndPreCloseScreenOperations();
	void SetTitles(const struct FCAText& Parent_Title, const struct FCAText& Screen_Title);
	void StartPreCloseScreenOperations(bool Force_sync_close);
	void PauseMenuCatpureInput();
	void OnPermissionToLeaveHandler(bool Granted);
	void OnShow();
	void OnHide();
	void RequestReturnToMainMenu();
	void OnReturnToMenu(ECADialogueResult Results);
	void BndEvt__BPUI_HUD_PauseMenu_return_to_menu_btn_K2Node_ComponentBoundEvent_4_UIElementSelected__DelegateSignature(class UCABaseUIElement* button);
	void OnSaveOptionSDismiss(ECADialogueResult Results);
	void SaveOptions();
	void OnResetToDefaultsDismiss(ECADialogueResult Results);
	void BndEvt__BPUI_HUD_PauseMenu_save_options_btn_K2Node_ComponentBoundEvent_0_UIElementSelected__DelegateSignature(class UCABaseUIElement* button);
	void HandleOnMatchStartActive(bool Is_active);
	void FocusCurrentWidget();
	void RequestResetToDefaults();
	void RequestExit();
	void OnDismissExcuded(ECADialogueResult Results);
	void OnDismissAlreadyBound(ECADialogueResult Results);
	void OnInputSelected();
	void OnDiscardChanges(ECADialogueResult Results);
	void OnShowExitGame(ECADialogueResult Results);
	void BndEvt__exit_game_btn_K2Node_ComponentBoundEvent_2_UIElementSelected__DelegateSignature(class UCABaseUIElement* button);
	void RequestPermissionToLeave();
	void BndEvt__back_btn_1_K2Node_ComponentBoundEvent_1_UIElementSelected__DelegateSignature(class UCABaseUIElement* button);
	void BndEvt__back_btn_K2Node_ComponentBoundEvent_0_UIElementSelected__DelegateSignature(class UCABaseUIElement* button);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnPaawnChanged(class APawn* NewPawn);
	void HidePauseMenu();
	void Construct();
	void CloseKeyRebindsOverlayPanel();
	void ShowKeyRebindsOverlayPanel();
	void OnOptionSelected(const struct FGameplayTag& Tag);
	void SocialParty_Pressed();
	void OnTabChanged(class FName Id, bool Has_entries);
	void Inventory_Pressed();
	void ControllerMapSecondaryTab_Pressed();
	void KeyBindingSecondaryTab_Pressed();
	void SetOptionCategory();
	void SwitchWidget(int32 Menu_index);
	void HidePreviousMenu();
	void ShowCurrentMenu();
	void PrimaryNavLeft();
	void PrimaryNavRight();
	void SecondaryNavLeft();
	void SecondaryNavRight();
	void CacheSubscreensIndices();

	bool IsInventoryTabOpen() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_HUD_PauseMenu_C">();
	}
	static class UBPUI_HUD_PauseMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_HUD_PauseMenu_C>();
	}
};
static_assert(alignof(UBPUI_HUD_PauseMenu_C) == 0x000008, "Wrong alignment on UBPUI_HUD_PauseMenu_C");
static_assert(sizeof(UBPUI_HUD_PauseMenu_C) == 0x000638, "Wrong size on UBPUI_HUD_PauseMenu_C");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, UberGraphFrame) == 0x000570, "Member 'UBPUI_HUD_PauseMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, back_btn) == 0x000578, "Member 'UBPUI_HUD_PauseMenu_C::back_btn' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, blackBg) == 0x000580, "Member 'UBPUI_HUD_PauseMenu_C::blackBg' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, BPUI_HUD_ControlScheme) == 0x000588, "Member 'UBPUI_HUD_PauseMenu_C::BPUI_HUD_ControlScheme' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, BPUI_HUD_Options) == 0x000590, "Member 'UBPUI_HUD_PauseMenu_C::BPUI_HUD_Options' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, BPUI_HUD_SocialPartyContainer) == 0x000598, "Member 'UBPUI_HUD_PauseMenu_C::BPUI_HUD_SocialPartyContainer' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, BPUI_InventoryContainer_234) == 0x0005A0, "Member 'UBPUI_HUD_PauseMenu_C::BPUI_InventoryContainer_234' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, Exit_game_btn) == 0x0005A8, "Member 'UBPUI_HUD_PauseMenu_C::Exit_game_btn' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, Input_overlay) == 0x0005B0, "Member 'UBPUI_HUD_PauseMenu_C::Input_overlay' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, Input_panel) == 0x0005B8, "Member 'UBPUI_HUD_PauseMenu_C::Input_panel' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, Notification_box) == 0x0005C0, "Member 'UBPUI_HUD_PauseMenu_C::Notification_box' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, Pause_screen_switcher) == 0x0005C8, "Member 'UBPUI_HUD_PauseMenu_C::Pause_screen_switcher' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, Reset_to_defaults_btn) == 0x0005D0, "Member 'UBPUI_HUD_PauseMenu_C::Reset_to_defaults_btn' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, Return_to_menu_btn) == 0x0005D8, "Member 'UBPUI_HUD_PauseMenu_C::Return_to_menu_btn' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, Save_options_btn) == 0x0005E0, "Member 'UBPUI_HUD_PauseMenu_C::Save_options_btn' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, Skip_tutorial) == 0x0005E8, "Member 'UBPUI_HUD_PauseMenu_C::Skip_tutorial' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, Current_widget_index) == 0x0005F0, "Member 'UBPUI_HUD_PauseMenu_C::Current_widget_index' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, OwningController) == 0x0005F8, "Member 'UBPUI_HUD_PauseMenu_C::OwningController' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, PermissionToLeave) == 0x000600, "Member 'UBPUI_HUD_PauseMenu_C::PermissionToLeave' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, IsShown) == 0x000610, "Member 'UBPUI_HUD_PauseMenu_C::IsShown' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, Current_primary_index) == 0x000614, "Member 'UBPUI_HUD_PauseMenu_C::Current_primary_index' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, Current_secondary_index) == 0x000618, "Member 'UBPUI_HUD_PauseMenu_C::Current_secondary_index' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, Action_in_flight) == 0x00061C, "Member 'UBPUI_HUD_PauseMenu_C::Action_in_flight' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, Is_match_start_active) == 0x00061D, "Member 'UBPUI_HUD_PauseMenu_C::Is_match_start_active' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, Inventory_ind) == 0x000620, "Member 'UBPUI_HUD_PauseMenu_C::Inventory_ind' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, Options_ind) == 0x000624, "Member 'UBPUI_HUD_PauseMenu_C::Options_ind' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, Keybindings_ind) == 0x000628, "Member 'UBPUI_HUD_PauseMenu_C::Keybindings_ind' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, Control_ind) == 0x00062C, "Member 'UBPUI_HUD_PauseMenu_C::Control_ind' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, Social_party_ind) == 0x000630, "Member 'UBPUI_HUD_PauseMenu_C::Social_party_ind' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenu_C, Auto_save_on_exit) == 0x000634, "Member 'UBPUI_HUD_PauseMenu_C::Auto_save_on_exit' has a wrong offset!");

}

