#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_InputDisplayWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Keaton_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_HUD_InputDisplayWidget.BPUI_HUD_InputDisplayWidget_C
// 0x00A0 (0x0558 - 0x04B8)
class UBPUI_HUD_InputDisplayWidget_C final : public UCAHUDInputDisplayWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Success_anim_PC;                                   // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Start_anim_PC;                                     // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Success_anim_console;                              // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Start_anim_console;                                // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CircleBG;                                          // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CircleProgression;                                 // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CircleStroke;                                      // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CircleSuccess_anim;                                // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SquareProgression;                                 // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SquareStroke;                                      // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SquareSuccess_anim;                                // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlaySlot*                           InputTxtOverlaySlot;                               // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ConsoleProgressMat;                                // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PcProgressMat;                                     // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timer;                                             // 0x0530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         End_Animation_Playback_Speed;                      // 0x0534(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               bndBorderMat;                                      // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           StyleColour;                                       // 0x0540(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           EndTimerHandle;                                    // 0x0550(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPUI_HUD_InputDisplayWidget(int32 EntryPoint);
	void OnStyleUpdated(ECAHUDInputDisplayStyle Input_style);
	void OnProgressHoldRequiredChanged();
	void OnProgressEnded(bool Is_successful);
	void OnProgressStarted();
	void PreConstruct(bool IsDesignTime);
	void OnFeedbackAnimationComplete();
	void OnProgressUpdated(float Progress);
	void Construct();
	void OnInputChanged();
	void SetCorrectInputDisplay();
	void SetImageStyleColour(class UImage* Image);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_HUD_InputDisplayWidget_C">();
	}
	static class UBPUI_HUD_InputDisplayWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_HUD_InputDisplayWidget_C>();
	}
};
static_assert(alignof(UBPUI_HUD_InputDisplayWidget_C) == 0x000008, "Wrong alignment on UBPUI_HUD_InputDisplayWidget_C");
static_assert(sizeof(UBPUI_HUD_InputDisplayWidget_C) == 0x000558, "Wrong size on UBPUI_HUD_InputDisplayWidget_C");
static_assert(offsetof(UBPUI_HUD_InputDisplayWidget_C, UberGraphFrame) == 0x0004B8, "Member 'UBPUI_HUD_InputDisplayWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_InputDisplayWidget_C, Success_anim_PC) == 0x0004C0, "Member 'UBPUI_HUD_InputDisplayWidget_C::Success_anim_PC' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_InputDisplayWidget_C, Start_anim_PC) == 0x0004C8, "Member 'UBPUI_HUD_InputDisplayWidget_C::Start_anim_PC' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_InputDisplayWidget_C, Success_anim_console) == 0x0004D0, "Member 'UBPUI_HUD_InputDisplayWidget_C::Success_anim_console' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_InputDisplayWidget_C, Start_anim_console) == 0x0004D8, "Member 'UBPUI_HUD_InputDisplayWidget_C::Start_anim_console' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_InputDisplayWidget_C, CircleBG) == 0x0004E0, "Member 'UBPUI_HUD_InputDisplayWidget_C::CircleBG' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_InputDisplayWidget_C, CircleProgression) == 0x0004E8, "Member 'UBPUI_HUD_InputDisplayWidget_C::CircleProgression' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_InputDisplayWidget_C, CircleStroke) == 0x0004F0, "Member 'UBPUI_HUD_InputDisplayWidget_C::CircleStroke' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_InputDisplayWidget_C, CircleSuccess_anim) == 0x0004F8, "Member 'UBPUI_HUD_InputDisplayWidget_C::CircleSuccess_anim' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_InputDisplayWidget_C, SquareProgression) == 0x000500, "Member 'UBPUI_HUD_InputDisplayWidget_C::SquareProgression' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_InputDisplayWidget_C, SquareStroke) == 0x000508, "Member 'UBPUI_HUD_InputDisplayWidget_C::SquareStroke' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_InputDisplayWidget_C, SquareSuccess_anim) == 0x000510, "Member 'UBPUI_HUD_InputDisplayWidget_C::SquareSuccess_anim' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_InputDisplayWidget_C, InputTxtOverlaySlot) == 0x000518, "Member 'UBPUI_HUD_InputDisplayWidget_C::InputTxtOverlaySlot' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_InputDisplayWidget_C, ConsoleProgressMat) == 0x000520, "Member 'UBPUI_HUD_InputDisplayWidget_C::ConsoleProgressMat' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_InputDisplayWidget_C, PcProgressMat) == 0x000528, "Member 'UBPUI_HUD_InputDisplayWidget_C::PcProgressMat' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_InputDisplayWidget_C, Timer) == 0x000530, "Member 'UBPUI_HUD_InputDisplayWidget_C::Timer' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_InputDisplayWidget_C, End_Animation_Playback_Speed) == 0x000534, "Member 'UBPUI_HUD_InputDisplayWidget_C::End_Animation_Playback_Speed' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_InputDisplayWidget_C, bndBorderMat) == 0x000538, "Member 'UBPUI_HUD_InputDisplayWidget_C::bndBorderMat' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_InputDisplayWidget_C, StyleColour) == 0x000540, "Member 'UBPUI_HUD_InputDisplayWidget_C::StyleColour' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_InputDisplayWidget_C, EndTimerHandle) == 0x000550, "Member 'UBPUI_HUD_InputDisplayWidget_C::EndTimerHandle' has a wrong offset!");

}

