#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_PingRadialSlot

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPUI_HUD_PingRadialSlot.BPUI_HUD_PingRadialSlot_C.ExecuteUbergraph_BPUI_HUD_PingRadialSlot
// 0x0028 (0x0028 - 0x0000)
struct BPUI_HUD_PingRadialSlot_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_is_focused;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRenderTransformAngle_ReturnValue;      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_PingRadialSlot_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlot) == 0x000008, "Wrong alignment on BPUI_HUD_PingRadialSlot_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlot");
static_assert(sizeof(BPUI_HUD_PingRadialSlot_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlot) == 0x000028, "Wrong size on BPUI_HUD_PingRadialSlot_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlot");
static_assert(offsetof(BPUI_HUD_PingRadialSlot_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlot, EntryPoint) == 0x000000, "Member 'BPUI_HUD_PingRadialSlot_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PingRadialSlot_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlot, K2Node_Event_is_focused) == 0x000004, "Member 'BPUI_HUD_PingRadialSlot_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlot::K2Node_Event_is_focused' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PingRadialSlot_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlot, CallFunc_GetRenderTransformAngle_ReturnValue) == 0x000008, "Member 'BPUI_HUD_PingRadialSlot_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlot::CallFunc_GetRenderTransformAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PingRadialSlot_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlot, K2Node_Event_IsDesignTime) == 0x00000C, "Member 'BPUI_HUD_PingRadialSlot_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlot::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PingRadialSlot_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlot, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'BPUI_HUD_PingRadialSlot_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlot::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PingRadialSlot_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlot, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'BPUI_HUD_PingRadialSlot_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlot::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PingRadialSlot_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlot, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'BPUI_HUD_PingRadialSlot_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlot::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function BPUI_HUD_PingRadialSlot.BPUI_HUD_PingRadialSlot_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BPUI_HUD_PingRadialSlot_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPUI_HUD_PingRadialSlot_C_PreConstruct) == 0x000001, "Wrong alignment on BPUI_HUD_PingRadialSlot_C_PreConstruct");
static_assert(sizeof(BPUI_HUD_PingRadialSlot_C_PreConstruct) == 0x000001, "Wrong size on BPUI_HUD_PingRadialSlot_C_PreConstruct");
static_assert(offsetof(BPUI_HUD_PingRadialSlot_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BPUI_HUD_PingRadialSlot_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BPUI_HUD_PingRadialSlot.BPUI_HUD_PingRadialSlot_C.SetFocusedState
// 0x0001 (0x0001 - 0x0000)
struct BPUI_HUD_PingRadialSlot_C_SetFocusedState final
{
public:
	bool                                          Is_focused;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPUI_HUD_PingRadialSlot_C_SetFocusedState) == 0x000001, "Wrong alignment on BPUI_HUD_PingRadialSlot_C_SetFocusedState");
static_assert(sizeof(BPUI_HUD_PingRadialSlot_C_SetFocusedState) == 0x000001, "Wrong size on BPUI_HUD_PingRadialSlot_C_SetFocusedState");
static_assert(offsetof(BPUI_HUD_PingRadialSlot_C_SetFocusedState, Is_focused) == 0x000000, "Member 'BPUI_HUD_PingRadialSlot_C_SetFocusedState::Is_focused' has a wrong offset!");

}

