#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUDVideoWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPUI_HUDVideoWidget.BPUI_HUDVideoWidget_C.ExecuteUbergraph_BPUI_HUDVideoWidget
// 0x0060 (0x0060 - 0x0000)
struct BPUI_HUDVideoWidget_C_ExecuteUbergraph_BPUI_HUDVideoWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0014)(ZeroConstructor, NoDestructor)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPUI_HUDVideoWidget_C_ExecuteUbergraph_BPUI_HUDVideoWidget) == 0x000008, "Wrong alignment on BPUI_HUDVideoWidget_C_ExecuteUbergraph_BPUI_HUDVideoWidget");
static_assert(sizeof(BPUI_HUDVideoWidget_C_ExecuteUbergraph_BPUI_HUDVideoWidget) == 0x000060, "Wrong size on BPUI_HUDVideoWidget_C_ExecuteUbergraph_BPUI_HUDVideoWidget");
static_assert(offsetof(BPUI_HUDVideoWidget_C_ExecuteUbergraph_BPUI_HUDVideoWidget, EntryPoint) == 0x000000, "Member 'BPUI_HUDVideoWidget_C_ExecuteUbergraph_BPUI_HUDVideoWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_HUDVideoWidget_C_ExecuteUbergraph_BPUI_HUDVideoWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BPUI_HUDVideoWidget_C_ExecuteUbergraph_BPUI_HUDVideoWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPUI_HUDVideoWidget_C_ExecuteUbergraph_BPUI_HUDVideoWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'BPUI_HUDVideoWidget_C_ExecuteUbergraph_BPUI_HUDVideoWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUDVideoWidget_C_ExecuteUbergraph_BPUI_HUDVideoWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'BPUI_HUDVideoWidget_C_ExecuteUbergraph_BPUI_HUDVideoWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUDVideoWidget_C_ExecuteUbergraph_BPUI_HUDVideoWidget, K2Node_ComponentBoundEvent_button) == 0x000040, "Member 'BPUI_HUDVideoWidget_C_ExecuteUbergraph_BPUI_HUDVideoWidget::K2Node_ComponentBoundEvent_button' has a wrong offset!");
static_assert(offsetof(BPUI_HUDVideoWidget_C_ExecuteUbergraph_BPUI_HUDVideoWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000048, "Member 'BPUI_HUDVideoWidget_C_ExecuteUbergraph_BPUI_HUDVideoWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUDVideoWidget_C_ExecuteUbergraph_BPUI_HUDVideoWidget, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000050, "Member 'BPUI_HUDVideoWidget_C_ExecuteUbergraph_BPUI_HUDVideoWidget::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUDVideoWidget_C_ExecuteUbergraph_BPUI_HUDVideoWidget, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BPUI_HUDVideoWidget_C_ExecuteUbergraph_BPUI_HUDVideoWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUDVideoWidget_C_ExecuteUbergraph_BPUI_HUDVideoWidget, CallFunc_IsValid_ReturnValue_1) == 0x000059, "Member 'BPUI_HUDVideoWidget_C_ExecuteUbergraph_BPUI_HUDVideoWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BPUI_HUDVideoWidget.BPUI_HUDVideoWidget_C.BndEvt__BPUI_HUDVideoWidget_skip_btn_K2Node_ComponentBoundEvent_1_UIElementSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPUI_HUDVideoWidget_C_BndEvt__BPUI_HUDVideoWidget_skip_btn_K2Node_ComponentBoundEvent_1_UIElementSelected__DelegateSignature final
{
public:
	class UCABaseUIElement*                       button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUDVideoWidget_C_BndEvt__BPUI_HUDVideoWidget_skip_btn_K2Node_ComponentBoundEvent_1_UIElementSelected__DelegateSignature) == 0x000008, "Wrong alignment on BPUI_HUDVideoWidget_C_BndEvt__BPUI_HUDVideoWidget_skip_btn_K2Node_ComponentBoundEvent_1_UIElementSelected__DelegateSignature");
static_assert(sizeof(BPUI_HUDVideoWidget_C_BndEvt__BPUI_HUDVideoWidget_skip_btn_K2Node_ComponentBoundEvent_1_UIElementSelected__DelegateSignature) == 0x000008, "Wrong size on BPUI_HUDVideoWidget_C_BndEvt__BPUI_HUDVideoWidget_skip_btn_K2Node_ComponentBoundEvent_1_UIElementSelected__DelegateSignature");
static_assert(offsetof(BPUI_HUDVideoWidget_C_BndEvt__BPUI_HUDVideoWidget_skip_btn_K2Node_ComponentBoundEvent_1_UIElementSelected__DelegateSignature, button) == 0x000000, "Member 'BPUI_HUDVideoWidget_C_BndEvt__BPUI_HUDVideoWidget_skip_btn_K2Node_ComponentBoundEvent_1_UIElementSelected__DelegateSignature::button' has a wrong offset!");

}

