#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_PrimaryMessageGenericWithSubheader

#include "Basic.hpp"

#include "Keaton_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BPUI_HUD_PrimaryMessageGenericWithSubheader.BPUI_HUD_PrimaryMessageGenericWithSubheader_C.ExecuteUbergraph_BPUI_HUD_PrimaryMessageGenericWithSubheader
// 0x0200 (0x0200 - 0x0000)
struct BPUI_HUD_PrimaryMessageGenericWithSubheader_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGenericWithSubheader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAPrimaryMessageTypesTableRow         CallFunc_GetMessageConfigData_ReturnValue;         // 0x0008(0x00D0)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAPrimaryMessagingData                CallFunc_GetMessagePayload_ReturnValue;            // 0x00E0(0x00E0)(ConstParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x01C0(0x0028)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01E8(0x0014)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BPUI_HUD_PrimaryMessageGenericWithSubheader_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGenericWithSubheader) == 0x000008, "Wrong alignment on BPUI_HUD_PrimaryMessageGenericWithSubheader_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGenericWithSubheader");
static_assert(sizeof(BPUI_HUD_PrimaryMessageGenericWithSubheader_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGenericWithSubheader) == 0x000200, "Wrong size on BPUI_HUD_PrimaryMessageGenericWithSubheader_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGenericWithSubheader");
static_assert(offsetof(BPUI_HUD_PrimaryMessageGenericWithSubheader_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGenericWithSubheader, EntryPoint) == 0x000000, "Member 'BPUI_HUD_PrimaryMessageGenericWithSubheader_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGenericWithSubheader::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PrimaryMessageGenericWithSubheader_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGenericWithSubheader, CallFunc_GetMessageConfigData_ReturnValue) == 0x000008, "Member 'BPUI_HUD_PrimaryMessageGenericWithSubheader_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGenericWithSubheader::CallFunc_GetMessageConfigData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PrimaryMessageGenericWithSubheader_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGenericWithSubheader, CallFunc_PlayAnimation_ReturnValue) == 0x0000D8, "Member 'BPUI_HUD_PrimaryMessageGenericWithSubheader_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGenericWithSubheader::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PrimaryMessageGenericWithSubheader_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGenericWithSubheader, CallFunc_GetMessagePayload_ReturnValue) == 0x0000E0, "Member 'BPUI_HUD_PrimaryMessageGenericWithSubheader_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGenericWithSubheader::CallFunc_GetMessagePayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PrimaryMessageGenericWithSubheader_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGenericWithSubheader, K2Node_MakeStruct_SlateColor) == 0x0001C0, "Member 'BPUI_HUD_PrimaryMessageGenericWithSubheader_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGenericWithSubheader::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PrimaryMessageGenericWithSubheader_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGenericWithSubheader, K2Node_CreateDelegate_OutputDelegate) == 0x0001E8, "Member 'BPUI_HUD_PrimaryMessageGenericWithSubheader_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGenericWithSubheader::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BPUI_HUD_PrimaryMessageGenericWithSubheader.BPUI_HUD_PrimaryMessageGenericWithSubheader_C.PlayFadeAnimation
// 0x0008 (0x0008 - 0x0000)
struct BPUI_HUD_PrimaryMessageGenericWithSubheader_C_PlayFadeAnimation final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_PrimaryMessageGenericWithSubheader_C_PlayFadeAnimation) == 0x000008, "Wrong alignment on BPUI_HUD_PrimaryMessageGenericWithSubheader_C_PlayFadeAnimation");
static_assert(sizeof(BPUI_HUD_PrimaryMessageGenericWithSubheader_C_PlayFadeAnimation) == 0x000008, "Wrong size on BPUI_HUD_PrimaryMessageGenericWithSubheader_C_PlayFadeAnimation");
static_assert(offsetof(BPUI_HUD_PrimaryMessageGenericWithSubheader_C_PlayFadeAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'BPUI_HUD_PrimaryMessageGenericWithSubheader_C_PlayFadeAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

