#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_InventoryContainer

#include "Basic.hpp"

#include "CALocalisationRuntime_structs.hpp"


namespace SDK::Params
{

// Function BPUI_InventoryContainer.BPUI_InventoryContainer_C.ExecuteUbergraph_BPUI_InventoryContainer
// 0x0038 (0x0038 - 0x0000)
struct BPUI_InventoryContainer_C_ExecuteUbergraph_BPUI_InventoryContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAText                                CallFunc_GetTitle_ReturnValue;                     // 0x0008(0x0030)()
};
static_assert(alignof(BPUI_InventoryContainer_C_ExecuteUbergraph_BPUI_InventoryContainer) == 0x000008, "Wrong alignment on BPUI_InventoryContainer_C_ExecuteUbergraph_BPUI_InventoryContainer");
static_assert(sizeof(BPUI_InventoryContainer_C_ExecuteUbergraph_BPUI_InventoryContainer) == 0x000038, "Wrong size on BPUI_InventoryContainer_C_ExecuteUbergraph_BPUI_InventoryContainer");
static_assert(offsetof(BPUI_InventoryContainer_C_ExecuteUbergraph_BPUI_InventoryContainer, EntryPoint) == 0x000000, "Member 'BPUI_InventoryContainer_C_ExecuteUbergraph_BPUI_InventoryContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_InventoryContainer_C_ExecuteUbergraph_BPUI_InventoryContainer, CallFunc_GetTitle_ReturnValue) == 0x000008, "Member 'BPUI_InventoryContainer_C_ExecuteUbergraph_BPUI_InventoryContainer::CallFunc_GetTitle_ReturnValue' has a wrong offset!");

// Function BPUI_InventoryContainer.BPUI_InventoryContainer_C.CaptureInput
// 0x0014 (0x0014 - 0x0000)
struct BPUI_InventoryContainer_C_CaptureInput final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0014)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BPUI_InventoryContainer_C_CaptureInput) == 0x000004, "Wrong alignment on BPUI_InventoryContainer_C_CaptureInput");
static_assert(sizeof(BPUI_InventoryContainer_C_CaptureInput) == 0x000014, "Wrong size on BPUI_InventoryContainer_C_CaptureInput");
static_assert(offsetof(BPUI_InventoryContainer_C_CaptureInput, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BPUI_InventoryContainer_C_CaptureInput::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

}

