#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_TeleportMap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_TeleportMap.BPUI_TeleportMap_C
// 0x0018 (0x06D0 - 0x06B8)
class UBPUI_TeleportMap_C final : public UCAHUDTeleportMapWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CursorAnim;                                        // 0x06C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            NoMovementEffectHandle;                            // 0x06C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPUI_TeleportMap(int32 EntryPoint);
	void OnInvalidDestinationHovered();
	void OnValidDestinationHovered();
	void OnInvalidDestination();
	void OnValidDestination();
	void OnInputModeChanged(bool Is_gamepad);
	void OnHide();
	void OnShow();
	void CaptureInput();
	void ReleaseInput();
	void ToggleVisibility(bool IsVisible_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_TeleportMap_C">();
	}
	static class UBPUI_TeleportMap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_TeleportMap_C>();
	}
};
static_assert(alignof(UBPUI_TeleportMap_C) == 0x000008, "Wrong alignment on UBPUI_TeleportMap_C");
static_assert(sizeof(UBPUI_TeleportMap_C) == 0x0006D0, "Wrong size on UBPUI_TeleportMap_C");
static_assert(offsetof(UBPUI_TeleportMap_C, UberGraphFrame) == 0x0006B8, "Member 'UBPUI_TeleportMap_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_TeleportMap_C, CursorAnim) == 0x0006C0, "Member 'UBPUI_TeleportMap_C::CursorAnim' has a wrong offset!");
static_assert(offsetof(UBPUI_TeleportMap_C, NoMovementEffectHandle) == 0x0006C8, "Member 'UBPUI_TeleportMap_C::NoMovementEffectHandle' has a wrong offset!");

}

