#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_CampLegend

#include "Basic.hpp"

#include "BPUI_HUD_MapZoneIconBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_HUD_CampLegend.BPUI_HUD_CampLegend_C
// 0x00A0 (0x0570 - 0x04D0)
class UBPUI_HUD_CampLegend_C final : public UBPUI_HUD_MapZoneIconBase_C
{
public:
	class UImage*                                 Camp_icon;                                         // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Camp_icon_1;                                       // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_1;                                            // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_2;                                            // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_3;                                            // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_4;                                            // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_5;                                            // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_6;                                            // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_12;                                           // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_13;                                           // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_14;                                           // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_15;                                           // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Left_keyline;                                      // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Left_keyline_1;                                    // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lower_boundary;                                    // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lower_boundary_1;                                  // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Right_keyline;                                     // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Right_keyline_1;                                   // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Upper_boundary;                                    // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Upper_boundary_1;                                  // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_HUD_CampLegend_C">();
	}
	static class UBPUI_HUD_CampLegend_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_HUD_CampLegend_C>();
	}
};
static_assert(alignof(UBPUI_HUD_CampLegend_C) == 0x000008, "Wrong alignment on UBPUI_HUD_CampLegend_C");
static_assert(sizeof(UBPUI_HUD_CampLegend_C) == 0x000570, "Wrong size on UBPUI_HUD_CampLegend_C");
static_assert(offsetof(UBPUI_HUD_CampLegend_C, Camp_icon) == 0x0004D0, "Member 'UBPUI_HUD_CampLegend_C::Camp_icon' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_CampLegend_C, Camp_icon_1) == 0x0004D8, "Member 'UBPUI_HUD_CampLegend_C::Camp_icon_1' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_CampLegend_C, Icon_1) == 0x0004E0, "Member 'UBPUI_HUD_CampLegend_C::Icon_1' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_CampLegend_C, Icon_2) == 0x0004E8, "Member 'UBPUI_HUD_CampLegend_C::Icon_2' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_CampLegend_C, Icon_3) == 0x0004F0, "Member 'UBPUI_HUD_CampLegend_C::Icon_3' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_CampLegend_C, Icon_4) == 0x0004F8, "Member 'UBPUI_HUD_CampLegend_C::Icon_4' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_CampLegend_C, Icon_5) == 0x000500, "Member 'UBPUI_HUD_CampLegend_C::Icon_5' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_CampLegend_C, Icon_6) == 0x000508, "Member 'UBPUI_HUD_CampLegend_C::Icon_6' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_CampLegend_C, Icon_12) == 0x000510, "Member 'UBPUI_HUD_CampLegend_C::Icon_12' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_CampLegend_C, Icon_13) == 0x000518, "Member 'UBPUI_HUD_CampLegend_C::Icon_13' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_CampLegend_C, Icon_14) == 0x000520, "Member 'UBPUI_HUD_CampLegend_C::Icon_14' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_CampLegend_C, Icon_15) == 0x000528, "Member 'UBPUI_HUD_CampLegend_C::Icon_15' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_CampLegend_C, Left_keyline) == 0x000530, "Member 'UBPUI_HUD_CampLegend_C::Left_keyline' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_CampLegend_C, Left_keyline_1) == 0x000538, "Member 'UBPUI_HUD_CampLegend_C::Left_keyline_1' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_CampLegend_C, Lower_boundary) == 0x000540, "Member 'UBPUI_HUD_CampLegend_C::Lower_boundary' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_CampLegend_C, Lower_boundary_1) == 0x000548, "Member 'UBPUI_HUD_CampLegend_C::Lower_boundary_1' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_CampLegend_C, Right_keyline) == 0x000550, "Member 'UBPUI_HUD_CampLegend_C::Right_keyline' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_CampLegend_C, Right_keyline_1) == 0x000558, "Member 'UBPUI_HUD_CampLegend_C::Right_keyline_1' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_CampLegend_C, Upper_boundary) == 0x000560, "Member 'UBPUI_HUD_CampLegend_C::Upper_boundary' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_CampLegend_C, Upper_boundary_1) == 0x000568, "Member 'UBPUI_HUD_CampLegend_C::Upper_boundary_1' has a wrong offset!");

}

