#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_NotificationBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CALocalisationRuntime_structs.hpp"
#include "Keaton_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CAAudio_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BPUI_HUD_NotificationBox.BPUI_HUD_NotificationBox_C.OnDismiss__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BPUI_HUD_NotificationBox_C_OnDismiss__DelegateSignature final
{
public:
	ECADialogueResult                             Results;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_NotificationBox_C_OnDismiss__DelegateSignature) == 0x000001, "Wrong alignment on BPUI_HUD_NotificationBox_C_OnDismiss__DelegateSignature");
static_assert(sizeof(BPUI_HUD_NotificationBox_C_OnDismiss__DelegateSignature) == 0x000001, "Wrong size on BPUI_HUD_NotificationBox_C_OnDismiss__DelegateSignature");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_OnDismiss__DelegateSignature, Results) == 0x000000, "Member 'BPUI_HUD_NotificationBox_C_OnDismiss__DelegateSignature::Results' has a wrong offset!");

// Function BPUI_HUD_NotificationBox.BPUI_HUD_NotificationBox_C.ExecuteUbergraph_BPUI_HUD_NotificationBox
// 0x0640 (0x0640 - 0x0000)
struct BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCurrentCategoryDisplayText_ReturnValue; // 0x0008(0x0018)()
	class FName                                   K2Node_CustomEvent_id;                             // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_text_to_inject_1;               // 0x0030(0x0018)()
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_2;               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetMessage_message;                       // 0x0050(0x0018)()
	bool                                          CallFunc_GetMessage_success;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetContendedKeyDisplayName_ReturnValue;   // 0x0070(0x0018)()
	class FText                                   CallFunc_GetCurrentlyBoundActionDisplayName_ReturnValue; // 0x0088(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00A0(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00E0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0120(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0130(0x0018)()
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0148(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetMessage_message_1;                     // 0x0160(0x0018)()
	bool                                          CallFunc_GetMessage_success_1;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetContendedKeyDisplayName_ReturnValue_1; // 0x0180(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0198(0x0040)(HasGetValueTypeHash)
	ECADialogueResult                             K2Node_CustomEvent_results;                        // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x01DC(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_2;                          // 0x01F0(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAText                                K2Node_CustomEvent_CAText_1;                       // 0x0208(0x0030)()
	struct FCAText                                K2Node_CustomEvent_CAText;                         // 0x0238(0x0030)()
	class FText                                   K2Node_CustomEvent_text_to_inject;                 // 0x0268(0x0018)()
	class FText                                   CallFunc_MakeTextFromCAText_text;                  // 0x0280(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0298(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x02D8(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x02F0(0x0010)(ReferenceParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeTextFromCAText_text_1;                // 0x0308(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0320(0x0018)()
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_3;                          // 0x0338(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_1;               // 0x0350(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCADialogueTableRow                    CallFunc_Map_Find_Value;                           // 0x0358(0x01A8)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAPlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAPlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue_1;   // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0518(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x0530(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button;                 // 0x0548(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAPlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue_2;   // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAPlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue_3;   // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_2;            // 0x0560(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_2;                 // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_571[0x7];                                      // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_3;            // 0x0578(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_3;                 // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_589[0x7];                                      // 0x0589(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0590(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x05D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x05E0(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x05F8(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x060C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0620(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_634[0x4];                                      // 0x0634(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox) == 0x000008, "Wrong alignment on BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox");
static_assert(sizeof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox) == 0x000640, "Wrong size on BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, EntryPoint) == 0x000000, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_GetCurrentCategoryDisplayText_ReturnValue) == 0x000008, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_GetCurrentCategoryDisplayText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, K2Node_CustomEvent_id) == 0x000020, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::K2Node_CustomEvent_id' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, K2Node_CustomEvent_text_to_inject_1) == 0x000030, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::K2Node_CustomEvent_text_to_inject_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, K2Node_ComponentBoundEvent_button_2) == 0x000048, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::K2Node_ComponentBoundEvent_button_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_GetMessage_message) == 0x000050, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_GetMessage_message' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_GetMessage_success) == 0x000068, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_GetMessage_success' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_GetContendedKeyDisplayName_ReturnValue) == 0x000070, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_GetContendedKeyDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_GetCurrentlyBoundActionDisplayName_ReturnValue) == 0x000088, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_GetCurrentlyBoundActionDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, K2Node_MakeStruct_FormatArgumentData) == 0x0000A0, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000E0, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, K2Node_MakeArray_Array) == 0x000120, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_Format_ReturnValue) == 0x000130, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, Temp_delegate_Variable) == 0x000148, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_GetMessage_message_1) == 0x000160, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_GetMessage_message_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_GetMessage_success_1) == 0x000178, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_GetMessage_success_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_GetContendedKeyDisplayName_ReturnValue_1) == 0x000180, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_GetContendedKeyDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, K2Node_MakeStruct_FormatArgumentData_2) == 0x000198, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, K2Node_CustomEvent_results) == 0x0001D8, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::K2Node_CustomEvent_results' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, Temp_delegate_Variable_1) == 0x0001DC, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, Temp_delegate_Variable_2) == 0x0001F0, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, K2Node_CustomEvent_CAText_1) == 0x000208, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::K2Node_CustomEvent_CAText_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, K2Node_CustomEvent_CAText) == 0x000238, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::K2Node_CustomEvent_CAText' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, K2Node_CustomEvent_text_to_inject) == 0x000268, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::K2Node_CustomEvent_text_to_inject' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_MakeTextFromCAText_text) == 0x000280, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_MakeTextFromCAText_text' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, K2Node_MakeStruct_FormatArgumentData_3) == 0x000298, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_TextToUpper_ReturnValue) == 0x0002D8, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, K2Node_MakeArray_Array_1) == 0x0002F0, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_TextIsEmpty_ReturnValue) == 0x000300, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_MakeTextFromCAText_text_1) == 0x000308, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_MakeTextFromCAText_text_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_Format_ReturnValue_1) == 0x000320, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, Temp_delegate_Variable_3) == 0x000338, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, K2Node_ComponentBoundEvent_button_1) == 0x000350, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::K2Node_ComponentBoundEvent_button_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_Map_Find_Value) == 0x000358, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_Map_Find_ReturnValue) == 0x000500, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000508, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_GetLocalPlayerController_ReturnValue_1) == 0x000510, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_GetLocalPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_PlayEvent_playback_instance) == 0x000518, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_PlayEvent_play_success) == 0x000528, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_PlayEvent_playback_instance_1) == 0x000530, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_PlayEvent_play_success_1) == 0x000540, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_PlayEvent_play_success_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, K2Node_ComponentBoundEvent_button) == 0x000548, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::K2Node_ComponentBoundEvent_button' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_GetLocalPlayerController_ReturnValue_2) == 0x000550, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_GetLocalPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_GetLocalPlayerController_ReturnValue_3) == 0x000558, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_GetLocalPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_PlayEvent_playback_instance_2) == 0x000560, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_PlayEvent_playback_instance_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_PlayEvent_play_success_2) == 0x000570, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_PlayEvent_play_success_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_PlayEvent_playback_instance_3) == 0x000578, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_PlayEvent_playback_instance_3' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_PlayEvent_play_success_3) == 0x000588, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_PlayEvent_play_success_3' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, K2Node_MakeStruct_FormatArgumentData_4) == 0x000590, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, K2Node_MakeArray_Array_2) == 0x0005D0, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_Format_ReturnValue_2) == 0x0005E0, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, K2Node_CreateDelegate_OutputDelegate) == 0x0005F8, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, K2Node_CreateDelegate_OutputDelegate_1) == 0x00060C, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, K2Node_CreateDelegate_OutputDelegate_2) == 0x000620, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox, CallFunc_PlayAnimation_ReturnValue) == 0x000638, "Member 'BPUI_HUD_NotificationBox_C_ExecuteUbergraph_BPUI_HUD_NotificationBox::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BPUI_HUD_NotificationBox.BPUI_HUD_NotificationBox_C.BndEvt__confirm_button_K2Node_ComponentBoundEvent_0_UIElementSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPUI_HUD_NotificationBox_C_BndEvt__confirm_button_K2Node_ComponentBoundEvent_0_UIElementSelected__DelegateSignature final
{
public:
	class UCABaseUIElement*                       button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_NotificationBox_C_BndEvt__confirm_button_K2Node_ComponentBoundEvent_0_UIElementSelected__DelegateSignature) == 0x000008, "Wrong alignment on BPUI_HUD_NotificationBox_C_BndEvt__confirm_button_K2Node_ComponentBoundEvent_0_UIElementSelected__DelegateSignature");
static_assert(sizeof(BPUI_HUD_NotificationBox_C_BndEvt__confirm_button_K2Node_ComponentBoundEvent_0_UIElementSelected__DelegateSignature) == 0x000008, "Wrong size on BPUI_HUD_NotificationBox_C_BndEvt__confirm_button_K2Node_ComponentBoundEvent_0_UIElementSelected__DelegateSignature");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_BndEvt__confirm_button_K2Node_ComponentBoundEvent_0_UIElementSelected__DelegateSignature, button) == 0x000000, "Member 'BPUI_HUD_NotificationBox_C_BndEvt__confirm_button_K2Node_ComponentBoundEvent_0_UIElementSelected__DelegateSignature::button' has a wrong offset!");

// Function BPUI_HUD_NotificationBox.BPUI_HUD_NotificationBox_C.BndEvt__BPUI_HUD_NotificationBox_third_option_button_K2Node_ComponentBoundEvent_2_UIElementSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPUI_HUD_NotificationBox_C_BndEvt__BPUI_HUD_NotificationBox_third_option_button_K2Node_ComponentBoundEvent_2_UIElementSelected__DelegateSignature final
{
public:
	class UCABaseUIElement*                       button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_NotificationBox_C_BndEvt__BPUI_HUD_NotificationBox_third_option_button_K2Node_ComponentBoundEvent_2_UIElementSelected__DelegateSignature) == 0x000008, "Wrong alignment on BPUI_HUD_NotificationBox_C_BndEvt__BPUI_HUD_NotificationBox_third_option_button_K2Node_ComponentBoundEvent_2_UIElementSelected__DelegateSignature");
static_assert(sizeof(BPUI_HUD_NotificationBox_C_BndEvt__BPUI_HUD_NotificationBox_third_option_button_K2Node_ComponentBoundEvent_2_UIElementSelected__DelegateSignature) == 0x000008, "Wrong size on BPUI_HUD_NotificationBox_C_BndEvt__BPUI_HUD_NotificationBox_third_option_button_K2Node_ComponentBoundEvent_2_UIElementSelected__DelegateSignature");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_BndEvt__BPUI_HUD_NotificationBox_third_option_button_K2Node_ComponentBoundEvent_2_UIElementSelected__DelegateSignature, button) == 0x000000, "Member 'BPUI_HUD_NotificationBox_C_BndEvt__BPUI_HUD_NotificationBox_third_option_button_K2Node_ComponentBoundEvent_2_UIElementSelected__DelegateSignature::button' has a wrong offset!");

// Function BPUI_HUD_NotificationBox.BPUI_HUD_NotificationBox_C.SetMsg
// 0x0048 (0x0048 - 0x0000)
struct BPUI_HUD_NotificationBox_C_SetMsg final
{
public:
	struct FCAText                                CAText;                                            // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Text_to_inject;                                    // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BPUI_HUD_NotificationBox_C_SetMsg) == 0x000008, "Wrong alignment on BPUI_HUD_NotificationBox_C_SetMsg");
static_assert(sizeof(BPUI_HUD_NotificationBox_C_SetMsg) == 0x000048, "Wrong size on BPUI_HUD_NotificationBox_C_SetMsg");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_SetMsg, CAText) == 0x000000, "Member 'BPUI_HUD_NotificationBox_C_SetMsg::CAText' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_SetMsg, Text_to_inject) == 0x000030, "Member 'BPUI_HUD_NotificationBox_C_SetMsg::Text_to_inject' has a wrong offset!");

// Function BPUI_HUD_NotificationBox.BPUI_HUD_NotificationBox_C.SetTitle
// 0x0030 (0x0030 - 0x0000)
struct BPUI_HUD_NotificationBox_C_SetTitle final
{
public:
	struct FCAText                                CAText;                                            // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BPUI_HUD_NotificationBox_C_SetTitle) == 0x000008, "Wrong alignment on BPUI_HUD_NotificationBox_C_SetTitle");
static_assert(sizeof(BPUI_HUD_NotificationBox_C_SetTitle) == 0x000030, "Wrong size on BPUI_HUD_NotificationBox_C_SetTitle");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_SetTitle, CAText) == 0x000000, "Member 'BPUI_HUD_NotificationBox_C_SetTitle::CAText' has a wrong offset!");

// Function BPUI_HUD_NotificationBox.BPUI_HUD_NotificationBox_C.Hide
// 0x0001 (0x0001 - 0x0000)
struct BPUI_HUD_NotificationBox_C_Hide final
{
public:
	ECADialogueResult                             Results;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_NotificationBox_C_Hide) == 0x000001, "Wrong alignment on BPUI_HUD_NotificationBox_C_Hide");
static_assert(sizeof(BPUI_HUD_NotificationBox_C_Hide) == 0x000001, "Wrong size on BPUI_HUD_NotificationBox_C_Hide");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_Hide, Results) == 0x000000, "Member 'BPUI_HUD_NotificationBox_C_Hide::Results' has a wrong offset!");

// Function BPUI_HUD_NotificationBox.BPUI_HUD_NotificationBox_C.SetFromData
// 0x0028 (0x0028 - 0x0000)
struct BPUI_HUD_NotificationBox_C_SetFromData final
{
public:
	class FName                                   Id;                                                // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text_to_inject;                                    // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BPUI_HUD_NotificationBox_C_SetFromData) == 0x000008, "Wrong alignment on BPUI_HUD_NotificationBox_C_SetFromData");
static_assert(sizeof(BPUI_HUD_NotificationBox_C_SetFromData) == 0x000028, "Wrong size on BPUI_HUD_NotificationBox_C_SetFromData");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_SetFromData, Id) == 0x000000, "Member 'BPUI_HUD_NotificationBox_C_SetFromData::Id' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_SetFromData, Text_to_inject) == 0x000010, "Member 'BPUI_HUD_NotificationBox_C_SetFromData::Text_to_inject' has a wrong offset!");

// Function BPUI_HUD_NotificationBox.BPUI_HUD_NotificationBox_C.BndEvt__cancel_button_K2Node_ComponentBoundEvent_1_UIElementSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPUI_HUD_NotificationBox_C_BndEvt__cancel_button_K2Node_ComponentBoundEvent_1_UIElementSelected__DelegateSignature final
{
public:
	class UCABaseUIElement*                       button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_NotificationBox_C_BndEvt__cancel_button_K2Node_ComponentBoundEvent_1_UIElementSelected__DelegateSignature) == 0x000008, "Wrong alignment on BPUI_HUD_NotificationBox_C_BndEvt__cancel_button_K2Node_ComponentBoundEvent_1_UIElementSelected__DelegateSignature");
static_assert(sizeof(BPUI_HUD_NotificationBox_C_BndEvt__cancel_button_K2Node_ComponentBoundEvent_1_UIElementSelected__DelegateSignature) == 0x000008, "Wrong size on BPUI_HUD_NotificationBox_C_BndEvt__cancel_button_K2Node_ComponentBoundEvent_1_UIElementSelected__DelegateSignature");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_BndEvt__cancel_button_K2Node_ComponentBoundEvent_1_UIElementSelected__DelegateSignature, button) == 0x000000, "Member 'BPUI_HUD_NotificationBox_C_BndEvt__cancel_button_K2Node_ComponentBoundEvent_1_UIElementSelected__DelegateSignature::button' has a wrong offset!");

// Function BPUI_HUD_NotificationBox.BPUI_HUD_NotificationBox_C.OnMouseButtonUp
// 0x0230 (0x0230 - 0x0000)
struct BPUI_HUD_NotificationBox_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00C0)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0170(0x00C0)()
};
static_assert(alignof(BPUI_HUD_NotificationBox_C_OnMouseButtonUp) == 0x000008, "Wrong alignment on BPUI_HUD_NotificationBox_C_OnMouseButtonUp");
static_assert(sizeof(BPUI_HUD_NotificationBox_C_OnMouseButtonUp) == 0x000230, "Wrong size on BPUI_HUD_NotificationBox_C_OnMouseButtonUp");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_OnMouseButtonUp, MyGeometry) == 0x000000, "Member 'BPUI_HUD_NotificationBox_C_OnMouseButtonUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_OnMouseButtonUp, MouseEvent) == 0x000038, "Member 'BPUI_HUD_NotificationBox_C_OnMouseButtonUp::MouseEvent' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_OnMouseButtonUp, ReturnValue) == 0x0000B0, "Member 'BPUI_HUD_NotificationBox_C_OnMouseButtonUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_OnMouseButtonUp, CallFunc_Handled_ReturnValue) == 0x000170, "Member 'BPUI_HUD_NotificationBox_C_OnMouseButtonUp::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function BPUI_HUD_NotificationBox.BPUI_HUD_NotificationBox_C.OnMouseButtonDown
// 0x0230 (0x0230 - 0x0000)
struct BPUI_HUD_NotificationBox_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00C0)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0170(0x00C0)()
};
static_assert(alignof(BPUI_HUD_NotificationBox_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on BPUI_HUD_NotificationBox_C_OnMouseButtonDown");
static_assert(sizeof(BPUI_HUD_NotificationBox_C_OnMouseButtonDown) == 0x000230, "Wrong size on BPUI_HUD_NotificationBox_C_OnMouseButtonDown");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'BPUI_HUD_NotificationBox_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'BPUI_HUD_NotificationBox_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'BPUI_HUD_NotificationBox_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000170, "Member 'BPUI_HUD_NotificationBox_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function BPUI_HUD_NotificationBox.BPUI_HUD_NotificationBox_C.GetMessage
// 0x01F8 (0x01F8 - 0x0000)
struct BPUI_HUD_NotificationBox_C_GetMessage final
{
public:
	class FName                                   Id;                                                // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Message;                                           // 0x0010(0x0018)(Parm, OutParm)
	bool                                          Success;                                           // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCADialogueTableRow                    CallFunc_Map_Find_Value;                           // 0x0030(0x01A8)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeTextFromCAText_text;                  // 0x01E0(0x0018)()
};
static_assert(alignof(BPUI_HUD_NotificationBox_C_GetMessage) == 0x000008, "Wrong alignment on BPUI_HUD_NotificationBox_C_GetMessage");
static_assert(sizeof(BPUI_HUD_NotificationBox_C_GetMessage) == 0x0001F8, "Wrong size on BPUI_HUD_NotificationBox_C_GetMessage");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_GetMessage, Id) == 0x000000, "Member 'BPUI_HUD_NotificationBox_C_GetMessage::Id' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_GetMessage, Message) == 0x000010, "Member 'BPUI_HUD_NotificationBox_C_GetMessage::Message' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_GetMessage, Success) == 0x000028, "Member 'BPUI_HUD_NotificationBox_C_GetMessage::Success' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_GetMessage, CallFunc_Map_Find_Value) == 0x000030, "Member 'BPUI_HUD_NotificationBox_C_GetMessage::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_GetMessage, CallFunc_Map_Find_ReturnValue) == 0x0001D8, "Member 'BPUI_HUD_NotificationBox_C_GetMessage::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_GetMessage, CallFunc_MakeTextFromCAText_text) == 0x0001E0, "Member 'BPUI_HUD_NotificationBox_C_GetMessage::CallFunc_MakeTextFromCAText_text' has a wrong offset!");

// Function BPUI_HUD_NotificationBox.BPUI_HUD_NotificationBox_C.ConfigureButton
// 0x0090 (0x0090 - 0x0000)
struct BPUI_HUD_NotificationBox_C_ConfigureButton final
{
public:
	class UCABaseHUDActionElement*                Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAText                                Ca_text;                                           // 0x0008(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FCAText                                Label_text;                                        // 0x0038(0x0030)(Edit, BlueprintVisible)
	class UCABaseHUDActionElement*                Target_button;                                     // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeTextFromCAText_text;                  // 0x0070(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCATextValid_ReturnValue;                // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPUI_HUD_NotificationBox_C_ConfigureButton) == 0x000008, "Wrong alignment on BPUI_HUD_NotificationBox_C_ConfigureButton");
static_assert(sizeof(BPUI_HUD_NotificationBox_C_ConfigureButton) == 0x000090, "Wrong size on BPUI_HUD_NotificationBox_C_ConfigureButton");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ConfigureButton, Target) == 0x000000, "Member 'BPUI_HUD_NotificationBox_C_ConfigureButton::Target' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ConfigureButton, Ca_text) == 0x000008, "Member 'BPUI_HUD_NotificationBox_C_ConfigureButton::Ca_text' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationBox_C_ConfigureButton, Label_text) == 0x000038, "Member 'BPUI_HUD_NotificationBox_C_ConfigureButton::Label_text' has a wrong offset!");
