#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_MatchEndWidget

#include "Basic.hpp"

#include "CAAudio_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Keaton_structs.hpp"


namespace SDK::Params
{

// Function BPUI_HUD_MatchEndWidget.BPUI_HUD_MatchEndWidget_C.ExecuteUbergraph_BPUI_HUD_MatchEndWidget
// 0x0170 (0x0170 - 0x0000)
struct BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0004(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x0018(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0030(0x0028)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0070(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0098(0x0028)()
	bool                                          Temp_bool_Variable;                                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00C4(0x0014)(ZeroConstructor, NoDestructor)
	class ACAPlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue;     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x00E8(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x0100(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECAEndGameReason                              CallFunc_GetEndGameReason_ReturnValue;             // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_113[0x5];                                      // 0x0113(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_2;                          // 0x0130(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_2;            // 0x0148(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_2;                 // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetTeamRank_ReturnValue;                  // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x015B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget) == 0x000008, "Wrong alignment on BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget");
static_assert(sizeof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget) == 0x000170, "Wrong size on BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, EntryPoint) == 0x000000, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, Temp_delegate_Variable) == 0x000004, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, Temp_delegate_Variable_1) == 0x000018, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, K2Node_MakeStruct_SlateColor) == 0x000030, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, K2Node_MakeStruct_SlateColor_1) == 0x000070, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, K2Node_MakeStruct_SlateColor_2) == 0x000098, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, Temp_bool_Variable) == 0x0000C0, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C4, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, CallFunc_GetLocalPlayerController_ReturnValue) == 0x0000D8, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000E0, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, CallFunc_PlayEvent_playback_instance) == 0x0000E8, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, CallFunc_PlayEvent_play_success) == 0x0000F8, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, CallFunc_PlayEvent_playback_instance_1) == 0x000100, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, CallFunc_PlayEvent_play_success_1) == 0x000110, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::CallFunc_PlayEvent_play_success_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, CallFunc_GetEndGameReason_ReturnValue) == 0x000111, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::CallFunc_GetEndGameReason_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000112, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000118, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, CallFunc_PlayAnimation_ReturnValue_1) == 0x000120, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, CallFunc_PlayAnimation_ReturnValue_2) == 0x000128, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, Temp_delegate_Variable_2) == 0x000130, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, CallFunc_PlayEvent_playback_instance_2) == 0x000148, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::CallFunc_PlayEvent_playback_instance_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, CallFunc_PlayEvent_play_success_2) == 0x000158, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::CallFunc_PlayEvent_play_success_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, CallFunc_GetTeamRank_ReturnValue) == 0x000159, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::CallFunc_GetTeamRank_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00015A, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, CallFunc_Not_PreBool_ReturnValue) == 0x00015B, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, CallFunc_BooleanAND_ReturnValue) == 0x00015C, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget, K2Node_Select_Default) == 0x000160, "Member 'BPUI_HUD_MatchEndWidget_C_ExecuteUbergraph_BPUI_HUD_MatchEndWidget::K2Node_Select_Default' has a wrong offset!");

}

