#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_WinnersScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_WinnersScreen.BPUI_WinnersScreen_C
// 0x0058 (0x04F8 - 0x04A0)
class UBPUI_WinnersScreen_C final : public UCAHUDWinnersScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       StartAnim;                                         // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_162;                                         // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_203;                                         // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo;                                              // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           LootItemsBox;                                      // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_auto_exit;                                     // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         M_auto_timeout_value;                              // 0x04F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         M_screen_shown_timestamp;                          // 0x04F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPUI_WinnersScreen(int32 EntryPoint);
	void Construct();
	void SetAutoContinueText();
	void GetScreenShownTimestamp(float* ScreenShownTimestamp);
	void SetScreenShownTimestamp(float* ScreenShownTimestamp);
	void TriggerContinueTimer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_WinnersScreen_C">();
	}
	static class UBPUI_WinnersScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_WinnersScreen_C>();
	}
};
static_assert(alignof(UBPUI_WinnersScreen_C) == 0x000008, "Wrong alignment on UBPUI_WinnersScreen_C");
static_assert(sizeof(UBPUI_WinnersScreen_C) == 0x0004F8, "Wrong size on UBPUI_WinnersScreen_C");
static_assert(offsetof(UBPUI_WinnersScreen_C, UberGraphFrame) == 0x0004A0, "Member 'UBPUI_WinnersScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_WinnersScreen_C, StartAnim) == 0x0004A8, "Member 'UBPUI_WinnersScreen_C::StartAnim' has a wrong offset!");
static_assert(offsetof(UBPUI_WinnersScreen_C, Image) == 0x0004B0, "Member 'UBPUI_WinnersScreen_C::Image' has a wrong offset!");
static_assert(offsetof(UBPUI_WinnersScreen_C, Image_162) == 0x0004B8, "Member 'UBPUI_WinnersScreen_C::Image_162' has a wrong offset!");
static_assert(offsetof(UBPUI_WinnersScreen_C, Image_203) == 0x0004C0, "Member 'UBPUI_WinnersScreen_C::Image_203' has a wrong offset!");
static_assert(offsetof(UBPUI_WinnersScreen_C, Logo) == 0x0004C8, "Member 'UBPUI_WinnersScreen_C::Logo' has a wrong offset!");
static_assert(offsetof(UBPUI_WinnersScreen_C, LootItemsBox) == 0x0004D0, "Member 'UBPUI_WinnersScreen_C::LootItemsBox' has a wrong offset!");
static_assert(offsetof(UBPUI_WinnersScreen_C, RetainerBox_0) == 0x0004D8, "Member 'UBPUI_WinnersScreen_C::RetainerBox_0' has a wrong offset!");
static_assert(offsetof(UBPUI_WinnersScreen_C, SizeBox_0) == 0x0004E0, "Member 'UBPUI_WinnersScreen_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UBPUI_WinnersScreen_C, Txt_auto_exit) == 0x0004E8, "Member 'UBPUI_WinnersScreen_C::Txt_auto_exit' has a wrong offset!");
static_assert(offsetof(UBPUI_WinnersScreen_C, M_auto_timeout_value) == 0x0004F0, "Member 'UBPUI_WinnersScreen_C::M_auto_timeout_value' has a wrong offset!");
static_assert(offsetof(UBPUI_WinnersScreen_C, M_screen_shown_timestamp) == 0x0004F4, "Member 'UBPUI_WinnersScreen_C::M_screen_shown_timestamp' has a wrong offset!");

}

