#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_SecondaryMessageDisguisedImage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_HUD_SecondaryMessageDisguisedImage.BPUI_HUD_SecondaryMessageDisguisedImage_C
// 0x0088 (0x06F0 - 0x0668)
class UBPUI_HUD_SecondaryMessageDisguisedImage_C final : public UCAHUDDisguisePrimaryMessage
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0668(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Fading;                                            // 0x0670(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RectSlide;                                         // 0x0678(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Ability_img;                                       // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ability_img_1;                                     // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ability_img_2;                                     // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           MASK_RetainerBox_0;                                // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x06A0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         LetterCount;                                       // 0x06B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BC[0x4];                                      // 0x06BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Textn;                                             // 0x06C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 CurrentText;                                       // 0x06D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 NextLetter;                                        // 0x06E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPUI_HUD_SecondaryMessageDisguisedImage(int32 EntryPoint);
	void OnShow();
	void PlayFadeAnimation();
	void HideWidget();
	void GetFormattedCharacterName(class FText* Result);
	void SequenceEvent__ENTRYPOINTBPUI_HUD_SecondaryMessageDisguisedImage_0();
	void SequenceEvent__ENTRYPOINTBPUI_HUD_SecondaryMessageDisguisedImage_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_HUD_SecondaryMessageDisguisedImage_C">();
	}
	static class UBPUI_HUD_SecondaryMessageDisguisedImage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_HUD_SecondaryMessageDisguisedImage_C>();
	}
};
static_assert(alignof(UBPUI_HUD_SecondaryMessageDisguisedImage_C) == 0x000008, "Wrong alignment on UBPUI_HUD_SecondaryMessageDisguisedImage_C");
static_assert(sizeof(UBPUI_HUD_SecondaryMessageDisguisedImage_C) == 0x0006F0, "Wrong size on UBPUI_HUD_SecondaryMessageDisguisedImage_C");
static_assert(offsetof(UBPUI_HUD_SecondaryMessageDisguisedImage_C, UberGraphFrame) == 0x000668, "Member 'UBPUI_HUD_SecondaryMessageDisguisedImage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_SecondaryMessageDisguisedImage_C, Fading) == 0x000670, "Member 'UBPUI_HUD_SecondaryMessageDisguisedImage_C::Fading' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_SecondaryMessageDisguisedImage_C, RectSlide) == 0x000678, "Member 'UBPUI_HUD_SecondaryMessageDisguisedImage_C::RectSlide' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_SecondaryMessageDisguisedImage_C, Ability_img) == 0x000680, "Member 'UBPUI_HUD_SecondaryMessageDisguisedImage_C::Ability_img' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_SecondaryMessageDisguisedImage_C, Ability_img_1) == 0x000688, "Member 'UBPUI_HUD_SecondaryMessageDisguisedImage_C::Ability_img_1' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_SecondaryMessageDisguisedImage_C, Ability_img_2) == 0x000690, "Member 'UBPUI_HUD_SecondaryMessageDisguisedImage_C::Ability_img_2' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_SecondaryMessageDisguisedImage_C, MASK_RetainerBox_0) == 0x000698, "Member 'UBPUI_HUD_SecondaryMessageDisguisedImage_C::MASK_RetainerBox_0' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_SecondaryMessageDisguisedImage_C, Text) == 0x0006A0, "Member 'UBPUI_HUD_SecondaryMessageDisguisedImage_C::Text' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_SecondaryMessageDisguisedImage_C, LetterCount) == 0x0006B8, "Member 'UBPUI_HUD_SecondaryMessageDisguisedImage_C::LetterCount' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_SecondaryMessageDisguisedImage_C, Textn) == 0x0006C0, "Member 'UBPUI_HUD_SecondaryMessageDisguisedImage_C::Textn' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_SecondaryMessageDisguisedImage_C, CurrentText) == 0x0006D0, "Member 'UBPUI_HUD_SecondaryMessageDisguisedImage_C::CurrentText' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_SecondaryMessageDisguisedImage_C, NextLetter) == 0x0006E0, "Member 'UBPUI_HUD_SecondaryMessageDisguisedImage_C::NextLetter' has a wrong offset!");

}

