#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_PingRadialSlotClose

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPUI_HUD_PingRadialSlotClose.BPUI_HUD_PingRadialSlotClose_C.ExecuteUbergraph_BPUI_HUD_PingRadialSlotClose
// 0x0008 (0x0008 - 0x0000)
struct BPUI_HUD_PingRadialSlotClose_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlotClose final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_is_focused;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPUI_HUD_PingRadialSlotClose_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlotClose) == 0x000004, "Wrong alignment on BPUI_HUD_PingRadialSlotClose_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlotClose");
static_assert(sizeof(BPUI_HUD_PingRadialSlotClose_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlotClose) == 0x000008, "Wrong size on BPUI_HUD_PingRadialSlotClose_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlotClose");
static_assert(offsetof(BPUI_HUD_PingRadialSlotClose_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlotClose, EntryPoint) == 0x000000, "Member 'BPUI_HUD_PingRadialSlotClose_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlotClose::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PingRadialSlotClose_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlotClose, K2Node_Event_is_focused) == 0x000004, "Member 'BPUI_HUD_PingRadialSlotClose_C_ExecuteUbergraph_BPUI_HUD_PingRadialSlotClose::K2Node_Event_is_focused' has a wrong offset!");

// Function BPUI_HUD_PingRadialSlotClose.BPUI_HUD_PingRadialSlotClose_C.SetFocusedState
// 0x0001 (0x0001 - 0x0000)
struct BPUI_HUD_PingRadialSlotClose_C_SetFocusedState final
{
public:
	bool                                          Is_focused;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPUI_HUD_PingRadialSlotClose_C_SetFocusedState) == 0x000001, "Wrong alignment on BPUI_HUD_PingRadialSlotClose_C_SetFocusedState");
static_assert(sizeof(BPUI_HUD_PingRadialSlotClose_C_SetFocusedState) == 0x000001, "Wrong size on BPUI_HUD_PingRadialSlotClose_C_SetFocusedState");
static_assert(offsetof(BPUI_HUD_PingRadialSlotClose_C_SetFocusedState, Is_focused) == 0x000000, "Member 'BPUI_HUD_PingRadialSlotClose_C_SetFocusedState::Is_focused' has a wrong offset!");

}

