#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_SecondaryMessageGeneric

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Keaton_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPUI_HUD_SecondaryMessageGeneric.BPUI_HUD_SecondaryMessageGeneric_C.ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric
// 0x02F0 (0x02F0 - 0x0000)
struct BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAPrimaryMessageTypesTableRow         CallFunc_GetMessageConfigData_ReturnValue;         // 0x0010(0x00D0)(ConstParm)
	struct FCAPrimaryMessagingData                CallFunc_GetMessagePayload_ReturnValue;            // 0x00E0(0x00E0)(ConstParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x01C0(0x0028)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01E8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0228(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_LinearColorLinearColor_ReturnValue; // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0270(0x0010)(ReferenceParm)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_282[0x6];                                      // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeTextFromCAText_text;                  // 0x0288(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x02A0(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x02B8(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x02D0(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric) == 0x000008, "Wrong alignment on BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric");
static_assert(sizeof(BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric) == 0x0002F0, "Wrong size on BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric");
static_assert(offsetof(BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric, EntryPoint) == 0x000000, "Member 'BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric, Temp_bool_Variable) == 0x000004, "Member 'BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric, Temp_byte_Variable) == 0x000005, "Member 'BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric, Temp_byte_Variable_1) == 0x000006, "Member 'BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric, Temp_bool_Variable_1) == 0x000007, "Member 'BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric, Temp_byte_Variable_2) == 0x000008, "Member 'BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric, Temp_byte_Variable_3) == 0x000009, "Member 'BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric, CallFunc_GetMessageConfigData_ReturnValue) == 0x000010, "Member 'BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric::CallFunc_GetMessageConfigData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric, CallFunc_GetMessagePayload_ReturnValue) == 0x0000E0, "Member 'BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric::CallFunc_GetMessagePayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric, K2Node_MakeStruct_SlateColor) == 0x0001C0, "Member 'BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric, K2Node_MakeStruct_FormatArgumentData) == 0x0001E8, "Member 'BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric, K2Node_MakeStruct_FormatArgumentData_1) == 0x000228, "Member 'BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric, CallFunc_EqualEqual_LinearColorLinearColor_ReturnValue) == 0x000268, "Member 'BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric::CallFunc_EqualEqual_LinearColorLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric, K2Node_MakeArray_Array) == 0x000270, "Member 'BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric, K2Node_Select_Default) == 0x000280, "Member 'BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric, K2Node_Select_Default_1) == 0x000281, "Member 'BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric, CallFunc_MakeTextFromCAText_text) == 0x000288, "Member 'BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric::CallFunc_MakeTextFromCAText_text' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric, CallFunc_Format_ReturnValue) == 0x0002A0, "Member 'BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric, K2Node_CreateDelegate_OutputDelegate) == 0x0002B8, "Member 'BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric, CallFunc_TextToUpper_ReturnValue) == 0x0002D0, "Member 'BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric, CallFunc_PlayAnimation_ReturnValue) == 0x0002E8, "Member 'BPUI_HUD_SecondaryMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_SecondaryMessageGeneric::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BPUI_HUD_SecondaryMessageGeneric.BPUI_HUD_SecondaryMessageGeneric_C.PlayFadeAnimation
// 0x0008 (0x0008 - 0x0000)
struct BPUI_HUD_SecondaryMessageGeneric_C_PlayFadeAnimation final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_SecondaryMessageGeneric_C_PlayFadeAnimation) == 0x000008, "Wrong alignment on BPUI_HUD_SecondaryMessageGeneric_C_PlayFadeAnimation");
static_assert(sizeof(BPUI_HUD_SecondaryMessageGeneric_C_PlayFadeAnimation) == 0x000008, "Wrong size on BPUI_HUD_SecondaryMessageGeneric_C_PlayFadeAnimation");
static_assert(offsetof(BPUI_HUD_SecondaryMessageGeneric_C_PlayFadeAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'BPUI_HUD_SecondaryMessageGeneric_C_PlayFadeAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

