#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_NotificationBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_HUD_NotificationBox.BPUI_HUD_NotificationBox_C
// 0x00C8 (0x0358 - 0x0290)
class UBPUI_HUD_NotificationBox_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Popup_show;                                        // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG_Tint;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHUDSecondaryActionButton_C*            Cancel_button;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHUDSecondaryActionButton_C*            Confirm_button;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FullscreenBlink;                                   // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_65;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 M_image;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MessageText;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_210;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHUDSecondaryActionButton_C*            Third_option_button;                               // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleText;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Waves;                                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnDismiss;                                         // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<class FName, struct FCADialogueTableRow> Notification_data;                                 // 0x0308(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void OnDismiss__DelegateSignature(ECADialogueResult Results);
	void ExecuteUbergraph_BPUI_HUD_NotificationBox(int32 EntryPoint);
	void ShowSkipTutorial();
	void CustomEvent();
	void ShowExitGame();
	void OnConfirm();
	void OnCancel();
	void OnThirdOption();
	void BndEvt__confirm_button_K2Node_ComponentBoundEvent_0_UIElementSelected__DelegateSignature(class UCABaseUIElement* button);
	void ShowReturnToFrontend();
	void ShowResetToDefaults();
	void ShowSaveOptions();
	void BndEvt__BPUI_HUD_NotificationBox_third_option_button_K2Node_ComponentBoundEvent_2_UIElementSelected__DelegateSignature(class UCABaseUIElement* button);
	void SetFocusOnButton();
	void SetMsg(const struct FCAText& CAText, const class FText& Text_to_inject);
	void SetTitle(const struct FCAText& CAText);
	void Show();
	void Hide(ECADialogueResult Results);
	void ShowCanNotRebind();
	void ShowKeyAlreadyBound();
	void ShowDiscardChanges();
	void SetFromData(class FName Id, const class FText& Text_to_inject);
	void BndEvt__cancel_button_K2Node_ComponentBoundEvent_1_UIElementSelected__DelegateSignature(class UCABaseUIElement* button);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void GetMessage(class FName Id, class FText* Message, bool* Success);
	void ConfigureButton(class UCABaseHUDActionElement* Target, const struct FCAText& Ca_text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_HUD_NotificationBox_C">();
	}
	static class UBPUI_HUD_NotificationBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_HUD_NotificationBox_C>();
	}
};
static_assert(alignof(UBPUI_HUD_NotificationBox_C) == 0x000008, "Wrong alignment on UBPUI_HUD_NotificationBox_C");
static_assert(sizeof(UBPUI_HUD_NotificationBox_C) == 0x000358, "Wrong size on UBPUI_HUD_NotificationBox_C");
static_assert(offsetof(UBPUI_HUD_NotificationBox_C, UberGraphFrame) == 0x000290, "Member 'UBPUI_HUD_NotificationBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_NotificationBox_C, Popup_show) == 0x000298, "Member 'UBPUI_HUD_NotificationBox_C::Popup_show' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_NotificationBox_C, BG_Tint) == 0x0002A0, "Member 'UBPUI_HUD_NotificationBox_C::BG_Tint' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_NotificationBox_C, Cancel_button) == 0x0002A8, "Member 'UBPUI_HUD_NotificationBox_C::Cancel_button' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_NotificationBox_C, Confirm_button) == 0x0002B0, "Member 'UBPUI_HUD_NotificationBox_C::Confirm_button' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_NotificationBox_C, FullscreenBlink) == 0x0002B8, "Member 'UBPUI_HUD_NotificationBox_C::FullscreenBlink' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_NotificationBox_C, Image_65) == 0x0002C0, "Member 'UBPUI_HUD_NotificationBox_C::Image_65' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_NotificationBox_C, M_image) == 0x0002C8, "Member 'UBPUI_HUD_NotificationBox_C::M_image' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_NotificationBox_C, MessageText) == 0x0002D0, "Member 'UBPUI_HUD_NotificationBox_C::MessageText' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_NotificationBox_C, ProgressBar_210) == 0x0002D8, "Member 'UBPUI_HUD_NotificationBox_C::ProgressBar_210' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_NotificationBox_C, Third_option_button) == 0x0002E0, "Member 'UBPUI_HUD_NotificationBox_C::Third_option_button' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_NotificationBox_C, TitleText) == 0x0002E8, "Member 'UBPUI_HUD_NotificationBox_C::TitleText' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_NotificationBox_C, Waves) == 0x0002F0, "Member 'UBPUI_HUD_NotificationBox_C::Waves' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_NotificationBox_C, OnDismiss) == 0x0002F8, "Member 'UBPUI_HUD_NotificationBox_C::OnDismiss' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_NotificationBox_C, Notification_data) == 0x000308, "Member 'UBPUI_HUD_NotificationBox_C::Notification_data' has a wrong offset!");

}

