#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_map_info

#include "Basic.hpp"

#include "CAGameDatabase_structs.hpp"
#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_map_info.BPUI_map_info_C
// 0x0030 (0x0300 - 0x02D0)
class UBPUI_map_info_C final : public UCAMapInfoWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 b1;                                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 b2;                                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 b3;                                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_mapName;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FCADataTableHandle                     MapDefinitionTable;                                // 0x02F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_BPUI_map_info(int32 EntryPoint);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_map_info_C">();
	}
	static class UBPUI_map_info_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_map_info_C>();
	}
};
static_assert(alignof(UBPUI_map_info_C) == 0x000008, "Wrong alignment on UBPUI_map_info_C");
static_assert(sizeof(UBPUI_map_info_C) == 0x000300, "Wrong size on UBPUI_map_info_C");
static_assert(offsetof(UBPUI_map_info_C, UberGraphFrame) == 0x0002D0, "Member 'UBPUI_map_info_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_map_info_C, b1) == 0x0002D8, "Member 'UBPUI_map_info_C::b1' has a wrong offset!");
static_assert(offsetof(UBPUI_map_info_C, b2) == 0x0002E0, "Member 'UBPUI_map_info_C::b2' has a wrong offset!");
static_assert(offsetof(UBPUI_map_info_C, b3) == 0x0002E8, "Member 'UBPUI_map_info_C::b3' has a wrong offset!");
static_assert(offsetof(UBPUI_map_info_C, RetainerBox_mapName) == 0x0002F0, "Member 'UBPUI_map_info_C::RetainerBox_mapName' has a wrong offset!");
static_assert(offsetof(UBPUI_map_info_C, MapDefinitionTable) == 0x0002F8, "Member 'UBPUI_map_info_C::MapDefinitionTable' has a wrong offset!");

}

