#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_TagComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPUI_HUD_TagComponent.BPUI_HUD_TagComponent_C
// 0x0060 (0x01A0 - 0x0140)
class UBPUI_HUD_TagComponent_C final : public UCAHUDTagComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0140(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<class UCAHUDHideableWidget*, float>      WidgetOpacityMap;                                  // 0x0148(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	float                                         EMPOpacity;                                        // 0x0198(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPUI_HUD_TagComponent(int32 EntryPoint);
	void NotifyPlayerPawnChanged(class APawn* Player_pawn);
	void NotifyTagRemoved(const struct FGameplayTag& Tag);
	void NotifyTagAdded(const struct FGameplayTag& Tag);
	void UpdateEMPVisualsForWidget(bool Is_Under_EMP, const struct FGameplayTag& HUD_Section_Tag, struct FCAHUDSectionEMPStatus& HUD_Section_Status);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_HUD_TagComponent_C">();
	}
	static class UBPUI_HUD_TagComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_HUD_TagComponent_C>();
	}
};
static_assert(alignof(UBPUI_HUD_TagComponent_C) == 0x000008, "Wrong alignment on UBPUI_HUD_TagComponent_C");
static_assert(sizeof(UBPUI_HUD_TagComponent_C) == 0x0001A0, "Wrong size on UBPUI_HUD_TagComponent_C");
static_assert(offsetof(UBPUI_HUD_TagComponent_C, UberGraphFrame) == 0x000140, "Member 'UBPUI_HUD_TagComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_TagComponent_C, WidgetOpacityMap) == 0x000148, "Member 'UBPUI_HUD_TagComponent_C::WidgetOpacityMap' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_TagComponent_C, EMPOpacity) == 0x000198, "Member 'UBPUI_HUD_TagComponent_C::EMPOpacity' has a wrong offset!");

}

