#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_ArcLens_ProjectileWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPUI_ArcLens_ProjectileWidget.BPUI_ArcLens_ProjectileWidget_C.ExecuteUbergraph_BPUI_ArcLens_ProjectileWidget
// 0x0008 (0x0008 - 0x0000)
struct BPUI_ArcLens_ProjectileWidget_C_ExecuteUbergraph_BPUI_ArcLens_ProjectileWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_impacted;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPUI_ArcLens_ProjectileWidget_C_ExecuteUbergraph_BPUI_ArcLens_ProjectileWidget) == 0x000004, "Wrong alignment on BPUI_ArcLens_ProjectileWidget_C_ExecuteUbergraph_BPUI_ArcLens_ProjectileWidget");
static_assert(sizeof(BPUI_ArcLens_ProjectileWidget_C_ExecuteUbergraph_BPUI_ArcLens_ProjectileWidget) == 0x000008, "Wrong size on BPUI_ArcLens_ProjectileWidget_C_ExecuteUbergraph_BPUI_ArcLens_ProjectileWidget");
static_assert(offsetof(BPUI_ArcLens_ProjectileWidget_C_ExecuteUbergraph_BPUI_ArcLens_ProjectileWidget, EntryPoint) == 0x000000, "Member 'BPUI_ArcLens_ProjectileWidget_C_ExecuteUbergraph_BPUI_ArcLens_ProjectileWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_ArcLens_ProjectileWidget_C_ExecuteUbergraph_BPUI_ArcLens_ProjectileWidget, K2Node_Event_impacted) == 0x000004, "Member 'BPUI_ArcLens_ProjectileWidget_C_ExecuteUbergraph_BPUI_ArcLens_ProjectileWidget::K2Node_Event_impacted' has a wrong offset!");

// Function BPUI_ArcLens_ProjectileWidget.BPUI_ArcLens_ProjectileWidget_C.OnPlayerImpacted
// 0x0001 (0x0001 - 0x0000)
struct BPUI_ArcLens_ProjectileWidget_C_OnPlayerImpacted final
{
public:
	bool                                          Impacted;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPUI_ArcLens_ProjectileWidget_C_OnPlayerImpacted) == 0x000001, "Wrong alignment on BPUI_ArcLens_ProjectileWidget_C_OnPlayerImpacted");
static_assert(sizeof(BPUI_ArcLens_ProjectileWidget_C_OnPlayerImpacted) == 0x000001, "Wrong size on BPUI_ArcLens_ProjectileWidget_C_OnPlayerImpacted");
static_assert(offsetof(BPUI_ArcLens_ProjectileWidget_C_OnPlayerImpacted, Impacted) == 0x000000, "Member 'BPUI_ArcLens_ProjectileWidget_C_OnPlayerImpacted::Impacted' has a wrong offset!");

}

