#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_map_howtoplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_map_howtoplay.BPUI_map_howtoplay_C
// 0x0028 (0x0330 - 0x0308)
class UBPUI_map_howtoplay_C final : public UCAMapHowToPlayWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 b1_1;                                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 b2_1;                                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 b3_1;                                              // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_htp;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPUI_map_howtoplay(int32 EntryPoint);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_map_howtoplay_C">();
	}
	static class UBPUI_map_howtoplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_map_howtoplay_C>();
	}
};
static_assert(alignof(UBPUI_map_howtoplay_C) == 0x000008, "Wrong alignment on UBPUI_map_howtoplay_C");
static_assert(sizeof(UBPUI_map_howtoplay_C) == 0x000330, "Wrong size on UBPUI_map_howtoplay_C");
static_assert(offsetof(UBPUI_map_howtoplay_C, UberGraphFrame) == 0x000308, "Member 'UBPUI_map_howtoplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_map_howtoplay_C, b1_1) == 0x000310, "Member 'UBPUI_map_howtoplay_C::b1_1' has a wrong offset!");
static_assert(offsetof(UBPUI_map_howtoplay_C, b2_1) == 0x000318, "Member 'UBPUI_map_howtoplay_C::b2_1' has a wrong offset!");
static_assert(offsetof(UBPUI_map_howtoplay_C, b3_1) == 0x000320, "Member 'UBPUI_map_howtoplay_C::b3_1' has a wrong offset!");
static_assert(offsetof(UBPUI_map_howtoplay_C, RetainerBox_htp) == 0x000328, "Member 'UBPUI_map_howtoplay_C::RetainerBox_htp' has a wrong offset!");

}

