#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_InGame_Contract

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPUI_HUD_InGame_Contract.BPUI_HUD_InGame_Contract_C
// 0x0030 (0x0798 - 0x0768)
class ABPUI_HUD_InGame_Contract_C final : public ACAHUD_InGameMain
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0768(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCATestLoadoutProxy_v2*                 CATestLoadoutProxy_v2;                             // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPUI_HUD_TagComponent_C*               BPUI_HUD_TagComponent;                             // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UCAHUDHideableWidget*>           Section_Widgets;                                   // 0x0788(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_BPUI_HUD_InGame_Contract(int32 EntryPoint);
	void NotifyPlayerPawnChanged(class APawn* Player_pawn);
	void NotifyTagRemoved(const struct FGameplayTag& Tag);
	void NotifyTagAdded(const struct FGameplayTag& Tag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_HUD_InGame_Contract_C">();
	}
	static class ABPUI_HUD_InGame_Contract_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPUI_HUD_InGame_Contract_C>();
	}
};
static_assert(alignof(ABPUI_HUD_InGame_Contract_C) == 0x000008, "Wrong alignment on ABPUI_HUD_InGame_Contract_C");
static_assert(sizeof(ABPUI_HUD_InGame_Contract_C) == 0x000798, "Wrong size on ABPUI_HUD_InGame_Contract_C");
static_assert(offsetof(ABPUI_HUD_InGame_Contract_C, UberGraphFrame) == 0x000768, "Member 'ABPUI_HUD_InGame_Contract_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABPUI_HUD_InGame_Contract_C, CATestLoadoutProxy_v2) == 0x000770, "Member 'ABPUI_HUD_InGame_Contract_C::CATestLoadoutProxy_v2' has a wrong offset!");
static_assert(offsetof(ABPUI_HUD_InGame_Contract_C, BPUI_HUD_TagComponent) == 0x000778, "Member 'ABPUI_HUD_InGame_Contract_C::BPUI_HUD_TagComponent' has a wrong offset!");
static_assert(offsetof(ABPUI_HUD_InGame_Contract_C, DefaultSceneRoot) == 0x000780, "Member 'ABPUI_HUD_InGame_Contract_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABPUI_HUD_InGame_Contract_C, Section_Widgets) == 0x000788, "Member 'ABPUI_HUD_InGame_Contract_C::Section_Widgets' has a wrong offset!");

}

