#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_SocialPartyContainer

#include "Basic.hpp"

#include "Keaton_structs.hpp"


namespace SDK::Params
{

// Function BPUI_HUD_SocialPartyContainer.BPUI_HUD_SocialPartyContainer_C.ExecuteUbergraph_BPUI_HUD_SocialPartyContainer
// 0x00B0 (0x00B0 - 0x0000)
struct BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCAPartyMemberUIData>           CallFunc_GenerateMemberData_ReturnValue;           // 0x0010(0x0010)(ReferenceParm)
	class UBP_PartyPlayerCard_C*                  CallFunc_TryFindTeammateForFocus_PlayerCard;       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0014)(ZeroConstructor, NoDestructor)
	class UBP_PartyPlayerCard_C*                  K2Node_CustomEvent_PartyPlayerCard;                // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAPartyPlayerCardState                       K2Node_CustomEvent_PartyCardState;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UBP_PartyPlayerCard_C* PartyPlayerCard, ECAPartyPlayerCardState PartyCardState)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x005C(0x0014)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PartyPlayerCard_C*                  CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_PartyPlayerCard_C*                  CallFunc_Array_Get_Item_1;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UBP_PartyPlayerCard_C* PartyPlayerCard, ECAPartyPlayerCardState PartyCardState)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0094(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsListeningForInputAction_ReturnValue;    // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer) == 0x000008, "Wrong alignment on BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer");
static_assert(sizeof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer) == 0x0000B0, "Wrong size on BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, EntryPoint) == 0x000000, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, CallFunc_GenerateMemberData_ReturnValue) == 0x000010, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::CallFunc_GenerateMemberData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, CallFunc_TryFindTeammateForFocus_PlayerCard) == 0x000020, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::CallFunc_TryFindTeammateForFocus_PlayerCard' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, Temp_int_Loop_Counter_Variable_1) == 0x000028, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, CallFunc_Add_IntInt_ReturnValue_1) == 0x00002C, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, K2Node_CustomEvent_PartyPlayerCard) == 0x000048, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::K2Node_CustomEvent_PartyPlayerCard' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, K2Node_CustomEvent_PartyCardState) == 0x000050, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::K2Node_CustomEvent_PartyCardState' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000051, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, K2Node_CreateDelegate_OutputDelegate_1) == 0x00005C, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, Temp_int_Array_Index_Variable_1) == 0x000070, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, CallFunc_Array_Get_Item) == 0x000078, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, CallFunc_Array_Get_Item_1) == 0x000080, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, CallFunc_IsValid_ReturnValue_1) == 0x000088, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, CallFunc_IsValid_ReturnValue_2) == 0x000089, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, CallFunc_Array_Length_ReturnValue_1) == 0x00008C, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, CallFunc_Less_IntInt_ReturnValue_1) == 0x000090, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, K2Node_CreateDelegate_OutputDelegate_2) == 0x000094, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000A8, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, CallFunc_IsValid_ReturnValue_3) == 0x0000A9, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, CallFunc_IsListeningForInputAction_ReturnValue) == 0x0000AA, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::CallFunc_IsListeningForInputAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer, CallFunc_Not_PreBool_ReturnValue) == 0x0000AB, "Member 'BPUI_HUD_SocialPartyContainer_C_ExecuteUbergraph_BPUI_HUD_SocialPartyContainer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BPUI_HUD_SocialPartyContainer.BPUI_HUD_SocialPartyContainer_C.OnPartyPlayerCardStateChanged_Event_0
// 0x0010 (0x0010 - 0x0000)
struct BPUI_HUD_SocialPartyContainer_C_OnPartyPlayerCardStateChanged_Event_0 final
{
public:
	class UBP_PartyPlayerCard_C*                  PartyPlayerCard;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAPartyPlayerCardState                       PartyCardState;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_SocialPartyContainer_C_OnPartyPlayerCardStateChanged_Event_0) == 0x000008, "Wrong alignment on BPUI_HUD_SocialPartyContainer_C_OnPartyPlayerCardStateChanged_Event_0");
static_assert(sizeof(BPUI_HUD_SocialPartyContainer_C_OnPartyPlayerCardStateChanged_Event_0) == 0x000010, "Wrong size on BPUI_HUD_SocialPartyContainer_C_OnPartyPlayerCardStateChanged_Event_0");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_OnPartyPlayerCardStateChanged_Event_0, PartyPlayerCard) == 0x000000, "Member 'BPUI_HUD_SocialPartyContainer_C_OnPartyPlayerCardStateChanged_Event_0::PartyPlayerCard' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_OnPartyPlayerCardStateChanged_Event_0, PartyCardState) == 0x000008, "Member 'BPUI_HUD_SocialPartyContainer_C_OnPartyPlayerCardStateChanged_Event_0::PartyCardState' has a wrong offset!");

// Function BPUI_HUD_SocialPartyContainer.BPUI_HUD_SocialPartyContainer_C.CaptureInput
// 0x0014 (0x0014 - 0x0000)
struct BPUI_HUD_SocialPartyContainer_C_CaptureInput final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0014)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BPUI_HUD_SocialPartyContainer_C_CaptureInput) == 0x000004, "Wrong alignment on BPUI_HUD_SocialPartyContainer_C_CaptureInput");
static_assert(sizeof(BPUI_HUD_SocialPartyContainer_C_CaptureInput) == 0x000014, "Wrong size on BPUI_HUD_SocialPartyContainer_C_CaptureInput");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_CaptureInput, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BPUI_HUD_SocialPartyContainer_C_CaptureInput::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BPUI_HUD_SocialPartyContainer.BPUI_HUD_SocialPartyContainer_C.TryFindTeammateForFocus
// 0x0028 (0x0028 - 0x0000)
struct BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus final
{
public:
	class UBP_PartyPlayerCard_C*                  PlayerCard;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_PartyPlayerCard_C*                  CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus) == 0x000008, "Wrong alignment on BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus");
static_assert(sizeof(BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus) == 0x000028, "Wrong size on BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus, PlayerCard) == 0x000000, "Member 'BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus::PlayerCard' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus, CallFunc_Array_Get_Item) == 0x000018, "Member 'BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus, CallFunc_IsEmpty_ReturnValue) == 0x000022, "Member 'BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus, CallFunc_Not_PreBool_ReturnValue) == 0x000023, "Member 'BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus, CallFunc_Not_PreBool_ReturnValue_1) == 0x000024, "Member 'BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus, CallFunc_Not_PreBool_ReturnValue_2) == 0x000025, "Member 'BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus, CallFunc_BooleanAND_ReturnValue) == 0x000026, "Member 'BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus, CallFunc_BooleanAND_ReturnValue_1) == 0x000027, "Member 'BPUI_HUD_SocialPartyContainer_C_TryFindTeammateForFocus::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BPUI_HUD_SocialPartyContainer.BPUI_HUD_SocialPartyContainer_C.UpdateDisconnectedTeammates
// 0x00E0 (0x00E0 - 0x0000)
struct BPUI_HUD_SocialPartyContainer_C_UpdateDisconnectedTeammates final
{
public:
	bool                                          LocalDidActiveCardBecomeDisconnected;              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_PartyPlayerCard_C*                  CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PartyPlayerCard_C*                  CallFunc_TryFindTeammateForFocus_PlayerCard;       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCAPartyMemberUIData>           CallFunc_GenerateMemberData_ReturnValue;           // 0x0048(0x0010)(ReferenceParm)
	struct FCAPartyMemberUIData                   CallFunc_Array_Get_Item_1;                         // 0x0058(0x0068)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PartyPlayerCard_C*                  CallFunc_Array_Get_Item_2;                         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPUI_HUD_SocialPartyContainer_C_UpdateDisconnectedTeammates) == 0x000008, "Wrong alignment on BPUI_HUD_SocialPartyContainer_C_UpdateDisconnectedTeammates");
static_assert(sizeof(BPUI_HUD_SocialPartyContainer_C_UpdateDisconnectedTeammates) == 0x0000E0, "Wrong size on BPUI_HUD_SocialPartyContainer_C_UpdateDisconnectedTeammates");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_UpdateDisconnectedTeammates, LocalDidActiveCardBecomeDisconnected) == 0x000000, "Member 'BPUI_HUD_SocialPartyContainer_C_UpdateDisconnectedTeammates::LocalDidActiveCardBecomeDisconnected' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_SocialPartyContainer_C_UpdateDisconnectedTeammates, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BPUI_HUD_SocialPartyContainer_C_UpdateDisconnectedTeammates::Temp_int_Array_Index_Variable' has a wrong offset!");
