#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_PrimaryMessage_v2_Character

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_HUD_PrimaryMessage_v2_Character.BPUI_HUD_PrimaryMessage_v2_Character_C
// 0x0030 (0x0410 - 0x03E0)
class UBPUI_HUD_PrimaryMessage_v2_Character_C final : public UCAPrimaryMessageLetterWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outline_padding_anim;                              // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Outline_fade_anim;                                 // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Letter_fade_anim;                                  // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox;                                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox_0;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPUI_HUD_PrimaryMessage_v2_Character(int32 EntryPoint);
	void PlayAnimations();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_HUD_PrimaryMessage_v2_Character_C">();
	}
	static class UBPUI_HUD_PrimaryMessage_v2_Character_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_HUD_PrimaryMessage_v2_Character_C>();
	}
};
static_assert(alignof(UBPUI_HUD_PrimaryMessage_v2_Character_C) == 0x000008, "Wrong alignment on UBPUI_HUD_PrimaryMessage_v2_Character_C");
static_assert(sizeof(UBPUI_HUD_PrimaryMessage_v2_Character_C) == 0x000410, "Wrong size on UBPUI_HUD_PrimaryMessage_v2_Character_C");
static_assert(offsetof(UBPUI_HUD_PrimaryMessage_v2_Character_C, UberGraphFrame) == 0x0003E0, "Member 'UBPUI_HUD_PrimaryMessage_v2_Character_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PrimaryMessage_v2_Character_C, Outline_padding_anim) == 0x0003E8, "Member 'UBPUI_HUD_PrimaryMessage_v2_Character_C::Outline_padding_anim' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PrimaryMessage_v2_Character_C, Outline_fade_anim) == 0x0003F0, "Member 'UBPUI_HUD_PrimaryMessage_v2_Character_C::Outline_fade_anim' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PrimaryMessage_v2_Character_C, Letter_fade_anim) == 0x0003F8, "Member 'UBPUI_HUD_PrimaryMessage_v2_Character_C::Letter_fade_anim' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PrimaryMessage_v2_Character_C, WrapBox) == 0x000400, "Member 'UBPUI_HUD_PrimaryMessage_v2_Character_C::WrapBox' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PrimaryMessage_v2_Character_C, WrapBox_0) == 0x000408, "Member 'UBPUI_HUD_PrimaryMessage_v2_Character_C::WrapBox_0' has a wrong offset!");

}

