#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_MapZoneIconBase

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BPUI_HUD_MapZoneIconBase.BPUI_HUD_MapZoneIconBase_C.ExecuteUbergraph_BPUI_HUD_MapZoneIconBase
// 0x0130 (0x0130 - 0x0000)
struct BPUI_HUD_MapZoneIconBase_C_ExecuteUbergraph_BPUI_HUD_MapZoneIconBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0040(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00B8(0x0078)(ConstParm)
};
static_assert(alignof(BPUI_HUD_MapZoneIconBase_C_ExecuteUbergraph_BPUI_HUD_MapZoneIconBase) == 0x000008, "Wrong alignment on BPUI_HUD_MapZoneIconBase_C_ExecuteUbergraph_BPUI_HUD_MapZoneIconBase");
static_assert(sizeof(BPUI_HUD_MapZoneIconBase_C_ExecuteUbergraph_BPUI_HUD_MapZoneIconBase) == 0x000130, "Wrong size on BPUI_HUD_MapZoneIconBase_C_ExecuteUbergraph_BPUI_HUD_MapZoneIconBase");
static_assert(offsetof(BPUI_HUD_MapZoneIconBase_C_ExecuteUbergraph_BPUI_HUD_MapZoneIconBase, EntryPoint) == 0x000000, "Member 'BPUI_HUD_MapZoneIconBase_C_ExecuteUbergraph_BPUI_HUD_MapZoneIconBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MapZoneIconBase_C_ExecuteUbergraph_BPUI_HUD_MapZoneIconBase, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BPUI_HUD_MapZoneIconBase_C_ExecuteUbergraph_BPUI_HUD_MapZoneIconBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MapZoneIconBase_C_ExecuteUbergraph_BPUI_HUD_MapZoneIconBase, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'BPUI_HUD_MapZoneIconBase_C_ExecuteUbergraph_BPUI_HUD_MapZoneIconBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MapZoneIconBase_C_ExecuteUbergraph_BPUI_HUD_MapZoneIconBase, K2Node_Event_MyGeometry) == 0x000008, "Member 'BPUI_HUD_MapZoneIconBase_C_ExecuteUbergraph_BPUI_HUD_MapZoneIconBase::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MapZoneIconBase_C_ExecuteUbergraph_BPUI_HUD_MapZoneIconBase, K2Node_Event_MouseEvent_1) == 0x000040, "Member 'BPUI_HUD_MapZoneIconBase_C_ExecuteUbergraph_BPUI_HUD_MapZoneIconBase::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MapZoneIconBase_C_ExecuteUbergraph_BPUI_HUD_MapZoneIconBase, K2Node_Event_MouseEvent) == 0x0000B8, "Member 'BPUI_HUD_MapZoneIconBase_C_ExecuteUbergraph_BPUI_HUD_MapZoneIconBase::K2Node_Event_MouseEvent' has a wrong offset!");

// Function BPUI_HUD_MapZoneIconBase.BPUI_HUD_MapZoneIconBase_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct BPUI_HUD_MapZoneIconBase_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BPUI_HUD_MapZoneIconBase_C_OnMouseLeave) == 0x000008, "Wrong alignment on BPUI_HUD_MapZoneIconBase_C_OnMouseLeave");
static_assert(sizeof(BPUI_HUD_MapZoneIconBase_C_OnMouseLeave) == 0x000078, "Wrong size on BPUI_HUD_MapZoneIconBase_C_OnMouseLeave");
static_assert(offsetof(BPUI_HUD_MapZoneIconBase_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'BPUI_HUD_MapZoneIconBase_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function BPUI_HUD_MapZoneIconBase.BPUI_HUD_MapZoneIconBase_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct BPUI_HUD_MapZoneIconBase_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BPUI_HUD_MapZoneIconBase_C_OnMouseEnter) == 0x000008, "Wrong alignment on BPUI_HUD_MapZoneIconBase_C_OnMouseEnter");
static_assert(sizeof(BPUI_HUD_MapZoneIconBase_C_OnMouseEnter) == 0x0000B0, "Wrong size on BPUI_HUD_MapZoneIconBase_C_OnMouseEnter");
static_assert(offsetof(BPUI_HUD_MapZoneIconBase_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'BPUI_HUD_MapZoneIconBase_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_MapZoneIconBase_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'BPUI_HUD_MapZoneIconBase_C_OnMouseEnter::MouseEvent' has a wrong offset!");

}

