#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_DebugMatchStartCountdown

#include "Basic.hpp"

#include "CAAudio_structs.hpp"
#include "Keaton_structs.hpp"


namespace SDK::Params
{

// Function BPUI_HUD_DebugMatchStartCountdown.BPUI_HUD_DebugMatchStartCountdown_C.ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown
// 0x01D0 (0x01D0 - 0x0000)
struct BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0018(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x002C(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	class ACAPlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UCAUIHUDInterface*                CallFunc_GetUIHUDInterface_ReturnValue;            // 0x0048(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0050(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_2;                          // 0x0064(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x0078(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAPrimaryMessagingData                K2Node_MakeStruct_CAPrimaryMessagingData;          // 0x0090(0x00E0)()
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_3;                          // 0x0170(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_2;            // 0x0190(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_2;                 // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAPlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue_1;   // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_3;            // 0x01B8(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_3;                 // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown) == 0x000008, "Wrong alignment on BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown");
static_assert(sizeof(BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown) == 0x0001D0, "Wrong size on BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown");
static_assert(offsetof(BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown, EntryPoint) == 0x000000, "Member 'BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown, Temp_int_Variable) == 0x000004, "Member 'BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000009, "Member 'BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown, Temp_object_Variable) == 0x000010, "Member 'BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown, Temp_delegate_Variable) == 0x000018, "Member 'BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown, Temp_delegate_Variable_1) == 0x00002C, "Member 'BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000040, "Member 'BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown, CallFunc_GetUIHUDInterface_ReturnValue) == 0x000048, "Member 'BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown::CallFunc_GetUIHUDInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown, CallFunc_PlayEvent_playback_instance) == 0x000050, "Member 'BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown, CallFunc_PlayEvent_play_success) == 0x000060, "Member 'BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown, CallFunc_IsValid_ReturnValue) == 0x000061, "Member 'BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown, Temp_delegate_Variable_2) == 0x000064, "Member 'BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown, CallFunc_PlayEvent_playback_instance_1) == 0x000078, "Member 'BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown, CallFunc_PlayEvent_play_success_1) == 0x000088, "Member 'BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown::CallFunc_PlayEvent_play_success_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown, K2Node_MakeStruct_CAPrimaryMessagingData) == 0x000090, "Member 'BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown::K2Node_MakeStruct_CAPrimaryMessagingData' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown, Temp_delegate_Variable_3) == 0x000170, "Member 'BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown, K2Node_Select_Default) == 0x000188, "Member 'BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown, CallFunc_PlayEvent_playback_instance_2) == 0x000190, "Member 'BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown::CallFunc_PlayEvent_playback_instance_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown, CallFunc_PlayEvent_play_success_2) == 0x0001A0, "Member 'BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown::CallFunc_PlayEvent_play_success_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown, CallFunc_PlayAnimation_ReturnValue) == 0x0001A8, "Member 'BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown, CallFunc_GetLocalPlayerController_ReturnValue_1) == 0x0001B0, "Member 'BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown::CallFunc_GetLocalPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown, CallFunc_PlayEvent_playback_instance_3) == 0x0001B8, "Member 'BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown::CallFunc_PlayEvent_playback_instance_3' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown, CallFunc_PlayEvent_play_success_3) == 0x0001C8, "Member 'BPUI_HUD_DebugMatchStartCountdown_C_ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown::CallFunc_PlayEvent_play_success_3' has a wrong offset!");

}

