#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_NotificationMessage

#include "Basic.hpp"

#include "Keaton_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CAAudio_structs.hpp"


namespace SDK::Params
{

// Function BPUI_HUD_NotificationMessage.BPUI_HUD_NotificationMessage_C.ExecuteUbergraph_BPUI_HUD_NotificationMessage
// 0x0100 (0x0100 - 0x0000)
struct BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAPlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0010(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x0024(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_2;                          // 0x0038(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	ECAHUDNotificationType                        K2Node_Event_notification_type_1;                  // 0x004C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0050(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECAHUDNotificationType                        K2Node_Event_notification_type;                    // 0x0061(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_3;                          // 0x0070(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAPlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue_1;   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x0098(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x00AC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAPlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue_2;   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAPlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue_3;   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_2;            // 0x00D0(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_2;                 // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_3;            // 0x00E8(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_3;                 // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage) == 0x000008, "Wrong alignment on BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage");
static_assert(sizeof(BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage) == 0x000100, "Wrong size on BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage, EntryPoint) == 0x000000, "Member 'BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000008, "Member 'BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage, Temp_delegate_Variable) == 0x000010, "Member 'BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage, Temp_delegate_Variable_1) == 0x000024, "Member 'BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage, Temp_delegate_Variable_2) == 0x000038, "Member 'BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage, K2Node_Event_notification_type_1) == 0x00004C, "Member 'BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage::K2Node_Event_notification_type_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage, CallFunc_PlayEvent_playback_instance) == 0x000050, "Member 'BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage, CallFunc_PlayEvent_play_success) == 0x000060, "Member 'BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage, K2Node_Event_notification_type) == 0x000061, "Member 'BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage::K2Node_Event_notification_type' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage, CallFunc_PlayAnimation_ReturnValue) == 0x000068, "Member 'BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage, Temp_delegate_Variable_3) == 0x000070, "Member 'BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage, CallFunc_GetLocalPlayerController_ReturnValue_1) == 0x000088, "Member 'BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage::CallFunc_GetLocalPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000090, "Member 'BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage, CallFunc_PlayEvent_playback_instance_1) == 0x000098, "Member 'BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage, CallFunc_PlayEvent_play_success_1) == 0x0000A8, "Member 'BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage::CallFunc_PlayEvent_play_success_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage, CallFunc_SelectColor_ReturnValue) == 0x0000AC, "Member 'BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage, CallFunc_GetLocalPlayerController_ReturnValue_2) == 0x0000C0, "Member 'BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage::CallFunc_GetLocalPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage, CallFunc_GetLocalPlayerController_ReturnValue_3) == 0x0000C8, "Member 'BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage::CallFunc_GetLocalPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage, CallFunc_PlayEvent_playback_instance_2) == 0x0000D0, "Member 'BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage::CallFunc_PlayEvent_playback_instance_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage, CallFunc_PlayEvent_play_success_2) == 0x0000E0, "Member 'BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage::CallFunc_PlayEvent_play_success_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage, CallFunc_PlayEvent_playback_instance_3) == 0x0000E8, "Member 'BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage::CallFunc_PlayEvent_playback_instance_3' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage, CallFunc_PlayEvent_play_success_3) == 0x0000F8, "Member 'BPUI_HUD_NotificationMessage_C_ExecuteUbergraph_BPUI_HUD_NotificationMessage::CallFunc_PlayEvent_play_success_3' has a wrong offset!");

// Function BPUI_HUD_NotificationMessage.BPUI_HUD_NotificationMessage_C.OnShowNotification
// 0x0001 (0x0001 - 0x0000)
struct BPUI_HUD_NotificationMessage_C_OnShowNotification final
{
public:
	ECAHUDNotificationType                        Notification_type;                                 // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_NotificationMessage_C_OnShowNotification) == 0x000001, "Wrong alignment on BPUI_HUD_NotificationMessage_C_OnShowNotification");
static_assert(sizeof(BPUI_HUD_NotificationMessage_C_OnShowNotification) == 0x000001, "Wrong size on BPUI_HUD_NotificationMessage_C_OnShowNotification");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_OnShowNotification, Notification_type) == 0x000000, "Member 'BPUI_HUD_NotificationMessage_C_OnShowNotification::Notification_type' has a wrong offset!");

// Function BPUI_HUD_NotificationMessage.BPUI_HUD_NotificationMessage_C.OnHideNotification
// 0x0001 (0x0001 - 0x0000)
struct BPUI_HUD_NotificationMessage_C_OnHideNotification final
{
public:
	ECAHUDNotificationType                        Notification_type;                                 // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_NotificationMessage_C_OnHideNotification) == 0x000001, "Wrong alignment on BPUI_HUD_NotificationMessage_C_OnHideNotification");
static_assert(sizeof(BPUI_HUD_NotificationMessage_C_OnHideNotification) == 0x000001, "Wrong size on BPUI_HUD_NotificationMessage_C_OnHideNotification");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_OnHideNotification, Notification_type) == 0x000000, "Member 'BPUI_HUD_NotificationMessage_C_OnHideNotification::Notification_type' has a wrong offset!");

// Function BPUI_HUD_NotificationMessage.BPUI_HUD_NotificationMessage_C.ReleaseInput
// 0x0048 (0x0048 - 0x0000)
struct BPUI_HUD_NotificationMessage_C_ReleaseInput final
{
public:
	class ACAPlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAHUDAbilitySystemComponent*           CallFunc_GetHudAbilitySystemComponent_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_NotificationMessage_C_ReleaseInput) == 0x000008, "Wrong alignment on BPUI_HUD_NotificationMessage_C_ReleaseInput");
static_assert(sizeof(BPUI_HUD_NotificationMessage_C_ReleaseInput) == 0x000048, "Wrong size on BPUI_HUD_NotificationMessage_C_ReleaseInput");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ReleaseInput, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000000, "Member 'BPUI_HUD_NotificationMessage_C_ReleaseInput::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ReleaseInput, CallFunc_GetHudAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'BPUI_HUD_NotificationMessage_C_ReleaseInput::CallFunc_GetHudAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ReleaseInput, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BPUI_HUD_NotificationMessage_C_ReleaseInput::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ReleaseInput, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000018, "Member 'BPUI_HUD_NotificationMessage_C_ReleaseInput::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ReleaseInput, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000028, "Member 'BPUI_HUD_NotificationMessage_C_ReleaseInput::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ReleaseInput, CallFunc_K2_GetPawn_ReturnValue) == 0x000030, "Member 'BPUI_HUD_NotificationMessage_C_ReleaseInput::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ReleaseInput, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'BPUI_HUD_NotificationMessage_C_ReleaseInput::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_ReleaseInput, CallFunc_GetPlayerController_ReturnValue_1) == 0x000040, "Member 'BPUI_HUD_NotificationMessage_C_ReleaseInput::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");

// Function BPUI_HUD_NotificationMessage.BPUI_HUD_NotificationMessage_C.CaptureInput
// 0x0020 (0x0020 - 0x0000)
struct BPUI_HUD_NotificationMessage_C_CaptureInput final
{
public:
	class ACAPlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_NotificationMessage_C_CaptureInput) == 0x000008, "Wrong alignment on BPUI_HUD_NotificationMessage_C_CaptureInput");
static_assert(sizeof(BPUI_HUD_NotificationMessage_C_CaptureInput) == 0x000020, "Wrong size on BPUI_HUD_NotificationMessage_C_CaptureInput");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_CaptureInput, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000000, "Member 'BPUI_HUD_NotificationMessage_C_CaptureInput::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_CaptureInput, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BPUI_HUD_NotificationMessage_C_CaptureInput::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_CaptureInput, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BPUI_HUD_NotificationMessage_C_CaptureInput::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_NotificationMessage_C_CaptureInput, CallFunc_K2_GetPawn_ReturnValue) == 0x000018, "Member 'BPUI_HUD_NotificationMessage_C_CaptureInput::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");

}

