#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUDVideoWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_HUDVideoWidget.BPUI_HUDVideoWidget_C
// 0x0090 (0x0348 - 0x02B8)
class UBPUI_HUDVideoWidget_C final : public UCAHUDVideoWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_45;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHUDActionButtonWithCoolDown_C*         Skip_btn;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VideoImage;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FCAHUDInteractionItemData              NewVar_0;                                          // 0x02D8(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BPUI_HUDVideoWidget(int32 EntryPoint);
	void OnCoolDownComplete();
	void OnSkipReleased();
	void OnSkipPressed();
	void BndEvt__BPUI_HUDVideoWidget_skip_btn_K2Node_ComponentBoundEvent_1_UIElementSelected__DelegateSignature(class UCABaseUIElement* button);
	void Destruct();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_HUDVideoWidget_C">();
	}
	static class UBPUI_HUDVideoWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_HUDVideoWidget_C>();
	}
};
static_assert(alignof(UBPUI_HUDVideoWidget_C) == 0x000008, "Wrong alignment on UBPUI_HUDVideoWidget_C");
static_assert(sizeof(UBPUI_HUDVideoWidget_C) == 0x000348, "Wrong size on UBPUI_HUDVideoWidget_C");
static_assert(offsetof(UBPUI_HUDVideoWidget_C, UberGraphFrame) == 0x0002B8, "Member 'UBPUI_HUDVideoWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_HUDVideoWidget_C, Image_45) == 0x0002C0, "Member 'UBPUI_HUDVideoWidget_C::Image_45' has a wrong offset!");
static_assert(offsetof(UBPUI_HUDVideoWidget_C, Skip_btn) == 0x0002C8, "Member 'UBPUI_HUDVideoWidget_C::Skip_btn' has a wrong offset!");
static_assert(offsetof(UBPUI_HUDVideoWidget_C, VideoImage) == 0x0002D0, "Member 'UBPUI_HUDVideoWidget_C::VideoImage' has a wrong offset!");
static_assert(offsetof(UBPUI_HUDVideoWidget_C, NewVar_0) == 0x0002D8, "Member 'UBPUI_HUDVideoWidget_C::NewVar_0' has a wrong offset!");

}

