#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_ArcLens_TeammateWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_ArcLens_TeammateWidget.BPUI_ArcLens_TeammateWidget_C
// 0x0048 (0x0558 - 0x0510)
class UBPUI_ArcLens_TeammateWidget_C final : public UCAArcLensTeammateWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       bump;                                              // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 bg;                                                // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_highlight_menuItem_C*               BP_highlight;                                      // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_HUD_InputDisplayWidget_C*         BPUI_HUD_InputDisplayWidget_1;                     // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_not_clamped_icon;                              // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Normal;                                            // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           BarColor;                                          // 0x0548(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPUI_ArcLens_TeammateWidget(int32 EntryPoint);
	void OnClampChanged(bool Is_clamped);
	void Construct();
	void OnHealthChanged(float Health, float Old_health);

	void OnPlayerColorChanged(const struct FLinearColor& Player_color) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_ArcLens_TeammateWidget_C">();
	}
	static class UBPUI_ArcLens_TeammateWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_ArcLens_TeammateWidget_C>();
	}
};
static_assert(alignof(UBPUI_ArcLens_TeammateWidget_C) == 0x000008, "Wrong alignment on UBPUI_ArcLens_TeammateWidget_C");
static_assert(sizeof(UBPUI_ArcLens_TeammateWidget_C) == 0x000558, "Wrong size on UBPUI_ArcLens_TeammateWidget_C");
static_assert(offsetof(UBPUI_ArcLens_TeammateWidget_C, UberGraphFrame) == 0x000510, "Member 'UBPUI_ArcLens_TeammateWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_ArcLens_TeammateWidget_C, bump) == 0x000518, "Member 'UBPUI_ArcLens_TeammateWidget_C::bump' has a wrong offset!");
static_assert(offsetof(UBPUI_ArcLens_TeammateWidget_C, bg) == 0x000520, "Member 'UBPUI_ArcLens_TeammateWidget_C::bg' has a wrong offset!");
static_assert(offsetof(UBPUI_ArcLens_TeammateWidget_C, BP_highlight) == 0x000528, "Member 'UBPUI_ArcLens_TeammateWidget_C::BP_highlight' has a wrong offset!");
static_assert(offsetof(UBPUI_ArcLens_TeammateWidget_C, BPUI_HUD_InputDisplayWidget_1) == 0x000530, "Member 'UBPUI_ArcLens_TeammateWidget_C::BPUI_HUD_InputDisplayWidget_1' has a wrong offset!");
static_assert(offsetof(UBPUI_ArcLens_TeammateWidget_C, Img_not_clamped_icon) == 0x000538, "Member 'UBPUI_ArcLens_TeammateWidget_C::Img_not_clamped_icon' has a wrong offset!");
static_assert(offsetof(UBPUI_ArcLens_TeammateWidget_C, Normal) == 0x000540, "Member 'UBPUI_ArcLens_TeammateWidget_C::Normal' has a wrong offset!");
static_assert(offsetof(UBPUI_ArcLens_TeammateWidget_C, BarColor) == 0x000548, "Member 'UBPUI_ArcLens_TeammateWidget_C::BarColor' has a wrong offset!");

}

