#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_PauseMenuHeader2

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_HUD_PauseMenuHeader2.BPUI_HUD_PauseMenuHeader2_C
// 0x0138 (0x0500 - 0x03C8)
class UBPUI_HUD_PauseMenuHeader2_C final : public UCAHUDHeaderMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       buttonSlide;                                       // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LogoAnim;                                          // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Contract_3;                                        // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Expand_3;                                          // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GlowBlink;                                         // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Expand_2;                                          // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Contract;                                          // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Expand;                                            // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         Action_hint_container_L;                           // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Action_hint_container_R;                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base;                                              // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_1;                                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HyenasLogo;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LogoSeq0_0;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LogoSeq0_1;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LogoSeq0_2;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LogoSeq0_3;                                        // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LogoSeq0_4;                                        // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LogoSeq0_5;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LogoSeq0_6;                                        // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LogoSeq0_7;                                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LogoSeq0_8;                                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LogoSeq0_9;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHUDActionButton_C*                     Next_action_symbol;                                // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHUDActionButton_C*                     Previous_action_symbol;                            // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ContractAnimPlayed;                                // 0x04A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ExpandAnimPlayed;                                  // 0x04A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4AA[0x2];                                      // 0x04AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           BlueColor;                                         // 0x04AC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DarkColor;                                         // 0x04BC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           WhiteColor;                                        // 0x04CC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           YellowColor;                                       // 0x04DC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           REDcolor;                                          // 0x04EC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPUI_HUD_PauseMenuHeader2(int32 EntryPoint);
	void ShowLogoAnim();
	void HideLogoAnim();
	void HeaderContract();
	void HeaderExpand();
	void HideTitleBox();
	void ShowTitleBox();
	void ShowActionHints(bool Show);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_HUD_PauseMenuHeader2_C">();
	}
	static class UBPUI_HUD_PauseMenuHeader2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_HUD_PauseMenuHeader2_C>();
	}
};
static_assert(alignof(UBPUI_HUD_PauseMenuHeader2_C) == 0x000008, "Wrong alignment on UBPUI_HUD_PauseMenuHeader2_C");
static_assert(sizeof(UBPUI_HUD_PauseMenuHeader2_C) == 0x000500, "Wrong size on UBPUI_HUD_PauseMenuHeader2_C");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, UberGraphFrame) == 0x0003C8, "Member 'UBPUI_HUD_PauseMenuHeader2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, buttonSlide) == 0x0003D0, "Member 'UBPUI_HUD_PauseMenuHeader2_C::buttonSlide' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, LogoAnim) == 0x0003D8, "Member 'UBPUI_HUD_PauseMenuHeader2_C::LogoAnim' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, Contract_3) == 0x0003E0, "Member 'UBPUI_HUD_PauseMenuHeader2_C::Contract_3' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, Expand_3) == 0x0003E8, "Member 'UBPUI_HUD_PauseMenuHeader2_C::Expand_3' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, GlowBlink) == 0x0003F0, "Member 'UBPUI_HUD_PauseMenuHeader2_C::GlowBlink' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, Expand_2) == 0x0003F8, "Member 'UBPUI_HUD_PauseMenuHeader2_C::Expand_2' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, Contract) == 0x000400, "Member 'UBPUI_HUD_PauseMenuHeader2_C::Contract' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, Expand) == 0x000408, "Member 'UBPUI_HUD_PauseMenuHeader2_C::Expand' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, Action_hint_container_L) == 0x000410, "Member 'UBPUI_HUD_PauseMenuHeader2_C::Action_hint_container_L' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, Action_hint_container_R) == 0x000418, "Member 'UBPUI_HUD_PauseMenuHeader2_C::Action_hint_container_R' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, Base) == 0x000420, "Member 'UBPUI_HUD_PauseMenuHeader2_C::Base' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, Base_1) == 0x000428, "Member 'UBPUI_HUD_PauseMenuHeader2_C::Base_1' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, Glow) == 0x000430, "Member 'UBPUI_HUD_PauseMenuHeader2_C::Glow' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, HyenasLogo) == 0x000438, "Member 'UBPUI_HUD_PauseMenuHeader2_C::HyenasLogo' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, LogoSeq0_0) == 0x000440, "Member 'UBPUI_HUD_PauseMenuHeader2_C::LogoSeq0_0' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, LogoSeq0_1) == 0x000448, "Member 'UBPUI_HUD_PauseMenuHeader2_C::LogoSeq0_1' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, LogoSeq0_2) == 0x000450, "Member 'UBPUI_HUD_PauseMenuHeader2_C::LogoSeq0_2' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, LogoSeq0_3) == 0x000458, "Member 'UBPUI_HUD_PauseMenuHeader2_C::LogoSeq0_3' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, LogoSeq0_4) == 0x000460, "Member 'UBPUI_HUD_PauseMenuHeader2_C::LogoSeq0_4' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, LogoSeq0_5) == 0x000468, "Member 'UBPUI_HUD_PauseMenuHeader2_C::LogoSeq0_5' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, LogoSeq0_6) == 0x000470, "Member 'UBPUI_HUD_PauseMenuHeader2_C::LogoSeq0_6' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, LogoSeq0_7) == 0x000478, "Member 'UBPUI_HUD_PauseMenuHeader2_C::LogoSeq0_7' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, LogoSeq0_8) == 0x000480, "Member 'UBPUI_HUD_PauseMenuHeader2_C::LogoSeq0_8' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, LogoSeq0_9) == 0x000488, "Member 'UBPUI_HUD_PauseMenuHeader2_C::LogoSeq0_9' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, Next_action_symbol) == 0x000490, "Member 'UBPUI_HUD_PauseMenuHeader2_C::Next_action_symbol' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, Previous_action_symbol) == 0x000498, "Member 'UBPUI_HUD_PauseMenuHeader2_C::Previous_action_symbol' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, RetainerBox_0) == 0x0004A0, "Member 'UBPUI_HUD_PauseMenuHeader2_C::RetainerBox_0' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, ContractAnimPlayed) == 0x0004A8, "Member 'UBPUI_HUD_PauseMenuHeader2_C::ContractAnimPlayed' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, ExpandAnimPlayed) == 0x0004A9, "Member 'UBPUI_HUD_PauseMenuHeader2_C::ExpandAnimPlayed' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, BlueColor) == 0x0004AC, "Member 'UBPUI_HUD_PauseMenuHeader2_C::BlueColor' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, DarkColor) == 0x0004BC, "Member 'UBPUI_HUD_PauseMenuHeader2_C::DarkColor' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, WhiteColor) == 0x0004CC, "Member 'UBPUI_HUD_PauseMenuHeader2_C::WhiteColor' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, YellowColor) == 0x0004DC, "Member 'UBPUI_HUD_PauseMenuHeader2_C::YellowColor' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PauseMenuHeader2_C, REDcolor) == 0x0004EC, "Member 'UBPUI_HUD_PauseMenuHeader2_C::REDcolor' has a wrong offset!");

}

