#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_PrimaryMessageGeneric_v3

#include "Basic.hpp"

#include "Keaton_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPUI_HUD_PrimaryMessageGeneric_v3.BPUI_HUD_PrimaryMessageGeneric_v3_C.ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3
// 0x02D0 (0x02D0 - 0x0000)
struct BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAPrimaryMessageTypesTableRow         CallFunc_GetMessageConfigData_ReturnValue;         // 0x0008(0x00D0)(ConstParm)
	struct FCAPrimaryMessagingData                CallFunc_GetMessagePayload_ReturnValue;            // 0x00D8(0x00E0)(ConstParm)
	bool                                          CallFunc_EqualEqual_LinearColorLinearColor_ReturnValue; // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01C0(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0200(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_LinearColorLinearColor_ReturnValue_1; // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0248(0x0010)(ReferenceParm)
	class FText                                   CallFunc_MakeTextFromCAText_text;                  // 0x0258(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0270(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0288(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x02A0(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3) == 0x000008, "Wrong alignment on BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3");
static_assert(sizeof(BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3) == 0x0002D0, "Wrong size on BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3");
static_assert(offsetof(BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3, EntryPoint) == 0x000000, "Member 'BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3, CallFunc_GetMessageConfigData_ReturnValue) == 0x000008, "Member 'BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3::CallFunc_GetMessageConfigData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3, CallFunc_GetMessagePayload_ReturnValue) == 0x0000D8, "Member 'BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3::CallFunc_GetMessagePayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3, CallFunc_EqualEqual_LinearColorLinearColor_ReturnValue) == 0x0001B8, "Member 'BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3::CallFunc_EqualEqual_LinearColorLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3, K2Node_MakeStruct_FormatArgumentData) == 0x0001C0, "Member 'BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3, K2Node_MakeStruct_FormatArgumentData_1) == 0x000200, "Member 'BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3, CallFunc_EqualEqual_LinearColorLinearColor_ReturnValue_1) == 0x000240, "Member 'BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3::CallFunc_EqualEqual_LinearColorLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3, K2Node_MakeArray_Array) == 0x000248, "Member 'BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3, CallFunc_MakeTextFromCAText_text) == 0x000258, "Member 'BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3::CallFunc_MakeTextFromCAText_text' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3, CallFunc_Format_ReturnValue) == 0x000270, "Member 'BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3, K2Node_CreateDelegate_OutputDelegate) == 0x000288, "Member 'BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3, CallFunc_TextToUpper_ReturnValue) == 0x0002A0, "Member 'BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3, CallFunc_PlayAnimation_ReturnValue) == 0x0002B8, "Member 'BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3, CallFunc_PlayAnimation_ReturnValue_1) == 0x0002C0, "Member 'BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3, CallFunc_PlayAnimation_ReturnValue_2) == 0x0002C8, "Member 'BPUI_HUD_PrimaryMessageGeneric_v3_C_ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

// Function BPUI_HUD_PrimaryMessageGeneric_v3.BPUI_HUD_PrimaryMessageGeneric_v3_C.PlayFadeAnimation
// 0x0008 (0x0008 - 0x0000)
struct BPUI_HUD_PrimaryMessageGeneric_v3_C_PlayFadeAnimation final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_PrimaryMessageGeneric_v3_C_PlayFadeAnimation) == 0x000008, "Wrong alignment on BPUI_HUD_PrimaryMessageGeneric_v3_C_PlayFadeAnimation");
static_assert(sizeof(BPUI_HUD_PrimaryMessageGeneric_v3_C_PlayFadeAnimation) == 0x000008, "Wrong size on BPUI_HUD_PrimaryMessageGeneric_v3_C_PlayFadeAnimation");
static_assert(offsetof(BPUI_HUD_PrimaryMessageGeneric_v3_C_PlayFadeAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'BPUI_HUD_PrimaryMessageGeneric_v3_C_PlayFadeAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

