#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_InventoryItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_InventoryItem.BPUI_InventoryItem_C
// 0x0018 (0x0460 - 0x0448)
class UBPUI_InventoryItem_C final : public UCAHUDInventoryItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0448(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_130;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Info_background_img;                               // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPUI_InventoryItem(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_InventoryItem_C">();
	}
	static class UBPUI_InventoryItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_InventoryItem_C>();
	}
};
static_assert(alignof(UBPUI_InventoryItem_C) == 0x000008, "Wrong alignment on UBPUI_InventoryItem_C");
static_assert(sizeof(UBPUI_InventoryItem_C) == 0x000460, "Wrong size on UBPUI_InventoryItem_C");
static_assert(offsetof(UBPUI_InventoryItem_C, UberGraphFrame) == 0x000448, "Member 'UBPUI_InventoryItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_InventoryItem_C, Image_130) == 0x000450, "Member 'UBPUI_InventoryItem_C::Image_130' has a wrong offset!");
static_assert(offsetof(UBPUI_InventoryItem_C, Info_background_img) == 0x000458, "Member 'UBPUI_InventoryItem_C::Info_background_img' has a wrong offset!");

}

