#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HowToPlay_Card

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_HowToPlay_Card.BPUI_HowToPlay_Card_C
// 0x0068 (0x02F8 - 0x0290)
class UBPUI_HowToPlay_Card_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCATextBlock*                           Desc;                                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DT_icon;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCATextBlock*                           Label;                                             // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Stripe;                                            // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Waves;                                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UCAGamemodeInstructionsStep> Instructions_step;                                 // 0x02C0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UBPUI_HowToPlay_CardContainer_C*        Parent;                                            // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPUI_HowToPlay_Card(int32 EntryPoint);
	void SetInstructionsStep(TSoftObjectPtr<class UCAGamemodeInstructionsStep> InstructionsStep, int32 CardIndex);
	void OnLoaded_52116C524653BCC5E85BFE898261A163(class UObject* Loaded);
	void OnLoaded_5039088C4FD4E1FB196E5F88F03D955E(class UObject* Loaded);
	void SetInstructionsStepInternal(TSoftObjectPtr<class UCAGamemodeInstructionsStep> InstructionsStep, int32 CardIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_HowToPlay_Card_C">();
	}
	static class UBPUI_HowToPlay_Card_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_HowToPlay_Card_C>();
	}
};
static_assert(alignof(UBPUI_HowToPlay_Card_C) == 0x000008, "Wrong alignment on UBPUI_HowToPlay_Card_C");
static_assert(sizeof(UBPUI_HowToPlay_Card_C) == 0x0002F8, "Wrong size on UBPUI_HowToPlay_Card_C");
static_assert(offsetof(UBPUI_HowToPlay_Card_C, UberGraphFrame) == 0x000290, "Member 'UBPUI_HowToPlay_Card_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_HowToPlay_Card_C, Desc) == 0x000298, "Member 'UBPUI_HowToPlay_Card_C::Desc' has a wrong offset!");
static_assert(offsetof(UBPUI_HowToPlay_Card_C, DT_icon) == 0x0002A0, "Member 'UBPUI_HowToPlay_Card_C::DT_icon' has a wrong offset!");
static_assert(offsetof(UBPUI_HowToPlay_Card_C, Label) == 0x0002A8, "Member 'UBPUI_HowToPlay_Card_C::Label' has a wrong offset!");
static_assert(offsetof(UBPUI_HowToPlay_Card_C, Stripe) == 0x0002B0, "Member 'UBPUI_HowToPlay_Card_C::Stripe' has a wrong offset!");
static_assert(offsetof(UBPUI_HowToPlay_Card_C, Waves) == 0x0002B8, "Member 'UBPUI_HowToPlay_Card_C::Waves' has a wrong offset!");
static_assert(offsetof(UBPUI_HowToPlay_Card_C, Instructions_step) == 0x0002C0, "Member 'UBPUI_HowToPlay_Card_C::Instructions_step' has a wrong offset!");
static_assert(offsetof(UBPUI_HowToPlay_Card_C, Parent) == 0x0002F0, "Member 'UBPUI_HowToPlay_Card_C::Parent' has a wrong offset!");

}

