#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_ScreenPropaganda_NewYorkAds

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_ScreenPropaganda_NewYorkAds.BPUI_ScreenPropaganda_NewYorkAds_C
// 0x0050 (0x02F0 - 0x02A0)
class UBPUI_ScreenPropaganda_NewYorkAds_C final : public UCAWidgetViewWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_1;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SecurityScreen;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitch;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         WidgetIndex;                                       // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimerDelay;                                        // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberOfWidgets;                                   // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           ImageSwitchTimer;                                  // 0x02E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         AlertedWidgetIndex;                                // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPUI_ScreenPropaganda_NewYorkAds(int32 EntryPoint);
	void UpdateWidget(int32 WidgetIndex_0);
	void UpdateNPCSpawnTime(int32 NPCWaveSpawnTime);
	void PreConstruct(bool IsDesignTime);
	void UpdateSecurityStatus(bool IsAlerted);
	void Construct();
	void ImageSwitch();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_ScreenPropaganda_NewYorkAds_C">();
	}
	static class UBPUI_ScreenPropaganda_NewYorkAds_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_ScreenPropaganda_NewYorkAds_C>();
	}
};
static_assert(alignof(UBPUI_ScreenPropaganda_NewYorkAds_C) == 0x000008, "Wrong alignment on UBPUI_ScreenPropaganda_NewYorkAds_C");
static_assert(sizeof(UBPUI_ScreenPropaganda_NewYorkAds_C) == 0x0002F0, "Wrong size on UBPUI_ScreenPropaganda_NewYorkAds_C");
static_assert(offsetof(UBPUI_ScreenPropaganda_NewYorkAds_C, UberGraphFrame) == 0x0002A0, "Member 'UBPUI_ScreenPropaganda_NewYorkAds_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_ScreenPropaganda_NewYorkAds_C, Image_1) == 0x0002A8, "Member 'UBPUI_ScreenPropaganda_NewYorkAds_C::Image_1' has a wrong offset!");
static_assert(offsetof(UBPUI_ScreenPropaganda_NewYorkAds_C, Image_2) == 0x0002B0, "Member 'UBPUI_ScreenPropaganda_NewYorkAds_C::Image_2' has a wrong offset!");
static_assert(offsetof(UBPUI_ScreenPropaganda_NewYorkAds_C, Image_3) == 0x0002B8, "Member 'UBPUI_ScreenPropaganda_NewYorkAds_C::Image_3' has a wrong offset!");
static_assert(offsetof(UBPUI_ScreenPropaganda_NewYorkAds_C, SecurityScreen) == 0x0002C0, "Member 'UBPUI_ScreenPropaganda_NewYorkAds_C::SecurityScreen' has a wrong offset!");
static_assert(offsetof(UBPUI_ScreenPropaganda_NewYorkAds_C, WidgetSwitch) == 0x0002C8, "Member 'UBPUI_ScreenPropaganda_NewYorkAds_C::WidgetSwitch' has a wrong offset!");
static_assert(offsetof(UBPUI_ScreenPropaganda_NewYorkAds_C, WidgetIndex) == 0x0002D0, "Member 'UBPUI_ScreenPropaganda_NewYorkAds_C::WidgetIndex' has a wrong offset!");
static_assert(offsetof(UBPUI_ScreenPropaganda_NewYorkAds_C, TimerDelay) == 0x0002D4, "Member 'UBPUI_ScreenPropaganda_NewYorkAds_C::TimerDelay' has a wrong offset!");
static_assert(offsetof(UBPUI_ScreenPropaganda_NewYorkAds_C, NumberOfWidgets) == 0x0002D8, "Member 'UBPUI_ScreenPropaganda_NewYorkAds_C::NumberOfWidgets' has a wrong offset!");
static_assert(offsetof(UBPUI_ScreenPropaganda_NewYorkAds_C, ImageSwitchTimer) == 0x0002E0, "Member 'UBPUI_ScreenPropaganda_NewYorkAds_C::ImageSwitchTimer' has a wrong offset!");
static_assert(offsetof(UBPUI_ScreenPropaganda_NewYorkAds_C, AlertedWidgetIndex) == 0x0002E8, "Member 'UBPUI_ScreenPropaganda_NewYorkAds_C::AlertedWidgetIndex' has a wrong offset!");

}

