#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_InputTextWrapper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_InputTextWrapper.BPUI_InputTextWrapper_C
// 0x0010 (0x04A8 - 0x0498)
class UBPUI_InputTextWrapper_C final : public UCAHUDInputTextWrapper
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0498(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         ReferenceTopPadding;                               // 0x04A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReferenceFontSize;                                 // 0x04A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPUI_InputTextWrapper(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnInputTextChanged(bool Has_any_icon);
	void CalculatePadding(bool HasAnyIcon);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_InputTextWrapper_C">();
	}
	static class UBPUI_InputTextWrapper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_InputTextWrapper_C>();
	}
};
static_assert(alignof(UBPUI_InputTextWrapper_C) == 0x000008, "Wrong alignment on UBPUI_InputTextWrapper_C");
static_assert(sizeof(UBPUI_InputTextWrapper_C) == 0x0004A8, "Wrong size on UBPUI_InputTextWrapper_C");
static_assert(offsetof(UBPUI_InputTextWrapper_C, UberGraphFrame) == 0x000498, "Member 'UBPUI_InputTextWrapper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_InputTextWrapper_C, ReferenceTopPadding) == 0x0004A0, "Member 'UBPUI_InputTextWrapper_C::ReferenceTopPadding' has a wrong offset!");
static_assert(offsetof(UBPUI_InputTextWrapper_C, ReferenceFontSize) == 0x0004A4, "Member 'UBPUI_InputTextWrapper_C::ReferenceFontSize' has a wrong offset!");

}

