#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_GadgetCelebration

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BPUI_HUD_GadgetCelebration.BPUI_HUD_GadgetCelebration_C.ExecuteUbergraph_BPUI_HUD_GadgetCelebration
// 0x0098 (0x0098 - 0x0000)
struct BPUI_HUD_GadgetCelebration_C_ExecuteUbergraph_BPUI_HUD_GadgetCelebration final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeTextFromCAText_text;                  // 0x0008(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0050(0x0028)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0078(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_GadgetCelebration_C_ExecuteUbergraph_BPUI_HUD_GadgetCelebration) == 0x000008, "Wrong alignment on BPUI_HUD_GadgetCelebration_C_ExecuteUbergraph_BPUI_HUD_GadgetCelebration");
static_assert(sizeof(BPUI_HUD_GadgetCelebration_C_ExecuteUbergraph_BPUI_HUD_GadgetCelebration) == 0x000098, "Wrong size on BPUI_HUD_GadgetCelebration_C_ExecuteUbergraph_BPUI_HUD_GadgetCelebration");
static_assert(offsetof(BPUI_HUD_GadgetCelebration_C_ExecuteUbergraph_BPUI_HUD_GadgetCelebration, EntryPoint) == 0x000000, "Member 'BPUI_HUD_GadgetCelebration_C_ExecuteUbergraph_BPUI_HUD_GadgetCelebration::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_GadgetCelebration_C_ExecuteUbergraph_BPUI_HUD_GadgetCelebration, CallFunc_MakeTextFromCAText_text) == 0x000008, "Member 'BPUI_HUD_GadgetCelebration_C_ExecuteUbergraph_BPUI_HUD_GadgetCelebration::CallFunc_MakeTextFromCAText_text' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_GadgetCelebration_C_ExecuteUbergraph_BPUI_HUD_GadgetCelebration, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'BPUI_HUD_GadgetCelebration_C_ExecuteUbergraph_BPUI_HUD_GadgetCelebration::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_GadgetCelebration_C_ExecuteUbergraph_BPUI_HUD_GadgetCelebration, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'BPUI_HUD_GadgetCelebration_C_ExecuteUbergraph_BPUI_HUD_GadgetCelebration::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_GadgetCelebration_C_ExecuteUbergraph_BPUI_HUD_GadgetCelebration, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000040, "Member 'BPUI_HUD_GadgetCelebration_C_ExecuteUbergraph_BPUI_HUD_GadgetCelebration::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_GadgetCelebration_C_ExecuteUbergraph_BPUI_HUD_GadgetCelebration, K2Node_MakeStruct_SlateColor) == 0x000050, "Member 'BPUI_HUD_GadgetCelebration_C_ExecuteUbergraph_BPUI_HUD_GadgetCelebration::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_GadgetCelebration_C_ExecuteUbergraph_BPUI_HUD_GadgetCelebration, K2Node_CreateDelegate_OutputDelegate_1) == 0x000078, "Member 'BPUI_HUD_GadgetCelebration_C_ExecuteUbergraph_BPUI_HUD_GadgetCelebration::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_GadgetCelebration_C_ExecuteUbergraph_BPUI_HUD_GadgetCelebration, CallFunc_PlayAnimation_ReturnValue_1) == 0x000090, "Member 'BPUI_HUD_GadgetCelebration_C_ExecuteUbergraph_BPUI_HUD_GadgetCelebration::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

