#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_Mk5_SegBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"
#include "S_UI_SegBarColours_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_HUD_Mk5_SegBar.BPUI_HUD_Mk5_SegBar_C
// 0x00B8 (0x0488 - 0x03D0)
class UBPUI_HUD_Mk5_SegBar_C final : public UCAHUDSegmentedBarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DamageFlash;                                       // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBPUI_HUD_Mk5_SegBar_Damage_C*          BPUI_HUD_Mk5_SegBar_Damage;                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_HUD_Mk5_SegBar_Damage_C*          BPUI_HUD_Mk5_SegBar_Damage_1;                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_HUD_Mk5_SegBar_Damage_C*          BPUI_HUD_Mk5_SegBar_Damage_2;                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Health_Bar;                                    // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MAT_Bar;                                           // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_UI_SegBarColours                    STR_ActiveColours;                                 // 0x0408(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Total_Segs;                                        // 0x0448(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Margin_Width;                                      // 0x044C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Active_Segs;                                       // 0x0450(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Normalised_Val;                                    // 0x0454(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Target_Val;                                        // 0x0458(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Mat_Bar_Dmg;                                       // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StoredValue;                                       // 0x0468(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBPUI_HUD_Mk5_SegBar_Damage_C*>  DamageBars;                                        // 0x0470(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         DamageBarToPlay;                                   // 0x0480(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPUI_HUD_Mk5_SegBar(int32 EntryPoint);
	void SetBarData(float Total_segs, float Margin_width, float Active_segs, float Normalised_val, float Target_val);
	void Construct();
	void SetActiveColours(const struct FS_UI_SegBarColours& STR_ActiveColours_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_HUD_Mk5_SegBar_C">();
	}
	static class UBPUI_HUD_Mk5_SegBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_HUD_Mk5_SegBar_C>();
	}
};
static_assert(alignof(UBPUI_HUD_Mk5_SegBar_C) == 0x000008, "Wrong alignment on UBPUI_HUD_Mk5_SegBar_C");
static_assert(sizeof(UBPUI_HUD_Mk5_SegBar_C) == 0x000488, "Wrong size on UBPUI_HUD_Mk5_SegBar_C");
static_assert(offsetof(UBPUI_HUD_Mk5_SegBar_C, UberGraphFrame) == 0x0003D0, "Member 'UBPUI_HUD_Mk5_SegBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_Mk5_SegBar_C, DamageFlash) == 0x0003D8, "Member 'UBPUI_HUD_Mk5_SegBar_C::DamageFlash' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_Mk5_SegBar_C, BPUI_HUD_Mk5_SegBar_Damage) == 0x0003E0, "Member 'UBPUI_HUD_Mk5_SegBar_C::BPUI_HUD_Mk5_SegBar_Damage' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_Mk5_SegBar_C, BPUI_HUD_Mk5_SegBar_Damage_1) == 0x0003E8, "Member 'UBPUI_HUD_Mk5_SegBar_C::BPUI_HUD_Mk5_SegBar_Damage_1' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_Mk5_SegBar_C, BPUI_HUD_Mk5_SegBar_Damage_2) == 0x0003F0, "Member 'UBPUI_HUD_Mk5_SegBar_C::BPUI_HUD_Mk5_SegBar_Damage_2' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_Mk5_SegBar_C, IMG_Health_Bar) == 0x0003F8, "Member 'UBPUI_HUD_Mk5_SegBar_C::IMG_Health_Bar' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_Mk5_SegBar_C, MAT_Bar) == 0x000400, "Member 'UBPUI_HUD_Mk5_SegBar_C::MAT_Bar' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_Mk5_SegBar_C, STR_ActiveColours) == 0x000408, "Member 'UBPUI_HUD_Mk5_SegBar_C::STR_ActiveColours' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_Mk5_SegBar_C, Total_Segs) == 0x000448, "Member 'UBPUI_HUD_Mk5_SegBar_C::Total_Segs' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_Mk5_SegBar_C, Margin_Width) == 0x00044C, "Member 'UBPUI_HUD_Mk5_SegBar_C::Margin_Width' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_Mk5_SegBar_C, Active_Segs) == 0x000450, "Member 'UBPUI_HUD_Mk5_SegBar_C::Active_Segs' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_Mk5_SegBar_C, Normalised_Val) == 0x000454, "Member 'UBPUI_HUD_Mk5_SegBar_C::Normalised_Val' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_Mk5_SegBar_C, Target_Val) == 0x000458, "Member 'UBPUI_HUD_Mk5_SegBar_C::Target_Val' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_Mk5_SegBar_C, Mat_Bar_Dmg) == 0x000460, "Member 'UBPUI_HUD_Mk5_SegBar_C::Mat_Bar_Dmg' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_Mk5_SegBar_C, StoredValue) == 0x000468, "Member 'UBPUI_HUD_Mk5_SegBar_C::StoredValue' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_Mk5_SegBar_C, DamageBars) == 0x000470, "Member 'UBPUI_HUD_Mk5_SegBar_C::DamageBars' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_Mk5_SegBar_C, DamageBarToPlay) == 0x000480, "Member 'UBPUI_HUD_Mk5_SegBar_C::DamageBarToPlay' has a wrong offset!");

}

