#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_SocialPartyContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_HUD_SocialPartyContainer.BPUI_HUD_SocialPartyContainer_C
// 0x0030 (0x0400 - 0x03D0)
class UBPUI_HUD_SocialPartyContainer_C final : public UCAHUDSocialPartyContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_SocialPartyScreen_C*                BP_SocialPartyScreen;                              // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsMatchStartActive;                                // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PartyPlayerCard_C*                  ActionsCard;                                       // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ActionBack;                                        // 0x03F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPUI_HUD_SocialPartyContainer(int32 EntryPoint);
	void OnPartyPlayerCardStateChanged_Event_0(class UBP_PartyPlayerCard_C* PartyPlayerCard, ECAPartyPlayerCardState PartyCardState);
	void OnPressedBack();
	void OnDisconnectedTeammatesChanged();
	void SetFocusOnFirstAvailableTeammate();
	void OnInputCaptured();
	void OnHide();
	void OnShow();
	void CaptureInput();
	void ReleaseInput();
	void TryFindTeammateForFocus(class UBP_PartyPlayerCard_C** PlayerCard);
	void UpdateDisconnectedTeammates();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_HUD_SocialPartyContainer_C">();
	}
	static class UBPUI_HUD_SocialPartyContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_HUD_SocialPartyContainer_C>();
	}
};
static_assert(alignof(UBPUI_HUD_SocialPartyContainer_C) == 0x000008, "Wrong alignment on UBPUI_HUD_SocialPartyContainer_C");
static_assert(sizeof(UBPUI_HUD_SocialPartyContainer_C) == 0x000400, "Wrong size on UBPUI_HUD_SocialPartyContainer_C");
static_assert(offsetof(UBPUI_HUD_SocialPartyContainer_C, UberGraphFrame) == 0x0003D0, "Member 'UBPUI_HUD_SocialPartyContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_SocialPartyContainer_C, BP_SocialPartyScreen) == 0x0003D8, "Member 'UBPUI_HUD_SocialPartyContainer_C::BP_SocialPartyScreen' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_SocialPartyContainer_C, IsMatchStartActive) == 0x0003E0, "Member 'UBPUI_HUD_SocialPartyContainer_C::IsMatchStartActive' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_SocialPartyContainer_C, ActionsCard) == 0x0003E8, "Member 'UBPUI_HUD_SocialPartyContainer_C::ActionsCard' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_SocialPartyContainer_C, ActionBack) == 0x0003F0, "Member 'UBPUI_HUD_SocialPartyContainer_C::ActionBack' has a wrong offset!");

}

