#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_InGame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPUI_HUD_InGame.BPUI_HUD_InGame_C
// 0x0018 (0x0780 - 0x0768)
class ABPUI_HUD_InGame_C final : public ACAHUD_InGameMain
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0768(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPUI_HUD_TagComponent_C*               BPUI_HUD_TagComponent;                             // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPUI_HUD_InGame(int32 EntryPoint);
	void NotifyPlayerPawnChanged(class APawn* Player_pawn);
	void NotifyTagAdded(const struct FGameplayTag& Tag);
	void NotifyTagRemoved(const struct FGameplayTag& Tag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_HUD_InGame_C">();
	}
	static class ABPUI_HUD_InGame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPUI_HUD_InGame_C>();
	}
};
static_assert(alignof(ABPUI_HUD_InGame_C) == 0x000008, "Wrong alignment on ABPUI_HUD_InGame_C");
static_assert(sizeof(ABPUI_HUD_InGame_C) == 0x000780, "Wrong size on ABPUI_HUD_InGame_C");
static_assert(offsetof(ABPUI_HUD_InGame_C, UberGraphFrame) == 0x000768, "Member 'ABPUI_HUD_InGame_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABPUI_HUD_InGame_C, BPUI_HUD_TagComponent) == 0x000770, "Member 'ABPUI_HUD_InGame_C::BPUI_HUD_TagComponent' has a wrong offset!");
static_assert(offsetof(ABPUI_HUD_InGame_C, DefaultSceneRoot) == 0x000778, "Member 'ABPUI_HUD_InGame_C::DefaultSceneRoot' has a wrong offset!");

}

