#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_TagComponent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Keaton_structs.hpp"


namespace SDK::Params
{

// Function BPUI_HUD_TagComponent.BPUI_HUD_TagComponent_C.ExecuteUbergraph_BPUI_HUD_TagComponent
// 0x0110 (0x0110 - 0x0000)
struct BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_Tag_1;                                // 0x0014(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_Tag;                                  // 0x0020(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_player_pawn;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAHUDSectionEMPStatus                 CallFunc_Map_Find_Value;                           // 0x0048(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAHUDSectionEMPStatus                 CallFunc_Map_Find_Value_1;                         // 0x0068(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   CallFunc_Map_Keys_Keys;                            // 0x0088(0x0010)(ReferenceParm)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0098(0x000C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAHUDSectionEMPStatus                 CallFunc_Map_Find_Value_2;                         // 0x00A8(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasGameplayTag_ReturnValue;               // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C3[0x1];                                       // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   CallFunc_Map_Keys_Keys_1;                          // 0x00C8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item_1;                         // 0x00DC(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAHUDSectionEMPStatus                 CallFunc_Map_Find_Value_3;                         // 0x00F0(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue_3;                   // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent) == 0x000008, "Wrong alignment on BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent");
static_assert(sizeof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent) == 0x000110, "Wrong size on BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, EntryPoint) == 0x000000, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, K2Node_Event_Tag_1) == 0x000014, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::K2Node_Event_Tag_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, K2Node_Event_Tag) == 0x000020, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::K2Node_Event_Tag' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, K2Node_Event_player_pawn) == 0x000030, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::K2Node_Event_player_pawn' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x000038, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, CallFunc_Map_Find_Value) == 0x000048, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, CallFunc_Map_Find_ReturnValue) == 0x000060, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, CallFunc_Map_Find_Value_1) == 0x000068, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, CallFunc_Map_Find_ReturnValue_1) == 0x000080, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, Temp_int_Loop_Counter_Variable_1) == 0x000084, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, CallFunc_Map_Keys_Keys) == 0x000088, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, CallFunc_Array_Get_Item) == 0x000098, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, CallFunc_Array_Length_ReturnValue) == 0x0000A4, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, CallFunc_Map_Find_Value_2) == 0x0000A8, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, CallFunc_Map_Find_ReturnValue_2) == 0x0000C0, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, CallFunc_Less_IntInt_ReturnValue) == 0x0000C1, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, CallFunc_HasGameplayTag_ReturnValue) == 0x0000C2, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::CallFunc_HasGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000C4, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, CallFunc_Map_Keys_Keys_1) == 0x0000C8, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::CallFunc_Map_Keys_Keys_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, CallFunc_Array_Length_ReturnValue_1) == 0x0000D8, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, CallFunc_Array_Get_Item_1) == 0x0000DC, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000E8, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, CallFunc_Map_Find_Value_3) == 0x0000F0, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::CallFunc_Map_Find_Value_3' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent, CallFunc_Map_Find_ReturnValue_3) == 0x000108, "Member 'BPUI_HUD_TagComponent_C_ExecuteUbergraph_BPUI_HUD_TagComponent::CallFunc_Map_Find_ReturnValue_3' has a wrong offset!");

// Function BPUI_HUD_TagComponent.BPUI_HUD_TagComponent_C.NotifyPlayerPawnChanged
// 0x0008 (0x0008 - 0x0000)
struct BPUI_HUD_TagComponent_C_NotifyPlayerPawnChanged final
{
public:
	class APawn*                                  Player_pawn;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_TagComponent_C_NotifyPlayerPawnChanged) == 0x000008, "Wrong alignment on BPUI_HUD_TagComponent_C_NotifyPlayerPawnChanged");
static_assert(sizeof(BPUI_HUD_TagComponent_C_NotifyPlayerPawnChanged) == 0x000008, "Wrong size on BPUI_HUD_TagComponent_C_NotifyPlayerPawnChanged");
static_assert(offsetof(BPUI_HUD_TagComponent_C_NotifyPlayerPawnChanged, Player_pawn) == 0x000000, "Member 'BPUI_HUD_TagComponent_C_NotifyPlayerPawnChanged::Player_pawn' has a wrong offset!");

// Function BPUI_HUD_TagComponent.BPUI_HUD_TagComponent_C.NotifyTagRemoved
// 0x000C (0x000C - 0x0000)
struct BPUI_HUD_TagComponent_C_NotifyTagRemoved final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_TagComponent_C_NotifyTagRemoved) == 0x000004, "Wrong alignment on BPUI_HUD_TagComponent_C_NotifyTagRemoved");
static_assert(sizeof(BPUI_HUD_TagComponent_C_NotifyTagRemoved) == 0x00000C, "Wrong size on BPUI_HUD_TagComponent_C_NotifyTagRemoved");
static_assert(offsetof(BPUI_HUD_TagComponent_C_NotifyTagRemoved, Tag) == 0x000000, "Member 'BPUI_HUD_TagComponent_C_NotifyTagRemoved::Tag' has a wrong offset!");

// Function BPUI_HUD_TagComponent.BPUI_HUD_TagComponent_C.NotifyTagAdded
// 0x000C (0x000C - 0x0000)
struct BPUI_HUD_TagComponent_C_NotifyTagAdded final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_TagComponent_C_NotifyTagAdded) == 0x000004, "Wrong alignment on BPUI_HUD_TagComponent_C_NotifyTagAdded");
static_assert(sizeof(BPUI_HUD_TagComponent_C_NotifyTagAdded) == 0x00000C, "Wrong size on BPUI_HUD_TagComponent_C_NotifyTagAdded");
static_assert(offsetof(BPUI_HUD_TagComponent_C_NotifyTagAdded, Tag) == 0x000000, "Member 'BPUI_HUD_TagComponent_C_NotifyTagAdded::Tag' has a wrong offset!");

// Function BPUI_HUD_TagComponent.BPUI_HUD_TagComponent_C.UpdateEMPVisualsForWidget
// 0x00B0 (0x00B0 - 0x0000)
struct BPUI_HUD_TagComponent_C_UpdateEMPVisualsForWidget final
{
public:
	bool                                          Is_Under_EMP;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           HUD_Section_Tag;                                   // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FCAHUDSectionEMPStatus                 HUD_Section_Status;                                // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class UCAHUDHideableWidget*>           LocalSectionWidgets;                               // 0x0028(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCAHUDHideableWidget*>           CallFunc_GetHudSectionWidgets_out_section_widgets; // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          Temp_bool_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAHUDHideableWidget*                   CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAHUDHideableWidget*                   CallFunc_Array_Get_Item_1;                         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Map_Find_Value;                           // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_TagComponent_C_UpdateEMPVisualsForWidget) == 0x000008, "Wrong alignment on BPUI_HUD_TagComponent_C_UpdateEMPVisualsForWidget");
static_assert(sizeof(BPUI_HUD_TagComponent_C_UpdateEMPVisualsForWidget) == 0x0000B0, "Wrong size on BPUI_HUD_TagComponent_C_UpdateEMPVisualsForWidget");
static_assert(offsetof(BPUI_HUD_TagComponent_C_UpdateEMPVisualsForWidget, Is_Under_EMP) == 0x000000, "Member 'BPUI_HUD_TagComponent_C_UpdateEMPVisualsForWidget::Is_Under_EMP' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_TagComponent_C_UpdateEMPVisualsForWidget, HUD_Section_Tag) == 0x000004, "Member 'BPUI_HUD_TagComponent_C_UpdateEMPVisualsForWidget::HUD_Section_Tag' has a wrong offset!");
