#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_PopupMessage

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BPUI_HUD_PopupMessage.BPUI_HUD_PopupMessage_C.ExecuteUbergraph_BPUI_HUD_PopupMessage
// 0x0098 (0x0098 - 0x0000)
struct BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAHUDScreenManager*                    CallFunc_GetHudScreenManager_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0050(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetActiveScreenPerScreenType_ReturnValue; // 0x0060(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAHUDScreenManager*                    CallFunc_GetHudScreenManager_ReturnValue_1;        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_1;     // 0x007C(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetActiveScreenPerScreenType_ReturnValue_1; // 0x0088(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue_1;         // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage) == 0x000008, "Wrong alignment on BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage");
static_assert(sizeof(BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage) == 0x000098, "Wrong size on BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage");
static_assert(offsetof(BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage, EntryPoint) == 0x000000, "Member 'BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage, CallFunc_K2_GetPawn_ReturnValue) == 0x000030, "Member 'BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage, CallFunc_GetPlayerController_ReturnValue_1) == 0x000038, "Member 'BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage, CallFunc_K2_GetPawn_ReturnValue_1) == 0x000040, "Member 'BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage, CallFunc_GetHudScreenManager_ReturnValue) == 0x000048, "Member 'BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage::CallFunc_GetHudScreenManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000050, "Member 'BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage, CallFunc_IsValid_ReturnValue) == 0x00005C, "Member 'BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage, CallFunc_GetActiveScreenPerScreenType_ReturnValue) == 0x000060, "Member 'BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage::CallFunc_GetActiveScreenPerScreenType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage, CallFunc_IsGameplayTagValid_ReturnValue) == 0x00006C, "Member 'BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage, CallFunc_GetHudScreenManager_ReturnValue_1) == 0x000070, "Member 'BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage::CallFunc_GetHudScreenManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage, CallFunc_MakeLiteralGameplayTag_ReturnValue_1) == 0x00007C, "Member 'BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage::CallFunc_MakeLiteralGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage, CallFunc_GetActiveScreenPerScreenType_ReturnValue_1) == 0x000088, "Member 'BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage::CallFunc_GetActiveScreenPerScreenType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage, CallFunc_IsGameplayTagValid_ReturnValue_1) == 0x000094, "Member 'BPUI_HUD_PopupMessage_C_ExecuteUbergraph_BPUI_HUD_PopupMessage::CallFunc_IsGameplayTagValid_ReturnValue_1' has a wrong offset!");

// Function BPUI_HUD_PopupMessage.BPUI_HUD_PopupMessage_C.Block Game Input
// 0x0014 (0x0014 - 0x0000)
struct BPUI_HUD_PopupMessage_C_Block_Game_Input final
{
public:
	TDelegate<void()>                             Callback;                                          // 0x0000(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor)
};
static_assert(alignof(BPUI_HUD_PopupMessage_C_Block_Game_Input) == 0x000004, "Wrong alignment on BPUI_HUD_PopupMessage_C_Block_Game_Input");
static_assert(sizeof(BPUI_HUD_PopupMessage_C_Block_Game_Input) == 0x000014, "Wrong size on BPUI_HUD_PopupMessage_C_Block_Game_Input");
static_assert(offsetof(BPUI_HUD_PopupMessage_C_Block_Game_Input, Callback) == 0x000000, "Member 'BPUI_HUD_PopupMessage_C_Block_Game_Input::Callback' has a wrong offset!");

}

