#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_ScreenPropagandaAmericana

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPUI_ScreenPropagandaAmericana.BPUI_ScreenPropagandaAmericana_C.ExecuteUbergraph_BPUI_ScreenPropagandaAmericana
// 0x0038 (0x0038 - 0x0000)
struct BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumWidgets_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsAlerted;                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NPCWaveSpawnTime;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_WidgetIndex;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana) == 0x000008, "Wrong alignment on BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana");
static_assert(sizeof(BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana) == 0x000038, "Wrong size on BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana");
static_assert(offsetof(BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana, EntryPoint) == 0x000000, "Member 'BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana, CallFunc_GetNumWidgets_ReturnValue) == 0x000008, "Member 'BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana::CallFunc_GetNumWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana, K2Node_Event_IsAlerted) == 0x000010, "Member 'BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana::K2Node_Event_IsAlerted' has a wrong offset!");
static_assert(offsetof(BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana, CallFunc_K2_SetTimer_ReturnValue) == 0x000018, "Member 'BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana, CallFunc_K2_SetTimer_ReturnValue_1) == 0x000020, "Member 'BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana::CallFunc_K2_SetTimer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana, K2Node_Event_IsDesignTime) == 0x000028, "Member 'BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana, K2Node_Event_NPCWaveSpawnTime) == 0x000030, "Member 'BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana::K2Node_Event_NPCWaveSpawnTime' has a wrong offset!");
static_assert(offsetof(BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana, K2Node_Event_WidgetIndex) == 0x000034, "Member 'BPUI_ScreenPropagandaAmericana_C_ExecuteUbergraph_BPUI_ScreenPropagandaAmericana::K2Node_Event_WidgetIndex' has a wrong offset!");

// Function BPUI_ScreenPropagandaAmericana.BPUI_ScreenPropagandaAmericana_C.UpdateWidget
// 0x0004 (0x0004 - 0x0000)
struct BPUI_ScreenPropagandaAmericana_C_UpdateWidget final
{
public:
	int32                                         WidgetIndex_0;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_ScreenPropagandaAmericana_C_UpdateWidget) == 0x000004, "Wrong alignment on BPUI_ScreenPropagandaAmericana_C_UpdateWidget");
static_assert(sizeof(BPUI_ScreenPropagandaAmericana_C_UpdateWidget) == 0x000004, "Wrong size on BPUI_ScreenPropagandaAmericana_C_UpdateWidget");
static_assert(offsetof(BPUI_ScreenPropagandaAmericana_C_UpdateWidget, WidgetIndex_0) == 0x000000, "Member 'BPUI_ScreenPropagandaAmericana_C_UpdateWidget::WidgetIndex_0' has a wrong offset!");

// Function BPUI_ScreenPropagandaAmericana.BPUI_ScreenPropagandaAmericana_C.UpdateNPCSpawnTime
// 0x0004 (0x0004 - 0x0000)
struct BPUI_ScreenPropagandaAmericana_C_UpdateNPCSpawnTime final
{
public:
	int32                                         NPCWaveSpawnTime;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_ScreenPropagandaAmericana_C_UpdateNPCSpawnTime) == 0x000004, "Wrong alignment on BPUI_ScreenPropagandaAmericana_C_UpdateNPCSpawnTime");
static_assert(sizeof(BPUI_ScreenPropagandaAmericana_C_UpdateNPCSpawnTime) == 0x000004, "Wrong size on BPUI_ScreenPropagandaAmericana_C_UpdateNPCSpawnTime");
static_assert(offsetof(BPUI_ScreenPropagandaAmericana_C_UpdateNPCSpawnTime, NPCWaveSpawnTime) == 0x000000, "Member 'BPUI_ScreenPropagandaAmericana_C_UpdateNPCSpawnTime::NPCWaveSpawnTime' has a wrong offset!");

// Function BPUI_ScreenPropagandaAmericana.BPUI_ScreenPropagandaAmericana_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BPUI_ScreenPropagandaAmericana_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPUI_ScreenPropagandaAmericana_C_PreConstruct) == 0x000001, "Wrong alignment on BPUI_ScreenPropagandaAmericana_C_PreConstruct");
static_assert(sizeof(BPUI_ScreenPropagandaAmericana_C_PreConstruct) == 0x000001, "Wrong size on BPUI_ScreenPropagandaAmericana_C_PreConstruct");
static_assert(offsetof(BPUI_ScreenPropagandaAmericana_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BPUI_ScreenPropagandaAmericana_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BPUI_ScreenPropagandaAmericana.BPUI_ScreenPropagandaAmericana_C.UpdateSecurityStatus
// 0x0001 (0x0001 - 0x0000)
struct BPUI_ScreenPropagandaAmericana_C_UpdateSecurityStatus final
{
public:
	bool                                          IsAlerted;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPUI_ScreenPropagandaAmericana_C_UpdateSecurityStatus) == 0x000001, "Wrong alignment on BPUI_ScreenPropagandaAmericana_C_UpdateSecurityStatus");
static_assert(sizeof(BPUI_ScreenPropagandaAmericana_C_UpdateSecurityStatus) == 0x000001, "Wrong size on BPUI_ScreenPropagandaAmericana_C_UpdateSecurityStatus");
static_assert(offsetof(BPUI_ScreenPropagandaAmericana_C_UpdateSecurityStatus, IsAlerted) == 0x000000, "Member 'BPUI_ScreenPropagandaAmericana_C_UpdateSecurityStatus::IsAlerted' has a wrong offset!");

// Function BPUI_ScreenPropagandaAmericana.BPUI_ScreenPropagandaAmericana_C.ImageSwitch
// 0x000C (0x000C - 0x0000)
struct BPUI_ScreenPropagandaAmericana_C_ImageSwitch final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_ScreenPropagandaAmericana_C_ImageSwitch) == 0x000004, "Wrong alignment on BPUI_ScreenPropagandaAmericana_C_ImageSwitch");
static_assert(sizeof(BPUI_ScreenPropagandaAmericana_C_ImageSwitch) == 0x00000C, "Wrong size on BPUI_ScreenPropagandaAmericana_C_ImageSwitch");
static_assert(offsetof(BPUI_ScreenPropagandaAmericana_C_ImageSwitch, Temp_int_Variable) == 0x000000, "Member 'BPUI_ScreenPropagandaAmericana_C_ImageSwitch::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BPUI_ScreenPropagandaAmericana_C_ImageSwitch, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000004, "Member 'BPUI_ScreenPropagandaAmericana_C_ImageSwitch::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_ScreenPropagandaAmericana_C_ImageSwitch, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BPUI_ScreenPropagandaAmericana_C_ImageSwitch::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

