#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HowToPlay_Screen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_HowToPlay_Screen.BPUI_HowToPlay_Screen_C
// 0x0080 (0x0310 - 0x0290)
class UBPUI_HowToPlay_Screen_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPUI_HowToPlay_CardContainer_C*        Card_container;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_SimpleHeader_C*                     Header;                                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Parent_container;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UCAGamemodeInstructions> Instructions;                                      // 0x02B0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UCAGameModeConfiguration> Configuration;                                     // 0x02E0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPUI_HowToPlay_Screen(int32 EntryPoint);
	void OnCardsLoaded();
	void SetData(TSoftObjectPtr<class UCAGameModeConfiguration> Configuration_0);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void OnLoaded_34B22CBA4BD633EE74F1FBAA81E7D042(class UObject* Loaded);
	void OnLoaded_BF80057944E838B6D523DDA3E107D9BC(class UObject* Loaded);
	void OnLoaded_8B939B0D461FF57D12F52495119EB929(class UObject* Loaded);
	void SetInstructionsInternal(TSoftObjectPtr<class UCAGamemodeInstructions> Instructions_0);
	void HideInstructions();
	void ShowInstructions();
	void UpdateHeader();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_HowToPlay_Screen_C">();
	}
	static class UBPUI_HowToPlay_Screen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_HowToPlay_Screen_C>();
	}
};
static_assert(alignof(UBPUI_HowToPlay_Screen_C) == 0x000008, "Wrong alignment on UBPUI_HowToPlay_Screen_C");
static_assert(sizeof(UBPUI_HowToPlay_Screen_C) == 0x000310, "Wrong size on UBPUI_HowToPlay_Screen_C");
static_assert(offsetof(UBPUI_HowToPlay_Screen_C, UberGraphFrame) == 0x000290, "Member 'UBPUI_HowToPlay_Screen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_HowToPlay_Screen_C, Card_container) == 0x000298, "Member 'UBPUI_HowToPlay_Screen_C::Card_container' has a wrong offset!");
static_assert(offsetof(UBPUI_HowToPlay_Screen_C, Header) == 0x0002A0, "Member 'UBPUI_HowToPlay_Screen_C::Header' has a wrong offset!");
static_assert(offsetof(UBPUI_HowToPlay_Screen_C, Parent_container) == 0x0002A8, "Member 'UBPUI_HowToPlay_Screen_C::Parent_container' has a wrong offset!");
static_assert(offsetof(UBPUI_HowToPlay_Screen_C, Instructions) == 0x0002B0, "Member 'UBPUI_HowToPlay_Screen_C::Instructions' has a wrong offset!");
static_assert(offsetof(UBPUI_HowToPlay_Screen_C, Configuration) == 0x0002E0, "Member 'UBPUI_HowToPlay_Screen_C::Configuration' has a wrong offset!");

}

