#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_HVLEMessageGeneric

#include "Basic.hpp"

#include "CAAudio_structs.hpp"
#include "Keaton_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPUI_HUD_HVLEMessageGeneric.BPUI_HUD_HVLEMessageGeneric_C.ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric
// 0x0320 (0x0320 - 0x0000)
struct BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAPlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0010(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0028(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAPrimaryMessageTypesTableRow         CallFunc_GetMessageConfigData_ReturnValue;         // 0x0040(0x00D0)(ConstParm)
	struct FCAPrimaryMessagingData                CallFunc_GetMessagePayload_ReturnValue;            // 0x0110(0x00E0)(ConstParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x01F0(0x0028)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0218(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0258(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_MakeTextFromCAText_text;                  // 0x0298(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x02B0(0x0010)(ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x02C0(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x02D8(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x02F0(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric) == 0x000008, "Wrong alignment on BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric");
static_assert(sizeof(BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric) == 0x000320, "Wrong size on BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric");
static_assert(offsetof(BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric, EntryPoint) == 0x000000, "Member 'BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000008, "Member 'BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric, Temp_delegate_Variable) == 0x000010, "Member 'BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric, CallFunc_PlayEvent_playback_instance) == 0x000028, "Member 'BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric, CallFunc_PlayEvent_play_success) == 0x000038, "Member 'BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric, CallFunc_GetMessageConfigData_ReturnValue) == 0x000040, "Member 'BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric::CallFunc_GetMessageConfigData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric, CallFunc_GetMessagePayload_ReturnValue) == 0x000110, "Member 'BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric::CallFunc_GetMessagePayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric, K2Node_MakeStruct_SlateColor) == 0x0001F0, "Member 'BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric, K2Node_MakeStruct_FormatArgumentData) == 0x000218, "Member 'BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric, K2Node_MakeStruct_FormatArgumentData_1) == 0x000258, "Member 'BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric, CallFunc_MakeTextFromCAText_text) == 0x000298, "Member 'BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric::CallFunc_MakeTextFromCAText_text' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric, K2Node_MakeArray_Array) == 0x0002B0, "Member 'BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric, K2Node_CreateDelegate_OutputDelegate) == 0x0002C0, "Member 'BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric, CallFunc_Format_ReturnValue) == 0x0002D8, "Member 'BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric, CallFunc_TextToUpper_ReturnValue) == 0x0002F0, "Member 'BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric, CallFunc_PlayAnimation_ReturnValue) == 0x000308, "Member 'BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric, CallFunc_PlayAnimation_ReturnValue_1) == 0x000310, "Member 'BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric, CallFunc_PlayAnimation_ReturnValue_2) == 0x000318, "Member 'BPUI_HUD_HVLEMessageGeneric_C_ExecuteUbergraph_BPUI_HUD_HVLEMessageGeneric::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

// Function BPUI_HUD_HVLEMessageGeneric.BPUI_HUD_HVLEMessageGeneric_C.PlayFadeAnimation
// 0x0008 (0x0008 - 0x0000)
struct BPUI_HUD_HVLEMessageGeneric_C_PlayFadeAnimation final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_HVLEMessageGeneric_C_PlayFadeAnimation) == 0x000008, "Wrong alignment on BPUI_HUD_HVLEMessageGeneric_C_PlayFadeAnimation");
static_assert(sizeof(BPUI_HUD_HVLEMessageGeneric_C_PlayFadeAnimation) == 0x000008, "Wrong size on BPUI_HUD_HVLEMessageGeneric_C_PlayFadeAnimation");
static_assert(offsetof(BPUI_HUD_HVLEMessageGeneric_C_PlayFadeAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'BPUI_HUD_HVLEMessageGeneric_C_PlayFadeAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

