#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_PrimaryMessageGeneric_v3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_HUD_PrimaryMessageGeneric_v3.BPUI_HUD_PrimaryMessageGeneric_v3_C
// 0x00B8 (0x06A8 - 0x05F0)
class UBPUI_HUD_PrimaryMessageGeneric_v3_C final : public UCAHUDPrimaryMessageBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Emergency;                                         // 0x05F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Lockdown;                                          // 0x0600(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fading;                                            // 0x0608(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RectSlide;                                         // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LensFlare;                                         // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LensFlare_1;                                       // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextOutline_1;                                     // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextOutline_2;                                     // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextSolid;                                         // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Warning;                                           // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Warning_1;                                         // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0658(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         LetterCount;                                       // 0x0670(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_674[0x4];                                      // 0x0674(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Textn;                                             // 0x0678(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 CurrentText;                                       // 0x0688(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 NextLetter;                                        // 0x0698(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPUI_HUD_PrimaryMessageGeneric_v3(int32 EntryPoint);
	void OnShow();
	void PlayFadeAnimation();
	void HideWidget();
	void SequenceEvent__ENTRYPOINTBPUI_HUD_PrimaryMessageGeneric_v3_0();
	void SequenceEvent__ENTRYPOINTBPUI_HUD_PrimaryMessageGeneric_v3_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_HUD_PrimaryMessageGeneric_v3_C">();
	}
	static class UBPUI_HUD_PrimaryMessageGeneric_v3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_HUD_PrimaryMessageGeneric_v3_C>();
	}
};
static_assert(alignof(UBPUI_HUD_PrimaryMessageGeneric_v3_C) == 0x000008, "Wrong alignment on UBPUI_HUD_PrimaryMessageGeneric_v3_C");
static_assert(sizeof(UBPUI_HUD_PrimaryMessageGeneric_v3_C) == 0x0006A8, "Wrong size on UBPUI_HUD_PrimaryMessageGeneric_v3_C");
static_assert(offsetof(UBPUI_HUD_PrimaryMessageGeneric_v3_C, UberGraphFrame) == 0x0005F0, "Member 'UBPUI_HUD_PrimaryMessageGeneric_v3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PrimaryMessageGeneric_v3_C, Emergency) == 0x0005F8, "Member 'UBPUI_HUD_PrimaryMessageGeneric_v3_C::Emergency' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PrimaryMessageGeneric_v3_C, Lockdown) == 0x000600, "Member 'UBPUI_HUD_PrimaryMessageGeneric_v3_C::Lockdown' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PrimaryMessageGeneric_v3_C, Fading) == 0x000608, "Member 'UBPUI_HUD_PrimaryMessageGeneric_v3_C::Fading' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PrimaryMessageGeneric_v3_C, RectSlide) == 0x000610, "Member 'UBPUI_HUD_PrimaryMessageGeneric_v3_C::RectSlide' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PrimaryMessageGeneric_v3_C, Glow) == 0x000618, "Member 'UBPUI_HUD_PrimaryMessageGeneric_v3_C::Glow' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PrimaryMessageGeneric_v3_C, LensFlare) == 0x000620, "Member 'UBPUI_HUD_PrimaryMessageGeneric_v3_C::LensFlare' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PrimaryMessageGeneric_v3_C, LensFlare_1) == 0x000628, "Member 'UBPUI_HUD_PrimaryMessageGeneric_v3_C::LensFlare_1' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PrimaryMessageGeneric_v3_C, TextOutline_1) == 0x000630, "Member 'UBPUI_HUD_PrimaryMessageGeneric_v3_C::TextOutline_1' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PrimaryMessageGeneric_v3_C, TextOutline_2) == 0x000638, "Member 'UBPUI_HUD_PrimaryMessageGeneric_v3_C::TextOutline_2' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PrimaryMessageGeneric_v3_C, TextSolid) == 0x000640, "Member 'UBPUI_HUD_PrimaryMessageGeneric_v3_C::TextSolid' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PrimaryMessageGeneric_v3_C, Warning) == 0x000648, "Member 'UBPUI_HUD_PrimaryMessageGeneric_v3_C::Warning' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PrimaryMessageGeneric_v3_C, Warning_1) == 0x000650, "Member 'UBPUI_HUD_PrimaryMessageGeneric_v3_C::Warning_1' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PrimaryMessageGeneric_v3_C, Text) == 0x000658, "Member 'UBPUI_HUD_PrimaryMessageGeneric_v3_C::Text' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PrimaryMessageGeneric_v3_C, LetterCount) == 0x000670, "Member 'UBPUI_HUD_PrimaryMessageGeneric_v3_C::LetterCount' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PrimaryMessageGeneric_v3_C, Textn) == 0x000678, "Member 'UBPUI_HUD_PrimaryMessageGeneric_v3_C::Textn' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PrimaryMessageGeneric_v3_C, CurrentText) == 0x000688, "Member 'UBPUI_HUD_PrimaryMessageGeneric_v3_C::CurrentText' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PrimaryMessageGeneric_v3_C, NextLetter) == 0x000698, "Member 'UBPUI_HUD_PrimaryMessageGeneric_v3_C::NextLetter' has a wrong offset!");

}

