#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_Debug_3d_Map

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_Debug_3d_Map.BPUI_Debug_3d_Map_C
// 0x0078 (0x0738 - 0x06C0)
class UBPUI_Debug_3d_Map_C final : public UCAHUD3DMapWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Startup;                                           // 0x06C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CursorAnim;                                        // 0x06D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBPUI_HUD_CampLegend_C*                 BPUI_HUD_CampLegend;                               // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_HUD_MapLegend_C*                  BPUI_HUD_MapLegend_C_0;                            // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_HUD_MapLegend_C*                  BPUI_HUD_MapLegend_C_1;                            // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_map_howtoplay_C*                  BPUI_map_howtoplay;                                // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_map_info_C*                       BPUI_map_info;                                     // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       Inv_box_howtoplay;                                 // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       Inv_box_mapName;                                   // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       Inv_box_zonelegend;                                // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MapTeleportButton;                                 // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_2dmapTexture;                          // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              Cached_mouse_position;                             // 0x0728(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Map_opacity;                                       // 0x0730(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPUI_Debug_3d_Map(int32 EntryPoint);
	void OnPawnChanged();
	void BndEvt__Button_135_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void OnSelectAction();
	void Construct();
	void OnHide();
	void OnShow();
	void ToggleVisibility(bool Is_visible);
	void ReleaseInput();
	void CaptureInput();
	void PrevMapArea();
	void NextMapArea();
	void ResetMapArea();
	void HasMouseMovedThisFrame(bool* Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_Debug_3d_Map_C">();
	}
	static class UBPUI_Debug_3d_Map_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_Debug_3d_Map_C>();
	}
};
static_assert(alignof(UBPUI_Debug_3d_Map_C) == 0x000008, "Wrong alignment on UBPUI_Debug_3d_Map_C");
static_assert(sizeof(UBPUI_Debug_3d_Map_C) == 0x000738, "Wrong size on UBPUI_Debug_3d_Map_C");
static_assert(offsetof(UBPUI_Debug_3d_Map_C, UberGraphFrame) == 0x0006C0, "Member 'UBPUI_Debug_3d_Map_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_Debug_3d_Map_C, Startup) == 0x0006C8, "Member 'UBPUI_Debug_3d_Map_C::Startup' has a wrong offset!");
static_assert(offsetof(UBPUI_Debug_3d_Map_C, CursorAnim) == 0x0006D0, "Member 'UBPUI_Debug_3d_Map_C::CursorAnim' has a wrong offset!");
static_assert(offsetof(UBPUI_Debug_3d_Map_C, BPUI_HUD_CampLegend) == 0x0006D8, "Member 'UBPUI_Debug_3d_Map_C::BPUI_HUD_CampLegend' has a wrong offset!");
static_assert(offsetof(UBPUI_Debug_3d_Map_C, BPUI_HUD_MapLegend_C_0) == 0x0006E0, "Member 'UBPUI_Debug_3d_Map_C::BPUI_HUD_MapLegend_C_0' has a wrong offset!");
static_assert(offsetof(UBPUI_Debug_3d_Map_C, BPUI_HUD_MapLegend_C_1) == 0x0006E8, "Member 'UBPUI_Debug_3d_Map_C::BPUI_HUD_MapLegend_C_1' has a wrong offset!");
static_assert(offsetof(UBPUI_Debug_3d_Map_C, BPUI_map_howtoplay) == 0x0006F0, "Member 'UBPUI_Debug_3d_Map_C::BPUI_map_howtoplay' has a wrong offset!");
static_assert(offsetof(UBPUI_Debug_3d_Map_C, BPUI_map_info) == 0x0006F8, "Member 'UBPUI_Debug_3d_Map_C::BPUI_map_info' has a wrong offset!");
static_assert(offsetof(UBPUI_Debug_3d_Map_C, Inv_box_howtoplay) == 0x000700, "Member 'UBPUI_Debug_3d_Map_C::Inv_box_howtoplay' has a wrong offset!");
static_assert(offsetof(UBPUI_Debug_3d_Map_C, Inv_box_mapName) == 0x000708, "Member 'UBPUI_Debug_3d_Map_C::Inv_box_mapName' has a wrong offset!");
static_assert(offsetof(UBPUI_Debug_3d_Map_C, Inv_box_zonelegend) == 0x000710, "Member 'UBPUI_Debug_3d_Map_C::Inv_box_zonelegend' has a wrong offset!");
static_assert(offsetof(UBPUI_Debug_3d_Map_C, MapTeleportButton) == 0x000718, "Member 'UBPUI_Debug_3d_Map_C::MapTeleportButton' has a wrong offset!");
static_assert(offsetof(UBPUI_Debug_3d_Map_C, RetainerBox_2dmapTexture) == 0x000720, "Member 'UBPUI_Debug_3d_Map_C::RetainerBox_2dmapTexture' has a wrong offset!");
static_assert(offsetof(UBPUI_Debug_3d_Map_C, Cached_mouse_position) == 0x000728, "Member 'UBPUI_Debug_3d_Map_C::Cached_mouse_position' has a wrong offset!");
static_assert(offsetof(UBPUI_Debug_3d_Map_C, Map_opacity) == 0x000730, "Member 'UBPUI_Debug_3d_Map_C::Map_opacity' has a wrong offset!");

}

