#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_PingRadialSlotClose

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_HUD_PingRadialSlotClose.BPUI_HUD_PingRadialSlotClose_C
// 0x0028 (0x0310 - 0x02E8)
class UBPUI_HUD_PingRadialSlotClose_C final : public UCAHUDRadialMenuSlotBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 IMG_background;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_closeIcon;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_1;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_1;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPUI_HUD_PingRadialSlotClose(int32 EntryPoint);
	void SetFocusedState(bool Is_focused);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_HUD_PingRadialSlotClose_C">();
	}
	static class UBPUI_HUD_PingRadialSlotClose_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_HUD_PingRadialSlotClose_C>();
	}
};
static_assert(alignof(UBPUI_HUD_PingRadialSlotClose_C) == 0x000008, "Wrong alignment on UBPUI_HUD_PingRadialSlotClose_C");
static_assert(sizeof(UBPUI_HUD_PingRadialSlotClose_C) == 0x000310, "Wrong size on UBPUI_HUD_PingRadialSlotClose_C");
static_assert(offsetof(UBPUI_HUD_PingRadialSlotClose_C, UberGraphFrame) == 0x0002E8, "Member 'UBPUI_HUD_PingRadialSlotClose_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PingRadialSlotClose_C, IMG_background) == 0x0002F0, "Member 'UBPUI_HUD_PingRadialSlotClose_C::IMG_background' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PingRadialSlotClose_C, IMG_closeIcon) == 0x0002F8, "Member 'UBPUI_HUD_PingRadialSlotClose_C::IMG_closeIcon' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PingRadialSlotClose_C, Overlay_1) == 0x000300, "Member 'UBPUI_HUD_PingRadialSlotClose_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_PingRadialSlotClose_C, SizeBox_1) == 0x000308, "Member 'UBPUI_HUD_PingRadialSlotClose_C::SizeBox_1' has a wrong offset!");

}

