#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_DebugMatchStartCountdown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_HUD_DebugMatchStartCountdown.BPUI_HUD_DebugMatchStartCountdown_C
// 0x0088 (0x0490 - 0x0408)
class UBPUI_HUD_DebugMatchStartCountdown_C final : public UCAHUDMatchStartCountdownWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AnimNewSmall;                                      // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimNewLarge;                                      // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GetReady;                                          // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim4;                                             // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim3;                                             // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim2;                                             // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim1;                                             // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             OutlineReadyText1;                                 // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             OutlineReadyText2;                                 // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OverlayBlock;                                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_0;                                     // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SolidReadyText2;                                   // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_1;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         TimeRemaining;                                     // 0x0478(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OriginalTime;                                      // 0x047C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentInterpValue;                                // 0x0480(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   OnMatchStartGameModeInfo;                          // 0x0484(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPUI_HUD_DebugMatchStartCountdown(int32 EntryPoint);
	void PlayNumberScaleUpAnimation();
	void OnCountdownFinished();
	void PlayReadyAnimation();
	void PlayNumberAnimations();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_HUD_DebugMatchStartCountdown_C">();
	}
	static class UBPUI_HUD_DebugMatchStartCountdown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_HUD_DebugMatchStartCountdown_C>();
	}
};
static_assert(alignof(UBPUI_HUD_DebugMatchStartCountdown_C) == 0x000008, "Wrong alignment on UBPUI_HUD_DebugMatchStartCountdown_C");
static_assert(sizeof(UBPUI_HUD_DebugMatchStartCountdown_C) == 0x000490, "Wrong size on UBPUI_HUD_DebugMatchStartCountdown_C");
static_assert(offsetof(UBPUI_HUD_DebugMatchStartCountdown_C, UberGraphFrame) == 0x000408, "Member 'UBPUI_HUD_DebugMatchStartCountdown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_DebugMatchStartCountdown_C, AnimNewSmall) == 0x000410, "Member 'UBPUI_HUD_DebugMatchStartCountdown_C::AnimNewSmall' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_DebugMatchStartCountdown_C, AnimNewLarge) == 0x000418, "Member 'UBPUI_HUD_DebugMatchStartCountdown_C::AnimNewLarge' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_DebugMatchStartCountdown_C, GetReady) == 0x000420, "Member 'UBPUI_HUD_DebugMatchStartCountdown_C::GetReady' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_DebugMatchStartCountdown_C, Anim4) == 0x000428, "Member 'UBPUI_HUD_DebugMatchStartCountdown_C::Anim4' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_DebugMatchStartCountdown_C, Anim3) == 0x000430, "Member 'UBPUI_HUD_DebugMatchStartCountdown_C::Anim3' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_DebugMatchStartCountdown_C, Anim2) == 0x000438, "Member 'UBPUI_HUD_DebugMatchStartCountdown_C::Anim2' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_DebugMatchStartCountdown_C, Anim1) == 0x000440, "Member 'UBPUI_HUD_DebugMatchStartCountdown_C::Anim1' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_DebugMatchStartCountdown_C, OutlineReadyText1) == 0x000448, "Member 'UBPUI_HUD_DebugMatchStartCountdown_C::OutlineReadyText1' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_DebugMatchStartCountdown_C, OutlineReadyText2) == 0x000450, "Member 'UBPUI_HUD_DebugMatchStartCountdown_C::OutlineReadyText2' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_DebugMatchStartCountdown_C, OverlayBlock) == 0x000458, "Member 'UBPUI_HUD_DebugMatchStartCountdown_C::OverlayBlock' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_DebugMatchStartCountdown_C, ProgressBar_0) == 0x000460, "Member 'UBPUI_HUD_DebugMatchStartCountdown_C::ProgressBar_0' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_DebugMatchStartCountdown_C, SolidReadyText2) == 0x000468, "Member 'UBPUI_HUD_DebugMatchStartCountdown_C::SolidReadyText2' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_DebugMatchStartCountdown_C, TextBlock_1) == 0x000470, "Member 'UBPUI_HUD_DebugMatchStartCountdown_C::TextBlock_1' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_DebugMatchStartCountdown_C, TimeRemaining) == 0x000478, "Member 'UBPUI_HUD_DebugMatchStartCountdown_C::TimeRemaining' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_DebugMatchStartCountdown_C, OriginalTime) == 0x00047C, "Member 'UBPUI_HUD_DebugMatchStartCountdown_C::OriginalTime' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_DebugMatchStartCountdown_C, CurrentInterpValue) == 0x000480, "Member 'UBPUI_HUD_DebugMatchStartCountdown_C::CurrentInterpValue' has a wrong offset!");
static_assert(offsetof(UBPUI_HUD_DebugMatchStartCountdown_C, OnMatchStartGameModeInfo) == 0x000484, "Member 'UBPUI_HUD_DebugMatchStartCountdown_C::OnMatchStartGameModeInfo' has a wrong offset!");

}

