#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_Mk5_SegBar

#include "Basic.hpp"

#include "S_UI_SegBarColours_structs.hpp"


namespace SDK::Params
{

// Function BPUI_HUD_Mk5_SegBar.BPUI_HUD_Mk5_SegBar_C.ExecuteUbergraph_BPUI_HUD_Mk5_SegBar
// 0x0068 (0x0068 - 0x0000)
struct BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_total_segs;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_margin_width;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_active_segs;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_normalised_val;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_target_val;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBPUI_HUD_Mk5_SegBar_Damage_C*>  K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UBPUI_HUD_Mk5_SegBar_Damage_C*          CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar) == 0x000008, "Wrong alignment on BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar");
static_assert(sizeof(BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar) == 0x000068, "Wrong size on BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar, EntryPoint) == 0x000000, "Member 'BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar, K2Node_Event_total_segs) == 0x000010, "Member 'BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar::K2Node_Event_total_segs' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar, K2Node_Event_margin_width) == 0x000014, "Member 'BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar::K2Node_Event_margin_width' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar, K2Node_Event_active_segs) == 0x000018, "Member 'BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar::K2Node_Event_active_segs' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar, K2Node_Event_normalised_val) == 0x00001C, "Member 'BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar::K2Node_Event_normalised_val' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar, K2Node_Event_target_val) == 0x000020, "Member 'BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar::K2Node_Event_target_val' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar, CallFunc_FMax_ReturnValue) == 0x000028, "Member 'BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000038, "Member 'BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000039, "Member 'BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar, CallFunc_Subtract_IntInt_ReturnValue) == 0x000040, "Member 'BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar, CallFunc_Greater_IntInt_ReturnValue) == 0x000044, "Member 'BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar, CallFunc_FMax_ReturnValue_1) == 0x000048, "Member 'BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar, CallFunc_SelectInt_ReturnValue) == 0x00004C, "Member 'BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar, K2Node_MakeArray_Array) == 0x000050, "Member 'BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar, CallFunc_Array_Get_Item) == 0x000060, "Member 'BPUI_HUD_Mk5_SegBar_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar::CallFunc_Array_Get_Item' has a wrong offset!");

// Function BPUI_HUD_Mk5_SegBar.BPUI_HUD_Mk5_SegBar_C.SetBarData
// 0x0014 (0x0014 - 0x0000)
struct BPUI_HUD_Mk5_SegBar_C_SetBarData final
{
public:
	float                                         Total_segs;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Margin_width;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Active_segs;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Normalised_val;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Target_val;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_Mk5_SegBar_C_SetBarData) == 0x000004, "Wrong alignment on BPUI_HUD_Mk5_SegBar_C_SetBarData");
static_assert(sizeof(BPUI_HUD_Mk5_SegBar_C_SetBarData) == 0x000014, "Wrong size on BPUI_HUD_Mk5_SegBar_C_SetBarData");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_C_SetBarData, Total_segs) == 0x000000, "Member 'BPUI_HUD_Mk5_SegBar_C_SetBarData::Total_segs' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_C_SetBarData, Margin_width) == 0x000004, "Member 'BPUI_HUD_Mk5_SegBar_C_SetBarData::Margin_width' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_C_SetBarData, Active_segs) == 0x000008, "Member 'BPUI_HUD_Mk5_SegBar_C_SetBarData::Active_segs' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_C_SetBarData, Normalised_val) == 0x00000C, "Member 'BPUI_HUD_Mk5_SegBar_C_SetBarData::Normalised_val' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_C_SetBarData, Target_val) == 0x000010, "Member 'BPUI_HUD_Mk5_SegBar_C_SetBarData::Target_val' has a wrong offset!");

// Function BPUI_HUD_Mk5_SegBar.BPUI_HUD_Mk5_SegBar_C.SetActiveColours
// 0x0044 (0x0044 - 0x0000)
struct BPUI_HUD_Mk5_SegBar_C_SetActiveColours final
{
public:
	struct FS_UI_SegBarColours                    STR_ActiveColours_0;                               // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPUI_HUD_Mk5_SegBar_C_SetActiveColours) == 0x000004, "Wrong alignment on BPUI_HUD_Mk5_SegBar_C_SetActiveColours");
static_assert(sizeof(BPUI_HUD_Mk5_SegBar_C_SetActiveColours) == 0x000044, "Wrong size on BPUI_HUD_Mk5_SegBar_C_SetActiveColours");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_C_SetActiveColours, STR_ActiveColours_0) == 0x000000, "Member 'BPUI_HUD_Mk5_SegBar_C_SetActiveColours::STR_ActiveColours_0' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_C_SetActiveColours, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BPUI_HUD_Mk5_SegBar_C_SetActiveColours::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

