#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_ArcLens_PlayerWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Keaton_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_ArcLens_PlayerWidget.BPUI_ArcLens_PlayerWidget_C
// 0x0048 (0x0518 - 0x04D0)
class UBPUI_ArcLens_PlayerWidget_C final : public UCAArcLensPlayerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       bump;                                              // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 bg;                                                // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 bg_1;                                              // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_highlight_menuItem_C*               BP_highlight;                                      // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_HUD_InputDisplayWidget_C*         BPUI_HUD_InputDisplayWidget_1;                     // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Normal;                                            // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           BarColor;                                          // 0x0508(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPUI_ArcLens_PlayerWidget(int32 EntryPoint);
	void OnPlayerHealthStateChanged(EHealthState Health_state);
	void Construct();
	void UpdateHealthScale(float Health_scale);
	void UpdateEmojiScale(float Emoji_scale);
	void OnHealthChanged(float Health, float Old_health);
	void OnArmorChanged(float Armor, float Old_armor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_ArcLens_PlayerWidget_C">();
	}
	static class UBPUI_ArcLens_PlayerWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_ArcLens_PlayerWidget_C>();
	}
};
static_assert(alignof(UBPUI_ArcLens_PlayerWidget_C) == 0x000008, "Wrong alignment on UBPUI_ArcLens_PlayerWidget_C");
static_assert(sizeof(UBPUI_ArcLens_PlayerWidget_C) == 0x000518, "Wrong size on UBPUI_ArcLens_PlayerWidget_C");
static_assert(offsetof(UBPUI_ArcLens_PlayerWidget_C, UberGraphFrame) == 0x0004D0, "Member 'UBPUI_ArcLens_PlayerWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_ArcLens_PlayerWidget_C, bump) == 0x0004D8, "Member 'UBPUI_ArcLens_PlayerWidget_C::bump' has a wrong offset!");
static_assert(offsetof(UBPUI_ArcLens_PlayerWidget_C, bg) == 0x0004E0, "Member 'UBPUI_ArcLens_PlayerWidget_C::bg' has a wrong offset!");
static_assert(offsetof(UBPUI_ArcLens_PlayerWidget_C, bg_1) == 0x0004E8, "Member 'UBPUI_ArcLens_PlayerWidget_C::bg_1' has a wrong offset!");
static_assert(offsetof(UBPUI_ArcLens_PlayerWidget_C, BP_highlight) == 0x0004F0, "Member 'UBPUI_ArcLens_PlayerWidget_C::BP_highlight' has a wrong offset!");
static_assert(offsetof(UBPUI_ArcLens_PlayerWidget_C, BPUI_HUD_InputDisplayWidget_1) == 0x0004F8, "Member 'UBPUI_ArcLens_PlayerWidget_C::BPUI_HUD_InputDisplayWidget_1' has a wrong offset!");
static_assert(offsetof(UBPUI_ArcLens_PlayerWidget_C, Normal) == 0x000500, "Member 'UBPUI_ArcLens_PlayerWidget_C::Normal' has a wrong offset!");
static_assert(offsetof(UBPUI_ArcLens_PlayerWidget_C, BarColor) == 0x000508, "Member 'UBPUI_ArcLens_PlayerWidget_C::BarColor' has a wrong offset!");

}

