#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_Mk5_SegBar_Damage

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPUI_HUD_Mk5_SegBar_Damage.BPUI_HUD_Mk5_SegBar_Damage_C.ExecuteUbergraph_BPUI_HUD_Mk5_SegBar_Damage
// 0x0038 (0x0038 - 0x0000)
struct BPUI_HUD_Mk5_SegBar_Damage_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar_Damage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Bottom_Percentage;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Top_Percentage;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Segments;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_Damage_Colour;                  // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_Mk5_SegBar_Damage_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar_Damage) == 0x000008, "Wrong alignment on BPUI_HUD_Mk5_SegBar_Damage_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar_Damage");
static_assert(sizeof(BPUI_HUD_Mk5_SegBar_Damage_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar_Damage) == 0x000038, "Wrong size on BPUI_HUD_Mk5_SegBar_Damage_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar_Damage");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_Damage_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar_Damage, EntryPoint) == 0x000000, "Member 'BPUI_HUD_Mk5_SegBar_Damage_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar_Damage::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_Damage_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar_Damage, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'BPUI_HUD_Mk5_SegBar_Damage_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar_Damage::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_Damage_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar_Damage, K2Node_CustomEvent_Bottom_Percentage) == 0x000010, "Member 'BPUI_HUD_Mk5_SegBar_Damage_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar_Damage::K2Node_CustomEvent_Bottom_Percentage' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_Damage_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar_Damage, K2Node_CustomEvent_Top_Percentage) == 0x000014, "Member 'BPUI_HUD_Mk5_SegBar_Damage_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar_Damage::K2Node_CustomEvent_Top_Percentage' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_Damage_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar_Damage, K2Node_CustomEvent_Segments) == 0x000018, "Member 'BPUI_HUD_Mk5_SegBar_Damage_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar_Damage::K2Node_CustomEvent_Segments' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_Damage_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar_Damage, K2Node_CustomEvent_Damage_Colour) == 0x00001C, "Member 'BPUI_HUD_Mk5_SegBar_Damage_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar_Damage::K2Node_CustomEvent_Damage_Colour' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_Damage_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar_Damage, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000030, "Member 'BPUI_HUD_Mk5_SegBar_Damage_C_ExecuteUbergraph_BPUI_HUD_Mk5_SegBar_Damage::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function BPUI_HUD_Mk5_SegBar_Damage.BPUI_HUD_Mk5_SegBar_Damage_C.DamageAnimation
// 0x001C (0x001C - 0x0000)
struct BPUI_HUD_Mk5_SegBar_Damage_C_DamageAnimation final
{
public:
	float                                         Bottom_Percentage;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Top_Percentage;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Segments;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Damage_Colour;                                     // 0x000C(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_Mk5_SegBar_Damage_C_DamageAnimation) == 0x000004, "Wrong alignment on BPUI_HUD_Mk5_SegBar_Damage_C_DamageAnimation");
static_assert(sizeof(BPUI_HUD_Mk5_SegBar_Damage_C_DamageAnimation) == 0x00001C, "Wrong size on BPUI_HUD_Mk5_SegBar_Damage_C_DamageAnimation");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_Damage_C_DamageAnimation, Bottom_Percentage) == 0x000000, "Member 'BPUI_HUD_Mk5_SegBar_Damage_C_DamageAnimation::Bottom_Percentage' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_Damage_C_DamageAnimation, Top_Percentage) == 0x000004, "Member 'BPUI_HUD_Mk5_SegBar_Damage_C_DamageAnimation::Top_Percentage' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_Damage_C_DamageAnimation, Segments) == 0x000008, "Member 'BPUI_HUD_Mk5_SegBar_Damage_C_DamageAnimation::Segments' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_Damage_C_DamageAnimation, Damage_Colour) == 0x00000C, "Member 'BPUI_HUD_Mk5_SegBar_Damage_C_DamageAnimation::Damage_Colour' has a wrong offset!");

// Function BPUI_HUD_Mk5_SegBar_Damage.BPUI_HUD_Mk5_SegBar_Damage_C.SetColours
// 0x0010 (0x0010 - 0x0000)
struct BPUI_HUD_Mk5_SegBar_Damage_C_SetColours final
{
public:
	struct FLinearColor                           Colour;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_Mk5_SegBar_Damage_C_SetColours) == 0x000004, "Wrong alignment on BPUI_HUD_Mk5_SegBar_Damage_C_SetColours");
static_assert(sizeof(BPUI_HUD_Mk5_SegBar_Damage_C_SetColours) == 0x000010, "Wrong size on BPUI_HUD_Mk5_SegBar_Damage_C_SetColours");
static_assert(offsetof(BPUI_HUD_Mk5_SegBar_Damage_C_SetColours, Colour) == 0x000000, "Member 'BPUI_HUD_Mk5_SegBar_Damage_C_SetColours::Colour' has a wrong offset!");

}

