#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_PauseMenu

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CAAudio_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Keaton_structs.hpp"
#include "CALocalisationRuntime_structs.hpp"


namespace SDK::Params
{

// Function BPUI_HUD_PauseMenu.BPUI_HUD_PauseMenu_C.PermissionToLeave__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BPUI_HUD_PauseMenu_C_PermissionToLeave__DelegateSignature final
{
public:
	bool                                          Granted;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPUI_HUD_PauseMenu_C_PermissionToLeave__DelegateSignature) == 0x000001, "Wrong alignment on BPUI_HUD_PauseMenu_C_PermissionToLeave__DelegateSignature");
static_assert(sizeof(BPUI_HUD_PauseMenu_C_PermissionToLeave__DelegateSignature) == 0x000001, "Wrong size on BPUI_HUD_PauseMenu_C_PermissionToLeave__DelegateSignature");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_PermissionToLeave__DelegateSignature, Granted) == 0x000000, "Member 'BPUI_HUD_PauseMenu_C_PermissionToLeave__DelegateSignature::Granted' has a wrong offset!");

// Function BPUI_HUD_PauseMenu.BPUI_HUD_PauseMenu_C.ExecuteUbergraph_BPUI_HUD_PauseMenu
// 0x0410 (0x0410 - 0x0000)
struct BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_id;                                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_has_entries;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCAUIOptionEntry*>               CallFunc_GetCurrentEntries_ReturnValue;            // 0x0018(0x0010)(ReferenceParm)
	struct FGameplayTag                           K2Node_Event_tag;                                  // 0x0028(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UCAUIHUDInterface*                CallFunc_GetUIHUDInterface_ReturnValue;            // 0x0050(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAPlayerController*                    K2Node_DynamicCast_AsCAPlayer_Controller;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_CustomEvent_NewPawn;                        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0084(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_5;               // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_4;               // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreSettingsDirty_ReturnValue;             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_3;               // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECADialogueResult                             K2Node_CustomEvent_results_6;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECADialogueResult                             K2Node_CustomEvent_results_5;                      // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECADialogueResult                             K2Node_CustomEvent_results_4;                      // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECADialogueResult                             K2Node_CustomEvent_results_3;                      // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x00EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWidget*                                CallFunc_GetWidgetAtIndex_ReturnValue;             // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UCAUIHUDInterface*                CallFunc_GetUIHUDInterface_ReturnValue_1;          // 0x00F8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_is_active;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_2;                  // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_103[0x5];                                      // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_2;               // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECADialogueResult                             K2Node_CustomEvent_results_2;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECADialogueResult                             K2Node_CustomEvent_results_1;                      // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button_1;               // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECADialogueResult                             K2Node_CustomEvent_results;                        // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_6;                    // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0134(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(ECADialogueResult Results)>    K2Node_CreateDelegate_OutputDelegate_1;            // 0x0148(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x015C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0170(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0184(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0198(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x01AC(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x01C0(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x01D4(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x01E8(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x01FC(0x0014)(ZeroConstructor, NoDestructor)
	ECAFrontendContext                            CallFunc_GetCurrentContext_ReturnValue;            // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_7;                    // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_granted;                        // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_213[0x1];                                      // 0x0213(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0214(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x0228(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsFeatureActive_ReturnValue;              // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x023D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x023E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x023F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x0240(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UCAUIHUDInterface*                CallFunc_GetUIHUDInterface_ReturnValue_2;          // 0x0258(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_force_sync_close;                     // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AreSettingsDirty_ReturnValue_1;           // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0263(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(ECADialogueResult Results)>    K2Node_CreateDelegate_OutputDelegate_12;           // 0x0264(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Granted)>                 K2Node_CreateDelegate_OutputDelegate_13;           // 0x027C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(class APawn* NewPawn)>         K2Node_CreateDelegate_OutputDelegate_14;           // 0x0290(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAText                                K2Node_CustomEvent_Parent_Title;                   // 0x02B0(0x0030)()
	struct FCAText                                K2Node_CustomEvent_Screen_Title;                   // 0x02E0(0x0030)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECADialogueResult Results)>    K2Node_CreateDelegate_OutputDelegate_15;           // 0x0314(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_AreSettingsDirty_ReturnValue_2;           // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseUIElement*                       K2Node_ComponentBoundEvent_button;                 // 0x0330(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreFlagsValid_ReturnValue;                // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_show_2;                         // 0x033A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33B[0x1];                                      // 0x033B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECADialogueResult Results)>    K2Node_CreateDelegate_OutputDelegate_16;           // 0x033C(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_352[0x2];                                      // 0x0352(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Is_active)>               K2Node_CreateDelegate_OutputDelegate_17;           // 0x0354(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_show_1;                         // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36A[0x2];                                      // 0x036A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECADialogueResult Results)>    K2Node_CreateDelegate_OutputDelegate_18;           // 0x036C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_19;           // 0x0380(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_show;                           // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0395(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_396[0x2];                                      // 0x0396(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECADialogueResult Results)>    K2Node_CreateDelegate_OutputDelegate_20;           // 0x0398(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAPlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue;     // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAPlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue_1;   // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x03C0(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x03D8(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECARemappingValidationResults                 CallFunc_AssignCurrentlySelectedItemAndKey_ReturnValue; // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECARemappingValidationResults                 CallFunc_AssignCurrentlySelectedItemAndKey_ReturnValue_1; // 0x03EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_8;                    // 0x03EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAGameState*                           CallFunc_GetGameState_ReturnValue;                 // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsPvEMatch_ReturnValue;                // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9[0x3];                                      // 0x03F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECADialogueResult Results)>    K2Node_CreateDelegate_OutputDelegate_21;           // 0x03FC(0x0014)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu) == 0x000008, "Wrong alignment on BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu");
static_assert(sizeof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu) == 0x000410, "Wrong size on BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, EntryPoint) == 0x000000, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_Event_id) == 0x000004, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_Event_id' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_Event_has_entries) == 0x000010, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_Event_has_entries' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_GetCurrentEntries_ReturnValue) == 0x000018, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_GetCurrentEntries_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_Event_tag) == 0x000028, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_Event_tag' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_MatchesTag_ReturnValue) == 0x000034, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_GetPlayerController_ReturnValue_1) == 0x000040, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_GetVisibility_ReturnValue) == 0x000048, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000049, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_GetUIHUDInterface_ReturnValue) == 0x000050, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_GetUIHUDInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_IsVisible_ReturnValue) == 0x000058, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_GetOwningPlayer_ReturnValue) == 0x000060, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_DynamicCast_AsCAPlayer_Controller) == 0x000068, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_DynamicCast_AsCAPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CustomEvent_NewPawn) == 0x000078, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CustomEvent_NewPawn' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_IsVisible_ReturnValue_1) == 0x000080, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_Event_MyGeometry) == 0x000084, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_Event_InDeltaTime) == 0x0000BC, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_ComponentBoundEvent_button_5) == 0x0000C0, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_ComponentBoundEvent_button_5' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_ComponentBoundEvent_button_4) == 0x0000D0, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_ComponentBoundEvent_button_4' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_AreSettingsDirty_ReturnValue) == 0x0000D8, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_AreSettingsDirty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_ComponentBoundEvent_button_3) == 0x0000E0, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_ComponentBoundEvent_button_3' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CustomEvent_results_6) == 0x0000E8, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CustomEvent_results_6' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_SwitchEnum_CmpSuccess) == 0x0000E9, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CustomEvent_results_5) == 0x0000EA, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CustomEvent_results_5' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000EB, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CustomEvent_results_4) == 0x0000EC, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CustomEvent_results_4' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_SwitchEnum_CmpSuccess_2) == 0x0000ED, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CustomEvent_results_3) == 0x0000EE, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CustomEvent_results_3' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_SwitchEnum_CmpSuccess_3) == 0x0000EF, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_GetWidgetAtIndex_ReturnValue) == 0x0000F0, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_GetWidgetAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_GetUIHUDInterface_ReturnValue_1) == 0x0000F8, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_GetUIHUDInterface_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CustomEvent_is_active) == 0x000100, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CustomEvent_is_active' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_IsValid_ReturnValue_1) == 0x000101, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_IsVisible_ReturnValue_2) == 0x000102, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_IsVisible_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_GetPlayerController_ReturnValue_2) == 0x000108, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_K2_GetPawn_ReturnValue) == 0x000110, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_ComponentBoundEvent_button_2) == 0x000118, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_ComponentBoundEvent_button_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CustomEvent_results_2) == 0x000120, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CustomEvent_results_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_SwitchEnum_CmpSuccess_4) == 0x000121, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CustomEvent_results_1) == 0x000122, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CustomEvent_results_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_SwitchEnum_CmpSuccess_5) == 0x000123, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_SwitchEnum_CmpSuccess_5' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_ComponentBoundEvent_button_1) == 0x000128, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_ComponentBoundEvent_button_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CustomEvent_results) == 0x000130, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CustomEvent_results' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_SwitchEnum_CmpSuccess_6) == 0x000131, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_SwitchEnum_CmpSuccess_6' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000134, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000148, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x00015C, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CreateDelegate_OutputDelegate_3) == 0x000170, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CreateDelegate_OutputDelegate_4) == 0x000184, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CreateDelegate_OutputDelegate_5) == 0x000198, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001AC, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001C0, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CreateDelegate_OutputDelegate_8) == 0x0001D4, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CreateDelegate_OutputDelegate_9) == 0x0001E8, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CreateDelegate_OutputDelegate_10) == 0x0001FC, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_GetCurrentContext_ReturnValue) == 0x000210, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_GetCurrentContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_SwitchEnum_CmpSuccess_7) == 0x000211, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_SwitchEnum_CmpSuccess_7' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CustomEvent_granted) == 0x000212, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CustomEvent_granted' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, Temp_delegate_Variable) == 0x000214, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, Temp_delegate_Variable_1) == 0x000228, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_IsFeatureActive_ReturnValue) == 0x00023C, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_IsFeatureActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, Temp_byte_Variable) == 0x00023D, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, Temp_byte_Variable_1) == 0x00023E, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, Temp_bool_Variable) == 0x00023F, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CreateDelegate_OutputDelegate_11) == 0x000240, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_GetUIHUDInterface_ReturnValue_2) == 0x000258, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_GetUIHUDInterface_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_IsValid_ReturnValue_2) == 0x000260, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_Event_force_sync_close) == 0x000261, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_Event_force_sync_close' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_AreSettingsDirty_ReturnValue_1) == 0x000262, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_AreSettingsDirty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_Not_PreBool_ReturnValue) == 0x000263, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CreateDelegate_OutputDelegate_12) == 0x000264, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_BooleanOR_ReturnValue) == 0x000278, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CreateDelegate_OutputDelegate_13) == 0x00027C, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CreateDelegate_OutputDelegate_14) == 0x000290, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_GetActiveWidget_ReturnValue) == 0x0002A8, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CustomEvent_Parent_Title) == 0x0002B0, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CustomEvent_Parent_Title' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CustomEvent_Screen_Title) == 0x0002E0, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CustomEvent_Screen_Title' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000310, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CreateDelegate_OutputDelegate_15) == 0x000314, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_AreSettingsDirty_ReturnValue_2) == 0x000328, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_AreSettingsDirty_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_ComponentBoundEvent_button) == 0x000330, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_ComponentBoundEvent_button' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_Select_Default) == 0x000338, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_AreFlagsValid_ReturnValue) == 0x000339, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_AreFlagsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CustomEvent_show_2) == 0x00033A, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CustomEvent_show_2' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CreateDelegate_OutputDelegate_16) == 0x00033C, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_BooleanAND_ReturnValue) == 0x000350, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_IsValid_ReturnValue_3) == 0x000351, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CreateDelegate_OutputDelegate_17) == 0x000354, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CustomEvent_show_1) == 0x000368, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CustomEvent_show_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_IsValid_ReturnValue_4) == 0x000369, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CreateDelegate_OutputDelegate_18) == 0x00036C, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CreateDelegate_OutputDelegate_18' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CreateDelegate_OutputDelegate_19) == 0x000380, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CreateDelegate_OutputDelegate_19' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CustomEvent_show) == 0x000394, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CustomEvent_show' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_IsValid_ReturnValue_5) == 0x000395, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CreateDelegate_OutputDelegate_20) == 0x000398, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CreateDelegate_OutputDelegate_20' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_GetLocalPlayerController_ReturnValue) == 0x0003B0, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_GetLocalPlayerController_ReturnValue_1) == 0x0003B8, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_GetLocalPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_PlayEvent_playback_instance) == 0x0003C0, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_PlayEvent_play_success) == 0x0003D0, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_PlayEvent_playback_instance_1) == 0x0003D8, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_PlayEvent_play_success_1) == 0x0003E8, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_PlayEvent_play_success_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_AssignCurrentlySelectedItemAndKey_ReturnValue) == 0x0003E9, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_AssignCurrentlySelectedItemAndKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_AssignCurrentlySelectedItemAndKey_ReturnValue_1) == 0x0003EA, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_AssignCurrentlySelectedItemAndKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_SwitchEnum_CmpSuccess_8) == 0x0003EB, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_SwitchEnum_CmpSuccess_8' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_GetGameState_ReturnValue) == 0x0003F0, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, CallFunc_GetIsPvEMatch_ReturnValue) == 0x0003F8, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::CallFunc_GetIsPvEMatch_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu, K2Node_CreateDelegate_OutputDelegate_21) == 0x0003FC, "Member 'BPUI_HUD_PauseMenu_C_ExecuteUbergraph_BPUI_HUD_PauseMenu::K2Node_CreateDelegate_OutputDelegate_21' has a wrong offset!");

// Function BPUI_HUD_PauseMenu.BPUI_HUD_PauseMenu_C.ShowLeaveMatchButton
// 0x0001 (0x0001 - 0x0000)
struct BPUI_HUD_PauseMenu_C_ShowLeaveMatchButton final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPUI_HUD_PauseMenu_C_ShowLeaveMatchButton) == 0x000001, "Wrong alignment on BPUI_HUD_PauseMenu_C_ShowLeaveMatchButton");
static_assert(sizeof(BPUI_HUD_PauseMenu_C_ShowLeaveMatchButton) == 0x000001, "Wrong size on BPUI_HUD_PauseMenu_C_ShowLeaveMatchButton");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ShowLeaveMatchButton, Show) == 0x000000, "Member 'BPUI_HUD_PauseMenu_C_ShowLeaveMatchButton::Show' has a wrong offset!");

// Function BPUI_HUD_PauseMenu.BPUI_HUD_PauseMenu_C.ShowReturnToMenuButton
// 0x0001 (0x0001 - 0x0000)
struct BPUI_HUD_PauseMenu_C_ShowReturnToMenuButton final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPUI_HUD_PauseMenu_C_ShowReturnToMenuButton) == 0x000001, "Wrong alignment on BPUI_HUD_PauseMenu_C_ShowReturnToMenuButton");
static_assert(sizeof(BPUI_HUD_PauseMenu_C_ShowReturnToMenuButton) == 0x000001, "Wrong size on BPUI_HUD_PauseMenu_C_ShowReturnToMenuButton");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ShowReturnToMenuButton, Show) == 0x000000, "Member 'BPUI_HUD_PauseMenu_C_ShowReturnToMenuButton::Show' has a wrong offset!");

// Function BPUI_HUD_PauseMenu.BPUI_HUD_PauseMenu_C.ShowSkipTutorialButton
// 0x0001 (0x0001 - 0x0000)
struct BPUI_HUD_PauseMenu_C_ShowSkipTutorialButton final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPUI_HUD_PauseMenu_C_ShowSkipTutorialButton) == 0x000001, "Wrong alignment on BPUI_HUD_PauseMenu_C_ShowSkipTutorialButton");
static_assert(sizeof(BPUI_HUD_PauseMenu_C_ShowSkipTutorialButton) == 0x000001, "Wrong size on BPUI_HUD_PauseMenu_C_ShowSkipTutorialButton");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_ShowSkipTutorialButton, Show) == 0x000000, "Member 'BPUI_HUD_PauseMenu_C_ShowSkipTutorialButton::Show' has a wrong offset!");

// Function BPUI_HUD_PauseMenu.BPUI_HUD_PauseMenu_C.BndEvt__BPUI_HUD_PauseMenu_skip_tutorial_K2Node_ComponentBoundEvent_6_UIElementSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPUI_HUD_PauseMenu_C_BndEvt__BPUI_HUD_PauseMenu_skip_tutorial_K2Node_ComponentBoundEvent_6_UIElementSelected__DelegateSignature final
{
public:
	class UCABaseUIElement*                       button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_PauseMenu_C_BndEvt__BPUI_HUD_PauseMenu_skip_tutorial_K2Node_ComponentBoundEvent_6_UIElementSelected__DelegateSignature) == 0x000008, "Wrong alignment on BPUI_HUD_PauseMenu_C_BndEvt__BPUI_HUD_PauseMenu_skip_tutorial_K2Node_ComponentBoundEvent_6_UIElementSelected__DelegateSignature");
static_assert(sizeof(BPUI_HUD_PauseMenu_C_BndEvt__BPUI_HUD_PauseMenu_skip_tutorial_K2Node_ComponentBoundEvent_6_UIElementSelected__DelegateSignature) == 0x000008, "Wrong size on BPUI_HUD_PauseMenu_C_BndEvt__BPUI_HUD_PauseMenu_skip_tutorial_K2Node_ComponentBoundEvent_6_UIElementSelected__DelegateSignature");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_BndEvt__BPUI_HUD_PauseMenu_skip_tutorial_K2Node_ComponentBoundEvent_6_UIElementSelected__DelegateSignature, button) == 0x000000, "Member 'BPUI_HUD_PauseMenu_C_BndEvt__BPUI_HUD_PauseMenu_skip_tutorial_K2Node_ComponentBoundEvent_6_UIElementSelected__DelegateSignature::button' has a wrong offset!");

// Function BPUI_HUD_PauseMenu.BPUI_HUD_PauseMenu_C.SetTitles
// 0x0060 (0x0060 - 0x0000)
struct BPUI_HUD_PauseMenu_C_SetTitles final
{
public:
	struct FCAText                                Parent_Title;                                      // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FCAText                                Screen_Title;                                      // 0x0030(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BPUI_HUD_PauseMenu_C_SetTitles) == 0x000008, "Wrong alignment on BPUI_HUD_PauseMenu_C_SetTitles");
static_assert(sizeof(BPUI_HUD_PauseMenu_C_SetTitles) == 0x000060, "Wrong size on BPUI_HUD_PauseMenu_C_SetTitles");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_SetTitles, Parent_Title) == 0x000000, "Member 'BPUI_HUD_PauseMenu_C_SetTitles::Parent_Title' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_SetTitles, Screen_Title) == 0x000030, "Member 'BPUI_HUD_PauseMenu_C_SetTitles::Screen_Title' has a wrong offset!");

// Function BPUI_HUD_PauseMenu.BPUI_HUD_PauseMenu_C.StartPreCloseScreenOperations
// 0x0001 (0x0001 - 0x0000)
struct BPUI_HUD_PauseMenu_C_StartPreCloseScreenOperations final
{
public:
	bool                                          Force_sync_close;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPUI_HUD_PauseMenu_C_StartPreCloseScreenOperations) == 0x000001, "Wrong alignment on BPUI_HUD_PauseMenu_C_StartPreCloseScreenOperations");
static_assert(sizeof(BPUI_HUD_PauseMenu_C_StartPreCloseScreenOperations) == 0x000001, "Wrong size on BPUI_HUD_PauseMenu_C_StartPreCloseScreenOperations");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_StartPreCloseScreenOperations, Force_sync_close) == 0x000000, "Member 'BPUI_HUD_PauseMenu_C_StartPreCloseScreenOperations::Force_sync_close' has a wrong offset!");

// Function BPUI_HUD_PauseMenu.BPUI_HUD_PauseMenu_C.OnPermissionToLeaveHandler
// 0x0001 (0x0001 - 0x0000)
struct BPUI_HUD_PauseMenu_C_OnPermissionToLeaveHandler final
{
public:
	bool                                          Granted;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPUI_HUD_PauseMenu_C_OnPermissionToLeaveHandler) == 0x000001, "Wrong alignment on BPUI_HUD_PauseMenu_C_OnPermissionToLeaveHandler");
static_assert(sizeof(BPUI_HUD_PauseMenu_C_OnPermissionToLeaveHandler) == 0x000001, "Wrong size on BPUI_HUD_PauseMenu_C_OnPermissionToLeaveHandler");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_OnPermissionToLeaveHandler, Granted) == 0x000000, "Member 'BPUI_HUD_PauseMenu_C_OnPermissionToLeaveHandler::Granted' has a wrong offset!");

// Function BPUI_HUD_PauseMenu.BPUI_HUD_PauseMenu_C.OnReturnToMenu
// 0x0001 (0x0001 - 0x0000)
struct BPUI_HUD_PauseMenu_C_OnReturnToMenu final
{
public:
	ECADialogueResult                             Results;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_PauseMenu_C_OnReturnToMenu) == 0x000001, "Wrong alignment on BPUI_HUD_PauseMenu_C_OnReturnToMenu");
static_assert(sizeof(BPUI_HUD_PauseMenu_C_OnReturnToMenu) == 0x000001, "Wrong size on BPUI_HUD_PauseMenu_C_OnReturnToMenu");
static_assert(offsetof(BPUI_HUD_PauseMenu_C_OnReturnToMenu, Results) == 0x000000, "Member 'BPUI_HUD_PauseMenu_C_OnReturnToMenu::Results' has a wrong offset!");

