#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_ArcLens_NPCWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_ArcLens_NPCWidget.BPUI_ArcLens_NPCWidget_C
// 0x0050 (0x04D8 - 0x0488)
class UBPUI_ArcLens_NPCWidget_C final : public UCAArcLensNPCWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0488(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hit;                                               // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Scale;                                             // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           Actual_content_container;                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 bg;                                                // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_HUD_InputDisplayWidget_C*         BPUI_HUD_InputDisplayWidget_1;                     // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Health_overlay;                                    // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           Cached_bar_color;                                  // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Combat_anim_played;                                // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BPUI_ArcLens_NPCWidget(int32 EntryPoint);
	void UpdateHealthScale(float Health_scale);
	void OnHealthChanged(float Health, float Old_health);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_ArcLens_NPCWidget_C">();
	}
	static class UBPUI_ArcLens_NPCWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_ArcLens_NPCWidget_C>();
	}
};
static_assert(alignof(UBPUI_ArcLens_NPCWidget_C) == 0x000008, "Wrong alignment on UBPUI_ArcLens_NPCWidget_C");
static_assert(sizeof(UBPUI_ArcLens_NPCWidget_C) == 0x0004D8, "Wrong size on UBPUI_ArcLens_NPCWidget_C");
static_assert(offsetof(UBPUI_ArcLens_NPCWidget_C, UberGraphFrame) == 0x000488, "Member 'UBPUI_ArcLens_NPCWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_ArcLens_NPCWidget_C, Hit) == 0x000490, "Member 'UBPUI_ArcLens_NPCWidget_C::Hit' has a wrong offset!");
static_assert(offsetof(UBPUI_ArcLens_NPCWidget_C, Scale) == 0x000498, "Member 'UBPUI_ArcLens_NPCWidget_C::Scale' has a wrong offset!");
static_assert(offsetof(UBPUI_ArcLens_NPCWidget_C, Actual_content_container) == 0x0004A0, "Member 'UBPUI_ArcLens_NPCWidget_C::Actual_content_container' has a wrong offset!");
static_assert(offsetof(UBPUI_ArcLens_NPCWidget_C, bg) == 0x0004A8, "Member 'UBPUI_ArcLens_NPCWidget_C::bg' has a wrong offset!");
static_assert(offsetof(UBPUI_ArcLens_NPCWidget_C, BPUI_HUD_InputDisplayWidget_1) == 0x0004B0, "Member 'UBPUI_ArcLens_NPCWidget_C::BPUI_HUD_InputDisplayWidget_1' has a wrong offset!");
static_assert(offsetof(UBPUI_ArcLens_NPCWidget_C, Health_overlay) == 0x0004B8, "Member 'UBPUI_ArcLens_NPCWidget_C::Health_overlay' has a wrong offset!");
static_assert(offsetof(UBPUI_ArcLens_NPCWidget_C, Cached_bar_color) == 0x0004C0, "Member 'UBPUI_ArcLens_NPCWidget_C::Cached_bar_color' has a wrong offset!");
static_assert(offsetof(UBPUI_ArcLens_NPCWidget_C, Combat_anim_played) == 0x0004D0, "Member 'UBPUI_ArcLens_NPCWidget_C::Combat_anim_played' has a wrong offset!");

}

