#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HUD_GenericProgress

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CALocalisationRuntime_structs.hpp"


namespace SDK::Params
{

// Function BPUI_HUD_GenericProgress.BPUI_HUD_GenericProgress_C.ExecuteUbergraph_BPUI_HUD_GenericProgress
// 0x00D0 (0x00D0 - 0x0000)
struct BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCATextValid_ReturnValue;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAText                                Temp_struct_Variable;                              // 0x0008(0x0030)()
	struct FCAText                                K2Node_Select_Default;                             // 0x0038(0x0030)()
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0068(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress) == 0x000008, "Wrong alignment on BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress");
static_assert(sizeof(BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress) == 0x0000D0, "Wrong size on BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress");
static_assert(offsetof(BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress, EntryPoint) == 0x000000, "Member 'BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress, Temp_bool_Variable) == 0x000004, "Member 'BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress, CallFunc_IsCATextValid_ReturnValue) == 0x000005, "Member 'BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress::CallFunc_IsCATextValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress, Temp_struct_Variable) == 0x000008, "Member 'BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress, K2Node_Select_Default) == 0x000038, "Member 'BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress, K2Node_Event_MyGeometry) == 0x000068, "Member 'BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress, K2Node_Event_InDeltaTime) == 0x0000A0, "Member 'BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000A4, "Member 'BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000A8, "Member 'BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000AC, "Member 'BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress, CallFunc_FClamp_ReturnValue) == 0x0000B0, "Member 'BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000B8, "Member 'BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress, CallFunc_PlayAnimation_ReturnValue) == 0x0000C0, "Member 'BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000C8, "Member 'BPUI_HUD_GenericProgress_C_ExecuteUbergraph_BPUI_HUD_GenericProgress::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function BPUI_HUD_GenericProgress.BPUI_HUD_GenericProgress_C.Tick
// 0x003C (0x003C - 0x0000)
struct BPUI_HUD_GenericProgress_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_HUD_GenericProgress_C_Tick) == 0x000004, "Wrong alignment on BPUI_HUD_GenericProgress_C_Tick");
static_assert(sizeof(BPUI_HUD_GenericProgress_C_Tick) == 0x00003C, "Wrong size on BPUI_HUD_GenericProgress_C_Tick");
static_assert(offsetof(BPUI_HUD_GenericProgress_C_Tick, MyGeometry) == 0x000000, "Member 'BPUI_HUD_GenericProgress_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BPUI_HUD_GenericProgress_C_Tick, InDeltaTime) == 0x000038, "Member 'BPUI_HUD_GenericProgress_C_Tick::InDeltaTime' has a wrong offset!");

}

