#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPWC_NPC_AlertWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPWC_NPC_AlertWidget.BPWC_NPC_AlertWidget_C.ExecuteUbergraph_BPWC_NPC_AlertWidget
// 0x00A8 (0x00A8 - 0x0000)
struct BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_NPC*                       K2Node_DynamicCast_AsCACharacter_NPC;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACASecurityArea*                        CallFunc_GetCurrentSecurityArea_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_NPCEscalatorManagerStateMachineComponent_C* K2Node_DynamicCast_AsBP_NPCEscalator_Manager_State_Machine_Component; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ACASecurityArea* Security_area)> K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0014)(ZeroConstructor, NoDestructor)
	class ACASecurityArea*                        K2Node_CustomEvent_security_area;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCANPCEscalatorManagerStateMachineComponent* CallFunc_GetComponentByClass_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCAFiniteState* State)>  K2Node_CreateDelegate_OutputDelegate_1;            // 0x0070(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCASysAreaSensorComponent*              CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_NPCEscalatorManagerStateMachineComponent_C* CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCASecurityAreaStateMachineComponent*   CallFunc_GetComponentByClass_ReturnValue_3;        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget) == 0x000008, "Wrong alignment on BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget");
static_assert(sizeof(BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget) == 0x0000A8, "Wrong size on BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget, EntryPoint) == 0x000000, "Member 'BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget, K2Node_DynamicCast_AsCACharacter_NPC) == 0x000010, "Member 'BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget::K2Node_DynamicCast_AsCACharacter_NPC' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget, CallFunc_GetCurrentSecurityArea_ReturnValue) == 0x000020, "Member 'BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget::CallFunc_GetCurrentSecurityArea_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget, K2Node_DynamicCast_AsBP_NPCEscalator_Manager_State_Machine_Component) == 0x000030, "Member 'BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget::K2Node_DynamicCast_AsBP_NPCEscalator_Manager_State_Machine_Component' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget, K2Node_CustomEvent_security_area) == 0x000050, "Member 'BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget::K2Node_CustomEvent_security_area' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget, CallFunc_IsValid_ReturnValue_2) == 0x000059, "Member 'BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget, CallFunc_GetComponentByClass_ReturnValue) == 0x000060, "Member 'BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget, K2Node_Event_DeltaSeconds) == 0x000068, "Member 'BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget, CallFunc_IsServer_ReturnValue) == 0x00006C, "Member 'BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget, CallFunc_IsValid_ReturnValue_3) == 0x00006D, "Member 'BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000070, "Member 'BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000088, "Member 'BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget, CallFunc_IsValid_ReturnValue_4) == 0x000090, "Member 'BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget, CallFunc_GetComponentByClass_ReturnValue_2) == 0x000098, "Member 'BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget, CallFunc_GetComponentByClass_ReturnValue_3) == 0x0000A0, "Member 'BPWC_NPC_AlertWidget_C_ExecuteUbergraph_BPWC_NPC_AlertWidget::CallFunc_GetComponentByClass_ReturnValue_3' has a wrong offset!");

// Function BPWC_NPC_AlertWidget.BPWC_NPC_AlertWidget_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BPWC_NPC_AlertWidget_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPWC_NPC_AlertWidget_C_ReceiveTick) == 0x000004, "Wrong alignment on BPWC_NPC_AlertWidget_C_ReceiveTick");
static_assert(sizeof(BPWC_NPC_AlertWidget_C_ReceiveTick) == 0x000004, "Wrong size on BPWC_NPC_AlertWidget_C_ReceiveTick");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BPWC_NPC_AlertWidget_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BPWC_NPC_AlertWidget.BPWC_NPC_AlertWidget_C.OnSecurityAreaEnter
// 0x0008 (0x0008 - 0x0000)
struct BPWC_NPC_AlertWidget_C_OnSecurityAreaEnter final
{
public:
	class ACASecurityArea*                        Security_area;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPWC_NPC_AlertWidget_C_OnSecurityAreaEnter) == 0x000008, "Wrong alignment on BPWC_NPC_AlertWidget_C_OnSecurityAreaEnter");
static_assert(sizeof(BPWC_NPC_AlertWidget_C_OnSecurityAreaEnter) == 0x000008, "Wrong size on BPWC_NPC_AlertWidget_C_OnSecurityAreaEnter");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_OnSecurityAreaEnter, Security_area) == 0x000000, "Member 'BPWC_NPC_AlertWidget_C_OnSecurityAreaEnter::Security_area' has a wrong offset!");

// Function BPWC_NPC_AlertWidget.BPWC_NPC_AlertWidget_C.SetVisibleInternal
// 0x0001 (0x0001 - 0x0000)
struct BPWC_NPC_AlertWidget_C_SetVisibleInternal final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPWC_NPC_AlertWidget_C_SetVisibleInternal) == 0x000001, "Wrong alignment on BPWC_NPC_AlertWidget_C_SetVisibleInternal");
static_assert(sizeof(BPWC_NPC_AlertWidget_C_SetVisibleInternal) == 0x000001, "Wrong size on BPWC_NPC_AlertWidget_C_SetVisibleInternal");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_SetVisibleInternal, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BPWC_NPC_AlertWidget_C_SetVisibleInternal::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BPWC_NPC_AlertWidget.BPWC_NPC_AlertWidget_C.SetHiddenInternal
// 0x0010 (0x0010 - 0x0000)
struct BPWC_NPC_AlertWidget_C_SetHiddenInternal final
{
public:
	class UCAHUDAlarmAlertIndicator*              AlertIndicator;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPWC_NPC_AlertWidget_C_SetHiddenInternal) == 0x000008, "Wrong alignment on BPWC_NPC_AlertWidget_C_SetHiddenInternal");
static_assert(sizeof(BPWC_NPC_AlertWidget_C_SetHiddenInternal) == 0x000010, "Wrong size on BPWC_NPC_AlertWidget_C_SetHiddenInternal");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_SetHiddenInternal, AlertIndicator) == 0x000000, "Member 'BPWC_NPC_AlertWidget_C_SetHiddenInternal::AlertIndicator' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_SetHiddenInternal, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BPWC_NPC_AlertWidget_C_SetHiddenInternal::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BPWC_NPC_AlertWidget.BPWC_NPC_AlertWidget_C.Tick
// 0x00B8 (0x00B8 - 0x0000)
struct BPWC_NPC_AlertWidget_C_Tick final
{
public:
	float                                         LocalAlertStateTotalDuration;                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAFiniteState*                         LocalAlertState;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalIsInSameCampAsLocalPlayer;                    // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LocalIsInShowIconState;                            // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LocalIsOwnerAnEscalator;                           // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPercentageToEscalate_ReturnValue;      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAFiniteState*                         CallFunc_GetCurrentState_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue;               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACASecurityArea*                        CallFunc_GetCurrentSecurityArea_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAFiniteState*                         CallFunc_GetCurrentState_ReturnValue_1;            // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACASecurityArea*                        CallFunc_GetCurrentSecurityArea_ReturnValue_1;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSecurityAreaUsingEscalation_ReturnValue; // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_1;             // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPWC_NPC_AlertWidget_C_Tick) == 0x000008, "Wrong alignment on BPWC_NPC_AlertWidget_C_Tick");
static_assert(sizeof(BPWC_NPC_AlertWidget_C_Tick) == 0x0000B8, "Wrong size on BPWC_NPC_AlertWidget_C_Tick");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, LocalAlertStateTotalDuration) == 0x000000, "Member 'BPWC_NPC_AlertWidget_C_Tick::LocalAlertStateTotalDuration' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, LocalAlertState) == 0x000008, "Member 'BPWC_NPC_AlertWidget_C_Tick::LocalAlertState' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, LocalIsInSameCampAsLocalPlayer) == 0x000010, "Member 'BPWC_NPC_AlertWidget_C_Tick::LocalIsInSameCampAsLocalPlayer' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, LocalIsInShowIconState) == 0x000011, "Member 'BPWC_NPC_AlertWidget_C_Tick::LocalIsInShowIconState' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, LocalIsOwnerAnEscalator) == 0x000012, "Member 'BPWC_NPC_AlertWidget_C_Tick::LocalIsOwnerAnEscalator' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BPWC_NPC_AlertWidget_C_Tick::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_GetPercentageToEscalate_ReturnValue) == 0x000018, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_GetPercentageToEscalate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_IsValid_ReturnValue_1) == 0x00001D, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_IsValid_ReturnValue_2) == 0x00001E, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_IsVisible_ReturnValue) == 0x00001F, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_IsVisible_ReturnValue_1) == 0x000020, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BPWC_NPC_AlertWidget_C_Tick::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00002C, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_SelectFloat_ReturnValue) == 0x000030, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_GetCurrentState_ReturnValue) == 0x000038, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_GetCurrentState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000040, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_IsValid_ReturnValue_3) == 0x000041, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_BooleanAND_ReturnValue) == 0x000042, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_GetStateByName_ReturnValue) == 0x000048, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_GetStateByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_BooleanAND_ReturnValue_1) == 0x000050, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_GetCurrentSecurityArea_ReturnValue) == 0x000058, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_GetCurrentSecurityArea_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_GetPlayerPawn_ReturnValue) == 0x000060, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x000068, "Member 'BPWC_NPC_AlertWidget_C_Tick::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'BPWC_NPC_AlertWidget_C_Tick::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_GetCurrentState_ReturnValue_1) == 0x000078, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_GetCurrentState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_GetCurrentSecurityArea_ReturnValue_1) == 0x000080, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_GetCurrentSecurityArea_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_IsValid_ReturnValue_4) == 0x000088, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_IsSecurityAreaUsingEscalation_ReturnValue) == 0x000089, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_IsSecurityAreaUsingEscalation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x00008A, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_Array_Get_Item) == 0x00008C, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_GetStateByName_ReturnValue_1) == 0x0000A0, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_GetStateByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_Less_IntInt_ReturnValue) == 0x0000A8, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x0000A9, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_Array_Find_ReturnValue) == 0x0000AC, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_IsValid_ReturnValue_5) == 0x0000B0, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_Tick, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000B1, "Member 'BPWC_NPC_AlertWidget_C_Tick::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BPWC_NPC_AlertWidget.BPWC_NPC_AlertWidget_C.OnEscalationCompletedActviated
// 0x0010 (0x0010 - 0x0000)
struct BPWC_NPC_AlertWidget_C_OnEscalationCompletedActviated final
{
public:
	class UCAHUDAlarmAlertIndicator*              AlertIndicator;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPWC_NPC_AlertWidget_C_OnEscalationCompletedActviated) == 0x000008, "Wrong alignment on BPWC_NPC_AlertWidget_C_OnEscalationCompletedActviated");
static_assert(sizeof(BPWC_NPC_AlertWidget_C_OnEscalationCompletedActviated) == 0x000010, "Wrong size on BPWC_NPC_AlertWidget_C_OnEscalationCompletedActviated");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_OnEscalationCompletedActviated, AlertIndicator) == 0x000000, "Member 'BPWC_NPC_AlertWidget_C_OnEscalationCompletedActviated::AlertIndicator' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_OnEscalationCompletedActviated, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BPWC_NPC_AlertWidget_C_OnEscalationCompletedActviated::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BPWC_NPC_AlertWidget.BPWC_NPC_AlertWidget_C.OnEscalationAlertedActivated
// 0x0001 (0x0001 - 0x0000)
struct BPWC_NPC_AlertWidget_C_OnEscalationAlertedActivated final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPWC_NPC_AlertWidget_C_OnEscalationAlertedActivated) == 0x000001, "Wrong alignment on BPWC_NPC_AlertWidget_C_OnEscalationAlertedActivated");
static_assert(sizeof(BPWC_NPC_AlertWidget_C_OnEscalationAlertedActivated) == 0x000001, "Wrong size on BPWC_NPC_AlertWidget_C_OnEscalationAlertedActivated");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_OnEscalationAlertedActivated, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BPWC_NPC_AlertWidget_C_OnEscalationAlertedActivated::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BPWC_NPC_AlertWidget.BPWC_NPC_AlertWidget_C.BindEscalatorStateEvents
// 0x0048 (0x0048 - 0x0000)
struct BPWC_NPC_AlertWidget_C_BindEscalatorStateEvents final
{
public:
	class UCAStateMachineComponent*               EscalatorManager;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_1;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPWC_NPC_AlertWidget_C_BindEscalatorStateEvents) == 0x000008, "Wrong alignment on BPWC_NPC_AlertWidget_C_BindEscalatorStateEvents");
static_assert(sizeof(BPWC_NPC_AlertWidget_C_BindEscalatorStateEvents) == 0x000048, "Wrong size on BPWC_NPC_AlertWidget_C_BindEscalatorStateEvents");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_BindEscalatorStateEvents, EscalatorManager) == 0x000000, "Member 'BPWC_NPC_AlertWidget_C_BindEscalatorStateEvents::EscalatorManager' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_BindEscalatorStateEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BPWC_NPC_AlertWidget_C_BindEscalatorStateEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_BindEscalatorStateEvents, CallFunc_GetStateByName_ReturnValue) == 0x000020, "Member 'BPWC_NPC_AlertWidget_C_BindEscalatorStateEvents::CallFunc_GetStateByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_BindEscalatorStateEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'BPWC_NPC_AlertWidget_C_BindEscalatorStateEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_BindEscalatorStateEvents, CallFunc_GetStateByName_ReturnValue_1) == 0x000040, "Member 'BPWC_NPC_AlertWidget_C_BindEscalatorStateEvents::CallFunc_GetStateByName_ReturnValue_1' has a wrong offset!");

// Function BPWC_NPC_AlertWidget.BPWC_NPC_AlertWidget_C.UnbindEscalatorStateEvents
// 0x0048 (0x0048 - 0x0000)
struct BPWC_NPC_AlertWidget_C_UnbindEscalatorStateEvents final
{
public:
	class UCAStateMachineComponent*               EscalatorManager;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAFiniteState*                         CallFunc_GetStateByName_ReturnValue_1;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPWC_NPC_AlertWidget_C_UnbindEscalatorStateEvents) == 0x000008, "Wrong alignment on BPWC_NPC_AlertWidget_C_UnbindEscalatorStateEvents");
static_assert(sizeof(BPWC_NPC_AlertWidget_C_UnbindEscalatorStateEvents) == 0x000048, "Wrong size on BPWC_NPC_AlertWidget_C_UnbindEscalatorStateEvents");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_UnbindEscalatorStateEvents, EscalatorManager) == 0x000000, "Member 'BPWC_NPC_AlertWidget_C_UnbindEscalatorStateEvents::EscalatorManager' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_UnbindEscalatorStateEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BPWC_NPC_AlertWidget_C_UnbindEscalatorStateEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_UnbindEscalatorStateEvents, CallFunc_GetStateByName_ReturnValue) == 0x000020, "Member 'BPWC_NPC_AlertWidget_C_UnbindEscalatorStateEvents::CallFunc_GetStateByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_UnbindEscalatorStateEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'BPWC_NPC_AlertWidget_C_UnbindEscalatorStateEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_UnbindEscalatorStateEvents, CallFunc_GetStateByName_ReturnValue_1) == 0x000040, "Member 'BPWC_NPC_AlertWidget_C_UnbindEscalatorStateEvents::CallFunc_GetStateByName_ReturnValue_1' has a wrong offset!");

// Function BPWC_NPC_AlertWidget.BPWC_NPC_AlertWidget_C.SecurityAreaStateChanged
// 0x0008 (0x0008 - 0x0000)
struct BPWC_NPC_AlertWidget_C_SecurityAreaStateChanged final
{
public:
	class UCAFiniteState*                         State;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPWC_NPC_AlertWidget_C_SecurityAreaStateChanged) == 0x000008, "Wrong alignment on BPWC_NPC_AlertWidget_C_SecurityAreaStateChanged");
static_assert(sizeof(BPWC_NPC_AlertWidget_C_SecurityAreaStateChanged) == 0x000008, "Wrong size on BPWC_NPC_AlertWidget_C_SecurityAreaStateChanged");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_SecurityAreaStateChanged, State) == 0x000000, "Member 'BPWC_NPC_AlertWidget_C_SecurityAreaStateChanged::State' has a wrong offset!");

// Function BPWC_NPC_AlertWidget.BPWC_NPC_AlertWidget_C.AllowShowingFromStatusTag
// 0x0001 (0x0001 - 0x0000)
struct BPWC_NPC_AlertWidget_C_AllowShowingFromStatusTag final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPWC_NPC_AlertWidget_C_AllowShowingFromStatusTag) == 0x000001, "Wrong alignment on BPWC_NPC_AlertWidget_C_AllowShowingFromStatusTag");
static_assert(sizeof(BPWC_NPC_AlertWidget_C_AllowShowingFromStatusTag) == 0x000001, "Wrong size on BPWC_NPC_AlertWidget_C_AllowShowingFromStatusTag");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_AllowShowingFromStatusTag, bEnabled) == 0x000000, "Member 'BPWC_NPC_AlertWidget_C_AllowShowingFromStatusTag::bEnabled' has a wrong offset!");

// Function BPWC_NPC_AlertWidget.BPWC_NPC_AlertWidget_C.CheckStatusTagToEnableOn
// 0x0028 (0x0028 - 0x0000)
struct BPWC_NPC_AlertWidget_C_CheckStatusTagToEnableOn final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPWC_NPC_AlertWidget_C_CheckStatusTagToEnableOn) == 0x000008, "Wrong alignment on BPWC_NPC_AlertWidget_C_CheckStatusTagToEnableOn");
static_assert(sizeof(BPWC_NPC_AlertWidget_C_CheckStatusTagToEnableOn) == 0x000028, "Wrong size on BPWC_NPC_AlertWidget_C_CheckStatusTagToEnableOn");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_CheckStatusTagToEnableOn, Temp_bool_Variable) == 0x000000, "Member 'BPWC_NPC_AlertWidget_C_CheckStatusTagToEnableOn::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPWC_NPC_AlertWidget_C_CheckStatusTagToEnableOn, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'BPWC_NPC_AlertWidget_C_CheckStatusTagToEnableOn::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
