#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CA_Weapon_Blueprint_FuncLib

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Keaton_structs.hpp"


namespace SDK::Params
{

// Function CA_Weapon_Blueprint_FuncLib.CA_Weapon_Blueprint_FuncLib_C.GetEquipAnimRate
// 0x0040 (0x0040 - 0x0000)
struct CA_Weapon_Blueprint_FuncLib_C_GetEquipAnimRate final
{
public:
	class ACAEquipmentBase*                       Equipment;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rate;                                              // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAWeapon*                              K2Node_DynamicCast_AsCAWeapon;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAWeaponStatsInstanceInterface        CallFunc_GetStatsInstanceInterface_ReturnValue;    // 0x0030(0x0008)(ConstParm, NoDestructor)
	float                                         CallFunc_GetEquipInTime_equip_in_time;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculatePlaybackRateForDuration_ReturnValue; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CA_Weapon_Blueprint_FuncLib_C_GetEquipAnimRate) == 0x000008, "Wrong alignment on CA_Weapon_Blueprint_FuncLib_C_GetEquipAnimRate");
static_assert(sizeof(CA_Weapon_Blueprint_FuncLib_C_GetEquipAnimRate) == 0x000040, "Wrong size on CA_Weapon_Blueprint_FuncLib_C_GetEquipAnimRate");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_GetEquipAnimRate, Equipment) == 0x000000, "Member 'CA_Weapon_Blueprint_FuncLib_C_GetEquipAnimRate::Equipment' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_GetEquipAnimRate, Montage) == 0x000008, "Member 'CA_Weapon_Blueprint_FuncLib_C_GetEquipAnimRate::Montage' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_GetEquipAnimRate, __WorldContext) == 0x000010, "Member 'CA_Weapon_Blueprint_FuncLib_C_GetEquipAnimRate::__WorldContext' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_GetEquipAnimRate, Rate) == 0x000018, "Member 'CA_Weapon_Blueprint_FuncLib_C_GetEquipAnimRate::Rate' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_GetEquipAnimRate, K2Node_DynamicCast_AsCAWeapon) == 0x000020, "Member 'CA_Weapon_Blueprint_FuncLib_C_GetEquipAnimRate::K2Node_DynamicCast_AsCAWeapon' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_GetEquipAnimRate, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'CA_Weapon_Blueprint_FuncLib_C_GetEquipAnimRate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_GetEquipAnimRate, CallFunc_GetStatsInstanceInterface_ReturnValue) == 0x000030, "Member 'CA_Weapon_Blueprint_FuncLib_C_GetEquipAnimRate::CallFunc_GetStatsInstanceInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_GetEquipAnimRate, CallFunc_GetEquipInTime_equip_in_time) == 0x000038, "Member 'CA_Weapon_Blueprint_FuncLib_C_GetEquipAnimRate::CallFunc_GetEquipInTime_equip_in_time' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_GetEquipAnimRate, CallFunc_CalculatePlaybackRateForDuration_ReturnValue) == 0x00003C, "Member 'CA_Weapon_Blueprint_FuncLib_C_GetEquipAnimRate::CallFunc_CalculatePlaybackRateForDuration_ReturnValue' has a wrong offset!");

// Function CA_Weapon_Blueprint_FuncLib.CA_Weapon_Blueprint_FuncLib_C.GetUnequipAnimRate
// 0x0040 (0x0040 - 0x0000)
struct CA_Weapon_Blueprint_FuncLib_C_GetUnequipAnimRate final
{
public:
	class ACAEquipmentBase*                       Equipment;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rate;                                              // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAWeapon*                              K2Node_DynamicCast_AsCAWeapon;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAWeaponStatsInstanceInterface        CallFunc_GetStatsInstanceInterface_ReturnValue;    // 0x0030(0x0008)(ConstParm, NoDestructor)
	float                                         CallFunc_GetEquipOutTime_equip_out_time;           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculatePlaybackRateForDuration_ReturnValue; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CA_Weapon_Blueprint_FuncLib_C_GetUnequipAnimRate) == 0x000008, "Wrong alignment on CA_Weapon_Blueprint_FuncLib_C_GetUnequipAnimRate");
static_assert(sizeof(CA_Weapon_Blueprint_FuncLib_C_GetUnequipAnimRate) == 0x000040, "Wrong size on CA_Weapon_Blueprint_FuncLib_C_GetUnequipAnimRate");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_GetUnequipAnimRate, Equipment) == 0x000000, "Member 'CA_Weapon_Blueprint_FuncLib_C_GetUnequipAnimRate::Equipment' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_GetUnequipAnimRate, Montage) == 0x000008, "Member 'CA_Weapon_Blueprint_FuncLib_C_GetUnequipAnimRate::Montage' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_GetUnequipAnimRate, __WorldContext) == 0x000010, "Member 'CA_Weapon_Blueprint_FuncLib_C_GetUnequipAnimRate::__WorldContext' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_GetUnequipAnimRate, Rate) == 0x000018, "Member 'CA_Weapon_Blueprint_FuncLib_C_GetUnequipAnimRate::Rate' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_GetUnequipAnimRate, K2Node_DynamicCast_AsCAWeapon) == 0x000020, "Member 'CA_Weapon_Blueprint_FuncLib_C_GetUnequipAnimRate::K2Node_DynamicCast_AsCAWeapon' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_GetUnequipAnimRate, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'CA_Weapon_Blueprint_FuncLib_C_GetUnequipAnimRate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_GetUnequipAnimRate, CallFunc_GetStatsInstanceInterface_ReturnValue) == 0x000030, "Member 'CA_Weapon_Blueprint_FuncLib_C_GetUnequipAnimRate::CallFunc_GetStatsInstanceInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_GetUnequipAnimRate, CallFunc_GetEquipOutTime_equip_out_time) == 0x000038, "Member 'CA_Weapon_Blueprint_FuncLib_C_GetUnequipAnimRate::CallFunc_GetEquipOutTime_equip_out_time' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_GetUnequipAnimRate, CallFunc_CalculatePlaybackRateForDuration_ReturnValue) == 0x00003C, "Member 'CA_Weapon_Blueprint_FuncLib_C_GetUnequipAnimRate::CallFunc_CalculatePlaybackRateForDuration_ReturnValue' has a wrong offset!");

// Function CA_Weapon_Blueprint_FuncLib.CA_Weapon_Blueprint_FuncLib_C.DrawLinesToActors
// 0x0060 (0x0060 - 0x0000)
struct CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors final
{
public:
	struct FVector                                SourceLocation;                                    // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ActorsToDrawLinesTo;                               // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         DrawDuration;                                      // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Thickness;                                         // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors) == 0x000008, "Wrong alignment on CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors");
static_assert(sizeof(CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors) == 0x000060, "Wrong size on CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors, SourceLocation) == 0x000000, "Member 'CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors::SourceLocation' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors, ActorsToDrawLinesTo) == 0x000010, "Member 'CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors::ActorsToDrawLinesTo' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors, DrawDuration) == 0x000020, "Member 'CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors::DrawDuration' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors, Thickness) == 0x000024, "Member 'CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors::Thickness' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors, __WorldContext) == 0x000028, "Member 'CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors::__WorldContext' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors, Temp_int_Array_Index_Variable) == 0x000034, "Member 'CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors, CallFunc_Array_Get_Item) == 0x000040, "Member 'CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'CA_Weapon_Blueprint_FuncLib_C_DrawLinesToActors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

