#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CAAudioUtilities

#include "Basic.hpp"

#include "Keaton_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CAAudio_structs.hpp"
#include "AUDIO_Env_FoleySweetners_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CAAudioUtilities.CAAudioUtilities_C.PlaySpecialistFoostepAudio
// 0x0438 (0x0438 - 0x0000)
struct CAAudioUtilities_C_PlaySpecialistFoostepAudio final
{
public:
	class ACACharacter_MainPlayer*                Character_Main_Player;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAPlayerMovementMode                         Current_Movement_Mode;                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Footstep_Event_Max_Distance;                       // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioStateValueType                 CASPr_CNTR_State;                                  // 0x001C(0x0004)(Edit, BlueprintVisible, NoDestructor)
	ECAPlayerMovementMode                         Player_Movement_Mode;                              // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioStateValueType                 VentCheck;                                         // 0x0024(0x0004)(Edit, BlueprintVisible, NoDestructor)
	struct FCAAudioEventType                      FP_Footstep_Event;                                 // 0x0028(0x0004)(Edit, BlueprintVisible, NoDestructor)
	struct FCAAudioEventType                      TP_Footstep_Event;                                 // 0x002C(0x0004)(Edit, BlueprintVisible, NoDestructor)
	struct FCAAudioEventType                      TP_Inital_Footstep_Event;                          // 0x0030(0x0004)(Edit, BlueprintVisible, NoDestructor)
	ECAPlayerMovementMetaMode                     Player_Meta_Movement_State;                        // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioBankNameType                   MaterialBank;                                      // 0x0038(0x0004)(Edit, BlueprintVisible, DisableEditOnTemplate, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x003C(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0050(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x0064(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_CompareHashIsEqual_ReturnValue;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_2;                          // 0x007C(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_3;                          // 0x0090(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_4;                          // 0x00A4(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x00C0(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x00D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FootstepSimulationEnabled_ReturnValue;    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DB[0x1];                                       // 0x00DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCASPrZoneInfo_id;                      // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZoneType                                     CallFunc_GetCASPrZoneInfo_type;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioStateValueType                 CallFunc_GetCASPrZoneInfo_size;                    // 0x00E4(0x0004)(NoDestructor)
	float                                         CallFunc_GetCASPrZoneInfo_volume;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCASPrZoneInfo_ReturnValue;             // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCASPrZoneInfo_id_1;                    // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EZoneType                                     CallFunc_GetCASPrZoneInfo_type_1;                  // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioStateValueType                 CallFunc_GetCASPrZoneInfo_size_1;                  // 0x00F8(0x0004)(NoDestructor)
	float                                         CallFunc_GetCASPrZoneInfo_volume_1;                // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCASPrZoneInfo_ReturnValue_1;           // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CompareHashIsEqual_ReturnValue_1;         // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_2;            // 0x0128(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_2;                 // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0148(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x01E0(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F2[0x2];                                      // 0x01F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0248(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0260(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x026C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPhysicalSurface                              CallFunc_GetSurfaceType_ReturnValue;               // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27A[0x2];                                      // 0x027A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0288(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_3;            // 0x0298(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_3;                 // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit_1;                 // 0x02AC(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue_1;            // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x033D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x033E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33F[0x1];                                      // 0x033F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0348(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0354(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0360(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x036C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0388(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0390(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x03A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x03B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPhysicalSurface                              CallFunc_GetSurfaceType_ReturnValue_1;             // 0x03C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingViewed_ReturnValue;                // 0x03C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C3[0x5];                                      // 0x03C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_4;            // 0x03C8(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_4;                 // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9[0x3];                                      // 0x03D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_5;                          // 0x03DC(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_6;                          // 0x03F0(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_5;            // 0x0408(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_5;                 // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_6;            // 0x0420(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_6;                 // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CAAudioUtilities_C_PlaySpecialistFoostepAudio) == 0x000008, "Wrong alignment on CAAudioUtilities_C_PlaySpecialistFoostepAudio");
static_assert(sizeof(CAAudioUtilities_C_PlaySpecialistFoostepAudio) == 0x000438, "Wrong size on CAAudioUtilities_C_PlaySpecialistFoostepAudio");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, Character_Main_Player) == 0x000000, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::Character_Main_Player' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, Current_Movement_Mode) == 0x000008, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::Current_Movement_Mode' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, __WorldContext) == 0x000010, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::__WorldContext' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, Footstep_Event_Max_Distance) == 0x000018, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::Footstep_Event_Max_Distance' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CASPr_CNTR_State) == 0x00001C, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CASPr_CNTR_State' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, Player_Movement_Mode) == 0x000020, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::Player_Movement_Mode' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, VentCheck) == 0x000024, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::VentCheck' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, FP_Footstep_Event) == 0x000028, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::FP_Footstep_Event' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, TP_Footstep_Event) == 0x00002C, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::TP_Footstep_Event' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, TP_Inital_Footstep_Event) == 0x000030, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::TP_Inital_Footstep_Event' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, Player_Meta_Movement_State) == 0x000034, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::Player_Meta_Movement_State' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, MaterialBank) == 0x000038, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::MaterialBank' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, Temp_delegate_Variable) == 0x00003C, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_PlayEvent_playback_instance) == 0x000050, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_PlayEvent_play_success) == 0x000060, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, Temp_delegate_Variable_1) == 0x000064, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_CompareHashIsEqual_ReturnValue) == 0x000078, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_CompareHashIsEqual_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, Temp_delegate_Variable_2) == 0x00007C, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, Temp_delegate_Variable_3) == 0x000090, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, Temp_delegate_Variable_4) == 0x0000A4, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::Temp_delegate_Variable_4' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000B8, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_PlayEvent_playback_instance_1) == 0x0000C0, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_PlayEvent_play_success_1) == 0x0000D0, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_PlayEvent_play_success_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000D1, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0000D2, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BooleanOR_ReturnValue) == 0x0000D3, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x0000D4, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BooleanOR_ReturnValue_1) == 0x0000D5, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x0000D6, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x0000D7, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_FootstepSimulationEnabled_ReturnValue) == 0x0000D8, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_FootstepSimulationEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BooleanOR_ReturnValue_2) == 0x0000D9, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BooleanOR_ReturnValue_3) == 0x0000DA, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_GetCASPrZoneInfo_id) == 0x0000DC, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_GetCASPrZoneInfo_id' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_GetCASPrZoneInfo_type) == 0x0000E0, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_GetCASPrZoneInfo_type' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_GetCASPrZoneInfo_size) == 0x0000E4, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_GetCASPrZoneInfo_size' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_GetCASPrZoneInfo_volume) == 0x0000E8, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_GetCASPrZoneInfo_volume' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_GetCASPrZoneInfo_ReturnValue) == 0x0000EC, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_GetCASPrZoneInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_GetCASPrZoneInfo_id_1) == 0x0000F0, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_GetCASPrZoneInfo_id_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_GetCASPrZoneInfo_type_1) == 0x0000F4, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_GetCASPrZoneInfo_type_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_GetCASPrZoneInfo_size_1) == 0x0000F8, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_GetCASPrZoneInfo_size_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_GetCASPrZoneInfo_volume_1) == 0x0000FC, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_GetCASPrZoneInfo_volume_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_GetCASPrZoneInfo_ReturnValue_1) == 0x000100, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_GetCASPrZoneInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_CompareHashIsEqual_ReturnValue_1) == 0x000101, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_CompareHashIsEqual_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, K2Node_MakeArray_Array) == 0x000108, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000118, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_PlayEvent_playback_instance_2) == 0x000128, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_PlayEvent_playback_instance_2' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_PlayEvent_play_success_2) == 0x000138, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_PlayEvent_play_success_2' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00013C, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_LineTraceSingle_OutHit) == 0x000148, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_LineTraceSingle_ReturnValue) == 0x0001D8, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, K2Node_MakeArray_Array_1) == 0x0001E0, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_bBlockingHit) == 0x0001F0, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001F1, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_Time) == 0x0001F4, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_Distance) == 0x0001F8, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_Location) == 0x0001FC, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_ImpactPoint) == 0x000208, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_Normal) == 0x000214, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_ImpactNormal) == 0x000220, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_PhysMat) == 0x000230, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_HitActor) == 0x000238, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_HitComponent) == 0x000240, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_HitBoneName) == 0x000248, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_HitItem) == 0x000254, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_ElementIndex) == 0x000258, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_FaceIndex) == 0x00025C, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_TraceStart) == 0x000260, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_TraceEnd) == 0x00026C, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_IsValid_ReturnValue) == 0x000278, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_GetSurfaceType_ReturnValue) == 0x000279, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_GetSurfaceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00027C, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000288, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_PlayEvent_playback_instance_3) == 0x000298, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_PlayEvent_playback_instance_3' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_PlayEvent_play_success_3) == 0x0002A8, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_PlayEvent_play_success_3' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_LineTraceSingle_OutHit_1) == 0x0002AC, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_LineTraceSingle_OutHit_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_LineTraceSingle_ReturnValue_1) == 0x00033C, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_LineTraceSingle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_bBlockingHit_1) == 0x00033D, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x00033E, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_Time_1) == 0x000340, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_Distance_1) == 0x000344, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_Location_1) == 0x000348, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000354, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_Normal_1) == 0x000360, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_ImpactNormal_1) == 0x00036C, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_PhysMat_1) == 0x000378, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_HitActor_1) == 0x000380, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_HitComponent_1) == 0x000388, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_HitBoneName_1) == 0x000390, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_HitItem_1) == 0x00039C, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_ElementIndex_1) == 0x0003A0, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_FaceIndex_1) == 0x0003A4, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_TraceStart_1) == 0x0003A8, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_BreakHitResult_TraceEnd_1) == 0x0003B4, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_IsValid_ReturnValue_1) == 0x0003C0, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_GetSurfaceType_ReturnValue_1) == 0x0003C1, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_GetSurfaceType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_IsBeingViewed_ReturnValue) == 0x0003C2, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_IsBeingViewed_ReturnValue' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_PlayEvent_playback_instance_4) == 0x0003C8, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_PlayEvent_playback_instance_4' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_PlayEvent_play_success_4) == 0x0003D8, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_PlayEvent_play_success_4' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, Temp_delegate_Variable_5) == 0x0003DC, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::Temp_delegate_Variable_5' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, Temp_delegate_Variable_6) == 0x0003F0, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::Temp_delegate_Variable_6' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_PlayEvent_playback_instance_5) == 0x000408, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_PlayEvent_playback_instance_5' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_PlayEvent_play_success_5) == 0x000418, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_PlayEvent_play_success_5' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_PlayEvent_playback_instance_6) == 0x000420, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_PlayEvent_playback_instance_6' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_PlaySpecialistFoostepAudio, CallFunc_PlayEvent_play_success_6) == 0x000430, "Member 'CAAudioUtilities_C_PlaySpecialistFoostepAudio::CallFunc_PlayEvent_play_success_6' has a wrong offset!");

// Function CAAudioUtilities.CAAudioUtilities_C.ConvertSurfaceToAudio
// 0x0020 (0x0020 - 0x0000)
struct CAAudioUtilities_C_ConvertSurfaceToAudio final
{
public:
	EPhysicalSurface                              Surface;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioSwitchValueType                Switch;                                            // 0x0010(0x0004)(Parm, OutParm, NoDestructor)
	struct FCAAudioBankNameType                   FootstepBank;                                      // 0x0014(0x0004)(Parm, OutParm, NoDestructor)
	struct FCAAudioSwitchValueType                CallFunc_GetMaterialAudio_switch_value;            // 0x0018(0x0004)(NoDestructor)
	struct FCAAudioBankNameType                   CallFunc_GetMaterialAudio_footstep_bank_name;      // 0x001C(0x0004)(NoDestructor)
};
static_assert(alignof(CAAudioUtilities_C_ConvertSurfaceToAudio) == 0x000008, "Wrong alignment on CAAudioUtilities_C_ConvertSurfaceToAudio");
static_assert(sizeof(CAAudioUtilities_C_ConvertSurfaceToAudio) == 0x000020, "Wrong size on CAAudioUtilities_C_ConvertSurfaceToAudio");
static_assert(offsetof(CAAudioUtilities_C_ConvertSurfaceToAudio, Surface) == 0x000000, "Member 'CAAudioUtilities_C_ConvertSurfaceToAudio::Surface' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_ConvertSurfaceToAudio, __WorldContext) == 0x000008, "Member 'CAAudioUtilities_C_ConvertSurfaceToAudio::__WorldContext' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_ConvertSurfaceToAudio, Switch) == 0x000010, "Member 'CAAudioUtilities_C_ConvertSurfaceToAudio::Switch' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_ConvertSurfaceToAudio, FootstepBank) == 0x000014, "Member 'CAAudioUtilities_C_ConvertSurfaceToAudio::FootstepBank' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_ConvertSurfaceToAudio, CallFunc_GetMaterialAudio_switch_value) == 0x000018, "Member 'CAAudioUtilities_C_ConvertSurfaceToAudio::CallFunc_GetMaterialAudio_switch_value' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_ConvertSurfaceToAudio, CallFunc_GetMaterialAudio_footstep_bank_name) == 0x00001C, "Member 'CAAudioUtilities_C_ConvertSurfaceToAudio::CallFunc_GetMaterialAudio_footstep_bank_name' has a wrong offset!");

// Function CAAudioUtilities.CAAudioUtilities_C.Play Jump Landing Audio
// 0x0160 (0x0160 - 0x0000)
struct CAAudioUtilities_C_Play_Jump_Landing_Audio final
{
public:
	class ACACharacter_MainPlayer*                Character_Main_Player;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAPlayerMovementMetaMode                     Current_Movement_Meta_Mode;                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAPlayerMovementMode                         Prev_Player_Movement_Mode;                         // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PreLandSpeed;                                      // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Jump_Landing_Footstep_Event_Max_Distance;          // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PreLand_Speed;                                     // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              FP_PhysSurfaceType;                                // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioEventType                      FP_Jump_Landing_SFX_Event;                         // 0x0024(0x0004)(Edit, BlueprintVisible, NoDestructor)
	EPhysicalSurface                              TP_PhysSurfaceType;                                // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioEventType                      TP_Initial_Jump_Landing_SFX_Event;                 // 0x002C(0x0004)(Edit, BlueprintVisible, NoDestructor)
	struct FCAAudioEventType                      TP_Jump_Landing_SFX_Event;                         // 0x0030(0x0004)(Edit, BlueprintVisible, NoDestructor)
	struct FHitResult                             FP_Line_By_Trace_Hit_Result;                       // 0x0034(0x0090)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	ECAPlayerMovementMetaMode                     Movement_Meta_Mode;                                // 0x00C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             TP_Line_By_Trace_Hit_Result;                       // 0x00C8(0x0090)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CAAudioUtilities_C_Play_Jump_Landing_Audio) == 0x000008, "Wrong alignment on CAAudioUtilities_C_Play_Jump_Landing_Audio");
static_assert(sizeof(CAAudioUtilities_C_Play_Jump_Landing_Audio) == 0x000160, "Wrong size on CAAudioUtilities_C_Play_Jump_Landing_Audio");
static_assert(offsetof(CAAudioUtilities_C_Play_Jump_Landing_Audio, Character_Main_Player) == 0x000000, "Member 'CAAudioUtilities_C_Play_Jump_Landing_Audio::Character_Main_Player' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_Play_Jump_Landing_Audio, Current_Movement_Meta_Mode) == 0x000008, "Member 'CAAudioUtilities_C_Play_Jump_Landing_Audio::Current_Movement_Meta_Mode' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_Play_Jump_Landing_Audio, Prev_Player_Movement_Mode) == 0x000009, "Member 'CAAudioUtilities_C_Play_Jump_Landing_Audio::Prev_Player_Movement_Mode' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_Play_Jump_Landing_Audio, PreLandSpeed) == 0x00000C, "Member 'CAAudioUtilities_C_Play_Jump_Landing_Audio::PreLandSpeed' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_Play_Jump_Landing_Audio, __WorldContext) == 0x000010, "Member 'CAAudioUtilities_C_Play_Jump_Landing_Audio::__WorldContext' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_Play_Jump_Landing_Audio, Jump_Landing_Footstep_Event_Max_Distance) == 0x000018, "Member 'CAAudioUtilities_C_Play_Jump_Landing_Audio::Jump_Landing_Footstep_Event_Max_Distance' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_Play_Jump_Landing_Audio, PreLand_Speed) == 0x00001C, "Member 'CAAudioUtilities_C_Play_Jump_Landing_Audio::PreLand_Speed' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_Play_Jump_Landing_Audio, FP_PhysSurfaceType) == 0x000020, "Member 'CAAudioUtilities_C_Play_Jump_Landing_Audio::FP_PhysSurfaceType' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_Play_Jump_Landing_Audio, FP_Jump_Landing_SFX_Event) == 0x000024, "Member 'CAAudioUtilities_C_Play_Jump_Landing_Audio::FP_Jump_Landing_SFX_Event' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_Play_Jump_Landing_Audio, TP_PhysSurfaceType) == 0x000028, "Member 'CAAudioUtilities_C_Play_Jump_Landing_Audio::TP_PhysSurfaceType' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_Play_Jump_Landing_Audio, TP_Initial_Jump_Landing_SFX_Event) == 0x00002C, "Member 'CAAudioUtilities_C_Play_Jump_Landing_Audio::TP_Initial_Jump_Landing_SFX_Event' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_Play_Jump_Landing_Audio, TP_Jump_Landing_SFX_Event) == 0x000030, "Member 'CAAudioUtilities_C_Play_Jump_Landing_Audio::TP_Jump_Landing_SFX_Event' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_Play_Jump_Landing_Audio, FP_Line_By_Trace_Hit_Result) == 0x000034, "Member 'CAAudioUtilities_C_Play_Jump_Landing_Audio::FP_Line_By_Trace_Hit_Result' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_Play_Jump_Landing_Audio, Movement_Meta_Mode) == 0x0000C4, "Member 'CAAudioUtilities_C_Play_Jump_Landing_Audio::Movement_Meta_Mode' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_Play_Jump_Landing_Audio, TP_Line_By_Trace_Hit_Result) == 0x0000C8, "Member 'CAAudioUtilities_C_Play_Jump_Landing_Audio::TP_Line_By_Trace_Hit_Result' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_Play_Jump_Landing_Audio, CallFunc_IsValid_ReturnValue) == 0x000158, "Member 'CAAudioUtilities_C_Play_Jump_Landing_Audio::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CAAudioUtilities.CAAudioUtilities_C.OnMovementModeChangeSetSwitchAudio
// 0x0020 (0x0020 - 0x0000)
struct CAAudioUtilities_C_OnMovementModeChangeSetSwitchAudio final
{
public:
	class ACACharacter_MainPlayer*                Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAPlayerMovementMode                         PreviousMovementMode;                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECAPlayerMovementMode                         CurrentMovementMode;                               // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CAAudioUtilities_C_OnMovementModeChangeSetSwitchAudio) == 0x000008, "Wrong alignment on CAAudioUtilities_C_OnMovementModeChangeSetSwitchAudio");
static_assert(sizeof(CAAudioUtilities_C_OnMovementModeChangeSetSwitchAudio) == 0x000020, "Wrong size on CAAudioUtilities_C_OnMovementModeChangeSetSwitchAudio");
static_assert(offsetof(CAAudioUtilities_C_OnMovementModeChangeSetSwitchAudio, Character) == 0x000000, "Member 'CAAudioUtilities_C_OnMovementModeChangeSetSwitchAudio::Character' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_OnMovementModeChangeSetSwitchAudio, PreviousMovementMode) == 0x000008, "Member 'CAAudioUtilities_C_OnMovementModeChangeSetSwitchAudio::PreviousMovementMode' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_OnMovementModeChangeSetSwitchAudio, CurrentMovementMode) == 0x000009, "Member 'CAAudioUtilities_C_OnMovementModeChangeSetSwitchAudio::CurrentMovementMode' has a wrong offset!");
static_assert(offsetof(CAAudioUtilities_C_OnMovementModeChangeSetSwitchAudio, __WorldContext) == 0x000010, "Member 'CAAudioUtilities_C_OnMovementModeChangeSetSwitchAudio::__WorldContext' has a wrong offset!");
