#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CABinaryAssetManager

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class CABinaryAssetManager.CABinaryAssetManagerInterface
// 0x0000 (0x0030 - 0x0030)
class ICABinaryAssetManagerInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CABinaryAssetManagerInterface">();
	}
	static class ICABinaryAssetManagerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICABinaryAssetManagerInterface>();
	}
};
static_assert(alignof(ICABinaryAssetManagerInterface) == 0x000008, "Wrong alignment on ICABinaryAssetManagerInterface");
static_assert(sizeof(ICABinaryAssetManagerInterface) == 0x000030, "Wrong size on ICABinaryAssetManagerInterface");

// Class CABinaryAssetManager.CADefaultDataAsset
// 0x0018 (0x0050 - 0x0038)
class UCADefaultDataAsset final : public UDataAsset
{
public:
	uint32                                        Version;                                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        Checksum;                                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint32>                                Data;                                              // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CADefaultDataAsset">();
	}
	static class UCADefaultDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCADefaultDataAsset>();
	}
};
static_assert(alignof(UCADefaultDataAsset) == 0x000008, "Wrong alignment on UCADefaultDataAsset");
static_assert(sizeof(UCADefaultDataAsset) == 0x000050, "Wrong size on UCADefaultDataAsset");
static_assert(offsetof(UCADefaultDataAsset, Version) == 0x000038, "Member 'UCADefaultDataAsset::Version' has a wrong offset!");
static_assert(offsetof(UCADefaultDataAsset, Checksum) == 0x00003C, "Member 'UCADefaultDataAsset::Checksum' has a wrong offset!");
static_assert(offsetof(UCADefaultDataAsset, Data) == 0x000040, "Member 'UCADefaultDataAsset::Data' has a wrong offset!");

}

