#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CACulling

#include "Basic.hpp"


namespace SDK::Params
{

// Function CACulling.CACullingPortal.SetEnable
// 0x0001 (0x0001 - 0x0000)
struct CACullingPortal_SetEnable final
{
public:
	bool                                          New_enable;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CACullingPortal_SetEnable) == 0x000001, "Wrong alignment on CACullingPortal_SetEnable");
static_assert(sizeof(CACullingPortal_SetEnable) == 0x000001, "Wrong size on CACullingPortal_SetEnable");
static_assert(offsetof(CACullingPortal_SetEnable, New_enable) == 0x000000, "Member 'CACullingPortal_SetEnable::New_enable' has a wrong offset!");

// Function CACulling.CACullingZone.SetEnable
// 0x0001 (0x0001 - 0x0000)
struct CACullingZone_SetEnable final
{
public:
	bool                                          New_enable;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CACullingZone_SetEnable) == 0x000001, "Wrong alignment on CACullingZone_SetEnable");
static_assert(sizeof(CACullingZone_SetEnable) == 0x000001, "Wrong size on CACullingZone_SetEnable");
static_assert(offsetof(CACullingZone_SetEnable, New_enable) == 0x000000, "Member 'CACullingZone_SetEnable::New_enable' has a wrong offset!");

}

