#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CALootEventStruct

#include "Basic.hpp"

#include "E_EventActivation_structs.hpp"


namespace SDK
{

// UserDefinedStruct CALootEventStruct.CALootEventStruct
// 0x000C (0x000C - 0x0000)
struct FCALootEventStruct final
{
public:
	bool                                          IsEnabled_1_E9C423FC480F67AB0B17058E08F9EBA3;      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_EventActivation                             ActivationTrigger_7_82D5EB5C40707B8843FF8F83AFF1C741; // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TriggerDelay_10_BFF3E97C4DD763CEA681BD80DFDE6296;  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnlyTriggersWithoutThreshold_13_978665C3433DC8A9539D5A90418E2DCF; // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FCALootEventStruct) == 0x000004, "Wrong alignment on FCALootEventStruct");
static_assert(sizeof(FCALootEventStruct) == 0x00000C, "Wrong size on FCALootEventStruct");
static_assert(offsetof(FCALootEventStruct, IsEnabled_1_E9C423FC480F67AB0B17058E08F9EBA3) == 0x000000, "Member 'FCALootEventStruct::IsEnabled_1_E9C423FC480F67AB0B17058E08F9EBA3' has a wrong offset!");
static_assert(offsetof(FCALootEventStruct, ActivationTrigger_7_82D5EB5C40707B8843FF8F83AFF1C741) == 0x000001, "Member 'FCALootEventStruct::ActivationTrigger_7_82D5EB5C40707B8843FF8F83AFF1C741' has a wrong offset!");
static_assert(offsetof(FCALootEventStruct, TriggerDelay_10_BFF3E97C4DD763CEA681BD80DFDE6296) == 0x000004, "Member 'FCALootEventStruct::TriggerDelay_10_BFF3E97C4DD763CEA681BD80DFDE6296' has a wrong offset!");
static_assert(offsetof(FCALootEventStruct, OnlyTriggersWithoutThreshold_13_978665C3433DC8A9539D5A90418E2DCF) == 0x000008, "Member 'FCALootEventStruct::OnlyTriggersWithoutThreshold_13_978665C3433DC8A9539D5A90418E2DCF' has a wrong offset!");

}

