#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CAProceduralRuntime

#include "Basic.hpp"


namespace SDK::Params
{

// Function CAProceduralRuntime.CARoomConnection.GetIsFromNode
// 0x0010 (0x0010 - 0x0000)
struct CARoomConnection_GetIsFromNode final
{
public:
	const class UCARoomNode*                      Node;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CARoomConnection_GetIsFromNode) == 0x000008, "Wrong alignment on CARoomConnection_GetIsFromNode");
static_assert(sizeof(CARoomConnection_GetIsFromNode) == 0x000010, "Wrong size on CARoomConnection_GetIsFromNode");
static_assert(offsetof(CARoomConnection_GetIsFromNode, Node) == 0x000000, "Member 'CARoomConnection_GetIsFromNode::Node' has a wrong offset!");
static_assert(offsetof(CARoomConnection_GetIsFromNode, ReturnValue) == 0x000008, "Member 'CARoomConnection_GetIsFromNode::ReturnValue' has a wrong offset!");

// Function CAProceduralRuntime.CARoomNode.GetFeature
// 0x0008 (0x0008 - 0x0000)
struct CARoomNode_GetFeature final
{
public:
	class UWallBreak*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CARoomNode_GetFeature) == 0x000008, "Wrong alignment on CARoomNode_GetFeature");
static_assert(sizeof(CARoomNode_GetFeature) == 0x000008, "Wrong size on CARoomNode_GetFeature");
static_assert(offsetof(CARoomNode_GetFeature, ReturnValue) == 0x000000, "Member 'CARoomNode_GetFeature::ReturnValue' has a wrong offset!");

}

