#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CARuntimeTextureCompression

#include "Basic.hpp"


namespace SDK
{

// Enum CARuntimeTextureCompression.ECACompressionJobTarget
// NumValues: 0x0003
enum class ECACompressionJobTarget : uint8
{
	CACompressionJobTarget_CPU               = 0,
	CACompressionJobTarget_GPU               = 1,
	CACompressionJobTarget_MAX               = 2,
};

// Enum CARuntimeTextureCompression.ECACompressionType
// NumValues: 0x0005
enum class ECACompressionType : uint8
{
	CACompression_BC1                        = 0,
	CAComprssion_BC3                         = 1,
	CACompression_BC4                        = 2,
	CACompression_BC5                        = 3,
	ECACompressionType_MAX                   = 4,
};

// ScriptStruct CARuntimeTextureCompression.CARuntimeRenderTargetCompressorParams
// 0x0018 (0x0018 - 0x0000)
struct FCARuntimeRenderTargetCompressorParams final
{
public:
	ECACompressionType                            M_target_compresion_format;                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECACompressionJobTarget                       M_compression_job_target;                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 M_source;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             M_destination;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCARuntimeRenderTargetCompressorParams) == 0x000008, "Wrong alignment on FCARuntimeRenderTargetCompressorParams");
static_assert(sizeof(FCARuntimeRenderTargetCompressorParams) == 0x000018, "Wrong size on FCARuntimeRenderTargetCompressorParams");
static_assert(offsetof(FCARuntimeRenderTargetCompressorParams, M_target_compresion_format) == 0x000000, "Member 'FCARuntimeRenderTargetCompressorParams::M_target_compresion_format' has a wrong offset!");
static_assert(offsetof(FCARuntimeRenderTargetCompressorParams, M_compression_job_target) == 0x000001, "Member 'FCARuntimeRenderTargetCompressorParams::M_compression_job_target' has a wrong offset!");
static_assert(offsetof(FCARuntimeRenderTargetCompressorParams, M_source) == 0x000008, "Member 'FCARuntimeRenderTargetCompressorParams::M_source' has a wrong offset!");
static_assert(offsetof(FCARuntimeRenderTargetCompressorParams, M_destination) == 0x000010, "Member 'FCARuntimeRenderTargetCompressorParams::M_destination' has a wrong offset!");

// ScriptStruct CARuntimeTextureCompression.CARuntimeTextureCompressorParams
// 0x0018 (0x0018 - 0x0000)
struct FCARuntimeTextureCompressorParams final
{
public:
	ECACompressionType                            M_target_compresion_format;                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECACompressionJobTarget                       M_compression_job_target;                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             M_source;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             M_destination;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCARuntimeTextureCompressorParams) == 0x000008, "Wrong alignment on FCARuntimeTextureCompressorParams");
static_assert(sizeof(FCARuntimeTextureCompressorParams) == 0x000018, "Wrong size on FCARuntimeTextureCompressorParams");
static_assert(offsetof(FCARuntimeTextureCompressorParams, M_target_compresion_format) == 0x000000, "Member 'FCARuntimeTextureCompressorParams::M_target_compresion_format' has a wrong offset!");
static_assert(offsetof(FCARuntimeTextureCompressorParams, M_compression_job_target) == 0x000001, "Member 'FCARuntimeTextureCompressorParams::M_compression_job_target' has a wrong offset!");
static_assert(offsetof(FCARuntimeTextureCompressorParams, M_source) == 0x000008, "Member 'FCARuntimeTextureCompressorParams::M_source' has a wrong offset!");
static_assert(offsetof(FCARuntimeTextureCompressorParams, M_destination) == 0x000010, "Member 'FCARuntimeTextureCompressorParams::M_destination' has a wrong offset!");

}

