#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CAUIEvents

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK
{

// ScriptStruct CAUIEvents.CAUIEventMapping
// 0x0058 (0x0058 - 0x0000)
struct FCAUIEventMapping final
{
public:
	TSoftClassPtr<class UClass>                   M_event_class;                                     // 0x0000(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           M_event_type;                                      // 0x0030(0x000C)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x1C];                                      // 0x003C(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCAUIEventMapping) == 0x000008, "Wrong alignment on FCAUIEventMapping");
static_assert(sizeof(FCAUIEventMapping) == 0x000058, "Wrong size on FCAUIEventMapping");
static_assert(offsetof(FCAUIEventMapping, M_event_class) == 0x000000, "Member 'FCAUIEventMapping::M_event_class' has a wrong offset!");
static_assert(offsetof(FCAUIEventMapping, M_event_type) == 0x000030, "Member 'FCAUIEventMapping::M_event_type' has a wrong offset!");

// ScriptStruct CAUIEvents.CAUIEventPoolItem
// 0x0048 (0x0048 - 0x0000)
struct FCAUIEventPoolItem final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCABaseUIEvent*>                 M_pooled_events;                                   // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   M_event_class;                                     // 0x0018(0x0030)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FCAUIEventPoolItem) == 0x000008, "Wrong alignment on FCAUIEventPoolItem");
static_assert(sizeof(FCAUIEventPoolItem) == 0x000048, "Wrong size on FCAUIEventPoolItem");
static_assert(offsetof(FCAUIEventPoolItem, M_pooled_events) == 0x000008, "Member 'FCAUIEventPoolItem::M_pooled_events' has a wrong offset!");
static_assert(offsetof(FCAUIEventPoolItem, M_event_class) == 0x000018, "Member 'FCAUIEventPoolItem::M_event_class' has a wrong offset!");

// ScriptStruct CAUIEvents.CAUIEventContainer
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FCAUIEventContainer final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCAUIEventContainer) == 0x000008, "Wrong alignment on FCAUIEventContainer");
static_assert(sizeof(FCAUIEventContainer) == 0x000010, "Wrong size on FCAUIEventContainer");

}

