#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CAUIEvents

#include "Basic.hpp"

#include "CAUIEvents_structs.hpp"


namespace SDK::Params
{

// Function CAUIEvents.CABaseUIEvent.UnbindFromUIEvent
// 0x0060 (0x0060 - 0x0000)
struct CABaseUIEvent_UnbindFromUIEvent final
{
public:
	const class UObject*                          Context;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCAUIEventMapping                      Mapping;                                           // 0x0008(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CABaseUIEvent_UnbindFromUIEvent) == 0x000008, "Wrong alignment on CABaseUIEvent_UnbindFromUIEvent");
static_assert(sizeof(CABaseUIEvent_UnbindFromUIEvent) == 0x000060, "Wrong size on CABaseUIEvent_UnbindFromUIEvent");
static_assert(offsetof(CABaseUIEvent_UnbindFromUIEvent, Context) == 0x000000, "Member 'CABaseUIEvent_UnbindFromUIEvent::Context' has a wrong offset!");
static_assert(offsetof(CABaseUIEvent_UnbindFromUIEvent, Mapping) == 0x000008, "Member 'CABaseUIEvent_UnbindFromUIEvent::Mapping' has a wrong offset!");

// Function CAUIEvents.CAUIEventMappingRegistry.RegisterUIEventMapping
// 0x0058 (0x0058 - 0x0000)
struct CAUIEventMappingRegistry_RegisterUIEventMapping final
{
public:
	struct FCAUIEventMapping                      Mapping;                                           // 0x0000(0x0058)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CAUIEventMappingRegistry_RegisterUIEventMapping) == 0x000008, "Wrong alignment on CAUIEventMappingRegistry_RegisterUIEventMapping");
static_assert(sizeof(CAUIEventMappingRegistry_RegisterUIEventMapping) == 0x000058, "Wrong size on CAUIEventMappingRegistry_RegisterUIEventMapping");
static_assert(offsetof(CAUIEventMappingRegistry_RegisterUIEventMapping, Mapping) == 0x000000, "Member 'CAUIEventMappingRegistry_RegisterUIEventMapping::Mapping' has a wrong offset!");

}

