#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Common_ActionButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function Common_ActionButton.Common_ActionButton_C.ExecuteUbergraph_Common_ActionButton
// 0x0138 (0x0138 - 0x0000)
struct Common_ActionButton_C_ExecuteUbergraph_Common_ActionButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0040(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00B8(0x0078)(ConstParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Common_ActionButton_C_ExecuteUbergraph_Common_ActionButton) == 0x000008, "Wrong alignment on Common_ActionButton_C_ExecuteUbergraph_Common_ActionButton");
static_assert(sizeof(Common_ActionButton_C_ExecuteUbergraph_Common_ActionButton) == 0x000138, "Wrong size on Common_ActionButton_C_ExecuteUbergraph_Common_ActionButton");
static_assert(offsetof(Common_ActionButton_C_ExecuteUbergraph_Common_ActionButton, EntryPoint) == 0x000000, "Member 'Common_ActionButton_C_ExecuteUbergraph_Common_ActionButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(Common_ActionButton_C_ExecuteUbergraph_Common_ActionButton, K2Node_Event_MyGeometry) == 0x000004, "Member 'Common_ActionButton_C_ExecuteUbergraph_Common_ActionButton::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Common_ActionButton_C_ExecuteUbergraph_Common_ActionButton, K2Node_Event_MouseEvent_1) == 0x000040, "Member 'Common_ActionButton_C_ExecuteUbergraph_Common_ActionButton::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(Common_ActionButton_C_ExecuteUbergraph_Common_ActionButton, K2Node_Event_MouseEvent) == 0x0000B8, "Member 'Common_ActionButton_C_ExecuteUbergraph_Common_ActionButton::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(Common_ActionButton_C_ExecuteUbergraph_Common_ActionButton, K2Node_Event_IsDesignTime) == 0x000130, "Member 'Common_ActionButton_C_ExecuteUbergraph_Common_ActionButton::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function Common_ActionButton.Common_ActionButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Common_ActionButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Common_ActionButton_C_PreConstruct) == 0x000001, "Wrong alignment on Common_ActionButton_C_PreConstruct");
static_assert(sizeof(Common_ActionButton_C_PreConstruct) == 0x000001, "Wrong size on Common_ActionButton_C_PreConstruct");
static_assert(offsetof(Common_ActionButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Common_ActionButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function Common_ActionButton.Common_ActionButton_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct Common_ActionButton_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Common_ActionButton_C_OnMouseLeave) == 0x000008, "Wrong alignment on Common_ActionButton_C_OnMouseLeave");
static_assert(sizeof(Common_ActionButton_C_OnMouseLeave) == 0x000078, "Wrong size on Common_ActionButton_C_OnMouseLeave");
static_assert(offsetof(Common_ActionButton_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'Common_ActionButton_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function Common_ActionButton.Common_ActionButton_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct Common_ActionButton_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Common_ActionButton_C_OnMouseEnter) == 0x000008, "Wrong alignment on Common_ActionButton_C_OnMouseEnter");
static_assert(sizeof(Common_ActionButton_C_OnMouseEnter) == 0x0000B0, "Wrong size on Common_ActionButton_C_OnMouseEnter");
static_assert(offsetof(Common_ActionButton_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'Common_ActionButton_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(Common_ActionButton_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'Common_ActionButton_C_OnMouseEnter::MouseEvent' has a wrong offset!");

}

