#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Common_ActionButtonWithIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Common_ActionButtonWithIcon.Common_ActionButtonWithIcon_C
// 0x0048 (0x0738 - 0x06F0)
class UCommon_ActionButtonWithIcon_C final : public UCABaseActionButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Action_icon;                                       // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Icon_texture;                                      // 0x0700(0x0030)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	struct FVector2D                              Icon_size;                                         // 0x0730(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Common_ActionButtonWithIcon(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetUnfocusedState();
	void SetFocusedState();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Common_ActionButtonWithIcon_C">();
	}
	static class UCommon_ActionButtonWithIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommon_ActionButtonWithIcon_C>();
	}
};
static_assert(alignof(UCommon_ActionButtonWithIcon_C) == 0x000008, "Wrong alignment on UCommon_ActionButtonWithIcon_C");
static_assert(sizeof(UCommon_ActionButtonWithIcon_C) == 0x000738, "Wrong size on UCommon_ActionButtonWithIcon_C");
static_assert(offsetof(UCommon_ActionButtonWithIcon_C, UberGraphFrame) == 0x0006F0, "Member 'UCommon_ActionButtonWithIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCommon_ActionButtonWithIcon_C, Action_icon) == 0x0006F8, "Member 'UCommon_ActionButtonWithIcon_C::Action_icon' has a wrong offset!");
static_assert(offsetof(UCommon_ActionButtonWithIcon_C, Icon_texture) == 0x000700, "Member 'UCommon_ActionButtonWithIcon_C::Icon_texture' has a wrong offset!");
static_assert(offsetof(UCommon_ActionButtonWithIcon_C, Icon_size) == 0x000730, "Member 'UCommon_ActionButtonWithIcon_C::Icon_size' has a wrong offset!");

}

