#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControlMapPanel

#include "Basic.hpp"


namespace SDK::Params
{

// Function ControlMapPanel.ControlMapPanel_C.ExecuteUbergraph_ControlMapPanel
// 0x0004 (0x0004 - 0x0000)
struct ControlMapPanel_C_ExecuteUbergraph_ControlMapPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ControlMapPanel_C_ExecuteUbergraph_ControlMapPanel) == 0x000004, "Wrong alignment on ControlMapPanel_C_ExecuteUbergraph_ControlMapPanel");
static_assert(sizeof(ControlMapPanel_C_ExecuteUbergraph_ControlMapPanel) == 0x000004, "Wrong size on ControlMapPanel_C_ExecuteUbergraph_ControlMapPanel");
static_assert(offsetof(ControlMapPanel_C_ExecuteUbergraph_ControlMapPanel, EntryPoint) == 0x000000, "Member 'ControlMapPanel_C_ExecuteUbergraph_ControlMapPanel::EntryPoint' has a wrong offset!");

// Function ControlMapPanel.ControlMapPanel_C.InitialiseBasedOnControlMode
// 0x0004 (0x0004 - 0x0000)
struct ControlMapPanel_C_InitialiseBasedOnControlMode final
{
public:
	int32                                         CallFunc_GetControlWidgetIndex_ReturnValue;        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ControlMapPanel_C_InitialiseBasedOnControlMode) == 0x000004, "Wrong alignment on ControlMapPanel_C_InitialiseBasedOnControlMode");
static_assert(sizeof(ControlMapPanel_C_InitialiseBasedOnControlMode) == 0x000004, "Wrong size on ControlMapPanel_C_InitialiseBasedOnControlMode");
static_assert(offsetof(ControlMapPanel_C_InitialiseBasedOnControlMode, CallFunc_GetControlWidgetIndex_ReturnValue) == 0x000000, "Member 'ControlMapPanel_C_InitialiseBasedOnControlMode::CallFunc_GetControlWidgetIndex_ReturnValue' has a wrong offset!");

}

