#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicOptionsPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DynamicOptionsPanel.DynamicOptionsPanel_C
// 0x0038 (0x0390 - 0x0358)
class UDynamicOptionsPanel_C final : public UCABaseUIOptionPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFE_screenTitle_C*                      FE_screenTitle;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_591;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             SendMessage_0;                                     // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWidgetSwitcher*                        Info_display_stack;                                // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SendMessage_0__DelegateSignature(class FName Msg);
	void ExecuteUbergraph_DynamicOptionsPanel(int32 EntryPoint);
	void Construct();
	void SetTitles(const struct FCAText& Parent_Title, const struct FCAText& Screen_Title);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DynamicOptionsPanel_C">();
	}
	static class UDynamicOptionsPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicOptionsPanel_C>();
	}
};
static_assert(alignof(UDynamicOptionsPanel_C) == 0x000008, "Wrong alignment on UDynamicOptionsPanel_C");
static_assert(sizeof(UDynamicOptionsPanel_C) == 0x000390, "Wrong size on UDynamicOptionsPanel_C");
static_assert(offsetof(UDynamicOptionsPanel_C, UberGraphFrame) == 0x000358, "Member 'UDynamicOptionsPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDynamicOptionsPanel_C, FE_screenTitle) == 0x000360, "Member 'UDynamicOptionsPanel_C::FE_screenTitle' has a wrong offset!");
static_assert(offsetof(UDynamicOptionsPanel_C, Image_591) == 0x000368, "Member 'UDynamicOptionsPanel_C::Image_591' has a wrong offset!");
static_assert(offsetof(UDynamicOptionsPanel_C, InvalidationBox_0) == 0x000370, "Member 'UDynamicOptionsPanel_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UDynamicOptionsPanel_C, SendMessage_0) == 0x000378, "Member 'UDynamicOptionsPanel_C::SendMessage_0' has a wrong offset!");
static_assert(offsetof(UDynamicOptionsPanel_C, Info_display_stack) == 0x000388, "Member 'UDynamicOptionsPanel_C::Info_display_stack' has a wrong offset!");

}

