#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_EditorActorSnapToData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_EditorActorSnapToData.F_EditorActorSnapToData
// 0x0058 (0x0058 - 0x0000)
struct FF_EditorActorSnapToData final
{
public:
	TSoftObjectPtr<class UStaticMesh>             SnapToActor_11_495C9B0D46247DA81E378DBAFCA5CF5E;   // 0x0000(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FTransform>                     RelativeOffsets_7_E0576A5741002B0EB454CF95523C6D27; // 0x0030(0x0010)(Edit, BlueprintVisible)
	struct FVector                                RenderOffset_15_C5FA064D4ACBB986431A78A30B53BB0E;  // 0x0040(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RenderSize_17_721701294128C36F04B24CAD616383A5;    // 0x004C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_EditorActorSnapToData) == 0x000008, "Wrong alignment on FF_EditorActorSnapToData");
static_assert(sizeof(FF_EditorActorSnapToData) == 0x000058, "Wrong size on FF_EditorActorSnapToData");
static_assert(offsetof(FF_EditorActorSnapToData, SnapToActor_11_495C9B0D46247DA81E378DBAFCA5CF5E) == 0x000000, "Member 'FF_EditorActorSnapToData::SnapToActor_11_495C9B0D46247DA81E378DBAFCA5CF5E' has a wrong offset!");
static_assert(offsetof(FF_EditorActorSnapToData, RelativeOffsets_7_E0576A5741002B0EB454CF95523C6D27) == 0x000030, "Member 'FF_EditorActorSnapToData::RelativeOffsets_7_E0576A5741002B0EB454CF95523C6D27' has a wrong offset!");
static_assert(offsetof(FF_EditorActorSnapToData, RenderOffset_15_C5FA064D4ACBB986431A78A30B53BB0E) == 0x000040, "Member 'FF_EditorActorSnapToData::RenderOffset_15_C5FA064D4ACBB986431A78A30B53BB0E' has a wrong offset!");
static_assert(offsetof(FF_EditorActorSnapToData, RenderSize_17_721701294128C36F04B24CAD616383A5) == 0x00004C, "Member 'FF_EditorActorSnapToData::RenderSize_17_721701294128C36F04B24CAD616383A5' has a wrong offset!");

}

