#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FE_Root

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "OnlineSubsystemUtils_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass FE_Root.FE_Root_C
// 0x0028 (0x0288 - 0x0260)
class AFE_Root_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FBlueprintSessionResult>        SessionsFound;                                     // 0x0268(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMediaPlayer*                           TVMonitors;                                        // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMediaPlayer*                           WeaponMonitor;                                     // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void LoadBenchmarkFlyThrough();
	void ExecuteUbergraph_FE_Root(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FE_Root_C">();
	}
	static class AFE_Root_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFE_Root_C>();
	}
};
static_assert(alignof(AFE_Root_C) == 0x000008, "Wrong alignment on AFE_Root_C");
static_assert(sizeof(AFE_Root_C) == 0x000288, "Wrong size on AFE_Root_C");
static_assert(offsetof(AFE_Root_C, UberGraphFrame) == 0x000260, "Member 'AFE_Root_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFE_Root_C, SessionsFound) == 0x000268, "Member 'AFE_Root_C::SessionsFound' has a wrong offset!");
static_assert(offsetof(AFE_Root_C, TVMonitors) == 0x000278, "Member 'AFE_Root_C::TVMonitors' has a wrong offset!");
static_assert(offsetof(AFE_Root_C, WeaponMonitor) == 0x000280, "Member 'AFE_Root_C::WeaponMonitor' has a wrong offset!");

}

