#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FE_Root

#include "Basic.hpp"


namespace SDK::Params
{

// Function FE_Root.FE_Root_C.ExecuteUbergraph_FE_Root
// 0x0040 (0x0040 - 0x0000)
struct FE_Root_C_ExecuteUbergraph_FE_Root final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAFrontEndHUD*                         CallFunc_GetFrontEndHUD_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MatchmakingProxy_C*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCommandLine_ReturnValue;               // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FE_Root_C_ExecuteUbergraph_FE_Root) == 0x000008, "Wrong alignment on FE_Root_C_ExecuteUbergraph_FE_Root");
static_assert(sizeof(FE_Root_C_ExecuteUbergraph_FE_Root) == 0x000040, "Wrong size on FE_Root_C_ExecuteUbergraph_FE_Root");
static_assert(offsetof(FE_Root_C_ExecuteUbergraph_FE_Root, EntryPoint) == 0x000000, "Member 'FE_Root_C_ExecuteUbergraph_FE_Root::EntryPoint' has a wrong offset!");
static_assert(offsetof(FE_Root_C_ExecuteUbergraph_FE_Root, CallFunc_GetFrontEndHUD_ReturnValue) == 0x000008, "Member 'FE_Root_C_ExecuteUbergraph_FE_Root::CallFunc_GetFrontEndHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(FE_Root_C_ExecuteUbergraph_FE_Root, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'FE_Root_C_ExecuteUbergraph_FE_Root::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FE_Root_C_ExecuteUbergraph_FE_Root, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'FE_Root_C_ExecuteUbergraph_FE_Root::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(FE_Root_C_ExecuteUbergraph_FE_Root, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'FE_Root_C_ExecuteUbergraph_FE_Root::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FE_Root_C_ExecuteUbergraph_FE_Root, CallFunc_GetCommandLine_ReturnValue) == 0x000028, "Member 'FE_Root_C_ExecuteUbergraph_FE_Root::CallFunc_GetCommandLine_ReturnValue' has a wrong offset!");
static_assert(offsetof(FE_Root_C_ExecuteUbergraph_FE_Root, CallFunc_Contains_ReturnValue) == 0x000038, "Member 'FE_Root_C_ExecuteUbergraph_FE_Root::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(FE_Root_C_ExecuteUbergraph_FE_Root, CallFunc_Contains_ReturnValue_1) == 0x000039, "Member 'FE_Root_C_ExecuteUbergraph_FE_Root::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FE_Root_C_ExecuteUbergraph_FE_Root, CallFunc_BooleanOR_ReturnValue) == 0x00003A, "Member 'FE_Root_C_ExecuteUbergraph_FE_Root::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

