#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FL_PlayerCharacter

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function FL_PlayerCharacter.FL_PlayerCharacter_C.SetPlayersLegsVisiblity
// 0x0040 (0x0040 - 0x0000)
struct FL_PlayerCharacter_C_SetPlayersLegsVisiblity final
{
public:
	class UMeshComponent*                         Original_mesh;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          New_visibilty;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFirstPerson_ReturnValue;                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSpecificPawnMesh_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FL_PlayerCharacter_C_SetPlayersLegsVisiblity) == 0x000008, "Wrong alignment on FL_PlayerCharacter_C_SetPlayersLegsVisiblity");
static_assert(sizeof(FL_PlayerCharacter_C_SetPlayersLegsVisiblity) == 0x000040, "Wrong size on FL_PlayerCharacter_C_SetPlayersLegsVisiblity");
static_assert(offsetof(FL_PlayerCharacter_C_SetPlayersLegsVisiblity, Original_mesh) == 0x000000, "Member 'FL_PlayerCharacter_C_SetPlayersLegsVisiblity::Original_mesh' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_SetPlayersLegsVisiblity, New_visibilty) == 0x000008, "Member 'FL_PlayerCharacter_C_SetPlayersLegsVisiblity::New_visibilty' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_SetPlayersLegsVisiblity, __WorldContext) == 0x000010, "Member 'FL_PlayerCharacter_C_SetPlayersLegsVisiblity::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_SetPlayersLegsVisiblity, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'FL_PlayerCharacter_C_SetPlayersLegsVisiblity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_SetPlayersLegsVisiblity, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x000020, "Member 'FL_PlayerCharacter_C_SetPlayersLegsVisiblity::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_SetPlayersLegsVisiblity, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'FL_PlayerCharacter_C_SetPlayersLegsVisiblity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_SetPlayersLegsVisiblity, CallFunc_IsFirstPerson_ReturnValue) == 0x000029, "Member 'FL_PlayerCharacter_C_SetPlayersLegsVisiblity::CallFunc_IsFirstPerson_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_SetPlayersLegsVisiblity, CallFunc_GetSpecificPawnMesh_ReturnValue) == 0x000030, "Member 'FL_PlayerCharacter_C_SetPlayersLegsVisiblity::CallFunc_GetSpecificPawnMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_SetPlayersLegsVisiblity, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'FL_PlayerCharacter_C_SetPlayersLegsVisiblity::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function FL_PlayerCharacter.FL_PlayerCharacter_C.ShowMeleeWeapon
// 0x0038 (0x0038 - 0x0000)
struct FL_PlayerCharacter_C_ShowMeleeWeapon final
{
public:
	class UMeshComponent*                         OriginalMesh;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter*                           K2Node_DynamicCast_AsCACharacter;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAEquipmentBase*                       CallFunc_GetCurrentlyHeldMeleeDeviceMarkDirty_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FL_PlayerCharacter_C_ShowMeleeWeapon) == 0x000008, "Wrong alignment on FL_PlayerCharacter_C_ShowMeleeWeapon");
static_assert(sizeof(FL_PlayerCharacter_C_ShowMeleeWeapon) == 0x000038, "Wrong size on FL_PlayerCharacter_C_ShowMeleeWeapon");
static_assert(offsetof(FL_PlayerCharacter_C_ShowMeleeWeapon, OriginalMesh) == 0x000000, "Member 'FL_PlayerCharacter_C_ShowMeleeWeapon::OriginalMesh' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_ShowMeleeWeapon, __WorldContext) == 0x000008, "Member 'FL_PlayerCharacter_C_ShowMeleeWeapon::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_ShowMeleeWeapon, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'FL_PlayerCharacter_C_ShowMeleeWeapon::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_ShowMeleeWeapon, K2Node_DynamicCast_AsCACharacter) == 0x000018, "Member 'FL_PlayerCharacter_C_ShowMeleeWeapon::K2Node_DynamicCast_AsCACharacter' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_ShowMeleeWeapon, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'FL_PlayerCharacter_C_ShowMeleeWeapon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_ShowMeleeWeapon, CallFunc_GetCurrentlyHeldMeleeDeviceMarkDirty_ReturnValue) == 0x000028, "Member 'FL_PlayerCharacter_C_ShowMeleeWeapon::CallFunc_GetCurrentlyHeldMeleeDeviceMarkDirty_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_ShowMeleeWeapon, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'FL_PlayerCharacter_C_ShowMeleeWeapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function FL_PlayerCharacter.FL_PlayerCharacter_C.ResetMeleeVisibility
// 0x0038 (0x0038 - 0x0000)
struct FL_PlayerCharacter_C_ResetMeleeVisibility final
{
public:
	class UMeshComponent*                         OriginalMesh;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter*                           K2Node_DynamicCast_AsCACharacter;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAEquipmentBase*                       CallFunc_GetCurrentlyHeldMeleeDeviceMarkDirty_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FL_PlayerCharacter_C_ResetMeleeVisibility) == 0x000008, "Wrong alignment on FL_PlayerCharacter_C_ResetMeleeVisibility");
static_assert(sizeof(FL_PlayerCharacter_C_ResetMeleeVisibility) == 0x000038, "Wrong size on FL_PlayerCharacter_C_ResetMeleeVisibility");
static_assert(offsetof(FL_PlayerCharacter_C_ResetMeleeVisibility, OriginalMesh) == 0x000000, "Member 'FL_PlayerCharacter_C_ResetMeleeVisibility::OriginalMesh' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_ResetMeleeVisibility, __WorldContext) == 0x000008, "Member 'FL_PlayerCharacter_C_ResetMeleeVisibility::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_ResetMeleeVisibility, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'FL_PlayerCharacter_C_ResetMeleeVisibility::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_ResetMeleeVisibility, K2Node_DynamicCast_AsCACharacter) == 0x000018, "Member 'FL_PlayerCharacter_C_ResetMeleeVisibility::K2Node_DynamicCast_AsCACharacter' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_ResetMeleeVisibility, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'FL_PlayerCharacter_C_ResetMeleeVisibility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_ResetMeleeVisibility, CallFunc_GetCurrentlyHeldMeleeDeviceMarkDirty_ReturnValue) == 0x000028, "Member 'FL_PlayerCharacter_C_ResetMeleeVisibility::CallFunc_GetCurrentlyHeldMeleeDeviceMarkDirty_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_ResetMeleeVisibility, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'FL_PlayerCharacter_C_ResetMeleeVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function FL_PlayerCharacter.FL_PlayerCharacter_C.SetHeldDeviceVisiblity
// 0x0060 (0x0060 - 0x0000)
struct FL_PlayerCharacter_C_SetHeldDeviceVisiblity final
{
public:
	class UMeshComponent*                         OriginalMesh;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Visible;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Reason;                                            // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ACACharacter*                           K2Node_DynamicCast_AsCACharacter;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FL_PlayerCharacter_C_SetHeldDeviceVisiblity) == 0x000008, "Wrong alignment on FL_PlayerCharacter_C_SetHeldDeviceVisiblity");
static_assert(sizeof(FL_PlayerCharacter_C_SetHeldDeviceVisiblity) == 0x000060, "Wrong size on FL_PlayerCharacter_C_SetHeldDeviceVisiblity");
static_assert(offsetof(FL_PlayerCharacter_C_SetHeldDeviceVisiblity, OriginalMesh) == 0x000000, "Member 'FL_PlayerCharacter_C_SetHeldDeviceVisiblity::OriginalMesh' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_SetHeldDeviceVisiblity, Visible) == 0x000008, "Member 'FL_PlayerCharacter_C_SetHeldDeviceVisiblity::Visible' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_SetHeldDeviceVisiblity, Reason) == 0x00000C, "Member 'FL_PlayerCharacter_C_SetHeldDeviceVisiblity::Reason' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_SetHeldDeviceVisiblity, Animation) == 0x000018, "Member 'FL_PlayerCharacter_C_SetHeldDeviceVisiblity::Animation' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_SetHeldDeviceVisiblity, __WorldContext) == 0x000020, "Member 'FL_PlayerCharacter_C_SetHeldDeviceVisiblity::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_SetHeldDeviceVisiblity, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'FL_PlayerCharacter_C_SetHeldDeviceVisiblity::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_SetHeldDeviceVisiblity, CallFunc_GetObjectName_ReturnValue) == 0x000030, "Member 'FL_PlayerCharacter_C_SetHeldDeviceVisiblity::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_SetHeldDeviceVisiblity, K2Node_DynamicCast_AsCACharacter) == 0x000040, "Member 'FL_PlayerCharacter_C_SetHeldDeviceVisiblity::K2Node_DynamicCast_AsCACharacter' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_SetHeldDeviceVisiblity, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'FL_PlayerCharacter_C_SetHeldDeviceVisiblity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_SetHeldDeviceVisiblity, CallFunc_Conv_StringToName_ReturnValue) == 0x00004C, "Member 'FL_PlayerCharacter_C_SetHeldDeviceVisiblity::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_SetHeldDeviceVisiblity, CallFunc_Not_PreBool_ReturnValue) == 0x000058, "Member 'FL_PlayerCharacter_C_SetHeldDeviceVisiblity::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_SetHeldDeviceVisiblity, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'FL_PlayerCharacter_C_SetHeldDeviceVisiblity::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function FL_PlayerCharacter.FL_PlayerCharacter_C.WhatAreWeLookingAt
// 0x0190 (0x0190 - 0x0000)
struct FL_PlayerCharacter_C_WhatAreWeLookingAt final
{
public:
	class APawn*                                  Viewer;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxDistanceAhead;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RadiusOfSweep;                                     // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HitActor;                                          // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorEyesViewPoint_OutLocation;        // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetActorEyesViewPoint_OutRotation;        // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ConstParm, ReferenceParm)
	struct FRotator                               CallFunc_GetBaseAimRotation_ReturnValue;           // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x0078(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10B[0x1];                                      // 0x010B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_PlayerCharacter_C_WhatAreWeLookingAt) == 0x000008, "Wrong alignment on FL_PlayerCharacter_C_WhatAreWeLookingAt");
static_assert(sizeof(FL_PlayerCharacter_C_WhatAreWeLookingAt) == 0x000190, "Wrong size on FL_PlayerCharacter_C_WhatAreWeLookingAt");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, Viewer) == 0x000000, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::Viewer' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, MaxDistanceAhead) == 0x000008, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::MaxDistanceAhead' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, RadiusOfSweep) == 0x00000C, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::RadiusOfSweep' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, __WorldContext) == 0x000010, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, HitActor) == 0x000018, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::HitActor' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, CallFunc_GetActorEyesViewPoint_OutLocation) == 0x000020, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::CallFunc_GetActorEyesViewPoint_OutLocation' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, CallFunc_GetActorEyesViewPoint_OutRotation) == 0x00002C, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::CallFunc_GetActorEyesViewPoint_OutRotation' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, K2Node_MakeArray_Array) == 0x000038, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, CallFunc_GetBaseAimRotation_ReturnValue) == 0x000048, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::CallFunc_GetBaseAimRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000054, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000060, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, CallFunc_Add_VectorVector_ReturnValue) == 0x00006C, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, CallFunc_SphereTraceSingle_OutHit) == 0x000078, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::CallFunc_SphereTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, CallFunc_SphereTraceSingle_ReturnValue) == 0x000108, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::CallFunc_SphereTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, CallFunc_BreakHitResult_bBlockingHit) == 0x000109, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, CallFunc_BreakHitResult_bInitialOverlap) == 0x00010A, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, CallFunc_BreakHitResult_Time) == 0x00010C, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, CallFunc_BreakHitResult_Distance) == 0x000110, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, CallFunc_BreakHitResult_Location) == 0x000114, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, CallFunc_BreakHitResult_ImpactPoint) == 0x000120, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, CallFunc_BreakHitResult_Normal) == 0x00012C, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, CallFunc_BreakHitResult_ImpactNormal) == 0x000138, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, CallFunc_BreakHitResult_PhysMat) == 0x000148, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, CallFunc_BreakHitResult_HitActor) == 0x000150, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, CallFunc_BreakHitResult_HitComponent) == 0x000158, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, CallFunc_BreakHitResult_HitBoneName) == 0x000160, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, CallFunc_BreakHitResult_HitItem) == 0x00016C, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, CallFunc_BreakHitResult_ElementIndex) == 0x000170, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, CallFunc_BreakHitResult_FaceIndex) == 0x000174, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, CallFunc_BreakHitResult_TraceStart) == 0x000178, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_WhatAreWeLookingAt, CallFunc_BreakHitResult_TraceEnd) == 0x000184, "Member 'FL_PlayerCharacter_C_WhatAreWeLookingAt::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");

// Function FL_PlayerCharacter.FL_PlayerCharacter_C.SetPropVisibility
// 0x0040 (0x0040 - 0x0000)
struct FL_PlayerCharacter_C_SetPropVisibility final
{
public:
	class UMeshComponent*                         OriginalMesh;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Visible;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   PropName;                                          // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAFrontEndFigure*                      K2Node_DynamicCast_AsCAFront_End_Figure;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FL_PlayerCharacter_C_SetPropVisibility) == 0x000008, "Wrong alignment on FL_PlayerCharacter_C_SetPropVisibility");
static_assert(sizeof(FL_PlayerCharacter_C_SetPropVisibility) == 0x000040, "Wrong size on FL_PlayerCharacter_C_SetPropVisibility");
static_assert(offsetof(FL_PlayerCharacter_C_SetPropVisibility, OriginalMesh) == 0x000000, "Member 'FL_PlayerCharacter_C_SetPropVisibility::OriginalMesh' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_SetPropVisibility, Visible) == 0x000008, "Member 'FL_PlayerCharacter_C_SetPropVisibility::Visible' has a wrong offset!");
static_assert(offsetof(FL_PlayerCharacter_C_SetPropVisibility, PropName) == 0x00000C, "Member 'FL_PlayerCharacter_C_SetPropVisibility::PropName' has a wrong offset!");
