#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FooterActionMenu

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function FooterActionMenu.FooterActionMenu_C.ExecuteUbergraph_FooterActionMenu
// 0x0030 (0x0030 - 0x0000)
struct FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   K2Node_CustomEvent_Text;                           // 0x0008(0x0018)(ConstParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_is_visible_1;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_is_visible;                     // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu) == 0x000008, "Wrong alignment on FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu");
static_assert(sizeof(FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu) == 0x000030, "Wrong size on FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu");
static_assert(offsetof(FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu, EntryPoint) == 0x000000, "Member 'FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu, Temp_bool_Variable) == 0x000004, "Member 'FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu, Temp_byte_Variable) == 0x000005, "Member 'FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu, Temp_byte_Variable_1) == 0x000006, "Member 'FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu, Temp_bool_Variable_1) == 0x000007, "Member 'FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu, K2Node_CustomEvent_Text) == 0x000008, "Member 'FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu, CallFunc_TextIsEmpty_ReturnValue) == 0x000020, "Member 'FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu, K2Node_CustomEvent_is_visible_1) == 0x000021, "Member 'FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu::K2Node_CustomEvent_is_visible_1' has a wrong offset!");
static_assert(offsetof(FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu, CallFunc_IsValid_ReturnValue) == 0x000022, "Member 'FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu, Temp_byte_Variable_2) == 0x000023, "Member 'FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu, K2Node_CustomEvent_is_visible) == 0x000024, "Member 'FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu::K2Node_CustomEvent_is_visible' has a wrong offset!");
static_assert(offsetof(FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu, CallFunc_IsValid_ReturnValue_1) == 0x000025, "Member 'FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu, K2Node_Select_Default) == 0x000026, "Member 'FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu, Temp_byte_Variable_3) == 0x000027, "Member 'FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu, K2Node_Select_Default_1) == 0x000028, "Member 'FooterActionMenu_C_ExecuteUbergraph_FooterActionMenu::K2Node_Select_Default_1' has a wrong offset!");

// Function FooterActionMenu.FooterActionMenu_C.TogglePartyWidgetVisibility
// 0x0001 (0x0001 - 0x0000)
struct FooterActionMenu_C_TogglePartyWidgetVisibility final
{
public:
	bool                                          Is_visible;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FooterActionMenu_C_TogglePartyWidgetVisibility) == 0x000001, "Wrong alignment on FooterActionMenu_C_TogglePartyWidgetVisibility");
static_assert(sizeof(FooterActionMenu_C_TogglePartyWidgetVisibility) == 0x000001, "Wrong size on FooterActionMenu_C_TogglePartyWidgetVisibility");
static_assert(offsetof(FooterActionMenu_C_TogglePartyWidgetVisibility, Is_visible) == 0x000000, "Member 'FooterActionMenu_C_TogglePartyWidgetVisibility::Is_visible' has a wrong offset!");

// Function FooterActionMenu.FooterActionMenu_C.ToggleCarouselVisibility
// 0x0001 (0x0001 - 0x0000)
struct FooterActionMenu_C_ToggleCarouselVisibility final
{
public:
	bool                                          Is_visible;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FooterActionMenu_C_ToggleCarouselVisibility) == 0x000001, "Wrong alignment on FooterActionMenu_C_ToggleCarouselVisibility");
static_assert(sizeof(FooterActionMenu_C_ToggleCarouselVisibility) == 0x000001, "Wrong size on FooterActionMenu_C_ToggleCarouselVisibility");
static_assert(offsetof(FooterActionMenu_C_ToggleCarouselVisibility, Is_visible) == 0x000000, "Member 'FooterActionMenu_C_ToggleCarouselVisibility::Is_visible' has a wrong offset!");

// Function FooterActionMenu.FooterActionMenu_C.SetMatchmakingText
// 0x0018 (0x0018 - 0x0000)
struct FooterActionMenu_C_SetMatchmakingText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(FooterActionMenu_C_SetMatchmakingText) == 0x000008, "Wrong alignment on FooterActionMenu_C_SetMatchmakingText");
static_assert(sizeof(FooterActionMenu_C_SetMatchmakingText) == 0x000018, "Wrong size on FooterActionMenu_C_SetMatchmakingText");
static_assert(offsetof(FooterActionMenu_C_SetMatchmakingText, Text) == 0x000000, "Member 'FooterActionMenu_C_SetMatchmakingText::Text' has a wrong offset!");

}

