#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FooterActionMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FooterActionMenu.FooterActionMenu_C
// 0x00E8 (0x0418 - 0x0330)
class UFooterActionMenu_C final : public UCABaseActionMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HomeScreen_switch;                                 // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       bump;                                              // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCATextBlock*                           And;                                               // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CarouselBox_C*                      BP_CarouselBox;                                    // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PartyFooterWidget_C*                BP_PartyFooterWidget;                              // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommon_ActionButton_C*                 Carousel_next_btn;                                 // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommon_ActionButton_C*                 Carousel_previous_btn;                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Highlight_Line;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HomeScreen_pinkGlow;                               // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_413;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line;                                              // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MatchmakingTB;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MmBg;                                              // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MmBg_1;                                            // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MmBg_2;                                            // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MmDashes;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MmDashes_1;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MmObject;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Party_widget_container;                            // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Player1Name;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Player2Name;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UExit_ActionButton_C*                   Quit_btn;                                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_1;                                     // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommon_ActionButtonWithIcon_C*         Settings_button;                                   // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommon_ActionButtonWithIcon_C*         Social_button;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Team_leader_waiting_display;                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextChatFooterButton_C*                TextChatFooterButton;                              // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCATextBlock*                           Waiting_for_players;                               // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FooterActionMenu(int32 EntryPoint);
	void TogglePartyWidgetVisibility(bool Is_visible);
	void ToggleCarouselVisibility(bool Is_visible);
	void OnLocalisationCultureChange();
	void SetMatchmakingText(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FooterActionMenu_C">();
	}
	static class UFooterActionMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFooterActionMenu_C>();
	}
};
static_assert(alignof(UFooterActionMenu_C) == 0x000008, "Wrong alignment on UFooterActionMenu_C");
static_assert(sizeof(UFooterActionMenu_C) == 0x000418, "Wrong size on UFooterActionMenu_C");
static_assert(offsetof(UFooterActionMenu_C, UberGraphFrame) == 0x000330, "Member 'UFooterActionMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, HomeScreen_switch) == 0x000338, "Member 'UFooterActionMenu_C::HomeScreen_switch' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, bump) == 0x000340, "Member 'UFooterActionMenu_C::bump' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, And) == 0x000348, "Member 'UFooterActionMenu_C::And' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, BP_CarouselBox) == 0x000350, "Member 'UFooterActionMenu_C::BP_CarouselBox' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, BP_PartyFooterWidget) == 0x000358, "Member 'UFooterActionMenu_C::BP_PartyFooterWidget' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, Carousel_next_btn) == 0x000360, "Member 'UFooterActionMenu_C::Carousel_next_btn' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, Carousel_previous_btn) == 0x000368, "Member 'UFooterActionMenu_C::Carousel_previous_btn' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, Highlight_Line) == 0x000370, "Member 'UFooterActionMenu_C::Highlight_Line' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, HomeScreen_pinkGlow) == 0x000378, "Member 'UFooterActionMenu_C::HomeScreen_pinkGlow' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, Image_413) == 0x000380, "Member 'UFooterActionMenu_C::Image_413' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, Line) == 0x000388, "Member 'UFooterActionMenu_C::Line' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, MatchmakingTB) == 0x000390, "Member 'UFooterActionMenu_C::MatchmakingTB' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, MmBg) == 0x000398, "Member 'UFooterActionMenu_C::MmBg' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, MmBg_1) == 0x0003A0, "Member 'UFooterActionMenu_C::MmBg_1' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, MmBg_2) == 0x0003A8, "Member 'UFooterActionMenu_C::MmBg_2' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, MmDashes) == 0x0003B0, "Member 'UFooterActionMenu_C::MmDashes' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, MmDashes_1) == 0x0003B8, "Member 'UFooterActionMenu_C::MmDashes_1' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, MmObject) == 0x0003C0, "Member 'UFooterActionMenu_C::MmObject' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, Party_widget_container) == 0x0003C8, "Member 'UFooterActionMenu_C::Party_widget_container' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, Player1Name) == 0x0003D0, "Member 'UFooterActionMenu_C::Player1Name' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, Player2Name) == 0x0003D8, "Member 'UFooterActionMenu_C::Player2Name' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, Quit_btn) == 0x0003E0, "Member 'UFooterActionMenu_C::Quit_btn' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, RetainerBox_1) == 0x0003E8, "Member 'UFooterActionMenu_C::RetainerBox_1' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, Settings_button) == 0x0003F0, "Member 'UFooterActionMenu_C::Settings_button' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, Social_button) == 0x0003F8, "Member 'UFooterActionMenu_C::Social_button' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, Team_leader_waiting_display) == 0x000400, "Member 'UFooterActionMenu_C::Team_leader_waiting_display' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, TextChatFooterButton) == 0x000408, "Member 'UFooterActionMenu_C::TextChatFooterButton' has a wrong offset!");
static_assert(offsetof(UFooterActionMenu_C, Waiting_for_players) == 0x000410, "Member 'UFooterActionMenu_C::Waiting_for_players' has a wrong offset!");

}

