#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrontendSceneStateManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_structs.hpp"
#include "CAUIEvents_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FrontendSceneStateManager.FrontendSceneStateManager_C.OnSpecialistSelected
// 0x0008 (0x0008 - 0x0000)
struct FrontendSceneStateManager_C_OnSpecialistSelected final
{
public:
	const class UCABaseUIEvent*                   Event_data;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontendSceneStateManager_C_OnSpecialistSelected) == 0x000008, "Wrong alignment on FrontendSceneStateManager_C_OnSpecialistSelected");
static_assert(sizeof(FrontendSceneStateManager_C_OnSpecialistSelected) == 0x000008, "Wrong size on FrontendSceneStateManager_C_OnSpecialistSelected");
static_assert(offsetof(FrontendSceneStateManager_C_OnSpecialistSelected, Event_data) == 0x000000, "Member 'FrontendSceneStateManager_C_OnSpecialistSelected::Event_data' has a wrong offset!");

// Function FrontendSceneStateManager.FrontendSceneStateManager_C.OnWeaponSceneChanged
// 0x0008 (0x0008 - 0x0000)
struct FrontendSceneStateManager_C_OnWeaponSceneChanged final
{
public:
	class ACAFrontEndWeaponScene*                 New_weapon_scene;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontendSceneStateManager_C_OnWeaponSceneChanged) == 0x000008, "Wrong alignment on FrontendSceneStateManager_C_OnWeaponSceneChanged");
static_assert(sizeof(FrontendSceneStateManager_C_OnWeaponSceneChanged) == 0x000008, "Wrong size on FrontendSceneStateManager_C_OnWeaponSceneChanged");
static_assert(offsetof(FrontendSceneStateManager_C_OnWeaponSceneChanged, New_weapon_scene) == 0x000000, "Member 'FrontendSceneStateManager_C_OnWeaponSceneChanged::New_weapon_scene' has a wrong offset!");

// Function FrontendSceneStateManager.FrontendSceneStateManager_C.OnPedentSceneChanged
// 0x0008 (0x0008 - 0x0000)
struct FrontendSceneStateManager_C_OnPedentSceneChanged final
{
public:
	class ACAFrontEndWeaponScene*                 New_weapon_scene;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontendSceneStateManager_C_OnPedentSceneChanged) == 0x000008, "Wrong alignment on FrontendSceneStateManager_C_OnPedentSceneChanged");
static_assert(sizeof(FrontendSceneStateManager_C_OnPedentSceneChanged) == 0x000008, "Wrong size on FrontendSceneStateManager_C_OnPedentSceneChanged");
static_assert(offsetof(FrontendSceneStateManager_C_OnPedentSceneChanged, New_weapon_scene) == 0x000000, "Member 'FrontendSceneStateManager_C_OnPedentSceneChanged::New_weapon_scene' has a wrong offset!");

// Function FrontendSceneStateManager.FrontendSceneStateManager_C.OnPunchOneVideoPlaybackComplete
// 0x0080 (0x0080 - 0x0000)
struct FrontendSceneStateManager_C_OnPunchOneVideoPlaybackComplete final
{
public:
	struct FCAUIEventData                         Event_data;                                        // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(FrontendSceneStateManager_C_OnPunchOneVideoPlaybackComplete) == 0x000008, "Wrong alignment on FrontendSceneStateManager_C_OnPunchOneVideoPlaybackComplete");
static_assert(sizeof(FrontendSceneStateManager_C_OnPunchOneVideoPlaybackComplete) == 0x000080, "Wrong size on FrontendSceneStateManager_C_OnPunchOneVideoPlaybackComplete");
static_assert(offsetof(FrontendSceneStateManager_C_OnPunchOneVideoPlaybackComplete, Event_data) == 0x000000, "Member 'FrontendSceneStateManager_C_OnPunchOneVideoPlaybackComplete::Event_data' has a wrong offset!");

// Function FrontendSceneStateManager.FrontendSceneStateManager_C.OnPunchTwoVideoPlaybackComplete
// 0x0080 (0x0080 - 0x0000)
struct FrontendSceneStateManager_C_OnPunchTwoVideoPlaybackComplete final
{
public:
	struct FCAUIEventData                         Event_data;                                        // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(FrontendSceneStateManager_C_OnPunchTwoVideoPlaybackComplete) == 0x000008, "Wrong alignment on FrontendSceneStateManager_C_OnPunchTwoVideoPlaybackComplete");
static_assert(sizeof(FrontendSceneStateManager_C_OnPunchTwoVideoPlaybackComplete) == 0x000080, "Wrong size on FrontendSceneStateManager_C_OnPunchTwoVideoPlaybackComplete");
static_assert(offsetof(FrontendSceneStateManager_C_OnPunchTwoVideoPlaybackComplete, Event_data) == 0x000000, "Member 'FrontendSceneStateManager_C_OnPunchTwoVideoPlaybackComplete::Event_data' has a wrong offset!");

// Function FrontendSceneStateManager.FrontendSceneStateManager_C.m_on_player_in_party_state_changed_Event_0
// 0x0001 (0x0001 - 0x0000)
struct FrontendSceneStateManager_C_M_on_player_in_party_state_changed_Event_0 final
{
public:
	bool                                          Is_in_party;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FrontendSceneStateManager_C_M_on_player_in_party_state_changed_Event_0) == 0x000001, "Wrong alignment on FrontendSceneStateManager_C_M_on_player_in_party_state_changed_Event_0");
static_assert(sizeof(FrontendSceneStateManager_C_M_on_player_in_party_state_changed_Event_0) == 0x000001, "Wrong size on FrontendSceneStateManager_C_M_on_player_in_party_state_changed_Event_0");
static_assert(offsetof(FrontendSceneStateManager_C_M_on_player_in_party_state_changed_Event_0, Is_in_party) == 0x000000, "Member 'FrontendSceneStateManager_C_M_on_player_in_party_state_changed_Event_0::Is_in_party' has a wrong offset!");

// Function FrontendSceneStateManager.FrontendSceneStateManager_C.ExecuteUbergraph_FrontendSceneStateManager
// 0x0570 (0x0570 - 0x0000)
struct FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParams            K2Node_MakeStruct_ViewTargetTransitionParams;      // 0x0008(0x0020)(NoDestructor)
	class UCABlendToCameraAsyncAction*            CallFunc_BlendToCamera_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABlendToCameraAsyncAction*            CallFunc_BlendToCamera_ReturnValue_1;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0050(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABlendToCameraAsyncAction*            CallFunc_BlendToCamera_ReturnValue_2;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParams            K2Node_MakeStruct_ViewTargetTransitionParams_1;    // 0x0070(0x0020)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0094(0x0014)(ZeroConstructor, NoDestructor)
	class UCABlendToCameraAsyncAction*            CallFunc_BlendToCamera_ReturnValue_3;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00B0(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABlendToCameraAsyncAction*            CallFunc_BlendToCamera_ReturnValue_4;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00D0(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABlendToCameraAsyncAction*            CallFunc_BlendToCamera_ReturnValue_5;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x00F0(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABlendToCameraAsyncAction*            CallFunc_BlendToCamera_ReturnValue_6;              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParams            K2Node_MakeStruct_ViewTargetTransitionParams_2;    // 0x0110(0x0020)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParams            K2Node_MakeStruct_ViewTargetTransitionParams_3;    // 0x0138(0x0020)(NoDestructor)
	TDelegate<void(class ACAFrontEndWeaponScene* New_weapon_scene)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0158(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(class ACAFrontEndWeaponScene* New_weapon_scene)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x016C(0x0014)(ZeroConstructor, NoDestructor)
	struct FViewTargetTransitionParams            K2Node_MakeStruct_ViewTargetTransitionParams_4;    // 0x0180(0x0020)(NoDestructor)
	struct FViewTargetTransitionParams            K2Node_MakeStruct_ViewTargetTransitionParams_5;    // 0x01A0(0x0020)(NoDestructor)
	struct FViewTargetTransitionParams            K2Node_MakeStruct_ViewTargetTransitionParams_6;    // 0x01C0(0x0020)(NoDestructor)
	TDelegate<void(const struct FCAUIEventData& Event_data)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x01E0(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAUIEventData& Event_data)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x01F4(0x0014)(ZeroConstructor, NoDestructor)
	struct FViewTargetTransitionParams            K2Node_MakeStruct_ViewTargetTransitionParams_7;    // 0x0208(0x0020)(NoDestructor)
	TDelegate<void(bool Is_in_party)>             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0228(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABlendToCameraAsyncAction*            CallFunc_BlendToCamera_ReturnValue_7;              // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x024A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x024B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UCABaseUIEvent*                   K2Node_CustomEvent_event_data_2;                   // 0x0250(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCASpecialistUIEvent*                   K2Node_DynamicCast_AsCASpecialist_UIEvent;         // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue_1;              // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26A[0x2];                                      // 0x026A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndex_ReturnValue;                     // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseUIEvent* Event_data)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0270(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x0284(0x0014)(ZeroConstructor, NoDestructor)
	struct FCAUIEventMapping                      CallFunc_BindToUIEvent_ReturnValue;                // 0x0298(0x0058)(HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x02F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerStart*                           CallFunc_GetPlayerStart_ReturnValue;               // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_308[0x8];                                      // 0x0308(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0310(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SpinningSonic_C*                    CallFunc_FinishSpawningActor_ReturnValue;          // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x0358(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABlendToCameraAsyncAction*            CallFunc_BlendToCamera_ReturnValue_8;              // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsUserInParty_ReturnValue;             // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsUserAloneInParty_ReturnValue;        // 0x037A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37B[0x5];                                      // 0x037B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAFrontEndWeaponSpot*                  CallFunc_GetFrontEndWeaponSpot_ReturnValue;        // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAFrontEndWeaponScene*                 K2Node_CustomEvent_new_weapon_scene_1;             // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAFrontEndWeaponSpot*                  CallFunc_GetFrontEndWeaponSpot_ReturnValue_1;      // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAFrontEndWeaponScene*                 K2Node_CustomEvent_new_weapon_scene;               // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAFrontEndWeaponSpot*                  CallFunc_GetFrontEndWeaponSpot_ReturnValue_2;      // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_2;             // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_2;              // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x03BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BB[0x5];                                      // 0x03BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParams            K2Node_MakeStruct_ViewTargetTransitionParams_8;    // 0x03C0(0x0020)(NoDestructor)
	class ACAFrontEndWeaponSpot*                  CallFunc_GetFrontEndWeaponSpot_ReturnValue_3;      // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FViewTargetTransitionParams            K2Node_MakeStruct_ViewTargetTransitionParams_9;    // 0x03F0(0x0020)(NoDestructor)
	class ACAFrontEndHUD*                         CallFunc_GetFrontEndHUD_ReturnValue;               // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_14;           // 0x0418(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParams            K2Node_MakeStruct_ViewTargetTransitionParams_10;   // 0x0438(0x0020)(NoDestructor)
	struct FCAUIEventData                         K2Node_CustomEvent_event_data_1;                   // 0x0458(0x0080)()
	struct FCAUIEventData                         K2Node_CustomEvent_event_data;                     // 0x04D8(0x0080)()
	bool                                          CallFunc_GetIsUserInParty_ReturnValue_1;           // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCASocialScreenProxy*                   CallFunc_GetSocialScreenProxy_ReturnValue;         // 0x0560(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x0569(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_is_in_party;                    // 0x056A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager) == 0x000010, "Wrong alignment on FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager");
static_assert(sizeof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager) == 0x000570, "Wrong size on FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, EntryPoint) == 0x000000, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_MakeStruct_ViewTargetTransitionParams) == 0x000008, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_MakeStruct_ViewTargetTransitionParams' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_BlendToCamera_ReturnValue) == 0x000028, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_BlendToCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_IsValid_ReturnValue) == 0x000044, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_BlendToCamera_ReturnValue_1) == 0x000048, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_BlendToCamera_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_CreateDelegate_OutputDelegate_1) == 0x000050, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_IsValid_ReturnValue_1) == 0x000064, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_BlendToCamera_ReturnValue_2) == 0x000068, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_BlendToCamera_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_MakeStruct_ViewTargetTransitionParams_1) == 0x000070, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_MakeStruct_ViewTargetTransitionParams_1' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_IsValid_ReturnValue_2) == 0x000090, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_CreateDelegate_OutputDelegate_2) == 0x000094, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_BlendToCamera_ReturnValue_3) == 0x0000A8, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_BlendToCamera_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000B0, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_IsValid_ReturnValue_3) == 0x0000C4, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_BlendToCamera_ReturnValue_4) == 0x0000C8, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_BlendToCamera_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000D0, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_IsValid_ReturnValue_4) == 0x0000E4, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_BlendToCamera_ReturnValue_5) == 0x0000E8, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_BlendToCamera_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000F0, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_IsValid_ReturnValue_5) == 0x000104, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_BlendToCamera_ReturnValue_6) == 0x000108, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_BlendToCamera_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_MakeStruct_ViewTargetTransitionParams_2) == 0x000110, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_MakeStruct_ViewTargetTransitionParams_2' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_IsValid_ReturnValue_6) == 0x000130, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_MakeStruct_ViewTargetTransitionParams_3) == 0x000138, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_MakeStruct_ViewTargetTransitionParams_3' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_CreateDelegate_OutputDelegate_6) == 0x000158, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_CreateDelegate_OutputDelegate_7) == 0x00016C, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_MakeStruct_ViewTargetTransitionParams_4) == 0x000180, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_MakeStruct_ViewTargetTransitionParams_4' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_MakeStruct_ViewTargetTransitionParams_5) == 0x0001A0, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_MakeStruct_ViewTargetTransitionParams_5' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_MakeStruct_ViewTargetTransitionParams_6) == 0x0001C0, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_MakeStruct_ViewTargetTransitionParams_6' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_CreateDelegate_OutputDelegate_8) == 0x0001E0, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_CreateDelegate_OutputDelegate_9) == 0x0001F4, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_MakeStruct_ViewTargetTransitionParams_7) == 0x000208, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_MakeStruct_ViewTargetTransitionParams_7' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_CreateDelegate_OutputDelegate_10) == 0x000228, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_BlendToCamera_ReturnValue_7) == 0x000240, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_BlendToCamera_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_IsValid_ReturnValue_7) == 0x000248, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_Conv_IntToByte_ReturnValue) == 0x000249, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00024A, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_GetValidValue_ReturnValue) == 0x00024B, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_CustomEvent_event_data_2) == 0x000250, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_CustomEvent_event_data_2' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000258, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_DynamicCast_AsCASpecialist_UIEvent) == 0x000260, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_DynamicCast_AsCASpecialist_UIEvent' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_DynamicCast_bSuccess) == 0x000268, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_GetValidValue_ReturnValue_1) == 0x000269, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_GetValidValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_GetIndex_ReturnValue) == 0x00026C, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_GetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_CreateDelegate_OutputDelegate_11) == 0x000270, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_CreateDelegate_OutputDelegate_12) == 0x000284, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_BindToUIEvent_ReturnValue) == 0x000298, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_BindToUIEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_MakeLiteralName_ReturnValue) == 0x0002F0, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_GetPlayerStart_ReturnValue) == 0x000300, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_GetPlayerStart_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_GetTransform_ReturnValue) == 0x000310, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_IsValid_ReturnValue_8) == 0x000340, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000348, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_FinishSpawningActor_ReturnValue) == 0x000350, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_CreateDelegate_OutputDelegate_13) == 0x000358, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_BlendToCamera_ReturnValue_8) == 0x000370, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_BlendToCamera_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_IsValid_ReturnValue_9) == 0x000378, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_GetIsUserInParty_ReturnValue) == 0x000379, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_GetIsUserInParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_GetIsUserAloneInParty_ReturnValue) == 0x00037A, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_GetIsUserAloneInParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_GetFrontEndWeaponSpot_ReturnValue) == 0x000380, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_GetFrontEndWeaponSpot_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_CustomEvent_new_weapon_scene_1) == 0x000388, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_CustomEvent_new_weapon_scene_1' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_IsValid_ReturnValue_10) == 0x000390, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_GetFrontEndWeaponSpot_ReturnValue_1) == 0x000398, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_GetFrontEndWeaponSpot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_IsValid_ReturnValue_11) == 0x0003A0, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_CustomEvent_new_weapon_scene) == 0x0003A8, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_CustomEvent_new_weapon_scene' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_GetFrontEndWeaponSpot_ReturnValue_2) == 0x0003B0, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_GetFrontEndWeaponSpot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_Conv_IntToByte_ReturnValue_2) == 0x0003B8, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_Conv_IntToByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_GetValidValue_ReturnValue_2) == 0x0003B9, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_GetValidValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_IsValid_ReturnValue_12) == 0x0003BA, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_MakeStruct_ViewTargetTransitionParams_8) == 0x0003C0, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_MakeStruct_ViewTargetTransitionParams_8' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_GetFrontEndWeaponSpot_ReturnValue_3) == 0x0003E0, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_GetFrontEndWeaponSpot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_IsValid_ReturnValue_13) == 0x0003E8, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_IsValid_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_MakeStruct_ViewTargetTransitionParams_9) == 0x0003F0, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_MakeStruct_ViewTargetTransitionParams_9' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_GetFrontEndHUD_ReturnValue) == 0x000410, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_GetFrontEndHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_CreateDelegate_OutputDelegate_14) == 0x000418, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000430, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_MakeStruct_ViewTargetTransitionParams_10) == 0x000438, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_MakeStruct_ViewTargetTransitionParams_10' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_CustomEvent_event_data_1) == 0x000458, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_CustomEvent_event_data_1' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_CustomEvent_event_data) == 0x0004D8, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_CustomEvent_event_data' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_GetIsUserInParty_ReturnValue_1) == 0x000558, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_GetIsUserInParty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_GetSocialScreenProxy_ReturnValue) == 0x000560, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_GetSocialScreenProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_IsValid_ReturnValue_14) == 0x000568, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_IsValid_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, CallFunc_IsValid_ReturnValue_15) == 0x000569, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::CallFunc_IsValid_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager, K2Node_CustomEvent_is_in_party) == 0x00056A, "Member 'FrontendSceneStateManager_C_ExecuteUbergraph_FrontendSceneStateManager::K2Node_CustomEvent_is_in_party' has a wrong offset!");

// Function FrontendSceneStateManager.FrontendSceneStateManager_C.UpdateFrontEndMainCamera
// 0x0048 (0x0048 - 0x0000)
struct FrontendSceneStateManager_C_UpdateFrontEndMainCamera final
{
public:
	bool                                          IsInParty;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          FromAnotherState;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FViewTargetTransitionParams            K2Node_MakeStruct_ViewTargetTransitionParams;      // 0x0008(0x0020)(NoDestructor)
	struct FViewTargetTransitionParams            K2Node_MakeStruct_ViewTargetTransitionParams_1;    // 0x0028(0x0020)(NoDestructor)
};
static_assert(alignof(FrontendSceneStateManager_C_UpdateFrontEndMainCamera) == 0x000008, "Wrong alignment on FrontendSceneStateManager_C_UpdateFrontEndMainCamera");
static_assert(sizeof(FrontendSceneStateManager_C_UpdateFrontEndMainCamera) == 0x000048, "Wrong size on FrontendSceneStateManager_C_UpdateFrontEndMainCamera");
static_assert(offsetof(FrontendSceneStateManager_C_UpdateFrontEndMainCamera, IsInParty) == 0x000000, "Member 'FrontendSceneStateManager_C_UpdateFrontEndMainCamera::IsInParty' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_UpdateFrontEndMainCamera, FromAnotherState) == 0x000001, "Member 'FrontendSceneStateManager_C_UpdateFrontEndMainCamera::FromAnotherState' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_UpdateFrontEndMainCamera, CallFunc_SelectFloat_ReturnValue) == 0x000004, "Member 'FrontendSceneStateManager_C_UpdateFrontEndMainCamera::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_UpdateFrontEndMainCamera, K2Node_MakeStruct_ViewTargetTransitionParams) == 0x000008, "Member 'FrontendSceneStateManager_C_UpdateFrontEndMainCamera::K2Node_MakeStruct_ViewTargetTransitionParams' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_UpdateFrontEndMainCamera, K2Node_MakeStruct_ViewTargetTransitionParams_1) == 0x000028, "Member 'FrontendSceneStateManager_C_UpdateFrontEndMainCamera::K2Node_MakeStruct_ViewTargetTransitionParams_1' has a wrong offset!");

// Function FrontendSceneStateManager.FrontendSceneStateManager_C.UpdateWeaponSceneCamera
// 0x0088 (0x0088 - 0x0000)
struct FrontendSceneStateManager_C_UpdateWeaponSceneCamera final
{
public:
	class ACAFrontEndWeaponScene*                 WeaponSceneParameter;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAFrontEndHUD*                         CallFunc_GetFrontEndHUD_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAFrontEndHUD*                         CallFunc_GetFrontEndHUD_ReturnValue_1;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue_1;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           CallFunc_GetDefaultCameraActor_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPreviousSceneStateName_ReturnValue;    // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACameraActor*                           CallFunc_GetDefaultCameraActor_ReturnValue_1;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           CallFunc_GetPendantCameraActor_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCurrentSceneStateName_ReturnValue;     // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FrontendSceneStateManager_C_UpdateWeaponSceneCamera) == 0x000008, "Wrong alignment on FrontendSceneStateManager_C_UpdateWeaponSceneCamera");
static_assert(sizeof(FrontendSceneStateManager_C_UpdateWeaponSceneCamera) == 0x000088, "Wrong size on FrontendSceneStateManager_C_UpdateWeaponSceneCamera");
static_assert(offsetof(FrontendSceneStateManager_C_UpdateWeaponSceneCamera, WeaponSceneParameter) == 0x000000, "Member 'FrontendSceneStateManager_C_UpdateWeaponSceneCamera::WeaponSceneParameter' has a wrong offset!");
static_assert(offsetof(FrontendSceneStateManager_C_UpdateWeaponSceneCamera, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'FrontendSceneStateManager_C_UpdateWeaponSceneCamera::CallFunc_IsValid_ReturnValue' has a wrong offset!");
