#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrontendMenuNavigationManager

#include "Basic.hpp"

#include "Keaton_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function FrontendMenuNavigationManager.FrontendMenuNavigationManager_C.OnMatchmakingStarted
// 0x0080 (0x0080 - 0x0000)
struct FrontendMenuNavigationManager_C_OnMatchmakingStarted final
{
public:
	struct FCAUIEventData                         Event_data;                                        // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(FrontendMenuNavigationManager_C_OnMatchmakingStarted) == 0x000008, "Wrong alignment on FrontendMenuNavigationManager_C_OnMatchmakingStarted");
static_assert(sizeof(FrontendMenuNavigationManager_C_OnMatchmakingStarted) == 0x000080, "Wrong size on FrontendMenuNavigationManager_C_OnMatchmakingStarted");
static_assert(offsetof(FrontendMenuNavigationManager_C_OnMatchmakingStarted, Event_data) == 0x000000, "Member 'FrontendMenuNavigationManager_C_OnMatchmakingStarted::Event_data' has a wrong offset!");

// Function FrontendMenuNavigationManager.FrontendMenuNavigationManager_C.OnMatchmakingStopped
// 0x0080 (0x0080 - 0x0000)
struct FrontendMenuNavigationManager_C_OnMatchmakingStopped final
{
public:
	struct FCAUIEventData                         Event_data;                                        // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(FrontendMenuNavigationManager_C_OnMatchmakingStopped) == 0x000008, "Wrong alignment on FrontendMenuNavigationManager_C_OnMatchmakingStopped");
static_assert(sizeof(FrontendMenuNavigationManager_C_OnMatchmakingStopped) == 0x000080, "Wrong size on FrontendMenuNavigationManager_C_OnMatchmakingStopped");
static_assert(offsetof(FrontendMenuNavigationManager_C_OnMatchmakingStopped, Event_data) == 0x000000, "Member 'FrontendMenuNavigationManager_C_OnMatchmakingStopped::Event_data' has a wrong offset!");

// Function FrontendMenuNavigationManager.FrontendMenuNavigationManager_C.OnPendingSpecialistChanged
// 0x0080 (0x0080 - 0x0000)
struct FrontendMenuNavigationManager_C_OnPendingSpecialistChanged final
{
public:
	struct FCAUIEventData                         Event_data;                                        // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(FrontendMenuNavigationManager_C_OnPendingSpecialistChanged) == 0x000008, "Wrong alignment on FrontendMenuNavigationManager_C_OnPendingSpecialistChanged");
static_assert(sizeof(FrontendMenuNavigationManager_C_OnPendingSpecialistChanged) == 0x000080, "Wrong size on FrontendMenuNavigationManager_C_OnPendingSpecialistChanged");
static_assert(offsetof(FrontendMenuNavigationManager_C_OnPendingSpecialistChanged, Event_data) == 0x000000, "Member 'FrontendMenuNavigationManager_C_OnPendingSpecialistChanged::Event_data' has a wrong offset!");

// Function FrontendMenuNavigationManager.FrontendMenuNavigationManager_C.OnChallengesSubHeaderElementUpdate
// 0x0080 (0x0080 - 0x0000)
struct FrontendMenuNavigationManager_C_OnChallengesSubHeaderElementUpdate final
{
public:
	struct FCAUIEventData                         Event_data;                                        // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(FrontendMenuNavigationManager_C_OnChallengesSubHeaderElementUpdate) == 0x000008, "Wrong alignment on FrontendMenuNavigationManager_C_OnChallengesSubHeaderElementUpdate");
static_assert(sizeof(FrontendMenuNavigationManager_C_OnChallengesSubHeaderElementUpdate) == 0x000080, "Wrong size on FrontendMenuNavigationManager_C_OnChallengesSubHeaderElementUpdate");
static_assert(offsetof(FrontendMenuNavigationManager_C_OnChallengesSubHeaderElementUpdate, Event_data) == 0x000000, "Member 'FrontendMenuNavigationManager_C_OnChallengesSubHeaderElementUpdate::Event_data' has a wrong offset!");

// Function FrontendMenuNavigationManager.FrontendMenuNavigationManager_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct FrontendMenuNavigationManager_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontendMenuNavigationManager_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on FrontendMenuNavigationManager_C_ReceiveEndPlay");
static_assert(sizeof(FrontendMenuNavigationManager_C_ReceiveEndPlay) == 0x000001, "Wrong size on FrontendMenuNavigationManager_C_ReceiveEndPlay");
static_assert(offsetof(FrontendMenuNavigationManager_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'FrontendMenuNavigationManager_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function FrontendMenuNavigationManager.FrontendMenuNavigationManager_C.ExecuteUbergraph_FrontendMenuNavigationManager
// 0x0288 (0x0288 - 0x0000)
struct FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAUIEventData                         K2Node_CustomEvent_event_data_3;                   // 0x0008(0x0080)()
	struct FCAUIEventData                         K2Node_CustomEvent_event_data_2;                   // 0x0088(0x0080)()
	TDelegate<void(const struct FCAUIEventData& Event_data)> K2Node_CreateDelegate_OutputDelegate;              // 0x0108(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAUIEventData& Event_data)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x011C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAUIEventData& Event_data)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0130(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAUIEventData                         K2Node_CustomEvent_event_data_1;                   // 0x0148(0x0080)()
	class UCAServicesDataItem*                    K2Node_DynamicCast_AsCAServices_Data_Item;         // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECAEntitlementPropertyOutputPins              CallFunc_SwitchOnEntitlementAvailability_exec;     // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D3[0x1];                                      // 0x01D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAUIEventData& Event_data)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x01D4(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAUIEventData& Event_data)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x01E8(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAUIEventData                         K2Node_CustomEvent_event_data;                     // 0x0200(0x0080)()
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager) == 0x000008, "Wrong alignment on FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager");
static_assert(sizeof(FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager) == 0x000288, "Wrong size on FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager");
static_assert(offsetof(FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager, EntryPoint) == 0x000000, "Member 'FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager, K2Node_CustomEvent_event_data_3) == 0x000008, "Member 'FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager::K2Node_CustomEvent_event_data_3' has a wrong offset!");
static_assert(offsetof(FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager, K2Node_CustomEvent_event_data_2) == 0x000088, "Member 'FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager::K2Node_CustomEvent_event_data_2' has a wrong offset!");
static_assert(offsetof(FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager, K2Node_CreateDelegate_OutputDelegate) == 0x000108, "Member 'FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager, K2Node_CreateDelegate_OutputDelegate_1) == 0x00011C, "Member 'FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager, K2Node_CreateDelegate_OutputDelegate_2) == 0x000130, "Member 'FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager, K2Node_CustomEvent_event_data_1) == 0x000148, "Member 'FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager::K2Node_CustomEvent_event_data_1' has a wrong offset!");
static_assert(offsetof(FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager, K2Node_DynamicCast_AsCAServices_Data_Item) == 0x0001C8, "Member 'FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager::K2Node_DynamicCast_AsCAServices_Data_Item' has a wrong offset!");
static_assert(offsetof(FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager, K2Node_DynamicCast_bSuccess) == 0x0001D0, "Member 'FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager, CallFunc_SwitchOnEntitlementAvailability_exec) == 0x0001D1, "Member 'FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager::CallFunc_SwitchOnEntitlementAvailability_exec' has a wrong offset!");
static_assert(offsetof(FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager, K2Node_SwitchEnum_CmpSuccess) == 0x0001D2, "Member 'FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001D4, "Member 'FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001E8, "Member 'FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager, K2Node_CustomEvent_event_data) == 0x000200, "Member 'FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager::K2Node_CustomEvent_event_data' has a wrong offset!");
static_assert(offsetof(FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager, K2Node_Event_EndPlayReason) == 0x000280, "Member 'FrontendMenuNavigationManager_C_ExecuteUbergraph_FrontendMenuNavigationManager::K2Node_Event_EndPlayReason' has a wrong offset!");

}

