#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrontendTextChatMediator

#include "Basic.hpp"

#include "Keaton_structs.hpp"
#include "CAAudio_structs.hpp"


namespace SDK::Params
{

// Function FrontendTextChatMediator.FrontendTextChatMediator_C.ExecuteUbergraph_FrontendTextChatMediator
// 0x0180 (0x0180 - 0x0000)
struct FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0004(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	class UObject*                                K2Node_Event_client;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAUIEventData& Event_data)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_TextChat_Screen_C*                  K2Node_DynamicCast_AsBP_Text_Chat_Screen;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAUIEventData                         K2Node_CustomEvent_event_data_1;                   // 0x0048(0x0080)()
	TDelegate<void(const struct FCAUIEventData& Event_data)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00C8(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAUIEventData                         K2Node_CustomEvent_event_data;                     // 0x00E0(0x0080)()
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayer_ReturnValue;               // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0168(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator) == 0x000008, "Wrong alignment on FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator");
static_assert(sizeof(FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator) == 0x000180, "Wrong size on FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator");
static_assert(offsetof(FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator, EntryPoint) == 0x000000, "Member 'FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator::EntryPoint' has a wrong offset!");
static_assert(offsetof(FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator, Temp_delegate_Variable) == 0x000004, "Member 'FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator, K2Node_Event_client) == 0x000018, "Member 'FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator::K2Node_Event_client' has a wrong offset!");
static_assert(offsetof(FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator, K2Node_DynamicCast_AsBP_Text_Chat_Screen) == 0x000038, "Member 'FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator::K2Node_DynamicCast_AsBP_Text_Chat_Screen' has a wrong offset!");
static_assert(offsetof(FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator, K2Node_CustomEvent_event_data_1) == 0x000048, "Member 'FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator::K2Node_CustomEvent_event_data_1' has a wrong offset!");
static_assert(offsetof(FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C8, "Member 'FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator, K2Node_CustomEvent_event_data) == 0x0000E0, "Member 'FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator::K2Node_CustomEvent_event_data' has a wrong offset!");
static_assert(offsetof(FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator, CallFunc_GetLocalPlayer_ReturnValue) == 0x000160, "Member 'FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator::CallFunc_GetLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator, CallFunc_PlayEvent_playback_instance) == 0x000168, "Member 'FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator, CallFunc_PlayEvent_play_success) == 0x000178, "Member 'FrontendTextChatMediator_C_ExecuteUbergraph_FrontendTextChatMediator::CallFunc_PlayEvent_play_success' has a wrong offset!");

// Function FrontendTextChatMediator.FrontendTextChatMediator_C.OnShowHistoryOnly
// 0x0080 (0x0080 - 0x0000)
struct FrontendTextChatMediator_C_OnShowHistoryOnly final
{
public:
	struct FCAUIEventData                         Event_data;                                        // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(FrontendTextChatMediator_C_OnShowHistoryOnly) == 0x000008, "Wrong alignment on FrontendTextChatMediator_C_OnShowHistoryOnly");
static_assert(sizeof(FrontendTextChatMediator_C_OnShowHistoryOnly) == 0x000080, "Wrong size on FrontendTextChatMediator_C_OnShowHistoryOnly");
static_assert(offsetof(FrontendTextChatMediator_C_OnShowHistoryOnly, Event_data) == 0x000000, "Member 'FrontendTextChatMediator_C_OnShowHistoryOnly::Event_data' has a wrong offset!");

// Function FrontendTextChatMediator.FrontendTextChatMediator_C.OnWidgetVisible
// 0x0080 (0x0080 - 0x0000)
struct FrontendTextChatMediator_C_OnWidgetVisible final
{
public:
	struct FCAUIEventData                         Event_data;                                        // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(FrontendTextChatMediator_C_OnWidgetVisible) == 0x000008, "Wrong alignment on FrontendTextChatMediator_C_OnWidgetVisible");
static_assert(sizeof(FrontendTextChatMediator_C_OnWidgetVisible) == 0x000080, "Wrong size on FrontendTextChatMediator_C_OnWidgetVisible");
static_assert(offsetof(FrontendTextChatMediator_C_OnWidgetVisible, Event_data) == 0x000000, "Member 'FrontendTextChatMediator_C_OnWidgetVisible::Event_data' has a wrong offset!");

// Function FrontendTextChatMediator.FrontendTextChatMediator_C.SetClient
// 0x0008 (0x0008 - 0x0000)
struct FrontendTextChatMediator_C_SetClient final
{
public:
	class UObject*                                Client_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontendTextChatMediator_C_SetClient) == 0x000008, "Wrong alignment on FrontendTextChatMediator_C_SetClient");
static_assert(sizeof(FrontendTextChatMediator_C_SetClient) == 0x000008, "Wrong size on FrontendTextChatMediator_C_SetClient");
static_assert(offsetof(FrontendTextChatMediator_C_SetClient, Client_0) == 0x000000, "Member 'FrontendTextChatMediator_C_SetClient::Client_0' has a wrong offset!");

}

