#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FTUE_VideoBase_Mediator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass FTUE_VideoBase_Mediator.FTUE_VideoBase_Mediator_C
// 0x0018 (0x0148 - 0x0130)
class UFTUE_VideoBase_Mediator_C : public UCAViewMediator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0130(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFullSizeVideo_Screen_C*                Client;                                            // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAMediaSourceDefinitions*              Media_sources;                                     // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FTUE_VideoBase_Mediator(int32 EntryPoint);
	void PlayFromMediaSource(const TSoftObjectPtr<class UObject>& MediaSource, bool IsLooping);
	void StopVideo();
	void PlayFromHandle(const struct FDataTableRowHandle& Handle, bool InLooping);
	void SetClient(class UObject* Client_0);
	void OnVideoComplete();
	void OnLoaded_C018DCFB4ECF6EA14DAAED9187AC010D(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FTUE_VideoBase_Mediator_C">();
	}
	static class UFTUE_VideoBase_Mediator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFTUE_VideoBase_Mediator_C>();
	}
};
static_assert(alignof(UFTUE_VideoBase_Mediator_C) == 0x000008, "Wrong alignment on UFTUE_VideoBase_Mediator_C");
static_assert(sizeof(UFTUE_VideoBase_Mediator_C) == 0x000148, "Wrong size on UFTUE_VideoBase_Mediator_C");
static_assert(offsetof(UFTUE_VideoBase_Mediator_C, UberGraphFrame) == 0x000130, "Member 'UFTUE_VideoBase_Mediator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFTUE_VideoBase_Mediator_C, Client) == 0x000138, "Member 'UFTUE_VideoBase_Mediator_C::Client' has a wrong offset!");
static_assert(offsetof(UFTUE_VideoBase_Mediator_C, Media_sources) == 0x000140, "Member 'UFTUE_VideoBase_Mediator_C::Media_sources' has a wrong offset!");

}

