#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FullSizeVideo_Screen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FullSizeVideo_Screen.FullSizeVideo_Screen_C
// 0x00C0 (0x03A8 - 0x02E8)
class UFullSizeVideo_Screen_C final : public UCABaseScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_45;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VideoImage;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnVideoComplete;                                   // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UBinkMediaPlayer*                       Media_player;                                      // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            Render_texture_brush;                              // 0x0318(0x0090)(Edit, BlueprintVisible)

public:
	void OnVideoComplete__DelegateSignature();
	void ExecuteUbergraph_FullSizeVideo_Screen(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetSize();
	void BndEvt__FTUE_FullSizeVideo_Screen_media_player_K2Node_ComponentBoundEvent_1_OnBinkMediaPlayerMediaReachedEnd__DelegateSignature();
	void Play(const class UBinkMediaSource* BinkMediaSource, bool InLooping);
	void StopVideo();
	void OnDisable();
	void OnEnable();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FullSizeVideo_Screen_C">();
	}
	static class UFullSizeVideo_Screen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFullSizeVideo_Screen_C>();
	}
};
static_assert(alignof(UFullSizeVideo_Screen_C) == 0x000008, "Wrong alignment on UFullSizeVideo_Screen_C");
static_assert(sizeof(UFullSizeVideo_Screen_C) == 0x0003A8, "Wrong size on UFullSizeVideo_Screen_C");
static_assert(offsetof(UFullSizeVideo_Screen_C, UberGraphFrame) == 0x0002E8, "Member 'UFullSizeVideo_Screen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFullSizeVideo_Screen_C, Image_45) == 0x0002F0, "Member 'UFullSizeVideo_Screen_C::Image_45' has a wrong offset!");
static_assert(offsetof(UFullSizeVideo_Screen_C, VideoImage) == 0x0002F8, "Member 'UFullSizeVideo_Screen_C::VideoImage' has a wrong offset!");
static_assert(offsetof(UFullSizeVideo_Screen_C, OnVideoComplete) == 0x000300, "Member 'UFullSizeVideo_Screen_C::OnVideoComplete' has a wrong offset!");
static_assert(offsetof(UFullSizeVideo_Screen_C, Media_player) == 0x000310, "Member 'UFullSizeVideo_Screen_C::Media_player' has a wrong offset!");
static_assert(offsetof(UFullSizeVideo_Screen_C, Render_texture_brush) == 0x000318, "Member 'UFullSizeVideo_Screen_C::Render_texture_brush' has a wrong offset!");

}

