#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FullSizeVideo_Screen

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FullSizeVideo_Screen.FullSizeVideo_Screen_C.ExecuteUbergraph_FullSizeVideo_Screen
// 0x00D8 (0x00D8 - 0x0000)
struct FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UBinkMediaSource*                 K2Node_CustomEvent_BinkMediaSource;                // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InLooping;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetUrl_ReturnValue;                       // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenUrl_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetLooping_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetHeight_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWidth_ReturnValue;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0048(0x0090)()
};
static_assert(alignof(FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen) == 0x000008, "Wrong alignment on FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen");
static_assert(sizeof(FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen) == 0x0000D8, "Wrong size on FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen");
static_assert(offsetof(FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen, EntryPoint) == 0x000000, "Member 'FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen::EntryPoint' has a wrong offset!");
static_assert(offsetof(FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen, K2Node_CustomEvent_BinkMediaSource) == 0x000008, "Member 'FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen::K2Node_CustomEvent_BinkMediaSource' has a wrong offset!");
static_assert(offsetof(FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen, K2Node_CustomEvent_InLooping) == 0x000010, "Member 'FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen::K2Node_CustomEvent_InLooping' has a wrong offset!");
static_assert(offsetof(FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen, CallFunc_GetUrl_ReturnValue) == 0x000018, "Member 'FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen::CallFunc_GetUrl_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen, CallFunc_OpenUrl_ReturnValue) == 0x000028, "Member 'FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen::CallFunc_OpenUrl_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen, CallFunc_SetLooping_ReturnValue) == 0x000029, "Member 'FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen::CallFunc_SetLooping_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen, CallFunc_GetHeight_ReturnValue) == 0x00002C, "Member 'FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen::CallFunc_GetHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen, CallFunc_GetWidth_ReturnValue) == 0x000030, "Member 'FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen::CallFunc_GetWidth_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000034, "Member 'FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000038, "Member 'FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen, CallFunc_MakeVector2D_ReturnValue) == 0x00003C, "Member 'FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen, K2Node_Event_IsDesignTime) == 0x000044, "Member 'FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen, K2Node_MakeStruct_SlateBrush) == 0x000048, "Member 'FullSizeVideo_Screen_C_ExecuteUbergraph_FullSizeVideo_Screen::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

// Function FullSizeVideo_Screen.FullSizeVideo_Screen_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct FullSizeVideo_Screen_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FullSizeVideo_Screen_C_PreConstruct) == 0x000001, "Wrong alignment on FullSizeVideo_Screen_C_PreConstruct");
static_assert(sizeof(FullSizeVideo_Screen_C_PreConstruct) == 0x000001, "Wrong size on FullSizeVideo_Screen_C_PreConstruct");
static_assert(offsetof(FullSizeVideo_Screen_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'FullSizeVideo_Screen_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function FullSizeVideo_Screen.FullSizeVideo_Screen_C.Play
// 0x0010 (0x0010 - 0x0000)
struct FullSizeVideo_Screen_C_Play final
{
public:
	const class UBinkMediaSource*                 BinkMediaSource;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InLooping;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FullSizeVideo_Screen_C_Play) == 0x000008, "Wrong alignment on FullSizeVideo_Screen_C_Play");
static_assert(sizeof(FullSizeVideo_Screen_C_Play) == 0x000010, "Wrong size on FullSizeVideo_Screen_C_Play");
static_assert(offsetof(FullSizeVideo_Screen_C_Play, BinkMediaSource) == 0x000000, "Member 'FullSizeVideo_Screen_C_Play::BinkMediaSource' has a wrong offset!");
static_assert(offsetof(FullSizeVideo_Screen_C_Play, InLooping) == 0x000008, "Member 'FullSizeVideo_Screen_C_Play::InLooping' has a wrong offset!");

}

