#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_NPC_Magboots

#include "Basic.hpp"

#include "Keaton_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CAAudio_structs.hpp"


namespace SDK::Params
{

// Function GC_NPC_Magboots.GC_NPC_Magboots_C.OnRemove
// 0x0160 (0x0160 - 0x0000)
struct GC_NPC_Magboots_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x00FC(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	ECANPCType                                    CallFunc_GetNPCType_ReturnValue;                   // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0118(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanNOR_ReturnValue;                   // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x012E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12F[0x1];                                      // 0x012F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x0130(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x0148(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GC_NPC_Magboots_C_OnRemove) == 0x000008, "Wrong alignment on GC_NPC_Magboots_C_OnRemove");
static_assert(sizeof(GC_NPC_Magboots_C_OnRemove) == 0x000160, "Wrong size on GC_NPC_Magboots_C_OnRemove");
static_assert(offsetof(GC_NPC_Magboots_C_OnRemove, MyTarget) == 0x000000, "Member 'GC_NPC_Magboots_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_OnRemove, Parameters) == 0x000008, "Member 'GC_NPC_Magboots_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_OnRemove, ReturnValue) == 0x0000F8, "Member 'GC_NPC_Magboots_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_OnRemove, Temp_delegate_Variable) == 0x0000FC, "Member 'GC_NPC_Magboots_C_OnRemove::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_OnRemove, CallFunc_GetNPCType_ReturnValue) == 0x000110, "Member 'GC_NPC_Magboots_C_OnRemove::CallFunc_GetNPCType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_OnRemove, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000111, "Member 'GC_NPC_Magboots_C_OnRemove::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_OnRemove, CallFunc_PlayEvent_playback_instance) == 0x000118, "Member 'GC_NPC_Magboots_C_OnRemove::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_OnRemove, CallFunc_PlayEvent_play_success) == 0x000128, "Member 'GC_NPC_Magboots_C_OnRemove::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_OnRemove, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000129, "Member 'GC_NPC_Magboots_C_OnRemove::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_OnRemove, CallFunc_BooleanNOR_ReturnValue) == 0x00012A, "Member 'GC_NPC_Magboots_C_OnRemove::CallFunc_BooleanNOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_OnRemove, CallFunc_IsValid_ReturnValue) == 0x00012B, "Member 'GC_NPC_Magboots_C_OnRemove::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_OnRemove, CallFunc_IsValid_ReturnValue_1) == 0x00012C, "Member 'GC_NPC_Magboots_C_OnRemove::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_OnRemove, CallFunc_BooleanAND_ReturnValue) == 0x00012D, "Member 'GC_NPC_Magboots_C_OnRemove::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_OnRemove, CallFunc_IsValid_ReturnValue_2) == 0x00012E, "Member 'GC_NPC_Magboots_C_OnRemove::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_OnRemove, Temp_delegate_Variable_1) == 0x000130, "Member 'GC_NPC_Magboots_C_OnRemove::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_OnRemove, CallFunc_PlayEvent_playback_instance_1) == 0x000148, "Member 'GC_NPC_Magboots_C_OnRemove::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_OnRemove, CallFunc_PlayEvent_play_success_1) == 0x000158, "Member 'GC_NPC_Magboots_C_OnRemove::CallFunc_PlayEvent_play_success_1' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_OnRemove, CallFunc_IsValid_ReturnValue_3) == 0x000159, "Member 'GC_NPC_Magboots_C_OnRemove::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_OnRemove, CallFunc_BooleanAND_ReturnValue_1) == 0x00015A, "Member 'GC_NPC_Magboots_C_OnRemove::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function GC_NPC_Magboots.GC_NPC_Magboots_C.WhileActive
// 0x0198 (0x0198 - 0x0000)
struct GC_NPC_Magboots_C_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_NPC*                       K2Node_DynamicCast_AsCACharacter_NPC;              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECANPCType                                    CallFunc_GetNPCType_ReturnValue;                   // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanNOR_ReturnValue;                   // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPawnMesh_ReturnValue;                  // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPawnMesh_ReturnValue_1;                // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue_1; // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13B[0x1];                                      // 0x013B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x013C(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x0150(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0168(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x0180(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GC_NPC_Magboots_C_WhileActive) == 0x000008, "Wrong alignment on GC_NPC_Magboots_C_WhileActive");
static_assert(sizeof(GC_NPC_Magboots_C_WhileActive) == 0x000198, "Wrong size on GC_NPC_Magboots_C_WhileActive");
static_assert(offsetof(GC_NPC_Magboots_C_WhileActive, MyTarget) == 0x000000, "Member 'GC_NPC_Magboots_C_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_WhileActive, Parameters) == 0x000008, "Member 'GC_NPC_Magboots_C_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_WhileActive, ReturnValue) == 0x0000F8, "Member 'GC_NPC_Magboots_C_WhileActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_WhileActive, K2Node_DynamicCast_AsCACharacter_NPC) == 0x000100, "Member 'GC_NPC_Magboots_C_WhileActive::K2Node_DynamicCast_AsCACharacter_NPC' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_WhileActive, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GC_NPC_Magboots_C_WhileActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_WhileActive, CallFunc_GetNPCType_ReturnValue) == 0x000109, "Member 'GC_NPC_Magboots_C_WhileActive::CallFunc_GetNPCType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_WhileActive, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00010A, "Member 'GC_NPC_Magboots_C_WhileActive::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_WhileActive, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00010B, "Member 'GC_NPC_Magboots_C_WhileActive::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_WhileActive, CallFunc_BooleanNOR_ReturnValue) == 0x00010C, "Member 'GC_NPC_Magboots_C_WhileActive::CallFunc_BooleanNOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_WhileActive, CallFunc_GetPawnMesh_ReturnValue) == 0x000110, "Member 'GC_NPC_Magboots_C_WhileActive::CallFunc_GetPawnMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_WhileActive, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue) == 0x000118, "Member 'GC_NPC_Magboots_C_WhileActive::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_WhileActive, CallFunc_IsValid_ReturnValue) == 0x000120, "Member 'GC_NPC_Magboots_C_WhileActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_WhileActive, CallFunc_GetPawnMesh_ReturnValue_1) == 0x000128, "Member 'GC_NPC_Magboots_C_WhileActive::CallFunc_GetPawnMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_WhileActive, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue_1) == 0x000130, "Member 'GC_NPC_Magboots_C_WhileActive::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_WhileActive, CallFunc_IsValid_ReturnValue_1) == 0x000138, "Member 'GC_NPC_Magboots_C_WhileActive::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_WhileActive, CallFunc_IsValid_ReturnValue_2) == 0x000139, "Member 'GC_NPC_Magboots_C_WhileActive::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_WhileActive, CallFunc_IsActive_ReturnValue) == 0x00013A, "Member 'GC_NPC_Magboots_C_WhileActive::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_WhileActive, Temp_delegate_Variable) == 0x00013C, "Member 'GC_NPC_Magboots_C_WhileActive::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_WhileActive, Temp_delegate_Variable_1) == 0x000150, "Member 'GC_NPC_Magboots_C_WhileActive::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_WhileActive, CallFunc_PlayEvent_playback_instance) == 0x000168, "Member 'GC_NPC_Magboots_C_WhileActive::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_WhileActive, CallFunc_PlayEvent_play_success) == 0x000178, "Member 'GC_NPC_Magboots_C_WhileActive::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_WhileActive, CallFunc_PlayEvent_playback_instance_1) == 0x000180, "Member 'GC_NPC_Magboots_C_WhileActive::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(GC_NPC_Magboots_C_WhileActive, CallFunc_PlayEvent_play_success_1) == 0x000190, "Member 'GC_NPC_Magboots_C_WhileActive::CallFunc_PlayEvent_play_success_1' has a wrong offset!");

}

