#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_NPC_FlashBang

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_NPC_FlashBang.GC_NPC_FlashBang_C
// 0x0020 (0x02E0 - 0x02C0)
class AGC_NPC_FlashBang_C final : public AGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Flashed3PVFX;                                      // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_NPC*                       NPC;                                               // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_NPC_FlashBang(int32 EntryPoint);
	void TPDelayedDialogue();
	void DialogueVoxWhenFlashed();
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_NPC_FlashBang_C">();
	}
	static class AGC_NPC_FlashBang_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_NPC_FlashBang_C>();
	}
};
static_assert(alignof(AGC_NPC_FlashBang_C) == 0x000008, "Wrong alignment on AGC_NPC_FlashBang_C");
static_assert(sizeof(AGC_NPC_FlashBang_C) == 0x0002E0, "Wrong size on AGC_NPC_FlashBang_C");
static_assert(offsetof(AGC_NPC_FlashBang_C, UberGraphFrame) == 0x0002C0, "Member 'AGC_NPC_FlashBang_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_NPC_FlashBang_C, DefaultSceneRoot) == 0x0002C8, "Member 'AGC_NPC_FlashBang_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGC_NPC_FlashBang_C, Flashed3PVFX) == 0x0002D0, "Member 'AGC_NPC_FlashBang_C::Flashed3PVFX' has a wrong offset!");
static_assert(offsetof(AGC_NPC_FlashBang_C, NPC) == 0x0002D8, "Member 'AGC_NPC_FlashBang_C::NPC' has a wrong offset!");

}

