#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Player_FlashBang

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Player_FlashBang.GC_Player_FlashBang_C
// 0x0048 (0x0370 - 0x0328)
class AGC_Player_FlashBang_C final : public ACAGameplayCueActor_Flashbang
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Show_HUD_At_Elapsed_Flash_Time;                    // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_HUD_Visible;                                    // 0x033C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAPlayerController*                    PlayerController;                                  // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Flashed3PVFX;                                      // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                MainPlayer;                                        // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   OnCurseFrustrated;                                 // 0x0358(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasBlockedAim;                                     // 0x0364(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FlashCount;                                        // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_Player_FlashBang(int32 EntryPoint);
	void ReceiveBeginPlay();
	void FPDelayedDialogue();
	void FPDialogueVoxWhenFlashed();
	void TPDelayedDialogue();
	void TPDialogueVoxWhenFlashed();
	void ReceiveTick(float DeltaSeconds);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Player_FlashBang_C">();
	}
	static class AGC_Player_FlashBang_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Player_FlashBang_C>();
	}
};
static_assert(alignof(AGC_Player_FlashBang_C) == 0x000008, "Wrong alignment on AGC_Player_FlashBang_C");
static_assert(sizeof(AGC_Player_FlashBang_C) == 0x000370, "Wrong size on AGC_Player_FlashBang_C");
static_assert(offsetof(AGC_Player_FlashBang_C, UberGraphFrame) == 0x000328, "Member 'AGC_Player_FlashBang_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Player_FlashBang_C, DefaultSceneRoot) == 0x000330, "Member 'AGC_Player_FlashBang_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGC_Player_FlashBang_C, Show_HUD_At_Elapsed_Flash_Time) == 0x000338, "Member 'AGC_Player_FlashBang_C::Show_HUD_At_Elapsed_Flash_Time' has a wrong offset!");
static_assert(offsetof(AGC_Player_FlashBang_C, Is_HUD_Visible) == 0x00033C, "Member 'AGC_Player_FlashBang_C::Is_HUD_Visible' has a wrong offset!");
static_assert(offsetof(AGC_Player_FlashBang_C, PlayerController) == 0x000340, "Member 'AGC_Player_FlashBang_C::PlayerController' has a wrong offset!");
static_assert(offsetof(AGC_Player_FlashBang_C, Flashed3PVFX) == 0x000348, "Member 'AGC_Player_FlashBang_C::Flashed3PVFX' has a wrong offset!");
static_assert(offsetof(AGC_Player_FlashBang_C, MainPlayer) == 0x000350, "Member 'AGC_Player_FlashBang_C::MainPlayer' has a wrong offset!");
static_assert(offsetof(AGC_Player_FlashBang_C, OnCurseFrustrated) == 0x000358, "Member 'AGC_Player_FlashBang_C::OnCurseFrustrated' has a wrong offset!");
static_assert(offsetof(AGC_Player_FlashBang_C, HasBlockedAim) == 0x000364, "Member 'AGC_Player_FlashBang_C::HasBlockedAim' has a wrong offset!");
static_assert(offsetof(AGC_Player_FlashBang_C, FlashCount) == 0x000368, "Member 'AGC_Player_FlashBang_C::FlashCount' has a wrong offset!");

}

