#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Tank_Slam_Begin

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CAAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GC_Tank_Slam_Begin.GC_Tank_Slam_Begin_C.WhileActive
// 0x0270 (0x0270 - 0x0000)
struct GC_Tank_Slam_Begin_C_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_NPC*                       K2Node_DynamicCast_AsCACharacter_NPC;              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPawnMesh_ReturnValue;                  // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0124(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0138(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x014C(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x01DC(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GC_Tank_Slam_Begin_C_WhileActive) == 0x000008, "Wrong alignment on GC_Tank_Slam_Begin_C_WhileActive");
static_assert(sizeof(GC_Tank_Slam_Begin_C_WhileActive) == 0x000270, "Wrong size on GC_Tank_Slam_Begin_C_WhileActive");
static_assert(offsetof(GC_Tank_Slam_Begin_C_WhileActive, MyTarget) == 0x000000, "Member 'GC_Tank_Slam_Begin_C_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Tank_Slam_Begin_C_WhileActive, Parameters) == 0x000008, "Member 'GC_Tank_Slam_Begin_C_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Tank_Slam_Begin_C_WhileActive, ReturnValue) == 0x0000F8, "Member 'GC_Tank_Slam_Begin_C_WhileActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Tank_Slam_Begin_C_WhileActive, K2Node_DynamicCast_AsCACharacter_NPC) == 0x000100, "Member 'GC_Tank_Slam_Begin_C_WhileActive::K2Node_DynamicCast_AsCACharacter_NPC' has a wrong offset!");
static_assert(offsetof(GC_Tank_Slam_Begin_C_WhileActive, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GC_Tank_Slam_Begin_C_WhileActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Tank_Slam_Begin_C_WhileActive, CallFunc_GetPawnMesh_ReturnValue) == 0x000110, "Member 'GC_Tank_Slam_Begin_C_WhileActive::CallFunc_GetPawnMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Tank_Slam_Begin_C_WhileActive, CallFunc_GetSocketLocation_ReturnValue) == 0x000118, "Member 'GC_Tank_Slam_Begin_C_WhileActive::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Tank_Slam_Begin_C_WhileActive, Temp_delegate_Variable) == 0x000124, "Member 'GC_Tank_Slam_Begin_C_WhileActive::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GC_Tank_Slam_Begin_C_WhileActive, CallFunc_PlayEvent_playback_instance) == 0x000138, "Member 'GC_Tank_Slam_Begin_C_WhileActive::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(GC_Tank_Slam_Begin_C_WhileActive, CallFunc_PlayEvent_play_success) == 0x000148, "Member 'GC_Tank_Slam_Begin_C_WhileActive::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(GC_Tank_Slam_Begin_C_WhileActive, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x00014C, "Member 'GC_Tank_Slam_Begin_C_WhileActive::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GC_Tank_Slam_Begin_C_WhileActive, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x0001DC, "Member 'GC_Tank_Slam_Begin_C_WhileActive::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");

// Function GC_Tank_Slam_Begin.GC_Tank_Slam_Begin_C.OnRemove
// 0x0100 (0x0100 - 0x0000)
struct GC_Tank_Slam_Begin_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GC_Tank_Slam_Begin_C_OnRemove) == 0x000008, "Wrong alignment on GC_Tank_Slam_Begin_C_OnRemove");
static_assert(sizeof(GC_Tank_Slam_Begin_C_OnRemove) == 0x000100, "Wrong size on GC_Tank_Slam_Begin_C_OnRemove");
static_assert(offsetof(GC_Tank_Slam_Begin_C_OnRemove, MyTarget) == 0x000000, "Member 'GC_Tank_Slam_Begin_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Tank_Slam_Begin_C_OnRemove, Parameters) == 0x000008, "Member 'GC_Tank_Slam_Begin_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Tank_Slam_Begin_C_OnRemove, ReturnValue) == 0x0000F8, "Member 'GC_Tank_Slam_Begin_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Tank_Slam_Begin_C_OnRemove, CallFunc_IsValid_ReturnValue) == 0x0000F9, "Member 'GC_Tank_Slam_Begin_C_OnRemove::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

