#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Untouchable_Explosion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Untouchable_Explosion.GC_Untouchable_Explosion_C
// 0x0020 (0x02E0 - 0x02C0)
class AGC_Untouchable_Explosion_C final : public AGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Cone;                                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Visible_time;                                      // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_Untouchable_Explosion(int32 EntryPoint);
	void HideAfterTimer();
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Untouchable_Explosion_C">();
	}
	static class AGC_Untouchable_Explosion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Untouchable_Explosion_C>();
	}
};
static_assert(alignof(AGC_Untouchable_Explosion_C) == 0x000008, "Wrong alignment on AGC_Untouchable_Explosion_C");
static_assert(sizeof(AGC_Untouchable_Explosion_C) == 0x0002E0, "Wrong size on AGC_Untouchable_Explosion_C");
static_assert(offsetof(AGC_Untouchable_Explosion_C, UberGraphFrame) == 0x0002C0, "Member 'AGC_Untouchable_Explosion_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Untouchable_Explosion_C, Cone) == 0x0002C8, "Member 'AGC_Untouchable_Explosion_C::Cone' has a wrong offset!");
static_assert(offsetof(AGC_Untouchable_Explosion_C, DefaultSceneRoot) == 0x0002D0, "Member 'AGC_Untouchable_Explosion_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGC_Untouchable_Explosion_C, Visible_time) == 0x0002D8, "Member 'AGC_Untouchable_Explosion_C::Visible_time' has a wrong offset!");

}

