#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_UnstableReaction_Explosion

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Keaton_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GC_UnstableReaction_Explosion.GC_UnstableReaction_Explosion_C.GetRadius
// 0x0014 (0x0014 - 0x0000)
struct GC_UnstableReaction_Explosion_C_GetRadius final
{
public:
	bool                                          IsPlayer;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsEliteNPC;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayerRadius;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EliteNPCRadius;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GeneralNPCRadius;                                  // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_UnstableReaction_Explosion_C_GetRadius) == 0x000004, "Wrong alignment on GC_UnstableReaction_Explosion_C_GetRadius");
static_assert(sizeof(GC_UnstableReaction_Explosion_C_GetRadius) == 0x000014, "Wrong size on GC_UnstableReaction_Explosion_C_GetRadius");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_GetRadius, IsPlayer) == 0x000000, "Member 'GC_UnstableReaction_Explosion_C_GetRadius::IsPlayer' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_GetRadius, IsEliteNPC) == 0x000001, "Member 'GC_UnstableReaction_Explosion_C_GetRadius::IsEliteNPC' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_GetRadius, PlayerRadius) == 0x000004, "Member 'GC_UnstableReaction_Explosion_C_GetRadius::PlayerRadius' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_GetRadius, EliteNPCRadius) == 0x000008, "Member 'GC_UnstableReaction_Explosion_C_GetRadius::EliteNPCRadius' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_GetRadius, GeneralNPCRadius) == 0x00000C, "Member 'GC_UnstableReaction_Explosion_C_GetRadius::GeneralNPCRadius' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_GetRadius, Radius) == 0x000010, "Member 'GC_UnstableReaction_Explosion_C_GetRadius::Radius' has a wrong offset!");

// Function GC_UnstableReaction_Explosion.GC_UnstableReaction_Explosion_C.OnActive
// 0x0100 (0x0100 - 0x0000)
struct GC_UnstableReaction_Explosion_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnActive_ReturnValue;                     // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GC_UnstableReaction_Explosion_C_OnActive) == 0x000008, "Wrong alignment on GC_UnstableReaction_Explosion_C_OnActive");
static_assert(sizeof(GC_UnstableReaction_Explosion_C_OnActive) == 0x000100, "Wrong size on GC_UnstableReaction_Explosion_C_OnActive");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnActive, MyTarget) == 0x000000, "Member 'GC_UnstableReaction_Explosion_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnActive, Parameters) == 0x000008, "Member 'GC_UnstableReaction_Explosion_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnActive, ReturnValue) == 0x0000F8, "Member 'GC_UnstableReaction_Explosion_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnActive, CallFunc_OnActive_ReturnValue) == 0x0000F9, "Member 'GC_UnstableReaction_Explosion_C_OnActive::CallFunc_OnActive_ReturnValue' has a wrong offset!");

// Function GC_UnstableReaction_Explosion.GC_UnstableReaction_Explosion_C.OnExecute
// 0x0308 (0x0308 - 0x0000)
struct GC_UnstableReaction_Explosion_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EffectRadius;                                      // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAFoamActorV2*                         Affected_Foam;                                     // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 InputParameters;                                   // 0x0108(0x00F0)(Edit, BlueprintVisible, ContainsInstancedReference)
	class APawn*                                  CallFunc_GetLocalPlayerPawn_ReturnValue;           // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAFoamActorV2*                         K2Node_DynamicCast_AsCAFoam_Actor_V2;              // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAHUDPerkActivity                     K2Node_MakeStruct_CAHUDPerkActivity;               // 0x0218(0x0014)(NoDestructor)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UCAUIHUDInterface*                CallFunc_GetUIHUDInterface_ReturnValue;            // 0x0230(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23A[0x2];                                      // 0x023A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0248(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0260(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x026C(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0278(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0298(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x02B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x02C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnExecute_ReturnValue;                    // 0x0302(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0303(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GC_UnstableReaction_Explosion_C_OnExecute) == 0x000008, "Wrong alignment on GC_UnstableReaction_Explosion_C_OnExecute");
static_assert(sizeof(GC_UnstableReaction_Explosion_C_OnExecute) == 0x000308, "Wrong size on GC_UnstableReaction_Explosion_C_OnExecute");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, Parameters) == 0x000008, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, ReturnValue) == 0x0000F8, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, EffectRadius) == 0x0000FC, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::EffectRadius' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, Affected_Foam) == 0x000100, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::Affected_Foam' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, InputParameters) == 0x000108, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::InputParameters' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, CallFunc_GetLocalPlayerPawn_ReturnValue) == 0x0001F8, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::CallFunc_GetLocalPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, K2Node_DynamicCast_AsCAFoam_Actor_V2) == 0x000200, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::K2Node_DynamicCast_AsCAFoam_Actor_V2' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x000208, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, CallFunc_MakeLiteralName_ReturnValue) == 0x00020C, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, K2Node_MakeStruct_CAHUDPerkActivity) == 0x000218, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::K2Node_MakeStruct_CAHUDPerkActivity' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, CallFunc_GetUIHUDInterface_ReturnValue) == 0x000230, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::CallFunc_GetUIHUDInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, CallFunc_IsValid_ReturnValue) == 0x000238, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, CallFunc_IsValid_ReturnValue_1) == 0x000239, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x00023C, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000240, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000248, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000260, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x00026C, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000278, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000298, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, CallFunc_BreakGameplayCueParameters_Location) == 0x0002B8, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, CallFunc_BreakGameplayCueParameters_Normal) == 0x0002C4, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0002D0, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0002D8, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0002E0, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0002E8, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0002F0, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0002F4, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0002F8, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000300, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000301, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, CallFunc_OnExecute_ReturnValue) == 0x000302, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::CallFunc_OnExecute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_UnstableReaction_Explosion_C_OnExecute, CallFunc_IsValid_ReturnValue_2) == 0x000303, "Member 'GC_UnstableReaction_Explosion_C_OnExecute::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

}

