#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Untouchable_Explosion

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CAAudio_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GC_Untouchable_Explosion.GC_Untouchable_Explosion_C.ExecuteUbergraph_GC_Untouchable_Explosion
// 0x0004 (0x0004 - 0x0000)
struct GC_Untouchable_Explosion_C_ExecuteUbergraph_GC_Untouchable_Explosion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Untouchable_Explosion_C_ExecuteUbergraph_GC_Untouchable_Explosion) == 0x000004, "Wrong alignment on GC_Untouchable_Explosion_C_ExecuteUbergraph_GC_Untouchable_Explosion");
static_assert(sizeof(GC_Untouchable_Explosion_C_ExecuteUbergraph_GC_Untouchable_Explosion) == 0x000004, "Wrong size on GC_Untouchable_Explosion_C_ExecuteUbergraph_GC_Untouchable_Explosion");
static_assert(offsetof(GC_Untouchable_Explosion_C_ExecuteUbergraph_GC_Untouchable_Explosion, EntryPoint) == 0x000000, "Member 'GC_Untouchable_Explosion_C_ExecuteUbergraph_GC_Untouchable_Explosion::EntryPoint' has a wrong offset!");

// Function GC_Untouchable_Explosion.GC_Untouchable_Explosion_C.OnActive
// 0x0308 (0x0308 - 0x0000)
struct GC_Untouchable_Explosion_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x00FC(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0118(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0130(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x013C(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0148(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0168(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorEyesViewPoint_OutLocation;        // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetActorEyesViewPoint_OutRotation;        // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_212[0x6];                                      // 0x0212(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0218(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeingViewed_ReturnValue;                // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22A[0x2];                                      // 0x022A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x022C(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x02C0(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x02D8(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x02EC(0x0014)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0300(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Untouchable_Explosion_C_OnActive) == 0x000008, "Wrong alignment on GC_Untouchable_Explosion_C_OnActive");
static_assert(sizeof(GC_Untouchable_Explosion_C_OnActive) == 0x000308, "Wrong size on GC_Untouchable_Explosion_C_OnActive");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, MyTarget) == 0x000000, "Member 'GC_Untouchable_Explosion_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, Parameters) == 0x000008, "Member 'GC_Untouchable_Explosion_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, ReturnValue) == 0x0000F8, "Member 'GC_Untouchable_Explosion_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, Temp_delegate_Variable) == 0x0000FC, "Member 'GC_Untouchable_Explosion_C_OnActive::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000110, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000114, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000118, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000130, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x00013C, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000148, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000168, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_BreakGameplayCueParameters_Location) == 0x000188, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_BreakGameplayCueParameters_Normal) == 0x000194, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0001A0, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001A8, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001B0, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001B8, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001C0, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001C4, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001C8, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001D0, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_GetActorEyesViewPoint_OutLocation) == 0x0001D4, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_GetActorEyesViewPoint_OutLocation' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_GetActorEyesViewPoint_OutRotation) == 0x0001E0, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_GetActorEyesViewPoint_OutRotation' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_GetForwardVector_ReturnValue) == 0x0001EC, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_IsValid_ReturnValue) == 0x0001F8, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0001FC, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x000208, "Member 'GC_Untouchable_Explosion_C_OnActive::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, K2Node_DynamicCast_bSuccess) == 0x000210, "Member 'GC_Untouchable_Explosion_C_OnActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000211, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_PlayEvent_playback_instance) == 0x000218, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_PlayEvent_play_success) == 0x000228, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_IsBeingViewed_ReturnValue) == 0x000229, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_IsBeingViewed_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x00022C, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0002BC, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, Temp_delegate_Variable_1) == 0x0002C0, "Member 'GC_Untouchable_Explosion_C_OnActive::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_PlayEvent_playback_instance_1) == 0x0002D8, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_PlayEvent_play_success_1) == 0x0002E8, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_PlayEvent_play_success_1' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, K2Node_CreateDelegate_OutputDelegate) == 0x0002EC, "Member 'GC_Untouchable_Explosion_C_OnActive::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GC_Untouchable_Explosion_C_OnActive, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000300, "Member 'GC_Untouchable_Explosion_C_OnActive::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

}

