#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCA_TeamOffensiveGadget_1P_Loading

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCA_TeamOffensiveGadget_1P_Loading.GCA_TeamOffensiveGadget_1P_Loading_C
// 0x0028 (0x02E8 - 0x02C0)
class AGCA_TeamOffensiveGadget_1P_Loading_C final : public AGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      ParticleSystem;                                    // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         NiagaraTemplate;                                   // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                Player;                                            // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCA_TeamOffensiveGadget_1P_Loading(int32 EntryPoint);
	void ReceiveDestroyed();
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCA_TeamOffensiveGadget_1P_Loading_C">();
	}
	static class AGCA_TeamOffensiveGadget_1P_Loading_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCA_TeamOffensiveGadget_1P_Loading_C>();
	}
};
static_assert(alignof(AGCA_TeamOffensiveGadget_1P_Loading_C) == 0x000008, "Wrong alignment on AGCA_TeamOffensiveGadget_1P_Loading_C");
static_assert(sizeof(AGCA_TeamOffensiveGadget_1P_Loading_C) == 0x0002E8, "Wrong size on AGCA_TeamOffensiveGadget_1P_Loading_C");
static_assert(offsetof(AGCA_TeamOffensiveGadget_1P_Loading_C, UberGraphFrame) == 0x0002C0, "Member 'AGCA_TeamOffensiveGadget_1P_Loading_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCA_TeamOffensiveGadget_1P_Loading_C, DefaultSceneRoot) == 0x0002C8, "Member 'AGCA_TeamOffensiveGadget_1P_Loading_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGCA_TeamOffensiveGadget_1P_Loading_C, ParticleSystem) == 0x0002D0, "Member 'AGCA_TeamOffensiveGadget_1P_Loading_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(AGCA_TeamOffensiveGadget_1P_Loading_C, NiagaraTemplate) == 0x0002D8, "Member 'AGCA_TeamOffensiveGadget_1P_Loading_C::NiagaraTemplate' has a wrong offset!");
static_assert(offsetof(AGCA_TeamOffensiveGadget_1P_Loading_C, Player) == 0x0002E0, "Member 'AGCA_TeamOffensiveGadget_1P_Loading_C::Player' has a wrong offset!");

}

