#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCA_TeamOffensiveGadget_1P_Loading

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CAAudio_structs.hpp"


namespace SDK::Params
{

// Function GCA_TeamOffensiveGadget_1P_Loading.GCA_TeamOffensiveGadget_1P_Loading_C.ExecuteUbergraph_GCA_TeamOffensiveGadget_1P_Loading
// 0x0008 (0x0008 - 0x0000)
struct GCA_TeamOffensiveGadget_1P_Loading_C_ExecuteUbergraph_GCA_TeamOffensiveGadget_1P_Loading final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCA_TeamOffensiveGadget_1P_Loading_C_ExecuteUbergraph_GCA_TeamOffensiveGadget_1P_Loading) == 0x000004, "Wrong alignment on GCA_TeamOffensiveGadget_1P_Loading_C_ExecuteUbergraph_GCA_TeamOffensiveGadget_1P_Loading");
static_assert(sizeof(GCA_TeamOffensiveGadget_1P_Loading_C_ExecuteUbergraph_GCA_TeamOffensiveGadget_1P_Loading) == 0x000008, "Wrong size on GCA_TeamOffensiveGadget_1P_Loading_C_ExecuteUbergraph_GCA_TeamOffensiveGadget_1P_Loading");
static_assert(offsetof(GCA_TeamOffensiveGadget_1P_Loading_C_ExecuteUbergraph_GCA_TeamOffensiveGadget_1P_Loading, EntryPoint) == 0x000000, "Member 'GCA_TeamOffensiveGadget_1P_Loading_C_ExecuteUbergraph_GCA_TeamOffensiveGadget_1P_Loading::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCA_TeamOffensiveGadget_1P_Loading_C_ExecuteUbergraph_GCA_TeamOffensiveGadget_1P_Loading, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'GCA_TeamOffensiveGadget_1P_Loading_C_ExecuteUbergraph_GCA_TeamOffensiveGadget_1P_Loading::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_TeamOffensiveGadget_1P_Loading_C_ExecuteUbergraph_GCA_TeamOffensiveGadget_1P_Loading, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'GCA_TeamOffensiveGadget_1P_Loading_C_ExecuteUbergraph_GCA_TeamOffensiveGadget_1P_Loading::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function GCA_TeamOffensiveGadget_1P_Loading.GCA_TeamOffensiveGadget_1P_Loading_C.OnActive
// 0x0140 (0x0140 - 0x0000)
struct GCA_TeamOffensiveGadget_1P_Loading_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeingViewed_ReturnValue;                // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10B[0x1];                                      // 0x010B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x010C(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0120(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCA_TeamOffensiveGadget_1P_Loading_C_OnActive) == 0x000008, "Wrong alignment on GCA_TeamOffensiveGadget_1P_Loading_C_OnActive");
static_assert(sizeof(GCA_TeamOffensiveGadget_1P_Loading_C_OnActive) == 0x000140, "Wrong size on GCA_TeamOffensiveGadget_1P_Loading_C_OnActive");
static_assert(offsetof(GCA_TeamOffensiveGadget_1P_Loading_C_OnActive, MyTarget) == 0x000000, "Member 'GCA_TeamOffensiveGadget_1P_Loading_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCA_TeamOffensiveGadget_1P_Loading_C_OnActive, Parameters) == 0x000008, "Member 'GCA_TeamOffensiveGadget_1P_Loading_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCA_TeamOffensiveGadget_1P_Loading_C_OnActive, ReturnValue) == 0x0000F8, "Member 'GCA_TeamOffensiveGadget_1P_Loading_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_TeamOffensiveGadget_1P_Loading_C_OnActive, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x000100, "Member 'GCA_TeamOffensiveGadget_1P_Loading_C_OnActive::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(GCA_TeamOffensiveGadget_1P_Loading_C_OnActive, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GCA_TeamOffensiveGadget_1P_Loading_C_OnActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCA_TeamOffensiveGadget_1P_Loading_C_OnActive, CallFunc_IsValid_ReturnValue) == 0x000109, "Member 'GCA_TeamOffensiveGadget_1P_Loading_C_OnActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_TeamOffensiveGadget_1P_Loading_C_OnActive, CallFunc_IsBeingViewed_ReturnValue) == 0x00010A, "Member 'GCA_TeamOffensiveGadget_1P_Loading_C_OnActive::CallFunc_IsBeingViewed_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_TeamOffensiveGadget_1P_Loading_C_OnActive, Temp_delegate_Variable) == 0x00010C, "Member 'GCA_TeamOffensiveGadget_1P_Loading_C_OnActive::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GCA_TeamOffensiveGadget_1P_Loading_C_OnActive, CallFunc_PlayEvent_playback_instance) == 0x000120, "Member 'GCA_TeamOffensiveGadget_1P_Loading_C_OnActive::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(GCA_TeamOffensiveGadget_1P_Loading_C_OnActive, CallFunc_PlayEvent_play_success) == 0x000130, "Member 'GCA_TeamOffensiveGadget_1P_Loading_C_OnActive::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(GCA_TeamOffensiveGadget_1P_Loading_C_OnActive, CallFunc_IsValid_ReturnValue_1) == 0x000131, "Member 'GCA_TeamOffensiveGadget_1P_Loading_C_OnActive::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCA_TeamOffensiveGadget_1P_Loading_C_OnActive, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue) == 0x000138, "Member 'GCA_TeamOffensiveGadget_1P_Loading_C_OnActive::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue' has a wrong offset!");

// Function GCA_TeamOffensiveGadget_1P_Loading.GCA_TeamOffensiveGadget_1P_Loading_C.OnRemove
// 0x0130 (0x0130 - 0x0000)
struct GCA_TeamOffensiveGadget_1P_Loading_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x00FC(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0118(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCA_TeamOffensiveGadget_1P_Loading_C_OnRemove) == 0x000008, "Wrong alignment on GCA_TeamOffensiveGadget_1P_Loading_C_OnRemove");
static_assert(sizeof(GCA_TeamOffensiveGadget_1P_Loading_C_OnRemove) == 0x000130, "Wrong size on GCA_TeamOffensiveGadget_1P_Loading_C_OnRemove");
static_assert(offsetof(GCA_TeamOffensiveGadget_1P_Loading_C_OnRemove, MyTarget) == 0x000000, "Member 'GCA_TeamOffensiveGadget_1P_Loading_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GCA_TeamOffensiveGadget_1P_Loading_C_OnRemove, Parameters) == 0x000008, "Member 'GCA_TeamOffensiveGadget_1P_Loading_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GCA_TeamOffensiveGadget_1P_Loading_C_OnRemove, ReturnValue) == 0x0000F8, "Member 'GCA_TeamOffensiveGadget_1P_Loading_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_TeamOffensiveGadget_1P_Loading_C_OnRemove, Temp_delegate_Variable) == 0x0000FC, "Member 'GCA_TeamOffensiveGadget_1P_Loading_C_OnRemove::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GCA_TeamOffensiveGadget_1P_Loading_C_OnRemove, CallFunc_IsValid_ReturnValue) == 0x000110, "Member 'GCA_TeamOffensiveGadget_1P_Loading_C_OnRemove::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_TeamOffensiveGadget_1P_Loading_C_OnRemove, CallFunc_PlayEvent_playback_instance) == 0x000118, "Member 'GCA_TeamOffensiveGadget_1P_Loading_C_OnRemove::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(GCA_TeamOffensiveGadget_1P_Loading_C_OnRemove, CallFunc_PlayEvent_play_success) == 0x000128, "Member 'GCA_TeamOffensiveGadget_1P_Loading_C_OnRemove::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(GCA_TeamOffensiveGadget_1P_Loading_C_OnRemove, CallFunc_IsValid_ReturnValue_1) == 0x000129, "Member 'GCA_TeamOffensiveGadget_1P_Loading_C_OnRemove::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

