#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCA_VIPClub

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CAAudio_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCA_VIPClub.GCA_VIPClub_C
// 0x0020 (0x02E0 - 0x02C0)
class AGCA_VIPClub_C final : public AGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               AUDIO_TP_CrownInstance;                            // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GCA_VIPClub(int32 EntryPoint);
	void ReceiveBeginPlay();
	bool WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCA_VIPClub_C">();
	}
	static class AGCA_VIPClub_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCA_VIPClub_C>();
	}
};
static_assert(alignof(AGCA_VIPClub_C) == 0x000008, "Wrong alignment on AGCA_VIPClub_C");
static_assert(sizeof(AGCA_VIPClub_C) == 0x0002E0, "Wrong size on AGCA_VIPClub_C");
static_assert(offsetof(AGCA_VIPClub_C, UberGraphFrame) == 0x0002C0, "Member 'AGCA_VIPClub_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCA_VIPClub_C, DefaultSceneRoot) == 0x0002C8, "Member 'AGCA_VIPClub_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGCA_VIPClub_C, AUDIO_TP_CrownInstance) == 0x0002D0, "Member 'AGCA_VIPClub_C::AUDIO_TP_CrownInstance' has a wrong offset!");

}

