#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCA_GenericTeleportOut

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CAAudio_structs.hpp"


namespace SDK::Params
{

// Function GCA_GenericTeleportOut.GCA_GenericTeleportOut_C.OnRemove
// 0x0130 (0x0130 - 0x0000)
struct GCA_GenericTeleportOut_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_NPC*                       L_NPC_Character;                                   // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      K2Node_DynamicCast_AsNiagara_Particle_System;      // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCA_GenericTeleportOut_C_OnRemove) == 0x000008, "Wrong alignment on GCA_GenericTeleportOut_C_OnRemove");
static_assert(sizeof(GCA_GenericTeleportOut_C_OnRemove) == 0x000130, "Wrong size on GCA_GenericTeleportOut_C_OnRemove");
static_assert(offsetof(GCA_GenericTeleportOut_C_OnRemove, MyTarget) == 0x000000, "Member 'GCA_GenericTeleportOut_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_OnRemove, Parameters) == 0x000008, "Member 'GCA_GenericTeleportOut_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_OnRemove, ReturnValue) == 0x0000F8, "Member 'GCA_GenericTeleportOut_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_OnRemove, L_NPC_Character) == 0x000100, "Member 'GCA_GenericTeleportOut_C_OnRemove::L_NPC_Character' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_OnRemove, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000108, "Member 'GCA_GenericTeleportOut_C_OnRemove::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_OnRemove, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000110, "Member 'GCA_GenericTeleportOut_C_OnRemove::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_OnRemove, CallFunc_Not_PreBool_ReturnValue) == 0x000118, "Member 'GCA_GenericTeleportOut_C_OnRemove::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_OnRemove, K2Node_DynamicCast_AsNiagara_Particle_System) == 0x000120, "Member 'GCA_GenericTeleportOut_C_OnRemove::K2Node_DynamicCast_AsNiagara_Particle_System' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_OnRemove, K2Node_DynamicCast_bSuccess) == 0x000128, "Member 'GCA_GenericTeleportOut_C_OnRemove::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GCA_GenericTeleportOut.GCA_GenericTeleportOut_C.WhileActive
// 0x0258 (0x0258 - 0x0000)
struct GCA_GenericTeleportOut_C_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Duration;                                          // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0108(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0120(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x012C(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0138(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0158(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerTimeSeconds_ReturnValue;         // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNiagaraComponent>       CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x01E0(0x0030)(InstancedReference, UObjectWrapper, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_216[0x2];                                      // 0x0216(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0228(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0240(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCA_GenericTeleportOut_C_WhileActive) == 0x000008, "Wrong alignment on GCA_GenericTeleportOut_C_WhileActive");
static_assert(sizeof(GCA_GenericTeleportOut_C_WhileActive) == 0x000258, "Wrong size on GCA_GenericTeleportOut_C_WhileActive");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, MyTarget) == 0x000000, "Member 'GCA_GenericTeleportOut_C_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, Parameters) == 0x000008, "Member 'GCA_GenericTeleportOut_C_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, ReturnValue) == 0x0000F8, "Member 'GCA_GenericTeleportOut_C_WhileActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, Duration) == 0x0000FC, "Member 'GCA_GenericTeleportOut_C_WhileActive::Duration' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000100, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000104, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000108, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000120, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x00012C, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000138, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000158, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_BreakGameplayCueParameters_Location) == 0x000178, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_BreakGameplayCueParameters_Normal) == 0x000184, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000190, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000198, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001A0, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001A8, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001B0, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001B4, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001B8, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001C0, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0001C8, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue) == 0x0001D0, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_GetServerTimeSeconds_ReturnValue) == 0x0001D8, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_GetServerTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x0001E0, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000210, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_IsValid_ReturnValue) == 0x000214, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x000215, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_GetFloatAttribute_ReturnValue) == 0x000218, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_FClamp_ReturnValue) == 0x00021C, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000220, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_IsValid_ReturnValue_1) == 0x000224, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, Temp_delegate_Variable) == 0x000228, "Member 'GCA_GenericTeleportOut_C_WhileActive::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_PlayEvent_playback_instance) == 0x000240, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(GCA_GenericTeleportOut_C_WhileActive, CallFunc_PlayEvent_play_success) == 0x000250, "Member 'GCA_GenericTeleportOut_C_WhileActive::CallFunc_PlayEvent_play_success' has a wrong offset!");

}

