#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCA_Slow

#include "Basic.hpp"

#include "CAAudio_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GCA_Slow.GCA_Slow_C.ExecuteUbergraph_GCA_Slow
// 0x0050 (0x0050 - 0x0000)
struct GCA_Slow_C_ExecuteUbergraph_GCA_Slow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             Temp_delegate_Variable;                            // 0x0008(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0014)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCA_Slow_C_ExecuteUbergraph_GCA_Slow) == 0x000008, "Wrong alignment on GCA_Slow_C_ExecuteUbergraph_GCA_Slow");
static_assert(sizeof(GCA_Slow_C_ExecuteUbergraph_GCA_Slow) == 0x000050, "Wrong size on GCA_Slow_C_ExecuteUbergraph_GCA_Slow");
static_assert(offsetof(GCA_Slow_C_ExecuteUbergraph_GCA_Slow, EntryPoint) == 0x000000, "Member 'GCA_Slow_C_ExecuteUbergraph_GCA_Slow::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCA_Slow_C_ExecuteUbergraph_GCA_Slow, CallFunc_RandomBool_ReturnValue) == 0x000004, "Member 'GCA_Slow_C_ExecuteUbergraph_GCA_Slow::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Slow_C_ExecuteUbergraph_GCA_Slow, Temp_delegate_Variable) == 0x000008, "Member 'GCA_Slow_C_ExecuteUbergraph_GCA_Slow::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GCA_Slow_C_ExecuteUbergraph_GCA_Slow, K2Node_CustomEvent_Actor) == 0x000020, "Member 'GCA_Slow_C_ExecuteUbergraph_GCA_Slow::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(GCA_Slow_C_ExecuteUbergraph_GCA_Slow, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x000028, "Member 'GCA_Slow_C_ExecuteUbergraph_GCA_Slow::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(GCA_Slow_C_ExecuteUbergraph_GCA_Slow, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'GCA_Slow_C_ExecuteUbergraph_GCA_Slow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCA_Slow_C_ExecuteUbergraph_GCA_Slow, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'GCA_Slow_C_ExecuteUbergraph_GCA_Slow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCA_Slow_C_ExecuteUbergraph_GCA_Slow, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000048, "Member 'GCA_Slow_C_ExecuteUbergraph_GCA_Slow::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function GCA_Slow.GCA_Slow_C.TPDialogueTrigger
// 0x0008 (0x0008 - 0x0000)
struct GCA_Slow_C_TPDialogueTrigger final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCA_Slow_C_TPDialogueTrigger) == 0x000008, "Wrong alignment on GCA_Slow_C_TPDialogueTrigger");
static_assert(sizeof(GCA_Slow_C_TPDialogueTrigger) == 0x000008, "Wrong size on GCA_Slow_C_TPDialogueTrigger");
static_assert(offsetof(GCA_Slow_C_TPDialogueTrigger, Actor) == 0x000000, "Member 'GCA_Slow_C_TPDialogueTrigger::Actor' has a wrong offset!");

// Function GCA_Slow.GCA_Slow_C.OnRemove
// 0x0100 (0x0100 - 0x0000)
struct GCA_Slow_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnRemove_ReturnValue;                     // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCA_Slow_C_OnRemove) == 0x000008, "Wrong alignment on GCA_Slow_C_OnRemove");
static_assert(sizeof(GCA_Slow_C_OnRemove) == 0x000100, "Wrong size on GCA_Slow_C_OnRemove");
static_assert(offsetof(GCA_Slow_C_OnRemove, MyTarget) == 0x000000, "Member 'GCA_Slow_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GCA_Slow_C_OnRemove, Parameters) == 0x000008, "Member 'GCA_Slow_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GCA_Slow_C_OnRemove, ReturnValue) == 0x0000F8, "Member 'GCA_Slow_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Slow_C_OnRemove, CallFunc_OnRemove_ReturnValue) == 0x0000F9, "Member 'GCA_Slow_C_OnRemove::CallFunc_OnRemove_ReturnValue' has a wrong offset!");

// Function GCA_Slow.GCA_Slow_C.WhileActive
// 0x0110 (0x0110 - 0x0000)
struct GCA_Slow_C_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFirstPerson_ReturnValue;                // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCA_Slow_C_WhileActive) == 0x000008, "Wrong alignment on GCA_Slow_C_WhileActive");
static_assert(sizeof(GCA_Slow_C_WhileActive) == 0x000110, "Wrong size on GCA_Slow_C_WhileActive");
static_assert(offsetof(GCA_Slow_C_WhileActive, MyTarget) == 0x000000, "Member 'GCA_Slow_C_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCA_Slow_C_WhileActive, Parameters) == 0x000008, "Member 'GCA_Slow_C_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCA_Slow_C_WhileActive, ReturnValue) == 0x0000F8, "Member 'GCA_Slow_C_WhileActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Slow_C_WhileActive, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x000100, "Member 'GCA_Slow_C_WhileActive::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(GCA_Slow_C_WhileActive, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GCA_Slow_C_WhileActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCA_Slow_C_WhileActive, CallFunc_IsValid_ReturnValue) == 0x000109, "Member 'GCA_Slow_C_WhileActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Slow_C_WhileActive, CallFunc_IsFirstPerson_ReturnValue) == 0x00010A, "Member 'GCA_Slow_C_WhileActive::CallFunc_IsFirstPerson_ReturnValue' has a wrong offset!");

// Function GCA_Slow.GCA_Slow_C.CleanupPreviousEffects
// 0x0001 (0x0001 - 0x0000)
struct GCA_Slow_C_CleanupPreviousEffects final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCA_Slow_C_CleanupPreviousEffects) == 0x000001, "Wrong alignment on GCA_Slow_C_CleanupPreviousEffects");
static_assert(sizeof(GCA_Slow_C_CleanupPreviousEffects) == 0x000001, "Wrong size on GCA_Slow_C_CleanupPreviousEffects");
static_assert(offsetof(GCA_Slow_C_CleanupPreviousEffects, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'GCA_Slow_C_CleanupPreviousEffects::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GCA_Slow.GCA_Slow_C.CreateTPCue
// 0x0048 (0x0048 - 0x0000)
struct GCA_Slow_C_CreateTPCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0018(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0030(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCA_Slow_C_CreateTPCue) == 0x000008, "Wrong alignment on GCA_Slow_C_CreateTPCue");
static_assert(sizeof(GCA_Slow_C_CreateTPCue) == 0x000048, "Wrong size on GCA_Slow_C_CreateTPCue");
static_assert(offsetof(GCA_Slow_C_CreateTPCue, MyTarget) == 0x000000, "Member 'GCA_Slow_C_CreateTPCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GCA_Slow_C_CreateTPCue, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'GCA_Slow_C_CreateTPCue::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Slow_C_CreateTPCue, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue) == 0x000010, "Member 'GCA_Slow_C_CreateTPCue::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Slow_C_CreateTPCue, Temp_delegate_Variable) == 0x000018, "Member 'GCA_Slow_C_CreateTPCue::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GCA_Slow_C_CreateTPCue, CallFunc_PlayEvent_playback_instance) == 0x000030, "Member 'GCA_Slow_C_CreateTPCue::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(GCA_Slow_C_CreateTPCue, CallFunc_PlayEvent_play_success) == 0x000040, "Member 'GCA_Slow_C_CreateTPCue::CallFunc_PlayEvent_play_success' has a wrong offset!");

}

