#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCA_ArmourRestore

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CAAudio_structs.hpp"


namespace SDK::Params
{

// Function GCA_ArmourRestore.GCA_ArmourRestore_C.ExecuteUbergraph_GCA_ArmourRestore
// 0x0030 (0x0030 - 0x0000)
struct GCA_ArmourRestore_C_ExecuteUbergraph_GCA_ArmourRestore final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Player;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class BP_PostProcess_Armour_Pickup::ABP_PostProcess_Armour_Pickup_C* CallFunc_SpawnCAAttachedEffect_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCA_ArmourRestore_C_ExecuteUbergraph_GCA_ArmourRestore) == 0x000008, "Wrong alignment on GCA_ArmourRestore_C_ExecuteUbergraph_GCA_ArmourRestore");
static_assert(sizeof(GCA_ArmourRestore_C_ExecuteUbergraph_GCA_ArmourRestore) == 0x000030, "Wrong size on GCA_ArmourRestore_C_ExecuteUbergraph_GCA_ArmourRestore");
static_assert(offsetof(GCA_ArmourRestore_C_ExecuteUbergraph_GCA_ArmourRestore, EntryPoint) == 0x000000, "Member 'GCA_ArmourRestore_C_ExecuteUbergraph_GCA_ArmourRestore::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCA_ArmourRestore_C_ExecuteUbergraph_GCA_ArmourRestore, K2Node_CustomEvent_Player) == 0x000008, "Member 'GCA_ArmourRestore_C_ExecuteUbergraph_GCA_ArmourRestore::K2Node_CustomEvent_Player' has a wrong offset!");
static_assert(offsetof(GCA_ArmourRestore_C_ExecuteUbergraph_GCA_ArmourRestore, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000010, "Member 'GCA_ArmourRestore_C_ExecuteUbergraph_GCA_ArmourRestore::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_ArmourRestore_C_ExecuteUbergraph_GCA_ArmourRestore, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x000018, "Member 'GCA_ArmourRestore_C_ExecuteUbergraph_GCA_ArmourRestore::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(GCA_ArmourRestore_C_ExecuteUbergraph_GCA_ArmourRestore, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'GCA_ArmourRestore_C_ExecuteUbergraph_GCA_ArmourRestore::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCA_ArmourRestore_C_ExecuteUbergraph_GCA_ArmourRestore, CallFunc_SpawnCAAttachedEffect_ReturnValue) == 0x000028, "Member 'GCA_ArmourRestore_C_ExecuteUbergraph_GCA_ArmourRestore::CallFunc_SpawnCAAttachedEffect_ReturnValue' has a wrong offset!");

// Function GCA_ArmourRestore.GCA_ArmourRestore_C.TriggerPostProcess
// 0x0008 (0x0008 - 0x0000)
struct GCA_ArmourRestore_C_TriggerPostProcess final
{
public:
	class AActor*                                 Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCA_ArmourRestore_C_TriggerPostProcess) == 0x000008, "Wrong alignment on GCA_ArmourRestore_C_TriggerPostProcess");
static_assert(sizeof(GCA_ArmourRestore_C_TriggerPostProcess) == 0x000008, "Wrong size on GCA_ArmourRestore_C_TriggerPostProcess");
static_assert(offsetof(GCA_ArmourRestore_C_TriggerPostProcess, Player) == 0x000000, "Member 'GCA_ArmourRestore_C_TriggerPostProcess::Player' has a wrong offset!");

// Function GCA_ArmourRestore.GCA_ArmourRestore_C.OnActive
// 0x0180 (0x0180 - 0x0000)
struct GCA_ArmourRestore_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter*                           K2Node_DynamicCast_AsCACharacter;                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeingViewed_ReturnValue;                // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11B[0x5];                                      // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue_1; // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0128(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x013C(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0150(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x0168(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCA_ArmourRestore_C_OnActive) == 0x000008, "Wrong alignment on GCA_ArmourRestore_C_OnActive");
static_assert(sizeof(GCA_ArmourRestore_C_OnActive) == 0x000180, "Wrong size on GCA_ArmourRestore_C_OnActive");
static_assert(offsetof(GCA_ArmourRestore_C_OnActive, MyTarget) == 0x000000, "Member 'GCA_ArmourRestore_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCA_ArmourRestore_C_OnActive, Parameters) == 0x000008, "Member 'GCA_ArmourRestore_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCA_ArmourRestore_C_OnActive, ReturnValue) == 0x0000F8, "Member 'GCA_ArmourRestore_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_ArmourRestore_C_OnActive, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000100, "Member 'GCA_ArmourRestore_C_OnActive::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_ArmourRestore_C_OnActive, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue) == 0x000108, "Member 'GCA_ArmourRestore_C_OnActive::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_ArmourRestore_C_OnActive, K2Node_DynamicCast_AsCACharacter) == 0x000110, "Member 'GCA_ArmourRestore_C_OnActive::K2Node_DynamicCast_AsCACharacter' has a wrong offset!");
static_assert(offsetof(GCA_ArmourRestore_C_OnActive, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'GCA_ArmourRestore_C_OnActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCA_ArmourRestore_C_OnActive, CallFunc_IsValid_ReturnValue) == 0x000119, "Member 'GCA_ArmourRestore_C_OnActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_ArmourRestore_C_OnActive, CallFunc_IsBeingViewed_ReturnValue) == 0x00011A, "Member 'GCA_ArmourRestore_C_OnActive::CallFunc_IsBeingViewed_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_ArmourRestore_C_OnActive, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue_1) == 0x000120, "Member 'GCA_ArmourRestore_C_OnActive::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCA_ArmourRestore_C_OnActive, Temp_delegate_Variable) == 0x000128, "Member 'GCA_ArmourRestore_C_OnActive::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GCA_ArmourRestore_C_OnActive, Temp_delegate_Variable_1) == 0x00013C, "Member 'GCA_ArmourRestore_C_OnActive::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(GCA_ArmourRestore_C_OnActive, CallFunc_PlayEvent_playback_instance) == 0x000150, "Member 'GCA_ArmourRestore_C_OnActive::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(GCA_ArmourRestore_C_OnActive, CallFunc_PlayEvent_play_success) == 0x000160, "Member 'GCA_ArmourRestore_C_OnActive::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(GCA_ArmourRestore_C_OnActive, CallFunc_PlayEvent_playback_instance_1) == 0x000168, "Member 'GCA_ArmourRestore_C_OnActive::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(GCA_ArmourRestore_C_OnActive, CallFunc_PlayEvent_play_success_1) == 0x000178, "Member 'GCA_ArmourRestore_C_OnActive::CallFunc_PlayEvent_play_success_1' has a wrong offset!");

}

