#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCA_TeleportIn

#include "Basic.hpp"

#include "Keaton_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CAAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GCA_TeleportIn.GCA_TeleportIn_C.ExecuteUbergraph_GCA_TeleportIn
// 0x0118 (0x0118 - 0x0000)
struct GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0004(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	ECANPCType                                    Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0014)(ZeroConstructor, NoDestructor)
	struct FCAAudioEventType                      Temp_struct_Variable;                              // 0x0030(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioEventType                      Temp_struct_Variable_1;                            // 0x0034(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioEventType                      Temp_struct_Variable_2;                            // 0x0038(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioEventType                      Temp_struct_Variable_3;                            // 0x003C(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioEventType                      Temp_struct_Variable_4;                            // 0x0040(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioEventType                      Temp_struct_Variable_5;                            // 0x0044(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioEventType                      Temp_struct_Variable_6;                            // 0x0048(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioEventType                      Temp_struct_Variable_7;                            // 0x004C(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioEventType                      Temp_struct_Variable_8;                            // 0x0050(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioEventType                      Temp_struct_Variable_9;                            // 0x0054(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioEventType                      Temp_struct_Variable_10;                           // 0x0058(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioEventType                      Temp_struct_Variable_11;                           // 0x005C(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioEventType                      Temp_struct_Variable_12;                           // 0x0060(0x0004)(ConstParm, NoDestructor)
	ECANPCType                                    Temp_byte_Variable_1;                              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioEventType                      Temp_struct_Variable_13;                           // 0x0068(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioEventType                      Temp_struct_Variable_14;                           // 0x006C(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioEventType                      Temp_struct_Variable_15;                           // 0x0070(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioEventType                      Temp_struct_Variable_16;                           // 0x0074(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioEventType                      Temp_struct_Variable_17;                           // 0x0078(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioEventType                      Temp_struct_Variable_18;                           // 0x007C(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioEventType                      Temp_struct_Variable_19;                           // 0x0080(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioEventType                      Temp_struct_Variable_20;                           // 0x0084(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioEventType                      Temp_struct_Variable_21;                           // 0x0088(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioEventType                      Temp_struct_Variable_22;                           // 0x008C(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioEventType                      Temp_struct_Variable_23;                           // 0x0090(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioEventType                      Temp_struct_Variable_24;                           // 0x0094(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioEventType                      Temp_struct_Variable_25;                           // 0x0098(0x0004)(ConstParm, NoDestructor)
	ECANPCType                                    K2Node_CustomEvent_NPCType;                        // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioEventType                      K2Node_Select_Default;                             // 0x00A0(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioEventType                      K2Node_Select_Default_1;                           // 0x00A4(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x00A8(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00BC(0x0014)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x00D8(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x00F0(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0110(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn) == 0x000008, "Wrong alignment on GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn");
static_assert(sizeof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn) == 0x000118, "Wrong size on GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, EntryPoint) == 0x000000, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_delegate_Variable) == 0x000004, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_byte_Variable) == 0x000018, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_struct_Variable) == 0x000030, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_struct_Variable_1) == 0x000034, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_struct_Variable_2) == 0x000038, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_struct_Variable_3) == 0x00003C, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_struct_Variable_4) == 0x000040, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_struct_Variable_5) == 0x000044, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_struct_Variable_6) == 0x000048, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_struct_Variable_7) == 0x00004C, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_struct_Variable_8) == 0x000050, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_struct_Variable_8' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_struct_Variable_9) == 0x000054, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_struct_Variable_9' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_struct_Variable_10) == 0x000058, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_struct_Variable_10' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_struct_Variable_11) == 0x00005C, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_struct_Variable_11' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_struct_Variable_12) == 0x000060, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_struct_Variable_12' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_byte_Variable_1) == 0x000064, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_struct_Variable_13) == 0x000068, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_struct_Variable_13' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_struct_Variable_14) == 0x00006C, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_struct_Variable_14' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_struct_Variable_15) == 0x000070, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_struct_Variable_15' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_struct_Variable_16) == 0x000074, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_struct_Variable_16' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_struct_Variable_17) == 0x000078, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_struct_Variable_17' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_struct_Variable_18) == 0x00007C, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_struct_Variable_18' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_struct_Variable_19) == 0x000080, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_struct_Variable_19' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_struct_Variable_20) == 0x000084, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_struct_Variable_20' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_struct_Variable_21) == 0x000088, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_struct_Variable_21' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_struct_Variable_22) == 0x00008C, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_struct_Variable_22' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_struct_Variable_23) == 0x000090, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_struct_Variable_23' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_struct_Variable_24) == 0x000094, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_struct_Variable_24' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_struct_Variable_25) == 0x000098, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_struct_Variable_25' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, K2Node_CustomEvent_NPCType) == 0x00009C, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::K2Node_CustomEvent_NPCType' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, K2Node_Select_Default) == 0x0000A0, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, K2Node_Select_Default_1) == 0x0000A4, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, CallFunc_PlayEvent_playback_instance) == 0x0000A8, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, CallFunc_PlayEvent_play_success) == 0x0000B8, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000BC, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000D0, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, Temp_delegate_Variable_1) == 0x0000D8, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, CallFunc_PlayEvent_playback_instance_1) == 0x0000F0, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, CallFunc_PlayEvent_play_success_1) == 0x000100, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::CallFunc_PlayEvent_play_success_1' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000104, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, CallFunc_FClamp_ReturnValue) == 0x000108, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000110, "Member 'GCA_TeleportIn_C_ExecuteUbergraph_GCA_TeleportIn::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");

// Function GCA_TeleportIn.GCA_TeleportIn_C.TeleportAudio
// 0x0001 (0x0001 - 0x0000)
struct GCA_TeleportIn_C_TeleportAudio final
{
public:
	ECANPCType                                    NPCType;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCA_TeleportIn_C_TeleportAudio) == 0x000001, "Wrong alignment on GCA_TeleportIn_C_TeleportAudio");
static_assert(sizeof(GCA_TeleportIn_C_TeleportAudio) == 0x000001, "Wrong size on GCA_TeleportIn_C_TeleportAudio");
static_assert(offsetof(GCA_TeleportIn_C_TeleportAudio, NPCType) == 0x000000, "Member 'GCA_TeleportIn_C_TeleportAudio::NPCType' has a wrong offset!");

// Function GCA_TeleportIn.GCA_TeleportIn_C.OnRemove
// 0x0130 (0x0130 - 0x0000)
struct GCA_TeleportIn_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_NPC*                       K2Node_DynamicCast_AsCACharacter_NPC;              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      K2Node_DynamicCast_AsNiagara_Particle_System;      // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCA_TeleportIn_C_OnRemove) == 0x000008, "Wrong alignment on GCA_TeleportIn_C_OnRemove");
static_assert(sizeof(GCA_TeleportIn_C_OnRemove) == 0x000130, "Wrong size on GCA_TeleportIn_C_OnRemove");
static_assert(offsetof(GCA_TeleportIn_C_OnRemove, MyTarget) == 0x000000, "Member 'GCA_TeleportIn_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_OnRemove, Parameters) == 0x000008, "Member 'GCA_TeleportIn_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_OnRemove, ReturnValue) == 0x0000F8, "Member 'GCA_TeleportIn_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_OnRemove, K2Node_DynamicCast_AsCACharacter_NPC) == 0x000100, "Member 'GCA_TeleportIn_C_OnRemove::K2Node_DynamicCast_AsCACharacter_NPC' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_OnRemove, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GCA_TeleportIn_C_OnRemove::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_OnRemove, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000110, "Member 'GCA_TeleportIn_C_OnRemove::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_OnRemove, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000118, "Member 'GCA_TeleportIn_C_OnRemove::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_OnRemove, K2Node_DynamicCast_AsNiagara_Particle_System) == 0x000120, "Member 'GCA_TeleportIn_C_OnRemove::K2Node_DynamicCast_AsNiagara_Particle_System' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_OnRemove, K2Node_DynamicCast_bSuccess_1) == 0x000128, "Member 'GCA_TeleportIn_C_OnRemove::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_OnRemove, CallFunc_Not_PreBool_ReturnValue) == 0x000129, "Member 'GCA_TeleportIn_C_OnRemove::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_OnRemove, CallFunc_IsValid_ReturnValue) == 0x00012A, "Member 'GCA_TeleportIn_C_OnRemove::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GCA_TeleportIn.GCA_TeleportIn_C.WhileActive
// 0x0230 (0x0230 - 0x0000)
struct GCA_TeleportIn_C_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0108(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0120(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x012C(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0138(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0158(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_NPC*                       K2Node_DynamicCast_AsCACharacter_NPC;              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECANPCType                                    CallFunc_GetNPCType_ReturnValue;                   // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECANPCType                                    CallFunc_GetNPCType_ReturnValue_1;                 // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerTimeSeconds_ReturnValue;         // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UNiagaraComponent>       CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x01F8(0x0030)(InstancedReference, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCA_TeleportIn_C_WhileActive) == 0x000008, "Wrong alignment on GCA_TeleportIn_C_WhileActive");
static_assert(sizeof(GCA_TeleportIn_C_WhileActive) == 0x000230, "Wrong size on GCA_TeleportIn_C_WhileActive");
static_assert(offsetof(GCA_TeleportIn_C_WhileActive, MyTarget) == 0x000000, "Member 'GCA_TeleportIn_C_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_WhileActive, Parameters) == 0x000008, "Member 'GCA_TeleportIn_C_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_WhileActive, ReturnValue) == 0x0000F8, "Member 'GCA_TeleportIn_C_WhileActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_TeleportIn_C_WhileActive, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0000FC, "Member 'GCA_TeleportIn_C_WhileActive::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
