#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCA_Drone_ZeroG_SpeedBoost

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCA_Drone_ZeroG_SpeedBoost.GCA_Drone_ZeroG_SpeedBoost_C.OnActive
// 0x0148 (0x0148 - 0x0000)
struct GCA_Drone_ZeroG_SpeedBoost_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharacterLighting_C> K2Node_DynamicCast_AsBPI_Character_Lighting;       // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_NPC_Character_DroneRusher_C*        K2Node_DynamicCast_AsBP_NPC_Character_Drone_Rusher; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_NPC_Character_DroneLight_C*         K2Node_DynamicCast_AsBP_NPC_Character_Drone_Light; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCA_Drone_ZeroG_SpeedBoost_C_OnActive) == 0x000008, "Wrong alignment on GCA_Drone_ZeroG_SpeedBoost_C_OnActive");
static_assert(sizeof(GCA_Drone_ZeroG_SpeedBoost_C_OnActive) == 0x000148, "Wrong size on GCA_Drone_ZeroG_SpeedBoost_C_OnActive");
static_assert(offsetof(GCA_Drone_ZeroG_SpeedBoost_C_OnActive, MyTarget) == 0x000000, "Member 'GCA_Drone_ZeroG_SpeedBoost_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCA_Drone_ZeroG_SpeedBoost_C_OnActive, Parameters) == 0x000008, "Member 'GCA_Drone_ZeroG_SpeedBoost_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCA_Drone_ZeroG_SpeedBoost_C_OnActive, ReturnValue) == 0x0000F8, "Member 'GCA_Drone_ZeroG_SpeedBoost_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Drone_ZeroG_SpeedBoost_C_OnActive, K2Node_DynamicCast_AsBPI_Character_Lighting) == 0x000100, "Member 'GCA_Drone_ZeroG_SpeedBoost_C_OnActive::K2Node_DynamicCast_AsBPI_Character_Lighting' has a wrong offset!");
static_assert(offsetof(GCA_Drone_ZeroG_SpeedBoost_C_OnActive, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'GCA_Drone_ZeroG_SpeedBoost_C_OnActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCA_Drone_ZeroG_SpeedBoost_C_OnActive, K2Node_DynamicCast_AsBP_NPC_Character_Drone_Rusher) == 0x000118, "Member 'GCA_Drone_ZeroG_SpeedBoost_C_OnActive::K2Node_DynamicCast_AsBP_NPC_Character_Drone_Rusher' has a wrong offset!");
static_assert(offsetof(GCA_Drone_ZeroG_SpeedBoost_C_OnActive, K2Node_DynamicCast_bSuccess_1) == 0x000120, "Member 'GCA_Drone_ZeroG_SpeedBoost_C_OnActive::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCA_Drone_ZeroG_SpeedBoost_C_OnActive, K2Node_DynamicCast_AsBP_NPC_Character_Drone_Light) == 0x000128, "Member 'GCA_Drone_ZeroG_SpeedBoost_C_OnActive::K2Node_DynamicCast_AsBP_NPC_Character_Drone_Light' has a wrong offset!");
static_assert(offsetof(GCA_Drone_ZeroG_SpeedBoost_C_OnActive, K2Node_DynamicCast_bSuccess_2) == 0x000130, "Member 'GCA_Drone_ZeroG_SpeedBoost_C_OnActive::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GCA_Drone_ZeroG_SpeedBoost_C_OnActive, CallFunc_IsValid_ReturnValue) == 0x000131, "Member 'GCA_Drone_ZeroG_SpeedBoost_C_OnActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Drone_ZeroG_SpeedBoost_C_OnActive, CallFunc_GetComponentByClass_ReturnValue) == 0x000138, "Member 'GCA_Drone_ZeroG_SpeedBoost_C_OnActive::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Drone_ZeroG_SpeedBoost_C_OnActive, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue) == 0x000140, "Member 'GCA_Drone_ZeroG_SpeedBoost_C_OnActive::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue' has a wrong offset!");

// Function GCA_Drone_ZeroG_SpeedBoost.GCA_Drone_ZeroG_SpeedBoost_C.OnRemove
// 0x0138 (0x0138 - 0x0000)
struct GCA_Drone_ZeroG_SpeedBoost_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_CharacterLighting_C> K2Node_DynamicCast_AsBPI_Character_Lighting;       // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_NPC_Character_DroneRusher_C*        K2Node_DynamicCast_AsBP_NPC_Character_Drone_Rusher; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_NPC_Character_DroneLight_C*         K2Node_DynamicCast_AsBP_NPC_Character_Drone_Light; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCA_Drone_ZeroG_SpeedBoost_C_OnRemove) == 0x000008, "Wrong alignment on GCA_Drone_ZeroG_SpeedBoost_C_OnRemove");
static_assert(sizeof(GCA_Drone_ZeroG_SpeedBoost_C_OnRemove) == 0x000138, "Wrong size on GCA_Drone_ZeroG_SpeedBoost_C_OnRemove");
static_assert(offsetof(GCA_Drone_ZeroG_SpeedBoost_C_OnRemove, MyTarget) == 0x000000, "Member 'GCA_Drone_ZeroG_SpeedBoost_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GCA_Drone_ZeroG_SpeedBoost_C_OnRemove, Parameters) == 0x000008, "Member 'GCA_Drone_ZeroG_SpeedBoost_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GCA_Drone_ZeroG_SpeedBoost_C_OnRemove, ReturnValue) == 0x0000F8, "Member 'GCA_Drone_ZeroG_SpeedBoost_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Drone_ZeroG_SpeedBoost_C_OnRemove, K2Node_DynamicCast_AsBPI_Character_Lighting) == 0x000100, "Member 'GCA_Drone_ZeroG_SpeedBoost_C_OnRemove::K2Node_DynamicCast_AsBPI_Character_Lighting' has a wrong offset!");
static_assert(offsetof(GCA_Drone_ZeroG_SpeedBoost_C_OnRemove, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'GCA_Drone_ZeroG_SpeedBoost_C_OnRemove::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCA_Drone_ZeroG_SpeedBoost_C_OnRemove, K2Node_DynamicCast_AsBP_NPC_Character_Drone_Rusher) == 0x000118, "Member 'GCA_Drone_ZeroG_SpeedBoost_C_OnRemove::K2Node_DynamicCast_AsBP_NPC_Character_Drone_Rusher' has a wrong offset!");
static_assert(offsetof(GCA_Drone_ZeroG_SpeedBoost_C_OnRemove, K2Node_DynamicCast_bSuccess_1) == 0x000120, "Member 'GCA_Drone_ZeroG_SpeedBoost_C_OnRemove::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCA_Drone_ZeroG_SpeedBoost_C_OnRemove, K2Node_DynamicCast_AsBP_NPC_Character_Drone_Light) == 0x000128, "Member 'GCA_Drone_ZeroG_SpeedBoost_C_OnRemove::K2Node_DynamicCast_AsBP_NPC_Character_Drone_Light' has a wrong offset!");
static_assert(offsetof(GCA_Drone_ZeroG_SpeedBoost_C_OnRemove, K2Node_DynamicCast_bSuccess_2) == 0x000130, "Member 'GCA_Drone_ZeroG_SpeedBoost_C_OnRemove::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GCA_Drone_ZeroG_SpeedBoost_C_OnRemove, CallFunc_IsValid_ReturnValue) == 0x000131, "Member 'GCA_Drone_ZeroG_SpeedBoost_C_OnRemove::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Drone_ZeroG_SpeedBoost_C_OnRemove, CallFunc_IsValid_ReturnValue_1) == 0x000132, "Member 'GCA_Drone_ZeroG_SpeedBoost_C_OnRemove::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

