#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCA_TeleportPlayerIn

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCA_TeleportPlayerIn.GCA_TeleportPlayerIn_C
// 0x0040 (0x0300 - 0x02C0)
class AGCA_TeleportPlayerIn_C final : public AGameplayCueNotify_Actor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         CumulativeDeltaTime;                               // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EventExampleTime;                                  // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Debug_Colour;                                      // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                CurrentCharacter;                                  // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasTriggeredExample;                               // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsFirstPerson;                                     // 0x02E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EA[0x6];                                      // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PostProcess_TeleportIn_C*           FPPostProcessEffect;                               // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      TPNiagara;                                         // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCA_TeleportPlayerIn_C">();
	}
	static class AGCA_TeleportPlayerIn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCA_TeleportPlayerIn_C>();
	}
};
static_assert(alignof(AGCA_TeleportPlayerIn_C) == 0x000008, "Wrong alignment on AGCA_TeleportPlayerIn_C");
static_assert(sizeof(AGCA_TeleportPlayerIn_C) == 0x000300, "Wrong size on AGCA_TeleportPlayerIn_C");
static_assert(offsetof(AGCA_TeleportPlayerIn_C, DefaultSceneRoot) == 0x0002C0, "Member 'AGCA_TeleportPlayerIn_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGCA_TeleportPlayerIn_C, CumulativeDeltaTime) == 0x0002C8, "Member 'AGCA_TeleportPlayerIn_C::CumulativeDeltaTime' has a wrong offset!");
static_assert(offsetof(AGCA_TeleportPlayerIn_C, EventExampleTime) == 0x0002CC, "Member 'AGCA_TeleportPlayerIn_C::EventExampleTime' has a wrong offset!");
static_assert(offsetof(AGCA_TeleportPlayerIn_C, Debug_Colour) == 0x0002D0, "Member 'AGCA_TeleportPlayerIn_C::Debug_Colour' has a wrong offset!");
static_assert(offsetof(AGCA_TeleportPlayerIn_C, CurrentCharacter) == 0x0002E0, "Member 'AGCA_TeleportPlayerIn_C::CurrentCharacter' has a wrong offset!");
static_assert(offsetof(AGCA_TeleportPlayerIn_C, HasTriggeredExample) == 0x0002E8, "Member 'AGCA_TeleportPlayerIn_C::HasTriggeredExample' has a wrong offset!");
static_assert(offsetof(AGCA_TeleportPlayerIn_C, IsFirstPerson) == 0x0002E9, "Member 'AGCA_TeleportPlayerIn_C::IsFirstPerson' has a wrong offset!");
static_assert(offsetof(AGCA_TeleportPlayerIn_C, FPPostProcessEffect) == 0x0002F0, "Member 'AGCA_TeleportPlayerIn_C::FPPostProcessEffect' has a wrong offset!");
static_assert(offsetof(AGCA_TeleportPlayerIn_C, TPNiagara) == 0x0002F8, "Member 'AGCA_TeleportPlayerIn_C::TPNiagara' has a wrong offset!");

}

