#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCA_Knockback

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCA_Knockback.GCA_Knockback_C.WhileActive
// 0x0118 (0x0118 - 0x0000)
struct GCA_Knockback_C_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PostProcess_Knockback_C*            CallFunc_SpawnCAAttachedEffect_ReturnValue;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter*                           K2Node_DynamicCast_AsCACharacter;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeingViewed_ReturnValue;                // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCA_Knockback_C_WhileActive) == 0x000008, "Wrong alignment on GCA_Knockback_C_WhileActive");
static_assert(sizeof(GCA_Knockback_C_WhileActive) == 0x000118, "Wrong size on GCA_Knockback_C_WhileActive");
static_assert(offsetof(GCA_Knockback_C_WhileActive, MyTarget) == 0x000000, "Member 'GCA_Knockback_C_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCA_Knockback_C_WhileActive, Parameters) == 0x000008, "Member 'GCA_Knockback_C_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCA_Knockback_C_WhileActive, ReturnValue) == 0x0000F8, "Member 'GCA_Knockback_C_WhileActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Knockback_C_WhileActive, CallFunc_SpawnCAAttachedEffect_ReturnValue) == 0x000100, "Member 'GCA_Knockback_C_WhileActive::CallFunc_SpawnCAAttachedEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Knockback_C_WhileActive, K2Node_DynamicCast_AsCACharacter) == 0x000108, "Member 'GCA_Knockback_C_WhileActive::K2Node_DynamicCast_AsCACharacter' has a wrong offset!");
static_assert(offsetof(GCA_Knockback_C_WhileActive, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'GCA_Knockback_C_WhileActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCA_Knockback_C_WhileActive, CallFunc_IsBeingViewed_ReturnValue) == 0x000111, "Member 'GCA_Knockback_C_WhileActive::CallFunc_IsBeingViewed_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Knockback_C_WhileActive, CallFunc_IsValid_ReturnValue) == 0x000112, "Member 'GCA_Knockback_C_WhileActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GCA_Knockback.GCA_Knockback_C.OnRemove
// 0x0100 (0x0100 - 0x0000)
struct GCA_Knockback_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCA_Knockback_C_OnRemove) == 0x000008, "Wrong alignment on GCA_Knockback_C_OnRemove");
static_assert(sizeof(GCA_Knockback_C_OnRemove) == 0x000100, "Wrong size on GCA_Knockback_C_OnRemove");
static_assert(offsetof(GCA_Knockback_C_OnRemove, MyTarget) == 0x000000, "Member 'GCA_Knockback_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GCA_Knockback_C_OnRemove, Parameters) == 0x000008, "Member 'GCA_Knockback_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GCA_Knockback_C_OnRemove, ReturnValue) == 0x0000F8, "Member 'GCA_Knockback_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Knockback_C_OnRemove, CallFunc_IsValid_ReturnValue) == 0x0000F9, "Member 'GCA_Knockback_C_OnRemove::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

