#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCA_VIPClub

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CAAudio_structs.hpp"


namespace SDK::Params
{

// Function GCA_VIPClub.GCA_VIPClub_C.ExecuteUbergraph_GCA_VIPClub
// 0x0004 (0x0004 - 0x0000)
struct GCA_VIPClub_C_ExecuteUbergraph_GCA_VIPClub final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCA_VIPClub_C_ExecuteUbergraph_GCA_VIPClub) == 0x000004, "Wrong alignment on GCA_VIPClub_C_ExecuteUbergraph_GCA_VIPClub");
static_assert(sizeof(GCA_VIPClub_C_ExecuteUbergraph_GCA_VIPClub) == 0x000004, "Wrong size on GCA_VIPClub_C_ExecuteUbergraph_GCA_VIPClub");
static_assert(offsetof(GCA_VIPClub_C_ExecuteUbergraph_GCA_VIPClub, EntryPoint) == 0x000000, "Member 'GCA_VIPClub_C_ExecuteUbergraph_GCA_VIPClub::EntryPoint' has a wrong offset!");

// Function GCA_VIPClub.GCA_VIPClub_C.WhileActive
// 0x0160 (0x0160 - 0x0000)
struct GCA_VIPClub_C_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x00FC(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0120(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeingViewed_ReturnValue;                // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x0134(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x0148(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCA_VIPClub_C_WhileActive) == 0x000008, "Wrong alignment on GCA_VIPClub_C_WhileActive");
static_assert(sizeof(GCA_VIPClub_C_WhileActive) == 0x000160, "Wrong size on GCA_VIPClub_C_WhileActive");
static_assert(offsetof(GCA_VIPClub_C_WhileActive, MyTarget) == 0x000000, "Member 'GCA_VIPClub_C_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCA_VIPClub_C_WhileActive, Parameters) == 0x000008, "Member 'GCA_VIPClub_C_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCA_VIPClub_C_WhileActive, ReturnValue) == 0x0000F8, "Member 'GCA_VIPClub_C_WhileActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_VIPClub_C_WhileActive, Temp_delegate_Variable) == 0x0000FC, "Member 'GCA_VIPClub_C_WhileActive::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GCA_VIPClub_C_WhileActive, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x000110, "Member 'GCA_VIPClub_C_WhileActive::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(GCA_VIPClub_C_WhileActive, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'GCA_VIPClub_C_WhileActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCA_VIPClub_C_WhileActive, CallFunc_IsValid_ReturnValue) == 0x000119, "Member 'GCA_VIPClub_C_WhileActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_VIPClub_C_WhileActive, CallFunc_PlayEvent_playback_instance) == 0x000120, "Member 'GCA_VIPClub_C_WhileActive::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(GCA_VIPClub_C_WhileActive, CallFunc_PlayEvent_play_success) == 0x000130, "Member 'GCA_VIPClub_C_WhileActive::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(GCA_VIPClub_C_WhileActive, CallFunc_IsBeingViewed_ReturnValue) == 0x000131, "Member 'GCA_VIPClub_C_WhileActive::CallFunc_IsBeingViewed_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_VIPClub_C_WhileActive, Temp_delegate_Variable_1) == 0x000134, "Member 'GCA_VIPClub_C_WhileActive::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(GCA_VIPClub_C_WhileActive, CallFunc_PlayEvent_playback_instance_1) == 0x000148, "Member 'GCA_VIPClub_C_WhileActive::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(GCA_VIPClub_C_WhileActive, CallFunc_PlayEvent_play_success_1) == 0x000158, "Member 'GCA_VIPClub_C_WhileActive::CallFunc_PlayEvent_play_success_1' has a wrong offset!");

// Function GCA_VIPClub.GCA_VIPClub_C.OnRemove
// 0x0100 (0x0100 - 0x0000)
struct GCA_VIPClub_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCA_VIPClub_C_OnRemove) == 0x000008, "Wrong alignment on GCA_VIPClub_C_OnRemove");
static_assert(sizeof(GCA_VIPClub_C_OnRemove) == 0x000100, "Wrong size on GCA_VIPClub_C_OnRemove");
static_assert(offsetof(GCA_VIPClub_C_OnRemove, MyTarget) == 0x000000, "Member 'GCA_VIPClub_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GCA_VIPClub_C_OnRemove, Parameters) == 0x000008, "Member 'GCA_VIPClub_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GCA_VIPClub_C_OnRemove, ReturnValue) == 0x0000F8, "Member 'GCA_VIPClub_C_OnRemove::ReturnValue' has a wrong offset!");

}

