#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCA_Perks_Specialist_Spotter_Marked

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CAAudio_structs.hpp"


namespace SDK::Params
{

// Function GCA_Perks_Specialist_Spotter_Marked.GCA_Perks_Specialist_Spotter_Marked_C.WhileActive
// 0x0158 (0x0158 - 0x0000)
struct GCA_Perks_Specialist_Spotter_Marked_C_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayerCharacter_ReturnValue;      // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter*                           K2Node_DynamicCast_AsCACharacter;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPawnMesh_ReturnValue;                  // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingViewed_ReturnValue;                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x012C(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0140(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCA_Perks_Specialist_Spotter_Marked_C_WhileActive) == 0x000008, "Wrong alignment on GCA_Perks_Specialist_Spotter_Marked_C_WhileActive");
static_assert(sizeof(GCA_Perks_Specialist_Spotter_Marked_C_WhileActive) == 0x000158, "Wrong size on GCA_Perks_Specialist_Spotter_Marked_C_WhileActive");
static_assert(offsetof(GCA_Perks_Specialist_Spotter_Marked_C_WhileActive, MyTarget) == 0x000000, "Member 'GCA_Perks_Specialist_Spotter_Marked_C_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCA_Perks_Specialist_Spotter_Marked_C_WhileActive, Parameters) == 0x000008, "Member 'GCA_Perks_Specialist_Spotter_Marked_C_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCA_Perks_Specialist_Spotter_Marked_C_WhileActive, ReturnValue) == 0x0000F8, "Member 'GCA_Perks_Specialist_Spotter_Marked_C_WhileActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Perks_Specialist_Spotter_Marked_C_WhileActive, CallFunc_GetLocalPlayerCharacter_ReturnValue) == 0x000100, "Member 'GCA_Perks_Specialist_Spotter_Marked_C_WhileActive::CallFunc_GetLocalPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Perks_Specialist_Spotter_Marked_C_WhileActive, K2Node_DynamicCast_AsCACharacter) == 0x000108, "Member 'GCA_Perks_Specialist_Spotter_Marked_C_WhileActive::K2Node_DynamicCast_AsCACharacter' has a wrong offset!");
static_assert(offsetof(GCA_Perks_Specialist_Spotter_Marked_C_WhileActive, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'GCA_Perks_Specialist_Spotter_Marked_C_WhileActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCA_Perks_Specialist_Spotter_Marked_C_WhileActive, CallFunc_IsValid_ReturnValue) == 0x000111, "Member 'GCA_Perks_Specialist_Spotter_Marked_C_WhileActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Perks_Specialist_Spotter_Marked_C_WhileActive, CallFunc_GetPawnMesh_ReturnValue) == 0x000118, "Member 'GCA_Perks_Specialist_Spotter_Marked_C_WhileActive::CallFunc_GetPawnMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Perks_Specialist_Spotter_Marked_C_WhileActive, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue) == 0x000120, "Member 'GCA_Perks_Specialist_Spotter_Marked_C_WhileActive::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Perks_Specialist_Spotter_Marked_C_WhileActive, CallFunc_IsBeingViewed_ReturnValue) == 0x000128, "Member 'GCA_Perks_Specialist_Spotter_Marked_C_WhileActive::CallFunc_IsBeingViewed_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Perks_Specialist_Spotter_Marked_C_WhileActive, Temp_delegate_Variable) == 0x00012C, "Member 'GCA_Perks_Specialist_Spotter_Marked_C_WhileActive::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GCA_Perks_Specialist_Spotter_Marked_C_WhileActive, CallFunc_PlayEvent_playback_instance) == 0x000140, "Member 'GCA_Perks_Specialist_Spotter_Marked_C_WhileActive::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(GCA_Perks_Specialist_Spotter_Marked_C_WhileActive, CallFunc_PlayEvent_play_success) == 0x000150, "Member 'GCA_Perks_Specialist_Spotter_Marked_C_WhileActive::CallFunc_PlayEvent_play_success' has a wrong offset!");

// Function GCA_Perks_Specialist_Spotter_Marked.GCA_Perks_Specialist_Spotter_Marked_C.OnRemove
// 0x0158 (0x0158 - 0x0000)
struct GCA_Perks_Specialist_Spotter_Marked_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter*                           K2Node_DynamicCast_AsCACharacter;                  // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPawnMesh_ReturnValue;                  // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingViewed_ReturnValue;                // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11B[0x5];                                      // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayerCharacter_ReturnValue;      // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0128(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0140(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCA_Perks_Specialist_Spotter_Marked_C_OnRemove) == 0x000008, "Wrong alignment on GCA_Perks_Specialist_Spotter_Marked_C_OnRemove");
static_assert(sizeof(GCA_Perks_Specialist_Spotter_Marked_C_OnRemove) == 0x000158, "Wrong size on GCA_Perks_Specialist_Spotter_Marked_C_OnRemove");
static_assert(offsetof(GCA_Perks_Specialist_Spotter_Marked_C_OnRemove, MyTarget) == 0x000000, "Member 'GCA_Perks_Specialist_Spotter_Marked_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GCA_Perks_Specialist_Spotter_Marked_C_OnRemove, Parameters) == 0x000008, "Member 'GCA_Perks_Specialist_Spotter_Marked_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GCA_Perks_Specialist_Spotter_Marked_C_OnRemove, ReturnValue) == 0x0000F8, "Member 'GCA_Perks_Specialist_Spotter_Marked_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Perks_Specialist_Spotter_Marked_C_OnRemove, K2Node_DynamicCast_AsCACharacter) == 0x000100, "Member 'GCA_Perks_Specialist_Spotter_Marked_C_OnRemove::K2Node_DynamicCast_AsCACharacter' has a wrong offset!");
static_assert(offsetof(GCA_Perks_Specialist_Spotter_Marked_C_OnRemove, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GCA_Perks_Specialist_Spotter_Marked_C_OnRemove::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCA_Perks_Specialist_Spotter_Marked_C_OnRemove, CallFunc_GetPawnMesh_ReturnValue) == 0x000110, "Member 'GCA_Perks_Specialist_Spotter_Marked_C_OnRemove::CallFunc_GetPawnMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Perks_Specialist_Spotter_Marked_C_OnRemove, CallFunc_IsBeingViewed_ReturnValue) == 0x000118, "Member 'GCA_Perks_Specialist_Spotter_Marked_C_OnRemove::CallFunc_IsBeingViewed_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Perks_Specialist_Spotter_Marked_C_OnRemove, CallFunc_IsValid_ReturnValue) == 0x000119, "Member 'GCA_Perks_Specialist_Spotter_Marked_C_OnRemove::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Perks_Specialist_Spotter_Marked_C_OnRemove, CallFunc_IsValid_ReturnValue_1) == 0x00011A, "Member 'GCA_Perks_Specialist_Spotter_Marked_C_OnRemove::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCA_Perks_Specialist_Spotter_Marked_C_OnRemove, CallFunc_GetLocalPlayerCharacter_ReturnValue) == 0x000120, "Member 'GCA_Perks_Specialist_Spotter_Marked_C_OnRemove::CallFunc_GetLocalPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Perks_Specialist_Spotter_Marked_C_OnRemove, Temp_delegate_Variable) == 0x000128, "Member 'GCA_Perks_Specialist_Spotter_Marked_C_OnRemove::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GCA_Perks_Specialist_Spotter_Marked_C_OnRemove, CallFunc_PlayEvent_playback_instance) == 0x000140, "Member 'GCA_Perks_Specialist_Spotter_Marked_C_OnRemove::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(GCA_Perks_Specialist_Spotter_Marked_C_OnRemove, CallFunc_PlayEvent_play_success) == 0x000150, "Member 'GCA_Perks_Specialist_Spotter_Marked_C_OnRemove::CallFunc_PlayEvent_play_success' has a wrong offset!");

}

