#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCA_TeleportOut

#include "Basic.hpp"

#include "Keaton_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCA_TeleportOut.GCA_TeleportOut_C
// 0x0058 (0x0318 - 0x02C0)
class AGCA_TeleportOut_C final : public AGameplayCueNotify_Actor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         CumulativeDeltaTime;                               // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_NPC*                       CurrentCharacter;                                  // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraSystem;                                     // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TeleportTimeRemaining;                             // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TeleportStartTime;                                 // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UNiagaraComponent>       NiagaraSystemInstance;                             // 0x02E8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, InstancedReference, HasGetValueTypeHash)

public:
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCA_TeleportOut_C">();
	}
	static class AGCA_TeleportOut_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCA_TeleportOut_C>();
	}
};
static_assert(alignof(AGCA_TeleportOut_C) == 0x000008, "Wrong alignment on AGCA_TeleportOut_C");
static_assert(sizeof(AGCA_TeleportOut_C) == 0x000318, "Wrong size on AGCA_TeleportOut_C");
static_assert(offsetof(AGCA_TeleportOut_C, DefaultSceneRoot) == 0x0002C0, "Member 'AGCA_TeleportOut_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGCA_TeleportOut_C, CumulativeDeltaTime) == 0x0002C8, "Member 'AGCA_TeleportOut_C::CumulativeDeltaTime' has a wrong offset!");
static_assert(offsetof(AGCA_TeleportOut_C, CurrentCharacter) == 0x0002D0, "Member 'AGCA_TeleportOut_C::CurrentCharacter' has a wrong offset!");
static_assert(offsetof(AGCA_TeleportOut_C, NiagaraSystem) == 0x0002D8, "Member 'AGCA_TeleportOut_C::NiagaraSystem' has a wrong offset!");
static_assert(offsetof(AGCA_TeleportOut_C, TeleportTimeRemaining) == 0x0002E0, "Member 'AGCA_TeleportOut_C::TeleportTimeRemaining' has a wrong offset!");
static_assert(offsetof(AGCA_TeleportOut_C, TeleportStartTime) == 0x0002E4, "Member 'AGCA_TeleportOut_C::TeleportStartTime' has a wrong offset!");
static_assert(offsetof(AGCA_TeleportOut_C, NiagaraSystemInstance) == 0x0002E8, "Member 'AGCA_TeleportOut_C::NiagaraSystemInstance' has a wrong offset!");

}

