#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCA_Heal_Large

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CAAudio_structs.hpp"


namespace SDK::Params
{

// Function GCA_Heal_Large.GCA_Heal_Large_C.OnActive
// 0x01A0 (0x01A0 - 0x0000)
struct GCA_Heal_Large_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                CallFunc_GetLocalPlayerCharacter_ReturnValue;      // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PostProcess_Heal_OneShot_Big_C*     CallFunc_SpawnCAAttachedEffect_ReturnValue;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter*                           K2Node_DynamicCast_AsCACharacter;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeingViewed_ReturnValue;                // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x0148(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x015C(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0170(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x0188(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCA_Heal_Large_C_OnActive) == 0x000008, "Wrong alignment on GCA_Heal_Large_C_OnActive");
static_assert(sizeof(GCA_Heal_Large_C_OnActive) == 0x0001A0, "Wrong size on GCA_Heal_Large_C_OnActive");
static_assert(offsetof(GCA_Heal_Large_C_OnActive, MyTarget) == 0x000000, "Member 'GCA_Heal_Large_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCA_Heal_Large_C_OnActive, Parameters) == 0x000008, "Member 'GCA_Heal_Large_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCA_Heal_Large_C_OnActive, ReturnValue) == 0x0000F8, "Member 'GCA_Heal_Large_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Heal_Large_C_OnActive, CallFunc_GetLocalPlayerCharacter_ReturnValue) == 0x000100, "Member 'GCA_Heal_Large_C_OnActive::CallFunc_GetLocalPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Heal_Large_C_OnActive, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000108, "Member 'GCA_Heal_Large_C_OnActive::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Heal_Large_C_OnActive, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000110, "Member 'GCA_Heal_Large_C_OnActive::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCA_Heal_Large_C_OnActive, CallFunc_SpawnCAAttachedEffect_ReturnValue) == 0x000118, "Member 'GCA_Heal_Large_C_OnActive::CallFunc_SpawnCAAttachedEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Heal_Large_C_OnActive, K2Node_DynamicCast_AsCACharacter) == 0x000120, "Member 'GCA_Heal_Large_C_OnActive::K2Node_DynamicCast_AsCACharacter' has a wrong offset!");
static_assert(offsetof(GCA_Heal_Large_C_OnActive, K2Node_DynamicCast_bSuccess) == 0x000128, "Member 'GCA_Heal_Large_C_OnActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCA_Heal_Large_C_OnActive, CallFunc_IsBeingViewed_ReturnValue) == 0x000129, "Member 'GCA_Heal_Large_C_OnActive::CallFunc_IsBeingViewed_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Heal_Large_C_OnActive, CallFunc_IsValid_ReturnValue) == 0x00012A, "Member 'GCA_Heal_Large_C_OnActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Heal_Large_C_OnActive, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x000130, "Member 'GCA_Heal_Large_C_OnActive::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(GCA_Heal_Large_C_OnActive, K2Node_DynamicCast_bSuccess_1) == 0x000138, "Member 'GCA_Heal_Large_C_OnActive::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCA_Heal_Large_C_OnActive, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue) == 0x000140, "Member 'GCA_Heal_Large_C_OnActive::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Heal_Large_C_OnActive, Temp_delegate_Variable) == 0x000148, "Member 'GCA_Heal_Large_C_OnActive::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GCA_Heal_Large_C_OnActive, Temp_delegate_Variable_1) == 0x00015C, "Member 'GCA_Heal_Large_C_OnActive::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(GCA_Heal_Large_C_OnActive, CallFunc_PlayEvent_playback_instance) == 0x000170, "Member 'GCA_Heal_Large_C_OnActive::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(GCA_Heal_Large_C_OnActive, CallFunc_PlayEvent_play_success) == 0x000180, "Member 'GCA_Heal_Large_C_OnActive::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(GCA_Heal_Large_C_OnActive, CallFunc_PlayEvent_playback_instance_1) == 0x000188, "Member 'GCA_Heal_Large_C_OnActive::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(GCA_Heal_Large_C_OnActive, CallFunc_PlayEvent_play_success_1) == 0x000198, "Member 'GCA_Heal_Large_C_OnActive::CallFunc_PlayEvent_play_success_1' has a wrong offset!");

}

