#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCA_TeleportOut_BankRobberTurret

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCA_TeleportOut_BankRobberTurret.GCA_TeleportOut_BankRobberTurret_C.OnRemove
// 0x0150 (0x0150 - 0x0000)
struct GCA_TeleportOut_BankRobberTurret_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_NPC*                       L_NPC_Character;                                   // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_NPC*                       K2Node_DynamicCast_AsCACharacter_NPC;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPawnMesh_ReturnValue;                  // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACAEquipmentBase*>               CallFunc_GetMountedDevices_mounted_devices;        // 0x0128(0x0010)(ReferenceParm)
	class ACAEquipmentBase*                       CallFunc_Array_Get_Item;                           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCA_TeleportOut_BankRobberTurret_C_OnRemove) == 0x000008, "Wrong alignment on GCA_TeleportOut_BankRobberTurret_C_OnRemove");
static_assert(sizeof(GCA_TeleportOut_BankRobberTurret_C_OnRemove) == 0x000150, "Wrong size on GCA_TeleportOut_BankRobberTurret_C_OnRemove");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_OnRemove, MyTarget) == 0x000000, "Member 'GCA_TeleportOut_BankRobberTurret_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_OnRemove, Parameters) == 0x000008, "Member 'GCA_TeleportOut_BankRobberTurret_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_OnRemove, ReturnValue) == 0x0000F8, "Member 'GCA_TeleportOut_BankRobberTurret_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_OnRemove, L_NPC_Character) == 0x000100, "Member 'GCA_TeleportOut_BankRobberTurret_C_OnRemove::L_NPC_Character' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_OnRemove, Temp_int_Array_Index_Variable) == 0x000108, "Member 'GCA_TeleportOut_BankRobberTurret_C_OnRemove::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_OnRemove, K2Node_DynamicCast_AsCACharacter_NPC) == 0x000110, "Member 'GCA_TeleportOut_BankRobberTurret_C_OnRemove::K2Node_DynamicCast_AsCACharacter_NPC' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_OnRemove, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'GCA_TeleportOut_BankRobberTurret_C_OnRemove::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_OnRemove, CallFunc_GetPawnMesh_ReturnValue) == 0x000120, "Member 'GCA_TeleportOut_BankRobberTurret_C_OnRemove::CallFunc_GetPawnMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_OnRemove, CallFunc_GetMountedDevices_mounted_devices) == 0x000128, "Member 'GCA_TeleportOut_BankRobberTurret_C_OnRemove::CallFunc_GetMountedDevices_mounted_devices' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_OnRemove, CallFunc_Array_Get_Item) == 0x000138, "Member 'GCA_TeleportOut_BankRobberTurret_C_OnRemove::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_OnRemove, CallFunc_Array_Length_ReturnValue) == 0x000140, "Member 'GCA_TeleportOut_BankRobberTurret_C_OnRemove::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_OnRemove, Temp_int_Loop_Counter_Variable) == 0x000144, "Member 'GCA_TeleportOut_BankRobberTurret_C_OnRemove::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_OnRemove, CallFunc_IsValid_ReturnValue) == 0x000148, "Member 'GCA_TeleportOut_BankRobberTurret_C_OnRemove::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_OnRemove, CallFunc_Less_IntInt_ReturnValue) == 0x000149, "Member 'GCA_TeleportOut_BankRobberTurret_C_OnRemove::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_OnRemove, CallFunc_Add_IntInt_ReturnValue) == 0x00014C, "Member 'GCA_TeleportOut_BankRobberTurret_C_OnRemove::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function GCA_TeleportOut_BankRobberTurret.GCA_TeleportOut_BankRobberTurret_C.OnActive
// 0x0100 (0x0100 - 0x0000)
struct GCA_TeleportOut_BankRobberTurret_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Duration;                                          // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCA_TeleportOut_BankRobberTurret_C_OnActive) == 0x000008, "Wrong alignment on GCA_TeleportOut_BankRobberTurret_C_OnActive");
static_assert(sizeof(GCA_TeleportOut_BankRobberTurret_C_OnActive) == 0x000100, "Wrong size on GCA_TeleportOut_BankRobberTurret_C_OnActive");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_OnActive, MyTarget) == 0x000000, "Member 'GCA_TeleportOut_BankRobberTurret_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_OnActive, Parameters) == 0x000008, "Member 'GCA_TeleportOut_BankRobberTurret_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_OnActive, ReturnValue) == 0x0000F8, "Member 'GCA_TeleportOut_BankRobberTurret_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_OnActive, Duration) == 0x0000FC, "Member 'GCA_TeleportOut_BankRobberTurret_C_OnActive::Duration' has a wrong offset!");

// Function GCA_TeleportOut_BankRobberTurret.GCA_TeleportOut_BankRobberTurret_C.WhileActive
// 0x0130 (0x0130 - 0x0000)
struct GCA_TeleportOut_BankRobberTurret_C_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Duration;                                          // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_NPC*                       K2Node_DynamicCast_AsCACharacter_NPC;              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPawnMesh_ReturnValue;                  // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCA_TeleportOut_BankRobberTurret_C_WhileActive) == 0x000008, "Wrong alignment on GCA_TeleportOut_BankRobberTurret_C_WhileActive");
static_assert(sizeof(GCA_TeleportOut_BankRobberTurret_C_WhileActive) == 0x000130, "Wrong size on GCA_TeleportOut_BankRobberTurret_C_WhileActive");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_WhileActive, MyTarget) == 0x000000, "Member 'GCA_TeleportOut_BankRobberTurret_C_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_WhileActive, Parameters) == 0x000008, "Member 'GCA_TeleportOut_BankRobberTurret_C_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_WhileActive, ReturnValue) == 0x0000F8, "Member 'GCA_TeleportOut_BankRobberTurret_C_WhileActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_WhileActive, Duration) == 0x0000FC, "Member 'GCA_TeleportOut_BankRobberTurret_C_WhileActive::Duration' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_WhileActive, K2Node_DynamicCast_AsCACharacter_NPC) == 0x000100, "Member 'GCA_TeleportOut_BankRobberTurret_C_WhileActive::K2Node_DynamicCast_AsCACharacter_NPC' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_WhileActive, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GCA_TeleportOut_BankRobberTurret_C_WhileActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_WhileActive, CallFunc_IsValid_ReturnValue) == 0x000109, "Member 'GCA_TeleportOut_BankRobberTurret_C_WhileActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_WhileActive, CallFunc_GetPawnMesh_ReturnValue) == 0x000110, "Member 'GCA_TeleportOut_BankRobberTurret_C_WhileActive::CallFunc_GetPawnMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_WhileActive, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue) == 0x000118, "Member 'GCA_TeleportOut_BankRobberTurret_C_WhileActive::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_WhileActive, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x000120, "Member 'GCA_TeleportOut_BankRobberTurret_C_WhileActive::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_WhileActive, CallFunc_GetFloatAttribute_ReturnValue) == 0x000124, "Member 'GCA_TeleportOut_BankRobberTurret_C_WhileActive::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_TeleportOut_BankRobberTurret_C_WhileActive, CallFunc_IsValid_ReturnValue_1) == 0x000128, "Member 'GCA_TeleportOut_BankRobberTurret_C_WhileActive::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

