#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCA_PlayerDownedAR

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCA_PlayerDownedAR.GCA_PlayerDownedAR_C
// 0x0028 (0x02E8 - 0x02C0)
class AGCA_PlayerDownedAR_C final : public AGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SkillfullKillHeadShot;                             // 0x02D0(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 EffectCauser;                                      // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCA_PlayerDownedAR(int32 EntryPoint);
	void ReceiveBeginPlay();
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void Spawn_Downed_AR_Shot(class ACACharacter_MainPlayer* Downed_Player, const struct FVector& Hit_Location, const struct FVector& Hit_Direction);
	void Spawn_Downed_AR_Player_Mesh(class ACACharacter_MainPlayer*& Downed_Player, class ABP_DownedAR_Character_C** Downed_Mesh);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCA_PlayerDownedAR_C">();
	}
	static class AGCA_PlayerDownedAR_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCA_PlayerDownedAR_C>();
	}
};
static_assert(alignof(AGCA_PlayerDownedAR_C) == 0x000008, "Wrong alignment on AGCA_PlayerDownedAR_C");
static_assert(sizeof(AGCA_PlayerDownedAR_C) == 0x0002E8, "Wrong size on AGCA_PlayerDownedAR_C");
static_assert(offsetof(AGCA_PlayerDownedAR_C, UberGraphFrame) == 0x0002C0, "Member 'AGCA_PlayerDownedAR_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCA_PlayerDownedAR_C, DefaultSceneRoot) == 0x0002C8, "Member 'AGCA_PlayerDownedAR_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGCA_PlayerDownedAR_C, SkillfullKillHeadShot) == 0x0002D0, "Member 'AGCA_PlayerDownedAR_C::SkillfullKillHeadShot' has a wrong offset!");
static_assert(offsetof(AGCA_PlayerDownedAR_C, EffectCauser) == 0x0002E0, "Member 'AGCA_PlayerDownedAR_C::EffectCauser' has a wrong offset!");

}

