#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCA_Cosplayer_InDisguise_IdentityThief

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Keaton_structs.hpp"


namespace SDK::Params
{

// Function GCA_Cosplayer_InDisguise_IdentityThief.GCA_Cosplayer_InDisguise_IdentityThief_C.WhileActive
// 0x0148 (0x0148 - 0x0000)
struct GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Character;                                         // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UCAUIHUDInterface*                CallFunc_GetUIHUDInterface_ReturnValue;            // 0x0108(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WhileActive_ReturnValue;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAHUDPerkActivity                     K2Node_MakeStruct_CAHUDPerkActivity;               // 0x0120(0x0014)(NoDestructor)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeingViewed_ReturnValue;                // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive) == 0x000008, "Wrong alignment on GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive");
static_assert(sizeof(GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive) == 0x000148, "Wrong size on GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive");
static_assert(offsetof(GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive, MyTarget) == 0x000000, "Member 'GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive, Parameters) == 0x000008, "Member 'GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive, ReturnValue) == 0x0000F8, "Member 'GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive, Character) == 0x000100, "Member 'GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive::Character' has a wrong offset!");
static_assert(offsetof(GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive, CallFunc_GetUIHUDInterface_ReturnValue) == 0x000108, "Member 'GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive::CallFunc_GetUIHUDInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive, CallFunc_WhileActive_ReturnValue) == 0x000110, "Member 'GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive::CallFunc_WhileActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive, CallFunc_IsValid_ReturnValue) == 0x000111, "Member 'GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive, CallFunc_MakeLiteralName_ReturnValue) == 0x000114, "Member 'GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive, K2Node_MakeStruct_CAHUDPerkActivity) == 0x000120, "Member 'GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive::K2Node_MakeStruct_CAHUDPerkActivity' has a wrong offset!");
static_assert(offsetof(GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x000138, "Member 'GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive, CallFunc_IsBeingViewed_ReturnValue) == 0x000141, "Member 'GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive::CallFunc_IsBeingViewed_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive, CallFunc_IsValid_ReturnValue_1) == 0x000142, "Member 'GCA_Cosplayer_InDisguise_IdentityThief_C_WhileActive::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

