#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCA_NPC_RusherDrone_Telegraph

#include "Basic.hpp"

#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCA_NPC_RusherDrone_Telegraph.GCA_NPC_RusherDrone_Telegraph_C
// 0x0018 (0x02D8 - 0x02C0)
class AGCA_NPC_RusherDrone_Telegraph_C final : public AGameplayCueNotify_Actor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Niagara_LayerEffect;                               // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraReference_LayerEffect;                      // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCA_NPC_RusherDrone_Telegraph_C">();
	}
	static class AGCA_NPC_RusherDrone_Telegraph_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCA_NPC_RusherDrone_Telegraph_C>();
	}
};
static_assert(alignof(AGCA_NPC_RusherDrone_Telegraph_C) == 0x000008, "Wrong alignment on AGCA_NPC_RusherDrone_Telegraph_C");
static_assert(sizeof(AGCA_NPC_RusherDrone_Telegraph_C) == 0x0002D8, "Wrong size on AGCA_NPC_RusherDrone_Telegraph_C");
static_assert(offsetof(AGCA_NPC_RusherDrone_Telegraph_C, DefaultSceneRoot) == 0x0002C0, "Member 'AGCA_NPC_RusherDrone_Telegraph_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGCA_NPC_RusherDrone_Telegraph_C, Niagara_LayerEffect) == 0x0002C8, "Member 'AGCA_NPC_RusherDrone_Telegraph_C::Niagara_LayerEffect' has a wrong offset!");
static_assert(offsetof(AGCA_NPC_RusherDrone_Telegraph_C, NiagaraReference_LayerEffect) == 0x0002D0, "Member 'AGCA_NPC_RusherDrone_Telegraph_C::NiagaraReference_LayerEffect' has a wrong offset!");

}

