#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCA_IntroTeleport

#include "Basic.hpp"

#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCA_IntroTeleport.GCA_IntroTeleport_C
// 0x0028 (0x02E8 - 0x02C0)
class AGCA_IntroTeleport_C final : public AGameplayCueNotify_Actor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      TPNiagara;                                         // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACACharacter_MainPlayer*                CurrentCharacter;                                  // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFirstPerson;                                     // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Duration;                                          // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PostProcess_TeleportIn_C*           TeleportPostProcess;                               // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCA_IntroTeleport_C">();
	}
	static class AGCA_IntroTeleport_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCA_IntroTeleport_C>();
	}
};
static_assert(alignof(AGCA_IntroTeleport_C) == 0x000008, "Wrong alignment on AGCA_IntroTeleport_C");
static_assert(sizeof(AGCA_IntroTeleport_C) == 0x0002E8, "Wrong size on AGCA_IntroTeleport_C");
static_assert(offsetof(AGCA_IntroTeleport_C, DefaultSceneRoot) == 0x0002C0, "Member 'AGCA_IntroTeleport_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGCA_IntroTeleport_C, TPNiagara) == 0x0002C8, "Member 'AGCA_IntroTeleport_C::TPNiagara' has a wrong offset!");
static_assert(offsetof(AGCA_IntroTeleport_C, CurrentCharacter) == 0x0002D0, "Member 'AGCA_IntroTeleport_C::CurrentCharacter' has a wrong offset!");
static_assert(offsetof(AGCA_IntroTeleport_C, IsFirstPerson) == 0x0002D8, "Member 'AGCA_IntroTeleport_C::IsFirstPerson' has a wrong offset!");
static_assert(offsetof(AGCA_IntroTeleport_C, Duration) == 0x0002DC, "Member 'AGCA_IntroTeleport_C::Duration' has a wrong offset!");
static_assert(offsetof(AGCA_IntroTeleport_C, TeleportPostProcess) == 0x0002E0, "Member 'AGCA_IntroTeleport_C::TeleportPostProcess' has a wrong offset!");

}

