#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCA_NPC_Escalator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCA_NPC_Escalator.GCA_NPC_Escalator_C
// 0x0018 (0x02D8 - 0x02C0)
class AGCA_NPC_Escalator_C final : public AGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextRenderComponent*                   TextRender;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCA_NPC_Escalator(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCA_NPC_Escalator_C">();
	}
	static class AGCA_NPC_Escalator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCA_NPC_Escalator_C>();
	}
};
static_assert(alignof(AGCA_NPC_Escalator_C) == 0x000008, "Wrong alignment on AGCA_NPC_Escalator_C");
static_assert(sizeof(AGCA_NPC_Escalator_C) == 0x0002D8, "Wrong size on AGCA_NPC_Escalator_C");
static_assert(offsetof(AGCA_NPC_Escalator_C, UberGraphFrame) == 0x0002C0, "Member 'AGCA_NPC_Escalator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCA_NPC_Escalator_C, TextRender) == 0x0002C8, "Member 'AGCA_NPC_Escalator_C::TextRender' has a wrong offset!");
static_assert(offsetof(AGCA_NPC_Escalator_C, DefaultSceneRoot) == 0x0002D0, "Member 'AGCA_NPC_Escalator_C::DefaultSceneRoot' has a wrong offset!");

}

