#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Perks_Specialist_ProDrono

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Keaton_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GCN_Perks_Specialist_ProDrono.GCN_Perks_Specialist_ProDrono_C.OnExecute
// 0x0218 (0x0218 - 0x0000)
struct GCN_Perks_Specialist_ProDrono_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0110(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0128(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0134(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0140(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0160(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAHUDPerkActivity                     K2Node_MakeStruct_CAHUDPerkActivity;               // 0x01CC(0x0014)(NoDestructor)
	class ACACharacter_MainPlayer*                K2Node_DynamicCast_AsCACharacter_Main_Player;      // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingViewed_ReturnValue;                // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UCAUIHUDInterface*                CallFunc_GetUIHUDInterface_ReturnValue;            // 0x0200(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCN_Perks_Specialist_ProDrono_C_OnExecute) == 0x000008, "Wrong alignment on GCN_Perks_Specialist_ProDrono_C_OnExecute");
static_assert(sizeof(GCN_Perks_Specialist_ProDrono_C_OnExecute) == 0x000218, "Wrong size on GCN_Perks_Specialist_ProDrono_C_OnExecute");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, MyTarget) == 0x000000, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, Parameters) == 0x000008, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, ReturnValue) == 0x0000F8, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, CallFunc_MakeLiteralName_ReturnValue) == 0x0000FC, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000108, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x00010C, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000110, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000128, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000134, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000140, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000160, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, CallFunc_BreakGameplayCueParameters_Location) == 0x000180, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, CallFunc_BreakGameplayCueParameters_Normal) == 0x00018C, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000198, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001A0, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001A8, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001B0, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001B8, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001BC, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001C0, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001C8, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, K2Node_MakeStruct_CAHUDPerkActivity) == 0x0001CC, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::K2Node_MakeStruct_CAHUDPerkActivity' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, K2Node_DynamicCast_AsCACharacter_Main_Player) == 0x0001E0, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::K2Node_DynamicCast_AsCACharacter_Main_Player' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x0001E8, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0001F0, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, CallFunc_IsBeingViewed_ReturnValue) == 0x0001F8, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::CallFunc_IsBeingViewed_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, CallFunc_IsValid_ReturnValue) == 0x0001F9, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, CallFunc_GetUIHUDInterface_ReturnValue) == 0x000200, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::CallFunc_GetUIHUDInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue) == 0x000208, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, CallFunc_IsValid_ReturnValue_1) == 0x000210, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_C_OnExecute, CallFunc_IsValid_ReturnValue_2) == 0x000211, "Member 'GCN_Perks_Specialist_ProDrono_C_OnExecute::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

}

