#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_WeaponProgression_SlotC

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CAAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCN_WeaponProgression_SlotC.GCN_WeaponProgression_SlotC_C.OnExecute
// 0x02C8 (0x02C8 - 0x0000)
struct GCN_WeaponProgression_SlotC_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          TriggerVFX;                                        // 0x00F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      FPEffect;                                          // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFirstPerson;                                     // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Params_0;                                          // 0x0110(0x00F0)(Edit, BlueprintVisible, ContainsInstancedReference)
	class ACACharacter*                           K2Node_DynamicCast_AsCACharacter;                  // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20A[0x6];                                      // 0x020A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICALoadoutInterface>   K2Node_DynamicCast_AsCALoadout_Interface;          // 0x0210(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCALoadoutComponent*                    CallFunc_GetLoadoutComponent_ReturnValue;          // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBeingViewed_ReturnValue;                // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPrimaryWeaponHeld_ReturnValue;          // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAEquipmentBase*                       CallFunc_GetCurrentlyHeldDevice_ReturnValue;       // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACAWeapon*                              K2Node_DynamicCast_AsCAWeapon;                     // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetAROffset_ReturnValue;                  // 0x024C(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnExecute_ReturnValue;                    // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25A[0x2];                                      // 0x025A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x025C(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0270(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCANiagaraComponentFOV*                 CallFunc_SpawnCANiagaraFOVSystemAttached_ReturnValue; // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable_1;                          // 0x0298(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance_1;            // 0x02B0(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success_1;                 // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCN_WeaponProgression_SlotC_C_OnExecute) == 0x000008, "Wrong alignment on GCN_WeaponProgression_SlotC_C_OnExecute");
static_assert(sizeof(GCN_WeaponProgression_SlotC_C_OnExecute) == 0x0002C8, "Wrong size on GCN_WeaponProgression_SlotC_C_OnExecute");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, MyTarget) == 0x000000, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, Parameters) == 0x000008, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, ReturnValue) == 0x0000F8, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, TriggerVFX) == 0x0000F9, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::TriggerVFX' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, FPEffect) == 0x000100, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::FPEffect' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, IsFirstPerson) == 0x000108, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::IsFirstPerson' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, Params_0) == 0x000110, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::Params_0' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, K2Node_DynamicCast_AsCACharacter) == 0x000200, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::K2Node_DynamicCast_AsCACharacter' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x000208, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, CallFunc_IsValid_ReturnValue) == 0x000209, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, K2Node_DynamicCast_AsCALoadout_Interface) == 0x000210, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::K2Node_DynamicCast_AsCALoadout_Interface' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, K2Node_DynamicCast_bSuccess_1) == 0x000220, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, CallFunc_GetLoadoutComponent_ReturnValue) == 0x000228, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::CallFunc_GetLoadoutComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, CallFunc_IsBeingViewed_ReturnValue) == 0x000230, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::CallFunc_IsBeingViewed_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, CallFunc_IsPrimaryWeaponHeld_ReturnValue) == 0x000231, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::CallFunc_IsPrimaryWeaponHeld_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, CallFunc_GetCurrentlyHeldDevice_ReturnValue) == 0x000238, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::CallFunc_GetCurrentlyHeldDevice_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, K2Node_DynamicCast_AsCAWeapon) == 0x000240, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::K2Node_DynamicCast_AsCAWeapon' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, K2Node_DynamicCast_bSuccess_2) == 0x000248, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, CallFunc_GetAROffset_ReturnValue) == 0x00024C, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::CallFunc_GetAROffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x000258, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, CallFunc_OnExecute_ReturnValue) == 0x000259, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::CallFunc_OnExecute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, Temp_delegate_Variable) == 0x00025C, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, CallFunc_PlayEvent_playback_instance) == 0x000270, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, CallFunc_PlayEvent_play_success) == 0x000280, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue) == 0x000288, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, CallFunc_SpawnCANiagaraFOVSystemAttached_ReturnValue) == 0x000290, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::CallFunc_SpawnCANiagaraFOVSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, Temp_delegate_Variable_1) == 0x000298, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, CallFunc_PlayEvent_playback_instance_1) == 0x0002B0, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::CallFunc_PlayEvent_playback_instance_1' has a wrong offset!");
static_assert(offsetof(GCN_WeaponProgression_SlotC_C_OnExecute, CallFunc_PlayEvent_play_success_1) == 0x0002C0, "Member 'GCN_WeaponProgression_SlotC_C_OnExecute::CallFunc_PlayEvent_play_success_1' has a wrong offset!");

}

