#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Perks_Specialist_ProDrono_Beam

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CAAudio_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GCN_Perks_Specialist_ProDrono_Beam.GCN_Perks_Specialist_ProDrono_Beam_C.OnExecute
// 0x0238 (0x0238 - 0x0000)
struct GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          IsHealing;                                         // 0x00F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioEventType                      Temp_struct_Variable;                              // 0x00FC(0x0004)(ConstParm, NoDestructor)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0108(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0120(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x012C(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0138(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0158(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACACharacter*                           K2Node_DynamicCast_AsCACharacter;                  // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPawnMesh_ReturnValue;                  // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioEventType                      Temp_struct_Variable_1;                            // 0x01F0(0x0004)(ConstParm, NoDestructor)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x01F4(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20A[0x2];                                      // 0x020A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAAudioEventType                      K2Node_Select_Default;                             // 0x020C(0x0004)(ConstParm, NoDestructor)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0210(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_Select_Default_1;                           // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnCANiagaraSystemAttached_ReturnValue; // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute) == 0x000008, "Wrong alignment on GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute");
static_assert(sizeof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute) == 0x000238, "Wrong size on GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, MyTarget) == 0x000000, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, Parameters) == 0x000008, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, ReturnValue) == 0x0000F8, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, IsHealing) == 0x0000F9, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::IsHealing' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, Temp_struct_Variable) == 0x0000FC, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000100, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000104, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000108, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000120, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x00012C, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000138, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000158, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, CallFunc_BreakGameplayCueParameters_Location) == 0x000178, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, CallFunc_BreakGameplayCueParameters_Normal) == 0x000184, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000190, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000198, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001A0, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001A8, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001B0, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001B4, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001B8, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001C0, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001C4, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, CallFunc_Less_FloatFloat_ReturnValue) == 0x0001D0, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, K2Node_DynamicCast_AsCACharacter) == 0x0001D8, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::K2Node_DynamicCast_AsCACharacter' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x0001E0, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, CallFunc_GetPawnMesh_ReturnValue) == 0x0001E8, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::CallFunc_GetPawnMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, Temp_struct_Variable_1) == 0x0001F0, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, Temp_delegate_Variable) == 0x0001F4, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, Temp_bool_Variable) == 0x000208, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, Temp_bool_Variable_1) == 0x000209, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, K2Node_Select_Default) == 0x00020C, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, CallFunc_PlayEvent_playback_instance) == 0x000210, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, CallFunc_PlayEvent_play_success) == 0x000220, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, K2Node_Select_Default_1) == 0x000228, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute, CallFunc_SpawnCANiagaraSystemAttached_ReturnValue) == 0x000230, "Member 'GCN_Perks_Specialist_ProDrono_Beam_C_OnExecute::CallFunc_SpawnCANiagaraSystemAttached_ReturnValue' has a wrong offset!");

}

