#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HideWidgetMediator

#include "Basic.hpp"


namespace SDK::Params
{

// Function HideWidgetMediator.HideWidgetMediator_C.ExecuteUbergraph_HideWidgetMediator
// 0x0040 (0x0040 - 0x0000)
struct HideWidgetMediator_C_ExecuteUbergraph_HideWidgetMediator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_client;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_DynamicCast_AsUser_Widget;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAFrontendHeaderMenu*                  K2Node_DynamicCast_AsCAFrontend_Header_Menu;       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAFrontendHeaderMenu*                  K2Node_DynamicCast_AsCAFrontend_Header_Menu_1;     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HideWidgetMediator_C_ExecuteUbergraph_HideWidgetMediator) == 0x000008, "Wrong alignment on HideWidgetMediator_C_ExecuteUbergraph_HideWidgetMediator");
static_assert(sizeof(HideWidgetMediator_C_ExecuteUbergraph_HideWidgetMediator) == 0x000040, "Wrong size on HideWidgetMediator_C_ExecuteUbergraph_HideWidgetMediator");
static_assert(offsetof(HideWidgetMediator_C_ExecuteUbergraph_HideWidgetMediator, EntryPoint) == 0x000000, "Member 'HideWidgetMediator_C_ExecuteUbergraph_HideWidgetMediator::EntryPoint' has a wrong offset!");
static_assert(offsetof(HideWidgetMediator_C_ExecuteUbergraph_HideWidgetMediator, K2Node_Event_client) == 0x000008, "Member 'HideWidgetMediator_C_ExecuteUbergraph_HideWidgetMediator::K2Node_Event_client' has a wrong offset!");
static_assert(offsetof(HideWidgetMediator_C_ExecuteUbergraph_HideWidgetMediator, K2Node_DynamicCast_AsUser_Widget) == 0x000010, "Member 'HideWidgetMediator_C_ExecuteUbergraph_HideWidgetMediator::K2Node_DynamicCast_AsUser_Widget' has a wrong offset!");
static_assert(offsetof(HideWidgetMediator_C_ExecuteUbergraph_HideWidgetMediator, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'HideWidgetMediator_C_ExecuteUbergraph_HideWidgetMediator::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HideWidgetMediator_C_ExecuteUbergraph_HideWidgetMediator, K2Node_DynamicCast_AsCAFrontend_Header_Menu) == 0x000020, "Member 'HideWidgetMediator_C_ExecuteUbergraph_HideWidgetMediator::K2Node_DynamicCast_AsCAFrontend_Header_Menu' has a wrong offset!");
static_assert(offsetof(HideWidgetMediator_C_ExecuteUbergraph_HideWidgetMediator, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'HideWidgetMediator_C_ExecuteUbergraph_HideWidgetMediator::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(HideWidgetMediator_C_ExecuteUbergraph_HideWidgetMediator, K2Node_DynamicCast_AsCAFrontend_Header_Menu_1) == 0x000030, "Member 'HideWidgetMediator_C_ExecuteUbergraph_HideWidgetMediator::K2Node_DynamicCast_AsCAFrontend_Header_Menu_1' has a wrong offset!");
static_assert(offsetof(HideWidgetMediator_C_ExecuteUbergraph_HideWidgetMediator, K2Node_DynamicCast_bSuccess_2) == 0x000038, "Member 'HideWidgetMediator_C_ExecuteUbergraph_HideWidgetMediator::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function HideWidgetMediator.HideWidgetMediator_C.SetClient
// 0x0008 (0x0008 - 0x0000)
struct HideWidgetMediator_C_SetClient final
{
public:
	class UObject*                                Client_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HideWidgetMediator_C_SetClient) == 0x000008, "Wrong alignment on HideWidgetMediator_C_SetClient");
static_assert(sizeof(HideWidgetMediator_C_SetClient) == 0x000008, "Wrong size on HideWidgetMediator_C_SetClient");
static_assert(offsetof(HideWidgetMediator_C_SetClient, Client_0) == 0x000000, "Member 'HideWidgetMediator_C_SetClient::Client_0' has a wrong offset!");

}

