#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUDActionButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Keaton_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HUDActionButton.HUDActionButton_C
// 0x0028 (0x06A8 - 0x0680)
class UHUDActionButton_C final : public UCABaseHUDActionElement
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0680(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FLinearColor                           bg_hover;                                          // 0x0688(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           bg_default;                                        // 0x0698(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HUDActionButton(int32 EntryPoint);
	void OnInputChanged(bool Is_controller, const ECAInputMode Input_mode);
	void SetUnfocusedState();
	void SetFocusedState();
	void OnUserSelected(bool Using_mouse);
	void Construct();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnUserFocused(bool Using_mouse);
	void BndEvt__m_internal_button_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void OnUserLostFocus(bool Using_mouse);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HUDActionButton_C">();
	}
	static class UHUDActionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDActionButton_C>();
	}
};
static_assert(alignof(UHUDActionButton_C) == 0x000008, "Wrong alignment on UHUDActionButton_C");
static_assert(sizeof(UHUDActionButton_C) == 0x0006A8, "Wrong size on UHUDActionButton_C");
static_assert(offsetof(UHUDActionButton_C, UberGraphFrame) == 0x000680, "Member 'UHUDActionButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHUDActionButton_C, bg_hover) == 0x000688, "Member 'UHUDActionButton_C::bg_hover' has a wrong offset!");
static_assert(offsetof(UHUDActionButton_C, bg_default) == 0x000698, "Member 'UHUDActionButton_C::bg_default' has a wrong offset!");

}

