#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LS_MatchEnd_WinnerCelebration

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_structs.hpp"
#include "LevelSequence_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LS_MatchEnd_WinnerCelebration.SequenceDirector_C
// 0x0020 (0x0060 - 0x0040)
class LS_MatchEnd_WinnerCelebration::USequenceDirector_C final : public ULevelSequenceDirector
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0040(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ACAWinnerCelebrationSequence*           Winner_Celebration_Sequence;                       // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCANiagaraVariableFloatPair>    Niagara_Float_Variables;                           // 0x0050(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_SequenceDirector(int32 EntryPoint);
	void OnCreated();
	void TriggerTeleportForPlayer003();
	void TriggerTeleportForPlayer002();
	void TriggerTeleportForPlayer001();
	void OnEmoteLoopEndReached();
	void OnStartEmoteAnimation();
	void SequenceEvent__ENTRYPOINTSequenceDirector_0();
	void SequenceEvent__ENTRYPOINTSequenceDirector_1();
	void SequenceEvent__ENTRYPOINTSequenceDirector_2();
	void SequenceEvent__ENTRYPOINTSequenceDirector_3();
	void SequenceEvent__ENTRYPOINTSequenceDirector_4();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlueprintGeneratedClass LS_MatchEnd_WinnerCelebration.SequenceDirector_C", true, "SequenceDirector_C">();
	}
	static class LS_MatchEnd_WinnerCelebration::USequenceDirector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<LS_MatchEnd_WinnerCelebration::USequenceDirector_C>();
	}
};
static_assert(alignof(LS_MatchEnd_WinnerCelebration::USequenceDirector_C) == 0x000008, "Wrong alignment on LS_MatchEnd_WinnerCelebration::USequenceDirector_C");
static_assert(sizeof(LS_MatchEnd_WinnerCelebration::USequenceDirector_C) == 0x000060, "Wrong size on LS_MatchEnd_WinnerCelebration::USequenceDirector_C");
static_assert(offsetof(LS_MatchEnd_WinnerCelebration::USequenceDirector_C, UberGraphFrame) == 0x000040, "Member 'LS_MatchEnd_WinnerCelebration::USequenceDirector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(LS_MatchEnd_WinnerCelebration::USequenceDirector_C, Winner_Celebration_Sequence) == 0x000048, "Member 'LS_MatchEnd_WinnerCelebration::USequenceDirector_C::Winner_Celebration_Sequence' has a wrong offset!");
static_assert(offsetof(LS_MatchEnd_WinnerCelebration::USequenceDirector_C, Niagara_Float_Variables) == 0x000050, "Member 'LS_MatchEnd_WinnerCelebration::USequenceDirector_C::Niagara_Float_Variables' has a wrong offset!");

}

