#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_UI_SegBarColours

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_UI_SegBarColours.S_UI_SegBarColours
// 0x0040 (0x0040 - 0x0000)
struct FS_UI_SegBarColours final
{
public:
	struct FLinearColor                           barForeground_16_E53D74574D06826E3F3691A15907C203; // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           barBackground_17_457023124F998CD856F71FB60F316162; // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           barDisabled_18_5A44AA8140A3FC02F2006B9F5523C50F;   // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           barDamage_21_28E62DF84D4666C0B4CF6785A945C319;     // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_UI_SegBarColours) == 0x000004, "Wrong alignment on FS_UI_SegBarColours");
static_assert(sizeof(FS_UI_SegBarColours) == 0x000040, "Wrong size on FS_UI_SegBarColours");
static_assert(offsetof(FS_UI_SegBarColours, barForeground_16_E53D74574D06826E3F3691A15907C203) == 0x000000, "Member 'FS_UI_SegBarColours::barForeground_16_E53D74574D06826E3F3691A15907C203' has a wrong offset!");
static_assert(offsetof(FS_UI_SegBarColours, barBackground_17_457023124F998CD856F71FB60F316162) == 0x000010, "Member 'FS_UI_SegBarColours::barBackground_17_457023124F998CD856F71FB60F316162' has a wrong offset!");
static_assert(offsetof(FS_UI_SegBarColours, barDisabled_18_5A44AA8140A3FC02F2006B9F5523C50F) == 0x000020, "Member 'FS_UI_SegBarColours::barDisabled_18_5A44AA8140A3FC02F2006B9F5523C50F' has a wrong offset!");
static_assert(offsetof(FS_UI_SegBarColours, barDamage_21_28E62DF84D4666C0B4CF6785A945C319) == 0x000030, "Member 'FS_UI_SegBarColours::barDamage_21_28E62DF84D4666C0B4CF6785A945C319' has a wrong offset!");

}

