#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SniperTurretLaserSightComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SniperTurretLaserSightComponent.SniperTurretLaserSightComponent_C
// 0x0010 (0x0330 - 0x0320)
class USniperTurretLaserSightComponent_C final : public UCALaserSightComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         TimeToNextShot;                                    // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELaserTargetEffectState                       State;                                             // 0x032C(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          AllSet;                                            // 0x032D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_SniperTurretLaserSightComponent(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void OnRep_State();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SniperTurretLaserSightComponent_C">();
	}
	static class USniperTurretLaserSightComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USniperTurretLaserSightComponent_C>();
	}
};
static_assert(alignof(USniperTurretLaserSightComponent_C) == 0x000010, "Wrong alignment on USniperTurretLaserSightComponent_C");
static_assert(sizeof(USniperTurretLaserSightComponent_C) == 0x000330, "Wrong size on USniperTurretLaserSightComponent_C");
static_assert(offsetof(USniperTurretLaserSightComponent_C, UberGraphFrame) == 0x000320, "Member 'USniperTurretLaserSightComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USniperTurretLaserSightComponent_C, TimeToNextShot) == 0x000328, "Member 'USniperTurretLaserSightComponent_C::TimeToNextShot' has a wrong offset!");
static_assert(offsetof(USniperTurretLaserSightComponent_C, State) == 0x00032C, "Member 'USniperTurretLaserSightComponent_C::State' has a wrong offset!");
static_assert(offsetof(USniperTurretLaserSightComponent_C, AllSet) == 0x00032D, "Member 'USniperTurretLaserSightComponent_C::AllSet' has a wrong offset!");

}

