#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StartUp_EpilepsyWarning_FlowState

#include "Basic.hpp"


namespace SDK::Params
{

// Function StartUp_EpilepsyWarning_FlowState.Startup_EpilepsyWarning_FlowState_C.ExecuteUbergraph_Startup_EpilepsyWarning_FlowState
// 0x00C8 (0x00C8 - 0x0000)
struct Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseScreen*                          K2Node_CustomEvent_screen_3;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator_3;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseScreen*                          K2Node_CustomEvent_screen_2;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator_2;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseScreen*                          K2Node_CustomEvent_screen_1;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator_1;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0068(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseScreen*                          K2Node_CustomEvent_screen;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator;                       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0090(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAViewMediator*                        Temp_object_Variable;                              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseScreen*                          Temp_object_Variable_1;                            // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCARequestScreenAsyncAction*            CallFunc_RequestUIScreen_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState) == 0x000008, "Wrong alignment on Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState");
static_assert(sizeof(Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState) == 0x0000C8, "Wrong size on Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState");
static_assert(offsetof(Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState, EntryPoint) == 0x000000, "Member 'Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState::EntryPoint' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState, K2Node_CustomEvent_screen_3) == 0x000008, "Member 'Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState::K2Node_CustomEvent_screen_3' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState, K2Node_CustomEvent_mediator_3) == 0x000010, "Member 'Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState::K2Node_CustomEvent_mediator_3' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState, K2Node_CustomEvent_screen_2) == 0x000030, "Member 'Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState::K2Node_CustomEvent_screen_2' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState, K2Node_CustomEvent_mediator_2) == 0x000038, "Member 'Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState::K2Node_CustomEvent_mediator_2' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState, K2Node_CustomEvent_screen_1) == 0x000058, "Member 'Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState::K2Node_CustomEvent_screen_1' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState, K2Node_CustomEvent_mediator_1) == 0x000060, "Member 'Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState::K2Node_CustomEvent_mediator_1' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState, K2Node_CreateDelegate_OutputDelegate_2) == 0x000068, "Member 'Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState, K2Node_CustomEvent_screen) == 0x000080, "Member 'Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState::K2Node_CustomEvent_screen' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState, K2Node_CustomEvent_mediator) == 0x000088, "Member 'Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState::K2Node_CustomEvent_mediator' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState, K2Node_CreateDelegate_OutputDelegate_3) == 0x000090, "Member 'Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState, Temp_object_Variable) == 0x0000A8, "Member 'Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState, Temp_object_Variable_1) == 0x0000B0, "Member 'Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState, CallFunc_RequestUIScreen_ReturnValue) == 0x0000B8, "Member 'Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState::CallFunc_RequestUIScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'Startup_EpilepsyWarning_FlowState_C_ExecuteUbergraph_Startup_EpilepsyWarning_FlowState::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function StartUp_EpilepsyWarning_FlowState.Startup_EpilepsyWarning_FlowState_C.OnAlreadyShowing_8CA21E234055249D87F268A4FC517CED
// 0x0010 (0x0010 - 0x0000)
struct Startup_EpilepsyWarning_FlowState_C_OnAlreadyShowing_8CA21E234055249D87F268A4FC517CED final
{
public:
	class UCABaseScreen*                          Screen;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        Mediator;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Startup_EpilepsyWarning_FlowState_C_OnAlreadyShowing_8CA21E234055249D87F268A4FC517CED) == 0x000008, "Wrong alignment on Startup_EpilepsyWarning_FlowState_C_OnAlreadyShowing_8CA21E234055249D87F268A4FC517CED");
static_assert(sizeof(Startup_EpilepsyWarning_FlowState_C_OnAlreadyShowing_8CA21E234055249D87F268A4FC517CED) == 0x000010, "Wrong size on Startup_EpilepsyWarning_FlowState_C_OnAlreadyShowing_8CA21E234055249D87F268A4FC517CED");
static_assert(offsetof(Startup_EpilepsyWarning_FlowState_C_OnAlreadyShowing_8CA21E234055249D87F268A4FC517CED, Screen) == 0x000000, "Member 'Startup_EpilepsyWarning_FlowState_C_OnAlreadyShowing_8CA21E234055249D87F268A4FC517CED::Screen' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_FlowState_C_OnAlreadyShowing_8CA21E234055249D87F268A4FC517CED, Mediator) == 0x000008, "Member 'Startup_EpilepsyWarning_FlowState_C_OnAlreadyShowing_8CA21E234055249D87F268A4FC517CED::Mediator' has a wrong offset!");

// Function StartUp_EpilepsyWarning_FlowState.Startup_EpilepsyWarning_FlowState_C.OnShowing_8CA21E234055249D87F268A4FC517CED
// 0x0010 (0x0010 - 0x0000)
struct Startup_EpilepsyWarning_FlowState_C_OnShowing_8CA21E234055249D87F268A4FC517CED final
{
public:
	class UCABaseScreen*                          Screen;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        Mediator;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Startup_EpilepsyWarning_FlowState_C_OnShowing_8CA21E234055249D87F268A4FC517CED) == 0x000008, "Wrong alignment on Startup_EpilepsyWarning_FlowState_C_OnShowing_8CA21E234055249D87F268A4FC517CED");
static_assert(sizeof(Startup_EpilepsyWarning_FlowState_C_OnShowing_8CA21E234055249D87F268A4FC517CED) == 0x000010, "Wrong size on Startup_EpilepsyWarning_FlowState_C_OnShowing_8CA21E234055249D87F268A4FC517CED");
static_assert(offsetof(Startup_EpilepsyWarning_FlowState_C_OnShowing_8CA21E234055249D87F268A4FC517CED, Screen) == 0x000000, "Member 'Startup_EpilepsyWarning_FlowState_C_OnShowing_8CA21E234055249D87F268A4FC517CED::Screen' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_FlowState_C_OnShowing_8CA21E234055249D87F268A4FC517CED, Mediator) == 0x000008, "Member 'Startup_EpilepsyWarning_FlowState_C_OnShowing_8CA21E234055249D87F268A4FC517CED::Mediator' has a wrong offset!");

// Function StartUp_EpilepsyWarning_FlowState.Startup_EpilepsyWarning_FlowState_C.OnMediatorReady_8CA21E234055249D87F268A4FC517CED
// 0x0010 (0x0010 - 0x0000)
struct Startup_EpilepsyWarning_FlowState_C_OnMediatorReady_8CA21E234055249D87F268A4FC517CED final
{
public:
	class UCABaseScreen*                          Screen;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        Mediator;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Startup_EpilepsyWarning_FlowState_C_OnMediatorReady_8CA21E234055249D87F268A4FC517CED) == 0x000008, "Wrong alignment on Startup_EpilepsyWarning_FlowState_C_OnMediatorReady_8CA21E234055249D87F268A4FC517CED");
static_assert(sizeof(Startup_EpilepsyWarning_FlowState_C_OnMediatorReady_8CA21E234055249D87F268A4FC517CED) == 0x000010, "Wrong size on Startup_EpilepsyWarning_FlowState_C_OnMediatorReady_8CA21E234055249D87F268A4FC517CED");
static_assert(offsetof(Startup_EpilepsyWarning_FlowState_C_OnMediatorReady_8CA21E234055249D87F268A4FC517CED, Screen) == 0x000000, "Member 'Startup_EpilepsyWarning_FlowState_C_OnMediatorReady_8CA21E234055249D87F268A4FC517CED::Screen' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_FlowState_C_OnMediatorReady_8CA21E234055249D87F268A4FC517CED, Mediator) == 0x000008, "Member 'Startup_EpilepsyWarning_FlowState_C_OnMediatorReady_8CA21E234055249D87F268A4FC517CED::Mediator' has a wrong offset!");

// Function StartUp_EpilepsyWarning_FlowState.Startup_EpilepsyWarning_FlowState_C.OnError_8CA21E234055249D87F268A4FC517CED
// 0x0010 (0x0010 - 0x0000)
struct Startup_EpilepsyWarning_FlowState_C_OnError_8CA21E234055249D87F268A4FC517CED final
{
public:
	class UCABaseScreen*                          Screen;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        Mediator;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Startup_EpilepsyWarning_FlowState_C_OnError_8CA21E234055249D87F268A4FC517CED) == 0x000008, "Wrong alignment on Startup_EpilepsyWarning_FlowState_C_OnError_8CA21E234055249D87F268A4FC517CED");
static_assert(sizeof(Startup_EpilepsyWarning_FlowState_C_OnError_8CA21E234055249D87F268A4FC517CED) == 0x000010, "Wrong size on Startup_EpilepsyWarning_FlowState_C_OnError_8CA21E234055249D87F268A4FC517CED");
static_assert(offsetof(Startup_EpilepsyWarning_FlowState_C_OnError_8CA21E234055249D87F268A4FC517CED, Screen) == 0x000000, "Member 'Startup_EpilepsyWarning_FlowState_C_OnError_8CA21E234055249D87F268A4FC517CED::Screen' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_FlowState_C_OnError_8CA21E234055249D87F268A4FC517CED, Mediator) == 0x000008, "Member 'Startup_EpilepsyWarning_FlowState_C_OnError_8CA21E234055249D87F268A4FC517CED::Mediator' has a wrong offset!");

}

