#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StartUp_InitFrontendUI_FlowState

#include "Basic.hpp"

#include "CAAudio_structs.hpp"


namespace SDK::Params
{

// Function StartUp_InitFrontendUI_FlowState.Startup_InitFrontendUI_FlowState_C.ExecuteUbergraph_Startup_InitFrontendUI_FlowState
// 0x04B8 (0x04B8 - 0x0000)
struct Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseScreen*                          K2Node_CustomEvent_screen_22;                      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator_22;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseScreen*                          K2Node_CustomEvent_screen_21;                      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator_21;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseScreen*                          K2Node_CustomEvent_screen_20;                      // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator_20;                    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0068(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAViewMediator*                        Temp_object_Variable;                              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseScreen*                          Temp_object_Variable_1;                            // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseScreen*                          K2Node_CustomEvent_screen_19;                      // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator_19;                    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00A0(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseScreen*                          K2Node_CustomEvent_screen_18;                      // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator_18;                    // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x00C8(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseScreen*                          K2Node_CustomEvent_screen_17;                      // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator_17;                    // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x00F0(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseScreen*                          K2Node_CustomEvent_screen_16;                      // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator_16;                    // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0118(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAViewMediator*                        Temp_object_Variable_2;                            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseScreen*                          Temp_object_Variable_3;                            // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseScreen*                          K2Node_CustomEvent_screen_15;                      // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator_15;                    // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0150(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseScreen*                          K2Node_CustomEvent_screen_14;                      // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator_14;                    // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0178(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseScreen*                          K2Node_CustomEvent_screen_13;                      // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator_13;                    // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x01A0(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseScreen*                          K2Node_CustomEvent_screen_12;                      // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator_12;                    // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x01C8(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAViewMediator*                        Temp_object_Variable_4;                            // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseScreen*                          Temp_object_Variable_5;                            // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseScreen*                          K2Node_CustomEvent_screen_11;                      // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator_11;                    // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0200(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseScreen*                          K2Node_CustomEvent_screen_10;                      // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator_10;                    // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x0228(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseScreen*                          K2Node_CustomEvent_screen_9;                       // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator_9;                     // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate_13;           // 0x0250(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseScreen*                          K2Node_CustomEvent_screen_8;                       // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator_8;                     // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate_14;           // 0x0278(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAViewMediator*                        Temp_object_Variable_6;                            // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseScreen*                          Temp_object_Variable_7;                            // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FCAAudioEventType& Event_name)> Temp_delegate_Variable;                            // 0x02A0(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseScreen*                          K2Node_CustomEvent_screen_7;                       // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator_7;                     // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate_15;           // 0x02C8(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseScreen*                          K2Node_CustomEvent_screen_6;                       // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator_6;                     // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate_16;           // 0x02F0(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseScreen*                          K2Node_CustomEvent_screen_5;                       // 0x0308(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator_5;                     // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate_17;           // 0x0318(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseScreen*                          K2Node_CustomEvent_screen_4;                       // 0x0330(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator_4;                     // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate_18;           // 0x0340(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAViewMediator*                        Temp_object_Variable_8;                            // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseScreen*                          Temp_object_Variable_9;                            // 0x0360(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFeatureActive_ReturnValue;              // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x3];                                      // 0x0369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate_19;           // 0x036C(0x0014)(ZeroConstructor, NoDestructor)
	class UCABaseScreen*                          K2Node_CustomEvent_screen_3;                       // 0x0380(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator_3;                     // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseScreen*                          K2Node_CustomEvent_screen_2;                       // 0x0390(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator_2;                     // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate_20;           // 0x03A0(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseScreen*                          K2Node_CustomEvent_screen_1;                       // 0x03B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator_1;                     // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate_21;           // 0x03C8(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCABaseScreen*                          K2Node_CustomEvent_screen;                         // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator;                       // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate_22;           // 0x03F0(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCAViewMediator*                        Temp_object_Variable_10;                           // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseScreen*                          Temp_object_Variable_11;                           // 0x0410(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCABaseScreen* Screen, class UCAViewMediator* Mediator)> K2Node_CreateDelegate_OutputDelegate_23;           // 0x0420(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCARequestScreenAsyncAction*            CallFunc_RequestUIScreen_ReturnValue;              // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCARequestScreenAsyncAction*            CallFunc_RequestUIScreen_ReturnValue_1;            // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44A[0x6];                                      // 0x044A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCARequestScreenAsyncAction*            CallFunc_RequestUIScreen_ReturnValue_2;            // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCARequestScreenAsyncAction*            CallFunc_RequestUIScreen_ReturnValue_3;            // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0461(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_462[0x6];                                      // 0x0462(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACAPlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAAudioPlaybackInstance               CallFunc_PlayEvent_playback_instance;              // 0x0470(0x0010)()
	bool                                          CallFunc_PlayEvent_play_success;                   // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCARequestScreenAsyncAction*            CallFunc_RequestUIScreen_ReturnValue_4;            // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCABaseScreen*                          K2Node_CustomEvent_screen_23;                      // 0x0490(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        K2Node_CustomEvent_mediator_23;                    // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCARequestScreenAsyncAction*            CallFunc_RequestUIScreen_ReturnValue_5;            // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState) == 0x000008, "Wrong alignment on Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState");
static_assert(sizeof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState) == 0x0004B8, "Wrong size on Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, EntryPoint) == 0x000000, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::EntryPoint' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_screen_22) == 0x000008, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_screen_22' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_mediator_22) == 0x000010, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_mediator_22' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_screen_21) == 0x000030, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_screen_21' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_mediator_21) == 0x000038, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_mediator_21' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_screen_20) == 0x000058, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_screen_20' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_mediator_20) == 0x000060, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_mediator_20' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CreateDelegate_OutputDelegate_2) == 0x000068, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, Temp_object_Variable) == 0x000080, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, Temp_object_Variable_1) == 0x000088, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_screen_19) == 0x000090, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_screen_19' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_mediator_19) == 0x000098, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_mediator_19' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000A0, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_screen_18) == 0x0000B8, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_screen_18' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_mediator_18) == 0x0000C0, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_mediator_18' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000C8, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_screen_17) == 0x0000E0, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_screen_17' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_mediator_17) == 0x0000E8, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_mediator_17' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000F0, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_screen_16) == 0x000108, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_screen_16' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_mediator_16) == 0x000110, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_mediator_16' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CreateDelegate_OutputDelegate_6) == 0x000118, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, Temp_object_Variable_2) == 0x000130, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, Temp_object_Variable_3) == 0x000138, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_screen_15) == 0x000140, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_screen_15' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_mediator_15) == 0x000148, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_mediator_15' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CreateDelegate_OutputDelegate_7) == 0x000150, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_screen_14) == 0x000168, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_screen_14' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_mediator_14) == 0x000170, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_mediator_14' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CreateDelegate_OutputDelegate_8) == 0x000178, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_screen_13) == 0x000190, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_screen_13' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_mediator_13) == 0x000198, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_mediator_13' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CreateDelegate_OutputDelegate_9) == 0x0001A0, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_screen_12) == 0x0001B8, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_screen_12' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_mediator_12) == 0x0001C0, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_mediator_12' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CreateDelegate_OutputDelegate_10) == 0x0001C8, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, Temp_object_Variable_4) == 0x0001E0, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, Temp_object_Variable_5) == 0x0001E8, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_screen_11) == 0x0001F0, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_screen_11' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_mediator_11) == 0x0001F8, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_mediator_11' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CreateDelegate_OutputDelegate_11) == 0x000200, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_screen_10) == 0x000218, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_screen_10' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_mediator_10) == 0x000220, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_mediator_10' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CreateDelegate_OutputDelegate_12) == 0x000228, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_screen_9) == 0x000240, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_screen_9' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_mediator_9) == 0x000248, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_mediator_9' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CreateDelegate_OutputDelegate_13) == 0x000250, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_screen_8) == 0x000268, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_screen_8' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_mediator_8) == 0x000270, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_mediator_8' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CreateDelegate_OutputDelegate_14) == 0x000278, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, Temp_object_Variable_6) == 0x000290, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, Temp_object_Variable_7) == 0x000298, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, Temp_delegate_Variable) == 0x0002A0, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_screen_7) == 0x0002B8, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_screen_7' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_mediator_7) == 0x0002C0, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_mediator_7' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CreateDelegate_OutputDelegate_15) == 0x0002C8, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_screen_6) == 0x0002E0, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_screen_6' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_mediator_6) == 0x0002E8, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_mediator_6' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CreateDelegate_OutputDelegate_16) == 0x0002F0, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_screen_5) == 0x000308, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_screen_5' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_mediator_5) == 0x000310, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_mediator_5' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CreateDelegate_OutputDelegate_17) == 0x000318, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_screen_4) == 0x000330, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_screen_4' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_mediator_4) == 0x000338, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_mediator_4' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CreateDelegate_OutputDelegate_18) == 0x000340, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CreateDelegate_OutputDelegate_18' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, Temp_object_Variable_8) == 0x000358, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, Temp_object_Variable_9) == 0x000360, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, CallFunc_IsFeatureActive_ReturnValue) == 0x000368, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::CallFunc_IsFeatureActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CreateDelegate_OutputDelegate_19) == 0x00036C, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CreateDelegate_OutputDelegate_19' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_screen_3) == 0x000380, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_screen_3' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_mediator_3) == 0x000388, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_mediator_3' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_screen_2) == 0x000390, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_screen_2' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_mediator_2) == 0x000398, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_mediator_2' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CreateDelegate_OutputDelegate_20) == 0x0003A0, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CreateDelegate_OutputDelegate_20' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_screen_1) == 0x0003B8, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_screen_1' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_mediator_1) == 0x0003C0, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_mediator_1' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CreateDelegate_OutputDelegate_21) == 0x0003C8, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CreateDelegate_OutputDelegate_21' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_screen) == 0x0003E0, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_screen' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_mediator) == 0x0003E8, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_mediator' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CreateDelegate_OutputDelegate_22) == 0x0003F0, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CreateDelegate_OutputDelegate_22' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, Temp_object_Variable_10) == 0x000408, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, Temp_object_Variable_11) == 0x000410, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, CallFunc_GetPlayerController_ReturnValue) == 0x000418, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CreateDelegate_OutputDelegate_23) == 0x000420, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CreateDelegate_OutputDelegate_23' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, CallFunc_RequestUIScreen_ReturnValue) == 0x000438, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::CallFunc_RequestUIScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, CallFunc_RequestUIScreen_ReturnValue_1) == 0x000440, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::CallFunc_RequestUIScreen_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, CallFunc_IsValid_ReturnValue) == 0x000448, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, CallFunc_IsValid_ReturnValue_1) == 0x000449, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, CallFunc_RequestUIScreen_ReturnValue_2) == 0x000450, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::CallFunc_RequestUIScreen_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, CallFunc_RequestUIScreen_ReturnValue_3) == 0x000458, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::CallFunc_RequestUIScreen_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, CallFunc_IsValid_ReturnValue_2) == 0x000460, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, CallFunc_IsValid_ReturnValue_3) == 0x000461, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000468, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, CallFunc_PlayEvent_playback_instance) == 0x000470, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::CallFunc_PlayEvent_playback_instance' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, CallFunc_PlayEvent_play_success) == 0x000480, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::CallFunc_PlayEvent_play_success' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, CallFunc_RequestUIScreen_ReturnValue_4) == 0x000488, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::CallFunc_RequestUIScreen_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_screen_23) == 0x000490, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_screen_23' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, K2Node_CustomEvent_mediator_23) == 0x000498, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::K2Node_CustomEvent_mediator_23' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, CallFunc_IsValid_ReturnValue_4) == 0x0004A0, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, CallFunc_RequestUIScreen_ReturnValue_5) == 0x0004A8, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::CallFunc_RequestUIScreen_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState, CallFunc_IsValid_ReturnValue_5) == 0x0004B0, "Member 'Startup_InitFrontendUI_FlowState_C_ExecuteUbergraph_Startup_InitFrontendUI_FlowState::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");

// Function StartUp_InitFrontendUI_FlowState.Startup_InitFrontendUI_FlowState_C.OnAlreadyShowing_DC185C8A46F35410D5AE52BFAA78CFB3
// 0x0010 (0x0010 - 0x0000)
struct Startup_InitFrontendUI_FlowState_C_OnAlreadyShowing_DC185C8A46F35410D5AE52BFAA78CFB3 final
{
public:
	class UCABaseScreen*                          Screen;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        Mediator;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Startup_InitFrontendUI_FlowState_C_OnAlreadyShowing_DC185C8A46F35410D5AE52BFAA78CFB3) == 0x000008, "Wrong alignment on Startup_InitFrontendUI_FlowState_C_OnAlreadyShowing_DC185C8A46F35410D5AE52BFAA78CFB3");
static_assert(sizeof(Startup_InitFrontendUI_FlowState_C_OnAlreadyShowing_DC185C8A46F35410D5AE52BFAA78CFB3) == 0x000010, "Wrong size on Startup_InitFrontendUI_FlowState_C_OnAlreadyShowing_DC185C8A46F35410D5AE52BFAA78CFB3");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_OnAlreadyShowing_DC185C8A46F35410D5AE52BFAA78CFB3, Screen) == 0x000000, "Member 'Startup_InitFrontendUI_FlowState_C_OnAlreadyShowing_DC185C8A46F35410D5AE52BFAA78CFB3::Screen' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_OnAlreadyShowing_DC185C8A46F35410D5AE52BFAA78CFB3, Mediator) == 0x000008, "Member 'Startup_InitFrontendUI_FlowState_C_OnAlreadyShowing_DC185C8A46F35410D5AE52BFAA78CFB3::Mediator' has a wrong offset!");

// Function StartUp_InitFrontendUI_FlowState.Startup_InitFrontendUI_FlowState_C.OnShowing_DC185C8A46F35410D5AE52BFAA78CFB3
// 0x0010 (0x0010 - 0x0000)
struct Startup_InitFrontendUI_FlowState_C_OnShowing_DC185C8A46F35410D5AE52BFAA78CFB3 final
{
public:
	class UCABaseScreen*                          Screen;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCAViewMediator*                        Mediator;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Startup_InitFrontendUI_FlowState_C_OnShowing_DC185C8A46F35410D5AE52BFAA78CFB3) == 0x000008, "Wrong alignment on Startup_InitFrontendUI_FlowState_C_OnShowing_DC185C8A46F35410D5AE52BFAA78CFB3");
static_assert(sizeof(Startup_InitFrontendUI_FlowState_C_OnShowing_DC185C8A46F35410D5AE52BFAA78CFB3) == 0x000010, "Wrong size on Startup_InitFrontendUI_FlowState_C_OnShowing_DC185C8A46F35410D5AE52BFAA78CFB3");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_OnShowing_DC185C8A46F35410D5AE52BFAA78CFB3, Screen) == 0x000000, "Member 'Startup_InitFrontendUI_FlowState_C_OnShowing_DC185C8A46F35410D5AE52BFAA78CFB3::Screen' has a wrong offset!");
static_assert(offsetof(Startup_InitFrontendUI_FlowState_C_OnShowing_DC185C8A46F35410D5AE52BFAA78CFB3, Mediator) == 0x000008, "Member 'Startup_InitFrontendUI_FlowState_C_OnShowing_DC185C8A46F35410D5AE52BFAA78CFB3::Mediator' has a wrong offset!");

