#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Startup_EpilepsyWarning_Screen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Startup_EpilepsyWarning_Screen.Startup_EpilepsyWarning_Screen_C
// 0x0058 (0x0340 - 0x02E8)
class UStartup_EpilepsyWarning_Screen_C final : public UCABaseScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Startup;                                           // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       blink;                                             // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 bg;                                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCATextBlock*                           body;                                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCATextBlock*                           Continue;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Continue_button;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_39;                                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Outer_stroke;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnAnyKeyPressed;                                   // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnAnyKeyPressed__DelegateSignature();
	void ExecuteUbergraph_Startup_EpilepsyWarning_Screen(int32 EntryPoint);
	void UpdateSubheaderText();
	void OnLocalisationCultureChange();
	void Dismiss();
	void BndEvt__continue_button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Startup_EpilepsyWarning_Screen_C">();
	}
	static class UStartup_EpilepsyWarning_Screen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStartup_EpilepsyWarning_Screen_C>();
	}
};
static_assert(alignof(UStartup_EpilepsyWarning_Screen_C) == 0x000008, "Wrong alignment on UStartup_EpilepsyWarning_Screen_C");
static_assert(sizeof(UStartup_EpilepsyWarning_Screen_C) == 0x000340, "Wrong size on UStartup_EpilepsyWarning_Screen_C");
static_assert(offsetof(UStartup_EpilepsyWarning_Screen_C, UberGraphFrame) == 0x0002E8, "Member 'UStartup_EpilepsyWarning_Screen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStartup_EpilepsyWarning_Screen_C, Startup) == 0x0002F0, "Member 'UStartup_EpilepsyWarning_Screen_C::Startup' has a wrong offset!");
static_assert(offsetof(UStartup_EpilepsyWarning_Screen_C, blink) == 0x0002F8, "Member 'UStartup_EpilepsyWarning_Screen_C::blink' has a wrong offset!");
static_assert(offsetof(UStartup_EpilepsyWarning_Screen_C, bg) == 0x000300, "Member 'UStartup_EpilepsyWarning_Screen_C::bg' has a wrong offset!");
static_assert(offsetof(UStartup_EpilepsyWarning_Screen_C, body) == 0x000308, "Member 'UStartup_EpilepsyWarning_Screen_C::body' has a wrong offset!");
static_assert(offsetof(UStartup_EpilepsyWarning_Screen_C, Continue) == 0x000310, "Member 'UStartup_EpilepsyWarning_Screen_C::Continue' has a wrong offset!");
static_assert(offsetof(UStartup_EpilepsyWarning_Screen_C, Continue_button) == 0x000318, "Member 'UStartup_EpilepsyWarning_Screen_C::Continue_button' has a wrong offset!");
static_assert(offsetof(UStartup_EpilepsyWarning_Screen_C, Image_39) == 0x000320, "Member 'UStartup_EpilepsyWarning_Screen_C::Image_39' has a wrong offset!");
static_assert(offsetof(UStartup_EpilepsyWarning_Screen_C, Outer_stroke) == 0x000328, "Member 'UStartup_EpilepsyWarning_Screen_C::Outer_stroke' has a wrong offset!");
static_assert(offsetof(UStartup_EpilepsyWarning_Screen_C, OnAnyKeyPressed) == 0x000330, "Member 'UStartup_EpilepsyWarning_Screen_C::OnAnyKeyPressed' has a wrong offset!");

}

