#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Startup_EpilepsyWarning_Screen

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CALocalisationRuntime_structs.hpp"


namespace SDK::Params
{

// Function Startup_EpilepsyWarning_Screen.Startup_EpilepsyWarning_Screen_C.ExecuteUbergraph_Startup_EpilepsyWarning_Screen
// 0x00B0 (0x00B0 - 0x0000)
struct Startup_EpilepsyWarning_Screen_C_ExecuteUbergraph_Startup_EpilepsyWarning_Screen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCAText                                Temp_struct_Variable;                              // 0x0010(0x0030)()
	struct FCAText                                Temp_struct_Variable_1;                            // 0x0040(0x0030)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsInputController_ReturnValue;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCAText                                K2Node_Select_Default;                             // 0x0080(0x0030)()
};
static_assert(alignof(Startup_EpilepsyWarning_Screen_C_ExecuteUbergraph_Startup_EpilepsyWarning_Screen) == 0x000008, "Wrong alignment on Startup_EpilepsyWarning_Screen_C_ExecuteUbergraph_Startup_EpilepsyWarning_Screen");
static_assert(sizeof(Startup_EpilepsyWarning_Screen_C_ExecuteUbergraph_Startup_EpilepsyWarning_Screen) == 0x0000B0, "Wrong size on Startup_EpilepsyWarning_Screen_C_ExecuteUbergraph_Startup_EpilepsyWarning_Screen");
static_assert(offsetof(Startup_EpilepsyWarning_Screen_C_ExecuteUbergraph_Startup_EpilepsyWarning_Screen, EntryPoint) == 0x000000, "Member 'Startup_EpilepsyWarning_Screen_C_ExecuteUbergraph_Startup_EpilepsyWarning_Screen::EntryPoint' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_Screen_C_ExecuteUbergraph_Startup_EpilepsyWarning_Screen, Temp_bool_Variable) == 0x000004, "Member 'Startup_EpilepsyWarning_Screen_C_ExecuteUbergraph_Startup_EpilepsyWarning_Screen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_Screen_C_ExecuteUbergraph_Startup_EpilepsyWarning_Screen, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'Startup_EpilepsyWarning_Screen_C_ExecuteUbergraph_Startup_EpilepsyWarning_Screen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_Screen_C_ExecuteUbergraph_Startup_EpilepsyWarning_Screen, Temp_struct_Variable) == 0x000010, "Member 'Startup_EpilepsyWarning_Screen_C_ExecuteUbergraph_Startup_EpilepsyWarning_Screen::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_Screen_C_ExecuteUbergraph_Startup_EpilepsyWarning_Screen, Temp_struct_Variable_1) == 0x000040, "Member 'Startup_EpilepsyWarning_Screen_C_ExecuteUbergraph_Startup_EpilepsyWarning_Screen::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_Screen_C_ExecuteUbergraph_Startup_EpilepsyWarning_Screen, CallFunc_PlayAnimation_ReturnValue_1) == 0x000070, "Member 'Startup_EpilepsyWarning_Screen_C_ExecuteUbergraph_Startup_EpilepsyWarning_Screen::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_Screen_C_ExecuteUbergraph_Startup_EpilepsyWarning_Screen, CallFunc_GetIsInputController_ReturnValue) == 0x000078, "Member 'Startup_EpilepsyWarning_Screen_C_ExecuteUbergraph_Startup_EpilepsyWarning_Screen::CallFunc_GetIsInputController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_Screen_C_ExecuteUbergraph_Startup_EpilepsyWarning_Screen, K2Node_Select_Default) == 0x000080, "Member 'Startup_EpilepsyWarning_Screen_C_ExecuteUbergraph_Startup_EpilepsyWarning_Screen::K2Node_Select_Default' has a wrong offset!");

// Function Startup_EpilepsyWarning_Screen.Startup_EpilepsyWarning_Screen_C.OnFocusReceived
// 0x01C0 (0x01C0 - 0x0000)
struct Startup_EpilepsyWarning_Screen_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00C0)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0100(0x00C0)()
};
static_assert(alignof(Startup_EpilepsyWarning_Screen_C_OnFocusReceived) == 0x000008, "Wrong alignment on Startup_EpilepsyWarning_Screen_C_OnFocusReceived");
static_assert(sizeof(Startup_EpilepsyWarning_Screen_C_OnFocusReceived) == 0x0001C0, "Wrong size on Startup_EpilepsyWarning_Screen_C_OnFocusReceived");
static_assert(offsetof(Startup_EpilepsyWarning_Screen_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'Startup_EpilepsyWarning_Screen_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_Screen_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'Startup_EpilepsyWarning_Screen_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_Screen_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'Startup_EpilepsyWarning_Screen_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_Screen_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000100, "Member 'Startup_EpilepsyWarning_Screen_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function Startup_EpilepsyWarning_Screen.Startup_EpilepsyWarning_Screen_C.OnKeyDown
// 0x01F8 (0x01F8 - 0x0000)
struct Startup_EpilepsyWarning_Screen_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00C0)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0138(0x00C0)()
};
static_assert(alignof(Startup_EpilepsyWarning_Screen_C_OnKeyDown) == 0x000008, "Wrong alignment on Startup_EpilepsyWarning_Screen_C_OnKeyDown");
static_assert(sizeof(Startup_EpilepsyWarning_Screen_C_OnKeyDown) == 0x0001F8, "Wrong size on Startup_EpilepsyWarning_Screen_C_OnKeyDown");
static_assert(offsetof(Startup_EpilepsyWarning_Screen_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'Startup_EpilepsyWarning_Screen_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_Screen_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'Startup_EpilepsyWarning_Screen_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_Screen_C_OnKeyDown, ReturnValue) == 0x000078, "Member 'Startup_EpilepsyWarning_Screen_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(Startup_EpilepsyWarning_Screen_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000138, "Member 'Startup_EpilepsyWarning_Screen_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

