#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TextChatFooterButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Keaton_structs.hpp"
#include "Keaton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TextChatFooterButton.TextChatFooterButton_C
// 0x0030 (0x0720 - 0x06F0)
class UTextChatFooterButton_C final : public UCABaseActionButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Chat_Icon;                                         // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           bg_hover;                                          // 0x0700(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           bg_default;                                        // 0x0710(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TextChatFooterButton(int32 EntryPoint);
	void OnInputChanged(bool Is_controller, const ECAInputMode Input_mode);
	void SetUnfocusedState();
	void SetFocusedState();
	void OnUserSelected(bool Using_mouse);
	void Construct();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnUserFocused(bool Using_mouse);
	void BndEvt__m_internal_button_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void OnUserLostFocus(bool Using_mouse);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TextChatFooterButton_C">();
	}
	static class UTextChatFooterButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTextChatFooterButton_C>();
	}
};
static_assert(alignof(UTextChatFooterButton_C) == 0x000008, "Wrong alignment on UTextChatFooterButton_C");
static_assert(sizeof(UTextChatFooterButton_C) == 0x000720, "Wrong size on UTextChatFooterButton_C");
static_assert(offsetof(UTextChatFooterButton_C, UberGraphFrame) == 0x0006F0, "Member 'UTextChatFooterButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTextChatFooterButton_C, Chat_Icon) == 0x0006F8, "Member 'UTextChatFooterButton_C::Chat_Icon' has a wrong offset!");
static_assert(offsetof(UTextChatFooterButton_C, bg_hover) == 0x000700, "Member 'UTextChatFooterButton_C::bg_hover' has a wrong offset!");
static_assert(offsetof(UTextChatFooterButton_C, bg_default) == 0x000710, "Member 'UTextChatFooterButton_C::bg_default' has a wrong offset!");

}

