#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TriangleButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TriangleButton.TriangleButton_C
// 0x0030 (0x02C0 - 0x0290)
class UTriangleButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PressAnim;                                         // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_27;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TriangleIcon;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             ButtonPressed;                                     // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ButtonPressed__DelegateSignature();
	void ExecuteUbergraph_TriangleButton(int32 EntryPoint);
	void BndEvt__TriangleButton_Button_27_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__TriangleButton_Button_27_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__TriangleButton_Button_27_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TriangleButton_C">();
	}
	static class UTriangleButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTriangleButton_C>();
	}
};
static_assert(alignof(UTriangleButton_C) == 0x000008, "Wrong alignment on UTriangleButton_C");
static_assert(sizeof(UTriangleButton_C) == 0x0002C0, "Wrong size on UTriangleButton_C");
static_assert(offsetof(UTriangleButton_C, UberGraphFrame) == 0x000290, "Member 'UTriangleButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTriangleButton_C, PressAnim) == 0x000298, "Member 'UTriangleButton_C::PressAnim' has a wrong offset!");
static_assert(offsetof(UTriangleButton_C, Button_27) == 0x0002A0, "Member 'UTriangleButton_C::Button_27' has a wrong offset!");
static_assert(offsetof(UTriangleButton_C, TriangleIcon) == 0x0002A8, "Member 'UTriangleButton_C::TriangleIcon' has a wrong offset!");
static_assert(offsetof(UTriangleButton_C, ButtonPressed) == 0x0002B0, "Member 'UTriangleButton_C::ButtonPressed' has a wrong offset!");

}

