#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NPC_AlertIndicator

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_NPC_AlertIndicator.WBP_NPC_AlertIndicator_C.ExecuteUbergraph_WBP_NPC_AlertIndicator
// 0x0068 (0x0068 - 0x0000)
struct WBP_NPC_AlertIndicator_C_ExecuteUbergraph_WBP_NPC_AlertIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NPC_AlertIndicator_C_ExecuteUbergraph_WBP_NPC_AlertIndicator) == 0x000008, "Wrong alignment on WBP_NPC_AlertIndicator_C_ExecuteUbergraph_WBP_NPC_AlertIndicator");
static_assert(sizeof(WBP_NPC_AlertIndicator_C_ExecuteUbergraph_WBP_NPC_AlertIndicator) == 0x000068, "Wrong size on WBP_NPC_AlertIndicator_C_ExecuteUbergraph_WBP_NPC_AlertIndicator");
static_assert(offsetof(WBP_NPC_AlertIndicator_C_ExecuteUbergraph_WBP_NPC_AlertIndicator, EntryPoint) == 0x000000, "Member 'WBP_NPC_AlertIndicator_C_ExecuteUbergraph_WBP_NPC_AlertIndicator::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_NPC_AlertIndicator_C_ExecuteUbergraph_WBP_NPC_AlertIndicator, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_NPC_AlertIndicator_C_ExecuteUbergraph_WBP_NPC_AlertIndicator::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NPC_AlertIndicator_C_ExecuteUbergraph_WBP_NPC_AlertIndicator, K2Node_Event_MyGeometry) == 0x000010, "Member 'WBP_NPC_AlertIndicator_C_ExecuteUbergraph_WBP_NPC_AlertIndicator::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_NPC_AlertIndicator_C_ExecuteUbergraph_WBP_NPC_AlertIndicator, K2Node_Event_InDeltaTime) == 0x000048, "Member 'WBP_NPC_AlertIndicator_C_ExecuteUbergraph_WBP_NPC_AlertIndicator::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_NPC_AlertIndicator_C_ExecuteUbergraph_WBP_NPC_AlertIndicator, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00004C, "Member 'WBP_NPC_AlertIndicator_C_ExecuteUbergraph_WBP_NPC_AlertIndicator::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NPC_AlertIndicator_C_ExecuteUbergraph_WBP_NPC_AlertIndicator, CallFunc_GetVisibility_ReturnValue) == 0x00004D, "Member 'WBP_NPC_AlertIndicator_C_ExecuteUbergraph_WBP_NPC_AlertIndicator::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NPC_AlertIndicator_C_ExecuteUbergraph_WBP_NPC_AlertIndicator, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000050, "Member 'WBP_NPC_AlertIndicator_C_ExecuteUbergraph_WBP_NPC_AlertIndicator::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NPC_AlertIndicator_C_ExecuteUbergraph_WBP_NPC_AlertIndicator, CallFunc_PlayAnimation_ReturnValue_1) == 0x000058, "Member 'WBP_NPC_AlertIndicator_C_ExecuteUbergraph_WBP_NPC_AlertIndicator::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NPC_AlertIndicator_C_ExecuteUbergraph_WBP_NPC_AlertIndicator, CallFunc_PlayAnimation_ReturnValue_2) == 0x000060, "Member 'WBP_NPC_AlertIndicator_C_ExecuteUbergraph_WBP_NPC_AlertIndicator::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

// Function WBP_NPC_AlertIndicator.WBP_NPC_AlertIndicator_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_NPC_AlertIndicator_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NPC_AlertIndicator_C_Tick) == 0x000004, "Wrong alignment on WBP_NPC_AlertIndicator_C_Tick");
static_assert(sizeof(WBP_NPC_AlertIndicator_C_Tick) == 0x00003C, "Wrong size on WBP_NPC_AlertIndicator_C_Tick");
static_assert(offsetof(WBP_NPC_AlertIndicator_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_NPC_AlertIndicator_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_NPC_AlertIndicator_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_NPC_AlertIndicator_C_Tick::InDeltaTime' has a wrong offset!");

}

